[
  {
    "type": "conversations",
    "conversations": "15May15",
    "participants": "Linda Zaruches | Talent Acquisition > Brian Cullinan | wizard",
    "contacts": [
      {
        "type": "conversations",
        "conversations": "LinkedIn",
        "name": "Linda Zaruches",
        "url": "linkedin.com/in/linda-zaruches-3a87562",
        "email": "waltersstar2012@gmail.com",
        "title": "Talent Acquisition"
      },
      {
        "type": "conversations",
        "conversations": "LinkedIn",
        "name": "Brian Cullinan",
        "url": "linkedin.com/in/megamindbrian",
        "phone": "4804660856 (Mobile)",
        "email": "megamindbrian@gmail.com",
        "title": "wizard"
      }
    ],
    "message": "Thanks for the response. Yes we are a very different company than we were in 2010. We ensure that all candidates have follow-up after an interview. We are working on several interesting products and I would like to share your resume with my hiring managers. \n\nPlease send a resume to lzaruches@godaddy.com and I will forward for review. We have our yearly GoDaddy Tech Fest next week and all my teams will be attending; it will be a great time for me to share your information. I will follow-up the week of the 25th after our Tech Fest.\n\nPlease let me know if you have any questions. \n\n>On May 14/2015 1:12PM, Brian Cullinan wrote:\n>Thank you for your interest, I actually had an interview with GoDaddy back in 2010 and they delayed months in responding to my application. I had a phone interview and an in person interview with \n> Jason Simpson - Manager, Internal Software Development\n> Kent Gott - Senior PHP Developer\n> Adam Shankel -PHP Developer\n> I never heard back from any of them after I sent a thank you letter. Has the environment at GoDaddy changed so drastically that they would want to hire a genuine talent like myself?\n> \n> I have been developing software since I was only 11 years old. I started in VB4 and explored .Net since it's inception. Later I honed my skills on the web with PHP and JavaScript. I enjoy all forms of software development and computer administration. In previous positions a 6 month salary review has worked well, as it gives us both a chance to show what we are made of, without breaking the bank. I have a lot of experience with start-ups, so I am no stranger to bringing new products and technologies to market in a controlled environment. I would enjoy a change to meet more of the team. For reference, I would be looking in the ballpark of $180k. Thank you. \n> \n> -Brian \n> \n> \n> On 5/7/15 9:42 PM, Linda Z. wrote: \n> --------------------\n> Dear Brian,\n> \n> GoDaddy is seeking an exceptionally talented Software Developer. We are looking for a talented, driven, and creative tools developer. We have a vast and complex network and a never ending need for innovation in order to meet the needs of our ever changing environment. This position will require advanced knowledge of networking technologies and software development techniques/technologies in order to create the tools and automation needed to keep pace with our customer needs.\n> \n> GoDaddy is one of the top technology companies and you will have the opportunity to work in a fast-paced, professional team environment.\n> \n> If you are interested in learning more about this opportunity, please contact me at lzaruches@godaddy.com or 602-420-4512. I look forward to hearing from you.\n> \n> Linda Zaruches\n> Technical Recruiter\n> GoDaddy",
    "time": "2015-05-15T15:32:00.000Z",
    "title": "Talent Acquisition"
  }
]