[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "40 Mutual Connections",
                "You and Bridgitte both know Yacov Wrocherinsky, Cliff Schertz, and 38 others"
            ],
            [
                "Bridgitte can introduce you to 6 people at American Express",
                "You are following American Express"
            ],
            [
                "Show more highlights"
            ],
            [
                "#SAFe #SPC i4 Change Agent Factory on Blast!  Great class in Phoenix, AZ that produced the next line of Lean Agile superstars!",
                "Suze Treacy, CAPM, CSM Vanessa Clark Cindy Smith Scott Davis Bridgitte Molyneux Katherine Englander Krissy Vanmeter Soren Burkhart Andre Grassi Nicole Bucher, PMP, CSM Elcio Holzmann Joshua Barnes Michael Westermann Tre Green Jorden Kolding Erin Rippstein Joe Tardiolo Tonia Trivett VICTORIA ALEXIS GOMEZ Aasim Shabazz David McKesey BCompSci, PMP, PMI-ACP,SMC, PSM, SAFe (SPC4) Arnold Aranez",
                "Bridgitte liked a comment"
            ],
            [
                "I'm speaking at Dreamforce. Join me for ‪Secrets from Admins to Level-Up Your Developer Career (Panel) Monday https://lnkd.in/gv5Rv-v",
                "OR Tuesday ‪https://lnkd.in/gW5h_g4 with Leslie Gestautas and Meighan Brodkey",
                "Bridgitte liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Scrum Master",
                "Company Name",
                "Spear Education",
                "Dates Employed",
                "Mar 2017 – Present",
                "Employment Duration",
                "9 mos",
                "Location",
                "Scottsdale, Arizona"
            ],
            [
                "IT Project Manager / Scrum Master",
                "Company Name",
                "DriveTime",
                "Dates Employed",
                "Jun 2016 – Feb 2017",
                "Employment Duration",
                "9 mos",
                "Location",
                "Tempe, Arizona",
                "•Implemented, educated and reinforced scrum methodology and agile framework within three new scrum teams (local and distributed)•Facilitated scrum ceremonies including release planning, backlog grooming, sprint planning, sprint reviews/demos, retrospectives, and daily scrums•Protected development team from outside distractions, removed impediments, and worked to resolve team conflicts in order to keep the team focused on sprint commitments and project timelines•Enabled the teams to establish velocity for improved estimation and commitment during planning•Tracked product backlog items, sprint/release burndown metrics, velocity, and task breakdown •Aligned with product team in prioritization of product backlog items to allow the team to have a clear focus delivering committed features on time and iteratively, delivering value to the business biweekly•Partnered with delivery managers to identify cross-team dependencies, manage inter-team tasks, and coordinate deployments•Improved morale and established clear goals by effectively managing timelines and shared resources with special emphasis on building relationships across departments•Addressed project issues through risk management and contingency planning•Guided projects to completion on time and on budget ensuring delivery was compliant to scope commitment"
            ],
            [
                "Business Applications Manager",
                "Company Name",
                "Pragmatic Marketing",
                "Dates Employed",
                "Dec 2010 – Jun 2016",
                "Employment Duration",
                "5 yrs 7 mos",
                "Location",
                "Scottsdale, AZ",
                "•Managed and delivered multiple projects to agreed upon scope, budget, schedule and expectations while monitoring scope creep and risks•Worked closely with cross-functional decision makers, executives and stakeholders to identify, recommend, develop, implement, and support business applications solutions for all facets of the organization•Analyzed and documented business requirements pertaining to usability and improvement of business applications and business process automation•Provided administration, customization, support, and maintenance for a wide range of company software applications and cloud based solutions•Developed workflow automation, detailed data reporting and visualization solutions using Salesforce Reports & Dashboards, Crystal Reports, TaskCentre, and SQL•Managed IT budget, expenses, vendors and resources (local & offshore)-Project highlights:•Salesforce.com: Managed project to develop a heavily customized Salesforce.com Enterprise implementation including a full data migration from InforCRM within a 4 mo time-frame with significant development cost savings. Minimized scope of project to ensure a proper phased approach leading to high user adoption rate and a successful, timely launch.•SpringCM Contract Management: Managed project to implement a contract management tool to provide efficiencies for legal and sales depts. SpringCM was fully integrated with Salesforce to enable sales mgrs to efficiently auto-generate sales order documents based off of opportunity data with minimal need for legal counsel involvement. Avg time to signature was decreased by more than 50%•Exchange 2007 upgrade to Office365: Managed project to migrate Exchange 2007 to Office 365 for entire organization. Project was completed ahead of schedule with minimal downtime•Clarizen project management: Implemented a project management tool to meet the specific requirements of 6 different depts, enabling cross-departmental collaboration and efficiency on org wide projects"
            ],
            [
                "Business Analyst / Project Manager, Professional Services Group",
                "Company Name",
                "Sage Software",
                "Dates Employed",
                "Jan 2007 – Mar 2011",
                "Employment Duration",
                "4 yrs 3 mos",
                "•Responsible and accountable for system design, quality assurance and implementation through all phases of the software development life cycle (SDLC) for companies spanning a wide range of industries•Project management role included: project scope identification, authoring service agreements and estimations, resource allocation, project planning, maintaining communications with clients, producing timely status reports and billing reports•Software development processes utilized during the SDLC consist of waterfall, spiral and Scrum processes.  As a Sage PSG consultant, multiple SDLC processes are utilized during any development engagement.•Customers' liaison to development team to translate customer requests into technical documentation, system and user test cases, and reporting layouts•Business requirements gathered through detailed analysis and JAD team sessions resulting in both functional and detailed design specifications•Business process reengineering and requirements gathering techniques utilized consist of UML, wireframes, control-action-response, and workflows diagrams•Data analysis and optimization for MSSQL and Oracle Sage implementations provided by thorough understanding of customer data informational needs resulting in detailed schema design, data mappings, and transformation rules for data migrations and integrations with legacy and back-office applications.•Providing on-site and remote product demonstrations and training to increase customer knowledge and efficiency•Sage Cloud Computing: Maintaining a strong role in the early testing and rollout phases of the SalesLogix Cloud computing offering; upgrading, implementing, testing and supporting internal systems in the cloud environment•Internal Sage lead engineer responsible for maintaining departmental development and quality assurance environment including VMWare, SQL, Oracle, Exchange and backup servers as well as administration of domain controllers"
            ],
            [
                "Senior Desktop Support Analyst",
                "Company Name",
                "Sage Software",
                "Dates Employed",
                "Sep 2003 – Jan 2007",
                "Employment Duration",
                "3 yrs 5 mos",
                "•\tProvided internal customer desktop and server support as part of a team supporting more than 5,000 employees•\tSupported desktop systems, enterprise servers and applications, networking, printing, e-mail, connectivity, remote access and hardware issues•\tProvided on-site support and technology placement for local and national business partner and customer events including Sage Insights and Sage Summit•\tLead resource on project or international migration of over 2,000 systems to Office 2003 performing requirements analysis, documentation of migration plan and implementation of upgrade automation•\tProvided corporate acquisition support for Active Directory and Exchange 2003 migrations and consolidation for several sites internationally from project beginning to end•\tManaged and trained desktop technical staff and service desk employees•\tCorporate wide Active Directory administration•\tResponsible for the proper operating condition of office-wide telephony equipment and connectivity"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Arizona State University - W. P. Carey School of Business",
                "Degree Name",
                "Bachelor of Science",
                "Field Of Study",
                "Computer Information Systems",
                "Dates attended or expected graduation",
                "1998 – 2001",
                "Activities and Societies:",
                "Beta Gamma Sigma (International honor society for recognizing business excellence)",
                "Graduated Summa Cum Laude"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "Barbara CorcoranBarbara Corcoran is a LinkedIn Influencer",
                "Co-Founder of Barbara Corcoran Venture Partners",
                "807,457 followers"
            ],
            [
                "Salesforce",
                "863,517 followers"
            ],
            [
                "W. P. Carey School of Business at Arizona State University",
                "13,615 members"
            ],
            [
                "Scaled Agile - SAFe Enthusiasts",
                "1,218 members"
            ],
            [
                "Salesforce developers/contractors",
                "38,077 members"
            ],
            [
                "Salesforce Data Quality Forum",
                "7,573 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Barbara CorcoranBarbara Corcoran is a LinkedIn Influencer",
                "Co-Founder of Barbara Corcoran Venture Partners",
                "807,457 followers"
            ],
            [
                "Barbara CorcoranBarbara Corcoran is a LinkedIn Influencer",
                "Co-Founder of Barbara Corcoran Venture Partners",
                "807,457 followers"
            ],
            [
                "Barbara Corcoran is a LinkedIn Influencer"
            ],
            [
                "Salesforce",
                "863,517 followers"
            ],
            [
                "Salesforce",
                "863,517 followers"
            ],
            [
                "W. P. Carey School of Business at Arizona State University",
                "13,615 members"
            ],
            [
                "W. P. Carey School of Business at Arizona State University",
                "13,615 members"
            ],
            [
                "Scaled Agile - SAFe Enthusiasts",
                "1,218 members"
            ],
            [
                "Scaled Agile - SAFe Enthusiasts",
                "1,218 members"
            ],
            [
                "Salesforce developers/contractors",
                "38,077 members"
            ],
            [
                "Salesforce developers/contractors",
                "38,077 members"
            ],
            [
                "Salesforce Data Quality Forum",
                "7,573 members"
            ],
            [
                "Salesforce Data Quality Forum",
                "7,573 members"
            ]
        ],
        "recommendations": [
            [
                "Mike de la Fuente",
                "DevOps Handyman - Principle Software Engineer",
                "January 31, 2017, Mike was senior to Bridgitte but didn’t manage directly",
                "I worked with Bridgitte for about six months at DriveTime. During that time, I came to depend on Bridgitte as my counterpart in her role as a Scrum Master. She helped to pilot and lead my teams through an Agile transformation to Scrum. Her ability to grasp technical concepts and transform them into well defined, meaningful plain-English terminology helped to bridge the gap between the development team and product owners. Her organization skills and ability to facilitate meaningful, productive meetings helped to lead the team to many successful sprints. Bridgitte comes with a positive attitude and is a great addition to any team!"
            ],
            [
                "Mike de la Fuente",
                "DevOps Handyman - Principle Software Engineer",
                "January 31, 2017, Mike was senior to Bridgitte but didn’t manage directly"
            ],
            [
                "Mike de la Fuente",
                "DevOps Handyman - Principle Software Engineer",
                "January 31, 2017, Mike was senior to Bridgitte but didn’t manage directly"
            ],
            [
                "Mike de la Fuente",
                "DevOps Handyman - Principle Software Engineer",
                "January 31, 2017, Mike was senior to Bridgitte but didn’t manage directly"
            ],
            "DevOps Handyman - Principle Software Engineer",
            [
                "I worked with Bridgitte for about six months at DriveTime. During that time, I came to depend on Bridgitte as my counterpart in her role as a Scrum Master. She helped to pilot and lead my teams through an Agile transformation to Scrum. Her ability to grasp technical concepts and transform them into well defined, meaningful plain-English terminology helped to bridge the gap between the development team and product owners. Her organization skills and ability to facilitate meaningful, productive meetings helped to lead the team to many successful sprints. Bridgitte comes with a positive attitude and is a great addition to any team!"
            ],
            [
                "I worked with Bridgitte for about six months at DriveTime. During that time, I came to depend on Bridgitte as my counterpart in her role as a Scrum Master. She helped to pilot and lead my teams through an Agile transformation to Scrum. Her ability to grasp technical concepts and transform them into well defined, meaningful plain-English terminology helped to bridge the gap between the development team and product owners. Her organization skills and ability to facilitate meaningful, productive meetings helped to lead the team to many successful sprints. Bridgitte comes with a positive attitude and is a great addition to any team!"
            ],
            [
                "Norman Rice",
                "Developer at The Judge Group",
                "June 3, 2008, Norman worked with Bridgitte in different groups",
                "Bridgitte is a superstar!  I watched her start from her beginnings to come into her own.  I would highly recommend her!"
            ],
            [
                "Norman Rice",
                "Developer at The Judge Group",
                "June 3, 2008, Norman worked with Bridgitte in different groups"
            ],
            [
                "Norman Rice",
                "Developer at The Judge Group",
                "June 3, 2008, Norman worked with Bridgitte in different groups"
            ],
            [
                "Norman Rice",
                "Developer at The Judge Group",
                "June 3, 2008, Norman worked with Bridgitte in different groups"
            ],
            "Developer at The Judge Group",
            [
                "Bridgitte is a superstar!  I watched her start from her beginnings to come into her own.  I would highly recommend her!"
            ],
            [
                "Bridgitte is a superstar!  I watched her start from her beginnings to come into her own.  I would highly recommend her!"
            ],
            [
                "Norman Rice",
                "Developer at The Judge Group",
                "June 3, 2008, Norman worked with Bridgitte in the same group",
                "Norm was truly an asset to the SalesLogix support team.  He was willing to help whenever necessary and outstanding when it came to teaching and training others.  I was always impressed by his detailed knowledge of the SalesLogix product suite.  Norm is also an excellent team builder and leader.  I would value the opportunity to work with Norm again on any project."
            ],
            [
                "Norman Rice",
                "Developer at The Judge Group",
                "June 3, 2008, Norman worked with Bridgitte in the same group"
            ],
            [
                "Norman Rice",
                "Developer at The Judge Group",
                "June 3, 2008, Norman worked with Bridgitte in the same group"
            ],
            [
                "Norman Rice",
                "Developer at The Judge Group",
                "June 3, 2008, Norman worked with Bridgitte in the same group"
            ],
            "Developer at The Judge Group",
            [
                "Norm was truly an asset to the SalesLogix support team.  He was willing to help whenever necessary and outstanding when it came to teaching and training others.  I was always impressed by his detailed knowledge of the SalesLogix product suite.  Norm is also an excellent team builder and leader.  I would value the opportunity to work with Norm again on any project."
            ],
            [
                "Norm was truly an asset to the SalesLogix support team.  He was willing to help whenever necessary and outstanding when it came to teaching and training others.  I was always impressed by his detailed knowledge of the SalesLogix product suite.  Norm is also an excellent team builder and leader.  I would value the opportunity to work with Norm again on any project."
            ],
            [
                "Jeremy Junginger",
                "Security Researcher - Advanced Security Initiatives Group at Cisco",
                "January 28, 2008, Jeremy worked with Bridgitte in the same group",
                "Jeremy was an absolute pleasure to work with at Sage.  He was consistently willing to go out of his way for customers and co-workers.  He has an extensive depth of experience and is absolutely thorough in his work.  His willingness to teach others is one of his most admirable qualities.  On several occasions Jeremy would plan training sessions to further educate the entire I.S. group on several topics including packet analysis, router management, and security best practices.  He undoubtedly brought value to the team on a daily basis.  I would consider Jeremy an exceptional asset to any employer."
            ],
            [
                "Jeremy Junginger",
                "Security Researcher - Advanced Security Initiatives Group at Cisco",
                "January 28, 2008, Jeremy worked with Bridgitte in the same group"
            ],
            [
                "Jeremy Junginger",
                "Security Researcher - Advanced Security Initiatives Group at Cisco",
                "January 28, 2008, Jeremy worked with Bridgitte in the same group"
            ],
            [
                "Jeremy Junginger",
                "Security Researcher - Advanced Security Initiatives Group at Cisco",
                "January 28, 2008, Jeremy worked with Bridgitte in the same group"
            ],
            "Security Researcher - Advanced Security Initiatives Group at Cisco",
            [
                "Jeremy was an absolute pleasure to work with at Sage.  He was consistently willing to go out of his way for customers and co-workers.  He has an extensive depth of experience and is absolutely thorough in his work.  His willingness to teach others is one of his most admirable qualities.  On several occasions Jeremy would plan training sessions to further educate the entire I.S. group on several topics including packet analysis, router management, and security best practices.  He undoubtedly brought value to the team on a daily basis.  I would consider Jeremy an exceptional asset to any employer."
            ],
            [
                "Jeremy was an absolute pleasure to work with at Sage.  He was consistently willing to go out of his way for customers and co-workers.  He has an extensive depth of experience and is absolutely thorough in his work.  His willingness to teach others is one of his most admirable qualities.  On several occasions Jeremy would plan training sessions to further educate the entire I.S. group on several topics including packet analysis, router management, and security best practices.  He undoubtedly brought value to the team on a daily basis.  I would consider Jeremy an exceptional asset to any employer."
            ]
        ],
        "skills": [
            [
                "Business Analysis",
                "See 55 endorsements for Business Analysis",
                "55",
                "Business Analysis",
                "Endorse",
                "Endorsed by Mike Strieder and 2 others who are highly skilled at this",
                "Endorsed by Mike Fournier and 4 other mutual connections"
            ],
            [
                "Business Analysis",
                "See 55 endorsements for Business Analysis",
                "55"
            ],
            [
                "Integration",
                "See 55 endorsements for Integration",
                "55",
                "Integration",
                "Endorse",
                "Endorsed by Rich Eaton and 5 others who are highly skilled at this",
                "Endorsed by Dov Greenberg and 2 other mutual connections"
            ],
            [
                "Integration",
                "See 55 endorsements for Integration",
                "55"
            ],
            [
                "Requirements Analysis",
                "See 37 endorsements for Requirements Analysis",
                "37",
                "Requirements Analysis",
                "Endorse",
                "Endorsed by Cliff Schertz and 2 other mutual connections",
                "Endorsed by 2 of Bridgitte’s colleagues at DriveTime"
            ],
            [
                "Requirements Analysis",
                "See 37 endorsements for Requirements Analysis",
                "37"
            ],
            [
                "Microsoft SQL Server",
                "See 35 endorsements for Microsoft SQL Server",
                "35",
                "Microsoft SQL Server",
                "Endorse"
            ],
            [
                "Microsoft SQL Server",
                "See 35 endorsements for Microsoft SQL Server",
                "35"
            ],
            [
                "Cloud Computing",
                "See 30 endorsements for Cloud Computing",
                "30",
                "Cloud Computing",
                "Endorse"
            ],
            [
                "Cloud Computing",
                "See 30 endorsements for Cloud Computing",
                "30"
            ],
            [
                "Software Documentation",
                "See 30 endorsements for Software Documentation",
                "30",
                "Software Documentation",
                "Endorse"
            ],
            [
                "Software Documentation",
                "See 30 endorsements for Software Documentation",
                "30"
            ],
            [
                "Microsoft Exchange",
                "See 27 endorsements for Microsoft Exchange",
                "27",
                "Microsoft Exchange",
                "Endorse"
            ],
            [
                "Microsoft Exchange",
                "See 27 endorsements for Microsoft Exchange",
                "27"
            ],
            [
                "Enterprise Software",
                "See 26 endorsements for Enterprise Software",
                "26",
                "Enterprise Software",
                "Endorse"
            ],
            [
                "Enterprise Software",
                "See 26 endorsements for Enterprise Software",
                "26"
            ],
            [
                "Databases",
                "See 24 endorsements for Databases",
                "24",
                "Databases",
                "Endorse"
            ],
            [
                "Databases",
                "See 24 endorsements for Databases",
                "24"
            ],
            [
                "Software Implementation",
                "See 16 endorsements for Software Implementation",
                "16",
                "Software Implementation",
                "Endorse"
            ],
            [
                "Software Implementation",
                "See 16 endorsements for Software Implementation",
                "16"
            ],
            [
                "CRM",
                "See 11 endorsements for CRM",
                "11",
                "CRM",
                "Endorse"
            ],
            [
                "CRM",
                "See 11 endorsements for CRM",
                "11"
            ],
            [
                "Software Development",
                "See 11 endorsements for Software Development",
                "11",
                "Software Development",
                "Endorse"
            ],
            [
                "Software Development",
                "See 11 endorsements for Software Development",
                "11"
            ],
            [
                "SaaS",
                "See 10 endorsements for SaaS",
                "10",
                "SaaS",
                "Endorse"
            ],
            [
                "SaaS",
                "See 10 endorsements for SaaS",
                "10"
            ],
            [
                "SQL",
                "See 8 endorsements for SQL",
                "8",
                "SQL",
                "Endorse"
            ],
            [
                "SQL",
                "See 8 endorsements for SQL",
                "8"
            ],
            [
                "IT Management",
                "See 6 endorsements for IT Management",
                "6",
                "IT Management",
                "Endorse"
            ],
            [
                "IT Management",
                "See 6 endorsements for IT Management",
                "6"
            ],
            [
                "System Administration",
                "See 6 endorsements for System Administration",
                "6",
                "System Administration",
                "Endorse"
            ],
            [
                "System Administration",
                "See 6 endorsements for System Administration",
                "6"
            ],
            [
                "Servers",
                "See 5 endorsements for Servers",
                "5",
                "Servers",
                "Endorse"
            ],
            [
                "Servers",
                "See 5 endorsements for Servers",
                "5"
            ],
            [
                "Training",
                "See 5 endorsements for Training",
                "5",
                "Training",
                "Endorse"
            ],
            [
                "Training",
                "See 5 endorsements for Training",
                "5"
            ],
            [
                "Active Directory",
                "See 5 endorsements for Active Directory",
                "5",
                "Active Directory",
                "Endorse"
            ],
            [
                "Active Directory",
                "See 5 endorsements for Active Directory",
                "5"
            ],
            [
                "Scrum",
                "See 5 endorsements for Scrum",
                "5",
                "Scrum",
                "Endorse"
            ],
            [
                "Scrum",
                "See 5 endorsements for Scrum",
                "5"
            ],
            [
                "Management",
                "See 5 endorsements for Management",
                "5",
                "Management",
                "Endorse"
            ],
            [
                "Management",
                "See 5 endorsements for Management",
                "5"
            ],
            [
                "VMware",
                "See 5 endorsements for VMware",
                "5",
                "VMware",
                "Endorse"
            ],
            [
                "VMware",
                "See 5 endorsements for VMware",
                "5"
            ],
            [
                "Project Management",
                "See 5 endorsements for Project Management",
                "5",
                "Project Management",
                "Endorse"
            ],
            [
                "Project Management",
                "See 5 endorsements for Project Management",
                "5"
            ],
            [
                "Testing",
                "See 5 endorsements for Testing",
                "5",
                "Testing",
                "Endorse"
            ],
            [
                "Testing",
                "See 5 endorsements for Testing",
                "5"
            ],
            [
                "Software Project Management",
                "See 5 endorsements for Software Project Management",
                "5",
                "Software Project Management",
                "Endorse"
            ],
            [
                "Software Project Management",
                "See 5 endorsements for Software Project Management",
                "5"
            ],
            [
                "Business Intelligence",
                "See 4 endorsements for Business Intelligence",
                "4",
                "Business Intelligence",
                "Endorse"
            ],
            [
                "Business Intelligence",
                "See 4 endorsements for Business Intelligence",
                "4"
            ],
            [
                "Technical Support",
                "See 4 endorsements for Technical Support",
                "4",
                "Technical Support",
                "Endorse"
            ],
            [
                "Technical Support",
                "See 4 endorsements for Technical Support",
                "4"
            ],
            [
                "SDLC",
                "See 3 endorsements for SDLC",
                "3",
                "SDLC",
                "Endorse"
            ],
            [
                "SDLC",
                "See 3 endorsements for SDLC",
                "3"
            ],
            [
                "Requirements Gathering",
                "See 3 endorsements for Requirements Gathering",
                "3",
                "Requirements Gathering",
                "Endorse"
            ],
            [
                "Requirements Gathering",
                "See 3 endorsements for Requirements Gathering",
                "3"
            ],
            [
                "Customer Relationship Management (CRM)",
                "See 3 endorsements for Customer Relationship Management (CRM)",
                "3",
                "Customer Relationship Management (CRM)",
                "Endorse"
            ],
            [
                "Customer Relationship Management (CRM)",
                "See 3 endorsements for Customer Relationship Management (CRM)",
                "3"
            ],
            [
                "SharePoint",
                "See 2 endorsements for SharePoint",
                "2",
                "SharePoint",
                "Endorse"
            ],
            [
                "SharePoint",
                "See 2 endorsements for SharePoint",
                "2"
            ],
            [
                "Oracle",
                "See 2 endorsements for Oracle",
                "2",
                "Oracle",
                "Endorse"
            ],
            [
                "Oracle",
                "See 2 endorsements for Oracle",
                "2"
            ],
            [
                "Data Migration",
                "See 2 endorsements for Data Migration",
                "2",
                "Data Migration",
                "Endorse"
            ],
            [
                "Data Migration",
                "See 2 endorsements for Data Migration",
                "2"
            ],
            [
                "Networking",
                "See 2 endorsements for Networking",
                "2",
                "Networking",
                "Endorse"
            ],
            [
                "Networking",
                "See 2 endorsements for Networking",
                "2"
            ],
            [
                "Business Process",
                "See 2 endorsements for Business Process",
                "2",
                "Business Process",
                "Endorse"
            ],
            [
                "Business Process",
                "See 2 endorsements for Business Process",
                "2"
            ],
            [
                "Professional Services",
                "See 2 endorsements for Professional Services",
                "2",
                "Professional Services",
                "Endorse"
            ],
            [
                "Professional Services",
                "See 2 endorsements for Professional Services",
                "2"
            ],
            [
                "Analysis",
                "See 1 endorsement for Analysis",
                "1",
                "Analysis",
                "Endorse"
            ],
            [
                "Analysis",
                "See 1 endorsement for Analysis",
                "1"
            ],
            [
                "Business Requirements",
                "See 1 endorsement for Business Requirements",
                "1",
                "Business Requirements",
                "Endorse"
            ],
            [
                "Business Requirements",
                "See 1 endorsement for Business Requirements",
                "1"
            ],
            [
                "Project Planning",
                "See 1 endorsement for Project Planning",
                "1",
                "Project Planning",
                "Endorse"
            ],
            [
                "Project Planning",
                "See 1 endorsement for Project Planning",
                "1"
            ],
            [
                "Architecture",
                "See 1 endorsement for Architecture",
                "1",
                "Architecture",
                "Endorse"
            ],
            [
                "Architecture",
                "See 1 endorsement for Architecture",
                "1"
            ],
            [
                "Visual Basic",
                "See 1 endorsement for Visual Basic",
                "1",
                "Visual Basic",
                "Endorse"
            ],
            [
                "Visual Basic",
                "See 1 endorsement for Visual Basic",
                "1"
            ],
            [
                "Visio",
                "See 1 endorsement for Visio",
                "1",
                "Visio",
                "Endorse"
            ],
            [
                "Visio",
                "See 1 endorsement for Visio",
                "1"
            ],
            [
                "Crystal Reports",
                "See 1 endorsement for Crystal Reports",
                "1",
                "Crystal Reports",
                "Endorse"
            ],
            [
                "Crystal Reports",
                "See 1 endorsement for Crystal Reports",
                "1"
            ],
            [
                "Agile Methodologies",
                "See 1 endorsement for Agile Methodologies",
                "1",
                "Agile Methodologies",
                "Endorse"
            ],
            [
                "Agile Methodologies",
                "See 1 endorsement for Agile Methodologies",
                "1"
            ],
            [
                "Security",
                "See 1 endorsement for Security",
                "1",
                "Security",
                "Endorse"
            ],
            [
                "Security",
                "See 1 endorsement for Security",
                "1"
            ],
            [
                "Quality Assurance",
                "See 1 endorsement for Quality Assurance",
                "1",
                "Quality Assurance",
                "Endorse"
            ],
            [
                "Quality Assurance",
                "See 1 endorsement for Quality Assurance",
                "1"
            ],
            [
                "IIS",
                "See 1 endorsement for IIS",
                "1",
                "IIS",
                "Endorse"
            ],
            [
                "IIS",
                "See 1 endorsement for IIS",
                "1"
            ],
            [
                "Agile Project Management",
                "Agile Project Management",
                "Endorse"
            ],
            [
                "Agile Project Management"
            ],
            [
                "Microsoft Azure",
                "Microsoft Azure",
                "Endorse"
            ],
            [
                "Microsoft Azure"
            ]
        ],
        "summary": "    Specialties: Project management, servant leadership, Scrum, Agile framework and principles, Kanban, CRM, SDLC, business process analysis and automation, functional and detail documentation, software implementation\n  \n  \n",
        "name": "Bridgitte Molyneux",
        "title": "IT Project Manager / Scrum Master",
        "url": "linkedin.com/in/bridgittemolyneux",
        "phone": "",
        "email": "bridge.molyneux@gmail.com"
    }
]