[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "126 Mutual Connections",
                "You and Danny P. both know John Fanning, 'Luni'​ Libes, and 124 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Master Business Coach & Consultant; Personal Growth, Leadership & Sales Expert; Speaker, Author",
                "Company Name",
                "FocalPoint Business Coaching of Arizona",
                "Dates Employed",
                "Feb 2008 – Present",
                "Employment Duration",
                "9 yrs 10 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Real-World, Master Business Coach Danny Creed is a certified business coach and consultant that specializes in growing and turning around businesses and helping business owners and executives prosper. Coach Dan has over 14,000 hours of logged, face to face business and personal coaching, consulting and training hours. He has worked with over 400 business turnarounds and involved with 14 successful start-up businesses. Coach Dan is an expert in moving clients to that elusive next level of success. He helps clients to maintain a business mentality of WINNING versus Surviving! He is a leading expert in the disciplines of developing and growing killer sales structure and teams, marketing, communication skills, time and priority management, strategic thinking, business start-ups and leadership. Real World Business Coaching eliminates business stagnation, chaos and conflict, replaced by a plan to manage with intent, coordination and goal/purpose driven results.When you work with Master Coach Dan, don’t expect lots of theory. This is a program based on acquiring clarity and focus and then attacking the goal. The program is simple; (1) understand each client’s vision for their business and their personal lives, from their point of view, (2) then create an exclusive and personalized success plan, (3) execute the plan and complete their vision. His unique and personal one-on-one approach helps clients to achieve their personal and business goals faster than they could ever do on their own. The program isn’t right for everyone, but for those few that truly want something better out of life and business, and are willing to work for it, Real World Business Coaching with Master Coach Dan will be an incredible personal and professional experience.dcreed@focalpointcoaching.com602-697-5949www.realworldbusinesscoach.com"
            ],
            [
                "FocalPoint Coaching International, Franchise Coach Recruiting Expert",
                "Company Name",
                "FocalPoint Coaching International",
                "Dates Employed",
                "Feb 2008 – Present",
                "Employment Duration",
                "9 yrs 10 mos",
                "Location",
                "Phoenix, Arizona Area",
                "I am building a winning team of Business Coaches in Arizona. If you've ever considered Professional Self-Employment and putting your business experience to work helping others then you need to talk to me today. If you are looking for greater control of your work/life balance; You are seeking total authority of your income potential; If you desire to leverage your experience; If you like to partner with a likeminded TEAM and you would enjoy making a difference in your business community then a career with FocalPoint Business Coaching is worth considering.As an Executive Franchise Business Opportunity, this model allows you to work for yourself, but not by yourself. Use the brand power, leverage and systems of Brian Tracy to increase your credibility. If you've been considering a change, such as buying a franchise, or being a consultant for marketing, sales,management or HR, take some time to consider the benefits of FocalPoint. Call or write  me today to start your education and due diligence process to see if Business Coaching might be right for you."
            ],
            [
                "Corporate Trainer: Brian Tracy Internationally Certified",
                "Company Name",
                "FocalPoint Business Coaching, Arizona",
                "Dates Employed",
                "Sep 2013 – Present",
                "Employment Duration",
                "4 yrs 3 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Real World Business Coach Danny Creed is proud to be in the inaugural Founding Member class of FocalPoint Internationals certified Brian Tracy Corporate Trainer program. This certification allows Coach Dan to deliver some of the most powerful corporate training programs in the world, designed by world renowned business development expert and author Brian Tracy. These programs have been presented to over 5 million people and translated in over 40 languages. The programs include; Superior Sales Training; Personal Success; Time Management; Your Best Year Ever course and The Brian Tracy Sales Success Intensive 1, the most powerful One Day sales training intensive course in the world today."
            ],
            [
                "Business Coach for Musicans & Performing Arts",
                "Company Name",
                "FocalPoint Business Coaching of Arizona",
                "Dates Employed",
                "Feb 2008 – Present",
                "Employment Duration",
                "9 yrs 10 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Real World Business Coach Danny Creed understands the business challenges that creative people face. Whether you're a musician, actor, producer, promoter or studio owner Coach Dan can help you clarify your goals and then reach them whether personal or professional he'll help you get there faster that you ever thought possible."
            ],
            [
                "KEYNOTE Speaker & Workshop Leader",
                "Company Name",
                "FocalPoint Business Coaching, Arizona",
                "Dates Employed",
                "Jan 2007 – Present",
                "Employment Duration",
                "10 yrs 11 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Real World Business Coach Danny Creed is a highly sought after key-note speaker; seminar and workshop leader and subject matter expert. Danny's down-to-earth, conversational speaking style is limited on theory and heavy on street-fighting business experience. This approach has set him apart, winning him the respect of businesses large and small, all around the globe. At one of Danny's keynote events, you can expect to walk away with concepts you can use the very next day, on topics such as:Business ClarityBusiness TurnaroundSuperstar CommunicationPriority and Time ManagementCustomer SatisfactionFoundational NegotiationGrass Roots LeadershipSales The Psychology of MarketingYou can book Master Business Coach Danny Creed by contacting him through LinkedIn or by clicking on the following address: For booking availability call 602-697-5949 or email to www.realworldbusinesscoach.com"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Butler County Community College",
                "Degree Name",
                "AA",
                "Field Of Study",
                "Journalism",
                "Dates attended or expected graduation",
                "1970 – 1972",
                "Activities and Societies:",
                "Student Body President, '71,72; News Editor, The Lantern college newspaper",
                "Studied Journalism and served as the news editor to one of the largest  College newspapers in the U.S.A. without advertising. Also served as the Student Body President for a full term."
            ],
            [
                "Butler County Community College",
                "Degree Name",
                "AA",
                "Field Of Study",
                "Journalism",
                "Dates attended or expected graduation",
                "1970 – 1972",
                "Activities and Societies:",
                "Student Body President, '71,72; News Editor, The Lantern college newspaper",
                "Studied Journalism and served as the news editor to one of the largest  College newspapers in the U.S.A. without advertising. Also served as the Student Body President for a full term."
            ],
            [
                "South Haven High School",
                "Degree Name",
                "High School - Salutorian",
                "Field Of Study",
                "General Studies",
                "Dates attended or expected graduation",
                "1967 – 1971",
                "Activities and Societies:",
                "Football, Basketball, Track team; National Honors Society; Band; Choir; Yearbook; Theater;",
                "Senior class Salutatorian; 4 year Letterman in Football, Basketball, Track; National Honor Society; Liberty Bell Award; Choir & chorus; band; Theatre"
            ],
            [
                "South Haven High School",
                "Degree Name",
                "High School - Salutorian",
                "Field Of Study",
                "General Studies",
                "Dates attended or expected graduation",
                "1967 – 1971",
                "Activities and Societies:",
                "Football, Basketball, Track team; National Honors Society; Band; Choir; Yearbook; Theater;",
                "Senior class Salutatorian; 4 year Letterman in Football, Basketball, Track; National Honor Society; Liberty Bell Award; Choir & chorus; band; Theatre"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer/Mentor",
                "Company Name",
                "Junior Achievement of Arizona",
                "Dates volunteered",
                "2013 – 2013",
                "Volunteer duration",
                "less than a year",
                "Cause",
                "Education",
                "Spending time as a volunteer/mentor at various J.A. events and as a trainer for the annual Stock Market Challange"
            ],
            [
                "Grow Southwest",
                "25 members"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,257,844 followers"
            ],
            [
                "Sony",
                "389,222 followers"
            ],
            [
                "Wealthy and Prosperous Entrepreneur's Forum",
                "280 members"
            ],
            [
                "Katz Media Group",
                "6,731 followers"
            ],
            [
                "Franchise-Info Sponsored",
                "6,570 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Grow Southwest",
                "25 members"
            ],
            [
                "Grow Southwest",
                "25 members"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,257,844 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,257,844 followers"
            ],
            [
                "Richard Branson is a LinkedIn Influencer"
            ],
            [
                "Sony",
                "389,222 followers"
            ],
            [
                "Sony",
                "389,222 followers"
            ],
            [
                "Wealthy and Prosperous Entrepreneur's Forum",
                "280 members"
            ],
            [
                "Wealthy and Prosperous Entrepreneur's Forum",
                "280 members"
            ],
            [
                "Katz Media Group",
                "6,731 followers"
            ],
            [
                "Katz Media Group",
                "6,731 followers"
            ],
            [
                "Franchise-Info Sponsored",
                "6,570 followers"
            ],
            [
                "Franchise-Info Sponsored",
                "6,570 followers"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "    Contact me at: 602-697-5949 or  dcreed@focalpointcoaching.comMaster Certified Business Coach Dan Creed is  the  \"REAL WORLD BUSINESS COACH\" for Executives, Business owners, Sales Leaders, and Sales Professionals  by preparing them for massive success with real world business, sales and leadership skills and tools  that eliminate barriers and accelerate their rate of growth, while improving the quality of their lives at the same time. Coach Dan has over 8,000 logged coaching hours and over 12,000 endorsements offering Real World Business Coaching. Coach Dan is the unprecedented SIX time, winner of the Brian Tracy Award of Sales Excellence representing FocalPoint Coaching International Coach of The Year.His business coaching process is a powerful and individualized experience for each client. Coach Dan GETS RESULTS. He will challenge you to be bold and to set your potential free. What Coach Dan offers is not right for everyone, but for those few that truly want something better out of life and business Coach Dan offers the premier, real world coaching experience and RESULTS!Services Provided: •\tBusiness Coaching; •\tBusiness development expertise;•\tSales & marketing training•\tExecutive Coaching•\tWorkshop & Keynote Speaking*       Business Turnaround Expert•\tBusiness Coach recruiting;•\tPersonal performance coaching; •\tMaster Goals training & development•\tPerformance Coaching; •\tLeadership development;•\tMarketing & Management Consultant;•\tPersonality Assessment/D.I.S.C. Profiling expert•\tEntrepreneurial Business Development; •\tBusiness Coach training•\tGuerrilla marketing expert;•\tPriority/Time Management training •\tCustomized sales training•\tProfessional Corporate & conference speakerdcreed@focalpointcoaching.com602-697-5949www.realworldbusinesscoach.com\n  \n  \n",
        "name": "Danny P. Creed",
        "title": "Master  Business Coach & Consultant; Personal/Prof. Growth, Leadership & Sales Expert; Keynote Speaker, Author,  Trainer",
        "url": "linkedin.com/in/businesscoachdan",
        "phone": "602-697-5949 (Mobile)",
        "email": "dcreed@focalpointcoaching.com"
    }
]