[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "1 Mutual Connection",
                "You and Kibria both know Roma Kuchukov"
            ],
            [
                "SJI team picnic 2017",
                "Kibria shared this"
            ],
            [
                "During my maiden solotrip to Zostel #Coorg, I met so many young people who work for so called elite companies in IT and other fileds. Many of them had run away from their never ending work, unimaginable pressure, killing deadlines, always buzzing cellphones. All they needed was timeout. They wanted some quiet and peace. All of them were strangers to each other. What connected them was the desire for peace. People at Zostel ensured that people got what they were seeking.",
                "I believe that one should work in order to be able to live and not live only to slog. Personal growth is very important which comes from exploring a different dimension of life.",
                "Hoping everyone attains that growth in 2018. #HappyNewYear2018",
                "Kibria liked"
            ],
            [
                "First school I attended 34 years ago and I went back to that School to start my new year.  I told them to dream and be positive and I hope do same in 2018",
                "Kibria shared this"
            ],
            [
                "One company I worked at, I could work until 6:00pm. And, no one would say a word and no, they didn’t pay any kind of overtime. Then, if I were to get to the office in the morning at 8:05 (which was not the norm) I was in trouble...I'd get a lecture about being 'on time'.",
                "An employee can be delivering good results but makes one mistake and it’s like the end of the world. All the good the employee has done is suddenly cancelled.",
                "When it was time for annual performance reviews they could list every mistake an employee has made.  Yet this same company would hire external consultants to boost falling engagement levels.",
                "Read full post here: \"Employees don’t leave Companies, they leave Managers\" - https://lnkd.in/eKpyrUF",
                "A culture of blaming, punishment, inflexibility and insensitivity only pushes people away.",
                "Instead of keeping record of mistakes employees make, why not focus your attention on their contributions and results.",
                "Agree?",
                "Kibria liked"
            ],
            [
                "How To Free Up Space On Windows",
                "Kibria liked"
            ],
            [
                "What a great idea ! We need these machines everywhere. And we should dispose of trash properly, too.",
                "Kibria shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Business Development Analyst",
                "Company Name",
                "SJ Innovation LLC",
                "Dates Employed",
                "Aug 2017 – Present",
                "Employment Duration",
                "6 mos"
            ],
            [
                "Marketing Officer",
                "Company Name",
                "SJ Innovation LLC",
                "Dates Employed",
                "Apr 2016 – Present",
                "Employment Duration",
                "1 yr 10 mos"
            ],
            "Recommendations",
            [
                "Shradha SharmaShradha Sharma is a LinkedIn Influencer",
                "Founder & CEO at YourStory Media",
                "557,248 followers"
            ],
            [
                "SJ Innovation LLC",
                "1,180 followers"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Shradha SharmaShradha Sharma is a LinkedIn Influencer",
                "Founder & CEO at YourStory Media",
                "557,248 followers"
            ],
            [
                "Shradha SharmaShradha Sharma is a LinkedIn Influencer",
                "Founder & CEO at YourStory Media",
                "557,248 followers"
            ],
            [
                "Shradha Sharma is a LinkedIn Influencer"
            ],
            [
                "SJ Innovation LLC",
                "1,180 followers"
            ],
            [
                "SJ Innovation LLC",
                "1,180 followers"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "",
        "name": "Kibria Chowdhury",
        "title": "Business Development Analyst at SJ Innovation LLC",
        "url": "",
        "phone": "",
        "email": ""
    }
]