[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "34 Mutual Connections",
                "You and Kristen both know Leanne Kinnard, Kevin Paulson, and 32 others"
            ],
            [
                "Kristen can introduce you to 12 people at Oracle",
                "You are following Oracle"
            ],
            [
                "Gainsight Strategic Advisory Services Consultant",
                "Kristen liked"
            ],
            [
                "When you love what you do, not only do you not work a day in your life, but success follows.",
                "Extremely honored to have achieved top leaser in the Northeast for 2 consecutive months!",
                "With determination, persistence, and an amazing team around you, anything is possible. Even within the first few months of a new role! 🌟",
                "Kristen liked"
            ],
            [
                "So excited to announce that I've accepted a Recruiter position with Insight Global. I couldn't be any happier to make a career of helping people find jobs and helping companies find the perfect employees.",
                "I am so thankful to Ohio University for presenting me with the opportunities I've had during my time here.",
                "The people I've met, faculty and fellow students, and the experiences I've had because of this school have been invaluable to my growth, professionally and personally.",
                "The EW Scripps School of Journalism is truly unparalleled in the opportunities it offers to its students, and I couldn't be more certain I made the right decision in becoming a Bobcat.",
                "I can't wait to begin this new chapter in Columbus, Ohio upon graduation in May.",
                "Also thank you to my amazing family for the endless love and support, and for pushing me to be the best version of myself every day. I love you all so much.",
                "Kristen liked"
            ],
            [
                "I need a Sr. Recruiting Coordinator asap for my team.",
                "Do you know anyone?",
                "Good with Excel?",
                "Good with data analytics?",
                "Someone hungry and wanting to grow in their career?",
                "ryan.sand@cioxhealth.com",
                "Kristen commented"
            ],
            [
                "Customer Success Manager, Named Accounts - West Coast",
                "Kristen liked"
            ],
            [
                "Service Desk Level II",
                "Excellent full time opportunity with established Scottsdale Company!",
                "Advanced Windows 10, 365, Server 2008/20112, Active Directory, 20-30 tickets a day and room to grow in the IT Department.",
                "Salary, bonus, full benefits.",
                "Ping me for details.",
                "Kristen liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Recruiter",
                "Company Name",
                "SMCI",
                "Dates Employed",
                "Jul 2017 – Present",
                "Employment Duration",
                "5 mos"
            ],
            [
                "Corporate Recruiter",
                "Company Name",
                "Syntel",
                "Dates Employed",
                "Dec 2016 – Jul 2017",
                "Employment Duration",
                "8 mos",
                "Location",
                "Scottsdale, Arizona",
                "-Performs as a team member on multiple projects simultaneously and works effectively in a fast-paced, dynamic team environment with high expectations for quality. -Manages a high volume of open requisitions at any given time. - Recommends candidates to business lines management based on analysis of department's needs and the candidate's skills. -Conducts candidate interviews to evaluate and summarize relevant skills and experience. - Proactively develop and maintained candidate profiles for current and future positions. - Influences industry-specific partnerships for networking purposes. -Researches and attends networking events that might allow access to new candidate pools. - Works with hiring managers to develop long term hiring strategies that support growth. - Contributed to the development of recruiting strategic objectives. -Supports special recruiting studies, analyses and projects to help ensure the success of strategic talent acquisition objectives. -Works with National and International clients to source the best qualified talents for given positions.-Knowledgeable with Visa practices and global recruitment processes-Recruited Software Engineers domestically and internationally for North American offices -Pre-screened candidates and coordinated subsequent technical phone screens and on-site interviews with engineers and recruiting team"
            ],
            [
                "Corporate Recruiter- Beijing Division (contract)",
                "Company Name",
                "Meridian Educational Technology International",
                "Dates Employed",
                "Jun 2016 – Nov 2016",
                "Employment Duration",
                "6 mos",
                "Location",
                "Beijing City, China",
                "-Source potential employees Internationally including but not limited to: Canada, North America, Europe-Pro-active approach in recruitment process by active search through networks and building an effective talent pool to fulfill future vacancies -Partner with the HR team and hiring managers to drive the recruitment process;-Handle the recruitment process from opening vacancy till hire of employee for the vacancies throughout China.-Screen and present viable resumes and/or qualified candidates -Run interviews with identified candidates-Manage candidates throughout the recruitment process building effective relationships using strong communication skills and providing feedback at all stages-Keep the ATS up-to-date with candidate pipeline-Ensure all recruitment is maintained on a professional level by all employees"
            ],
            [
                "Human Resources Coordinator",
                "Company Name",
                "Zenefits",
                "Dates Employed",
                "Jun 2015 – Mar 2016",
                "Employment Duration",
                "10 mos",
                "Location",
                "Scottsdale, Arizona",
                "We manage your benefits, payroll, and HR – so you don’t have to. No more paperwork. No more headaches. It's all done online and completely paperless.-Drive Zenefits revenue growth through outreach emails & phone-calls with a focus on setting demo appointments for the sales team-Research prospect contact information and best ways to get in touch with them-Nurture and qualify new leads that turn into quality demo appointments-Cold call, prospect and pipeline building and opportunity identification-Educate prospects on Zenefits HR and benefits solutions-Work closely with Sales Managers & Marketing on various projects that are in support of the entire sales team-Proficient in MS Office Applications, Excel, Google Apps, and CRM tools such as Salesforce.com and Inside Sales"
            ],
            [
                "Training and Development Coordinator",
                "Company Name",
                "Texas Roadhouse",
                "Dates Employed",
                "May 2007 – Sep 2015",
                "Employment Duration",
                "8 yrs 5 mos",
                "Location",
                "California, Arizona",
                "- Strategic Consulting, including business plan & sales strategy development.-Advising new businesses on formation of corporations and business structures, drafting privacy policies and structuring commercial transactions.-Give onsite and offsite classes."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor’s Degree",
                "Field Of Study",
                "Education/Teaching of Individuals in Elementary Special Education Programs",
                "Dates attended or expected graduation",
                "2013 – 2015",
                "Activities and Societies:",
                "Sigma Kappa Sorority, Big Brothers, Big Sisters of America, Snow Devils Activities Club"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor’s Degree",
                "Field Of Study",
                "Education/Teaching of Individuals in Elementary Special Education Programs",
                "Dates attended or expected graduation",
                "2013 – 2015",
                "Activities and Societies:",
                "Sigma Kappa Sorority, Big Brothers, Big Sisters of America, Snow Devils Activities Club"
            ],
            [
                "James Logan High",
                "Degree Name",
                "High School",
                "Field Of Study",
                "General Education",
                "Dates attended or expected graduation",
                "2006 – 2009",
                "Activities and Societies:",
                "Cheerleading, Leadership, Forensics Team, Soccer Team"
            ],
            [
                "James Logan High",
                "Degree Name",
                "High School",
                "Field Of Study",
                "General Education",
                "Dates attended or expected graduation",
                "2006 – 2009",
                "Activities and Societies:",
                "Cheerleading, Leadership, Forensics Team, Soccer Team"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Personal Advocate",
                "Company Name",
                "Big Brother Big Sister Foundation",
                "Dates volunteered",
                "Jul 2011 – Dec 2015",
                "Volunteer duration",
                "4 yrs 6 mos",
                "Cause",
                "Children",
                "Working with youth and grow a positive relationship among adolescence from 5-17 years old."
            ],
            [
                "Personal Advocate",
                "Company Name",
                "Big Brother Big Sister Foundation",
                "Dates volunteered",
                "Jul 2011 – Dec 2015",
                "Volunteer duration",
                "4 yrs 6 mos",
                "Cause",
                "Children",
                "Working with youth and grow a positive relationship among adolescence from 5-17 years old."
            ],
            [
                "Coach",
                "Company Name",
                "Boys and Girls Club of America",
                "Dates volunteered",
                "Aug 2017 – Present",
                "Volunteer duration",
                "4 mos",
                "Cause",
                "Children",
                "-Cheerleader Coach and Cooking teacher for children 6-11-Fundraising efforts to ensure funding to keep the club active-Tutoring, mentoring and advising impressionable children-Actively serving as role model for young girls"
            ],
            [
                "Coach",
                "Company Name",
                "Boys and Girls Club of America",
                "Dates volunteered",
                "Aug 2017 – Present",
                "Volunteer duration",
                "4 mos",
                "Cause",
                "Children",
                "-Cheerleader Coach and Cooking teacher for children 6-11-Fundraising efforts to ensure funding to keep the club active-Tutoring, mentoring and advising impressionable children-Actively serving as role model for young girls"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 23 more skills"
            ],
            "Recommendations",
            [
                "TED Conferences",
                "6,087,122 followers"
            ],
            [
                "Habitat for Humanity International",
                "88,799 followers"
            ],
            [
                "Arizona Professional Networkers",
                "25,876 members"
            ],
            [
                "Business Owners, Entrepreneurs & Start-Ups",
                "29,727 members"
            ],
            [
                "Arizona State University",
                "426,127 followers"
            ],
            [
                "HomeLight",
                "2,785 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "TED Conferences",
                "6,087,122 followers"
            ],
            [
                "TED Conferences",
                "6,087,122 followers"
            ],
            [
                "Habitat for Humanity International",
                "88,799 followers"
            ],
            [
                "Habitat for Humanity International",
                "88,799 followers"
            ],
            [
                "Arizona Professional Networkers",
                "25,876 members"
            ],
            [
                "Arizona Professional Networkers",
                "25,876 members"
            ],
            [
                "Business Owners, Entrepreneurs & Start-Ups",
                "29,727 members"
            ],
            [
                "Business Owners, Entrepreneurs & Start-Ups",
                "29,727 members"
            ],
            [
                "Arizona State University",
                "426,127 followers"
            ],
            [
                "Arizona State University",
                "426,127 followers"
            ],
            [
                "HomeLight",
                "2,785 followers"
            ],
            [
                "HomeLight",
                "2,785 followers"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Human Resources",
                "See 65 endorsements for Human Resources",
                "65",
                "Human Resources",
                "Endorse",
                "Endorsed by Joseph Abbinanti, who is highly skilled at this",
                "Endorsed by 7 of Kristen’s colleagues at Zenefits"
            ],
            [
                "Human Resources",
                "See 65 endorsements for Human Resources",
                "65"
            ],
            [
                "Recruiting",
                "See 47 endorsements for Recruiting",
                "47",
                "Recruiting",
                "Endorse",
                "Endorsed by Joseph Abbinanti and 1 other who is highly skilled at this",
                "Endorsed by 3 of Kristen’s colleagues at Zenefits"
            ],
            [
                "Recruiting",
                "See 47 endorsements for Recruiting",
                "47"
            ],
            [
                "Public Speaking",
                "See 62 endorsements for Public Speaking",
                "62",
                "Public Speaking",
                "Endorse",
                "Endorsed by Dennis Menjivar, who is highly skilled at this",
                "Endorsed by Samir Trivedi (mutual connection)"
            ],
            [
                "Public Speaking",
                "See 62 endorsements for Public Speaking",
                "62"
            ]
        ],
        "summary": "    Experienced Senior Recruiter with a demonstrated history of working in the information technology and services industry. Skilled in Microsoft Word, Sales, Customer Relationship Management (CRM), Management, and Employee Training. Strong human resources professional with a Bachelor’s Degree focused in Education/Teaching of Individuals in Elementary Special Education Programs from Arizona State University.\n  \n  \n",
        "name": "Kristen Kidd",
        "title": "MS Candidate, Human Resource Management at Georgetown University",
        "url": "linkedin.com/in/kristenkidd09",
        "phone": "",
        "email": "kristenkidd09@gmail.com"
    }
]