[
    {
        "experience": [
            "Highlights",
            [
                "103 Mutual Connections",
                "You and Douglas both know Trish Bear, Jeremy Young, and 101 others"
            ],
            [
                "Tune in to Bloomberg Radio today at 3:45pm CT to hear Jet Linx President and CEO Jamie Walker speak on the business of private aviation with Cory Johnson! https://lnkd.in/eXNr2hx",
                "Douglas liked"
            ],
            [
                "2017 Press Releases",
                "Douglas liked"
            ],
            [
                "To the Nines | Jet Linx",
                "Douglas liked"
            ],
            [
                "\"The real voyage of discovery consists not in seeking new landscapes, but in having new eyes.\" – Marcel Proust #TakeFlightTuesday",
                "Douglas liked"
            ],
            [
                "Jet Linx Atlanta Client Services Specialist Tia Flanagan loves to greet every flight – \"especially when our clients travel with their dogs!\" Get to know Tia, and find out why she is proud to call Jet Linx Atlanta #MyHomeBase: https://lnkd.in/e4-7GPq",
                "Douglas liked"
            ],
            [
                "Jet Linx Aviation is hiring! #YourPersonalJetCompany",
                "Douglas shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Director of Jet Card Sales",
                "Company Name",
                "Jet Linx",
                "Dates Employed",
                "Jan 2016 – Present",
                "Employment Duration",
                "1 yr 10 mos",
                "Location",
                "Greater Omaha Area",
                "Jet Linx History...In 1999 we set out to build a private jet company that would provide the industry’s best customer service experience.We started by looking at the other companies that guarantee private jet services to their clients to see where there was room for improvement. The other companies operate massive floating fleets, from one central office, to stretch and try to provide service to the masses. By doing so, their clients schedule flights through an 800 number, embark from a third party FBO, and fly on a different aircraft with different pilots every time.In exchange for servicing the masses, the other companies require their clients to deal with impersonal and unfamiliar relationships for every aspect of their experience. The companies are never able to get to know their clients personally and therefore can not cater to their client’s individual needs. And the client consequently never receives the quality of service that should accompany such a high ticket item.In order to provide the best customer service experience we had to change all this. We start by establishing a local base of operation so that we can handhold every aspect of the customer service experience. Our clients schedule their flights with a local Client Service person, embark from a local private terminal, and fly on local planes with local pilots they know and trust. We localize every aspect of our business so we can focus on providing each and every client with the very best customer service experience."
            ],
            [
                "Director of Charter Sales, West Coast",
                "Company Name",
                "Status Jet",
                "Dates Employed",
                "Jun 2015 – Jan 2016",
                "Employment Duration",
                "8 mos",
                "Location",
                "Dallas/Fort Worth Area",
                "Status Jet has stayed focused on serving the unique needs of the luxury market. Today, that commitment is stronger than ever. We are committed to upholding our core principles: To be a premier luxury service provider of private aircraft charter and sales, dedicated to providing our customers with the finest and safest aircraft in the industry, and offering superior client service!We believe safety is the most important part of any flight.  When you can rely on a smooth flight from take off to landing, it is easier to enjoy the unique amenities available on each aircraft. Each Status Jet aircraft and flight crew strictly adheres to rigorous FAA Part 135 Regulations, and the benchmark ARGUS Gold and Platinum standards. With a focus on safety and reliability first, we ensure you can sit back, relax and enjoy your private jet charter."
            ],
            [
                "Executive Casino Host",
                "Company Name",
                "The New Tropicana Las Vegas",
                "Dates Employed",
                "Nov 2014 – Apr 2015",
                "Employment Duration",
                "6 mos",
                "Location",
                "Las Vegas, Nevada Area",
                "Located on the south end of the Las Vegas Strip, The New Tropicana Las Vegas is redefining the expectations of today’s global travelers with a recently completed $200 million transformation that provides a casually elegant resort experience. In addition to a South Beach rhythm and vibe, the transformation of the resort includes a fresh redesign of its best-in-class hotel rooms and suites, the 50,000-square-foot casino, more than 72,000 square feet of meeting and exhibition space, several new restaurants and bars, a new race and sports book, and Glow®, a Mandara Spa and fitness center. First-class entertainment includes the Laugh Factory comedy club and live music in the Tropicana Lounge.Since the launch of our $200 million transformation, Tropicana Las Vegas has been honored with a variety of exclusive awards. From our hotel rooms and suites to our Las Vegas restaurants, casino and rewards program, and our all-new Las Vegas convention facility, we have received honors for just about everything! We are very proud to have such a well-rounded assortment of decorations, as we believe that each award we have received is a testimony to our guests about the exceptional experience that they can expect to have when they stay at our resort."
            ],
            [
                "Casino Host",
                "Company Name",
                "The Cosmopolitan of Las Vegas",
                "Dates Employed",
                "Jan 2014 – Oct 2014",
                "Employment Duration",
                "10 mos",
                "Location",
                "Las Vegas, Nevada Area",
                "The Cosmopolitan of Las Vegas is a unique luxury resort offering a decidedly different perspective, situated in the heart of The Strip. The resort's uniquely vertical multi-tower design offers spectacular views of the vibrant city. The new 2,995-room resort features oversized, residential-style living spaces with expansive, one-of-a-kind private terraces. The Cosmopolitan's luxurious resort amenities include a 100,000-square-foot casino; Sahra Spa & Hammam; three unique pool experiences at The Pool District; Marquee Nightclub & Dayclub at The Cosmopolitan, a multi-level integrated nightclub; and 150,000 square feet of state-of-the-art convention and meeting space. An eclectic lineup of new-to-market retailers include AllSaints Spitalfields, Beckley, CRSVR Sneaker Boutique, DNA2050, Molly Brown's Swimwear, Retrospecs & Co, Skins 6|2 Cosmetics and STITCHED. Signature restaurants include Blue Ribbon Sushi Bar & Grill by restaurateurs Bruce and Eric Bromberg; Comme Ça by Los Angeles Chef David Myers; Estiatorio Milos, by international restaurateur Costas Spiliadis; Holsteins from Block 16 Hospitality; Jaleo and China Poblano restaurants by acclaimed Chef José Andrés; Scarpetta and D.O.C.G. by award-winning Chef Scott Conant; and popular steakhouse STK from The ONE Group.",
                "Media (1)",
                "This position has 1 media",
                "The Cosmopolitan of Las Vegas",
                "The Cosmopolitan of Las Vegas",
                "This media is an image"
            ],
            [
                "Sheriff's Cyber & Technology Posse Official",
                "Company Name",
                "Maricopa County",
                "Dates Employed",
                "Jun 2011 – Nov 2013",
                "Employment Duration",
                "2 yrs 6 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Though varied by skill set and interest, all the Posse groups have one goal - to support the Maricopa County Sheriff's Office personnel. All Posse groups train for, participate in, and respond to missions such as: Search & Rescue, Crime Prevention, Civic Functions, Disaster Relief and Emergency Support.",
                "Media (1)",
                "This position has 1 media",
                "Maricopa County Sheriff's Office",
                "Maricopa County Sheriff's Office",
                "This media is a link"
            ],
            [
                "Co-Founder/President",
                "Company Name",
                "SeatNation",
                "Dates Employed",
                "Nov 2007 – Aug 2013",
                "Employment Duration",
                "5 yrs 10 mos",
                "Location",
                "Scottsdale, Arizona",
                "Ran the day to day operations of SeatNation's corporate headquarters in Scottsdale, AZ. Travel to all major national & international events throughout the calendar year (BCS Championship, Super Bowl, Winter Olympics, NASCAR Daytona 500, NCAA Final Four, Masters, Kentucky Derby, Indianapolis 500, NBA Finals, US Open Golf, NHL Stanley Cup Finals, Wimbledon, Summer Olympics, FIFA World Cup, Ryder Cup, US Open Tennis, World Series, National Finals Rodeo, etc...)Co-Founded SeatNation in 2007 which is a unique premium ticket and concierge service, specializing in the procurement of hard-to-get tickets at great prices. The extensive ticket networks include professional and non-professional sporting events, concerts, theater, festivals and exclusive celebrity parties. SeatNation further ensures an enjoyable and flawless experience by offering personal jet service to the city of your event, car service, dinner reservations and hotel accommodations of the highest caliber."
            ],
            [
                "Senior Sales Associate",
                "Company Name",
                "Ticket Exchange Inc.",
                "Dates Employed",
                "Nov 1997 – Nov 2007",
                "Employment Duration",
                "10 yrs 1 mo",
                "Location",
                "Phoenix, Arizona Area",
                "Point-Of-Sale Ticketing System Operator for Purchase Orders/Invoices.The Ticket Exchange Inc. has been providing premium tickets for all sporting, concert, and theatrical events around the world for corporate and individual clients since 1983. Hard to aquire quality tickets can be an exceptional gift, incentive, or reward for your valued employees, important clients, friends, and loved ones. Whether you require one or one hundred tickets, the Ticket Exchange can fulfill your specific needs. In addition to concert access around the globe, Ticket Exchange Inc. has access to personalized ticket, hotel, limousine, and travel accommodations. T.E.I. is currently in good standing with the National Association of Ticket Brokers, Phoenix Chamber of Commerce, and the Better Business Bureau."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Arizona State University",
                "Field Of Study",
                "Business Administration and Management, General",
                "Dates attended or expected graduation",
                "1997 – 2002"
            ],
            [
                "Arizona State University",
                "Field Of Study",
                "Business Administration and Management, General",
                "Dates attended or expected graduation",
                "1997 – 2002"
            ],
            [
                "Portland State University",
                "Field Of Study",
                "Business/Commerce, General",
                "Dates attended or expected graduation",
                "1996 – 1997"
            ],
            [
                "Portland State University",
                "Field Of Study",
                "Business/Commerce, General",
                "Dates attended or expected graduation",
                "1996 – 1997"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Board Member",
                "Company Name",
                "Future for KIDS",
                "Dates volunteered",
                "May 2016 – Present",
                "Volunteer duration",
                "1 yr 6 mos",
                "Cause",
                "Children",
                "Future for KIDS Mission is to provide mentor driven out-of-school time programs and camps that focus on academics, athletics, and ethics to improve the lives of youth who face adversity.Future for KIDS is an organization recognized for excellence and innovation committed to creating brighter futures for our community’s most vulnerable youth.Future for KIDS values the following as central to our success:• Education: We encourage life-long learning Camp FFK for website mentor child.• Excellence: We are committed to upholding excellent program service to benefit the children in our community.• Diversity: We embrace diversity in all of its dimensions recognizing that mutual respect for individuality and the inclusion of all are vital for both personal and organizational success.• Integrity: We hold high standards of character and integrity as the foundations upon which the organization is built.• Healthy living: We promote a commitment to physical and mental wellness and strive to be good role models for healthy behaviors."
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 47 more skills"
            ],
            "Recommendations",
            [
                "INTERNATIONAL LUXURY HOTEL ASSOCIATION - Hospitality, Hotels, Tourism, Luxury, Wellness, Food, Spa",
                "329,559 members"
            ],
            [
                "Paris Las Vegas",
                "762 followers"
            ],
            [
                "Mark CubanMark Cuban is a LinkedIn Influencer",
                "President",
                "2,871,657 followers"
            ],
            [
                "Cutter Aviation",
                "2,435 followers"
            ],
            [
                "Salesforce",
                "847,202 followers"
            ],
            [
                "Embraer",
                "200,014 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "INTERNATIONAL LUXURY HOTEL ASSOCIATION - Hospitality, Hotels, Tourism, Luxury, Wellness, Food, Spa",
                "329,559 members"
            ],
            [
                "INTERNATIONAL LUXURY HOTEL ASSOCIATION - Hospitality, Hotels, Tourism, Luxury, Wellness, Food, Spa",
                "329,559 members"
            ],
            [
                "Paris Las Vegas",
                "762 followers"
            ],
            [
                "Paris Las Vegas",
                "762 followers"
            ],
            [
                "Mark CubanMark Cuban is a LinkedIn Influencer",
                "President",
                "2,871,657 followers"
            ],
            [
                "Mark CubanMark Cuban is a LinkedIn Influencer",
                "President",
                "2,871,657 followers"
            ],
            [
                "Mark Cuban is a LinkedIn Influencer"
            ],
            [
                "Cutter Aviation",
                "2,435 followers"
            ],
            [
                "Cutter Aviation",
                "2,435 followers"
            ],
            [
                "Salesforce",
                "847,202 followers"
            ],
            [
                "Salesforce",
                "847,202 followers"
            ],
            [
                "Embraer",
                "200,014 followers"
            ],
            [
                "Embraer",
                "200,014 followers"
            ]
        ],
        "recommendations": [
            [
                "Corbin R. Collier",
                "Inside Sales Account Executive at EPIC Aviation",
                "June 9, 2016, Corbin R. worked with Douglas but at different companies",
                "“Douglas is a brilliant aviation sales professional with many years of experience.  He is extremely enthusiastic about his work and always has a positive outlook.  It’s rare that you come across standout talent like Douglas.  He’s the best!”"
            ],
            [
                "Corbin R. Collier",
                "Inside Sales Account Executive at EPIC Aviation",
                "June 9, 2016, Corbin R. worked with Douglas but at different companies"
            ],
            [
                "Corbin R. Collier",
                "Inside Sales Account Executive at EPIC Aviation",
                "June 9, 2016, Corbin R. worked with Douglas but at different companies"
            ],
            [
                "Corbin R. Collier",
                "Inside Sales Account Executive at EPIC Aviation",
                "June 9, 2016, Corbin R. worked with Douglas but at different companies"
            ],
            "Inside Sales Account Executive at EPIC Aviation",
            [
                "“Douglas is a brilliant aviation sales professional with many years of experience.  He is extremely enthusiastic about his work and always has a positive outlook.  It’s rare that you come across standout talent like Douglas.  He’s the best!”"
            ],
            [
                "“Douglas is a brilliant aviation sales professional with many years of experience.  He is extremely enthusiastic about his work and always has a positive outlook.  It’s rare that you come across standout talent like Douglas.  He’s the best!”"
            ],
            [
                "Mark Sage",
                "Buyer at SupplyOne",
                "February 2, 2015, Mark was a client of Douglas’",
                "Douglas Teitel would be one of the Best Casino Host's I have ever had in the past 19 years in Las Vegas and all other Gaming locations . He knows how to treat a customer and provides top level service ever time . I am very excited to see he has joined the Tropicana Team and I will gladly be moving my business over to the Tropicana knowing that Doug is there  ."
            ],
            [
                "Mark Sage",
                "Buyer at SupplyOne",
                "February 2, 2015, Mark was a client of Douglas’"
            ],
            [
                "Mark Sage",
                "Buyer at SupplyOne",
                "February 2, 2015, Mark was a client of Douglas’"
            ],
            [
                "Mark Sage",
                "Buyer at SupplyOne",
                "February 2, 2015, Mark was a client of Douglas’"
            ],
            "Buyer at SupplyOne",
            [
                "Douglas Teitel would be one of the Best Casino Host's I have ever had in the past 19 years in Las Vegas and all other Gaming locations . He knows how to treat a customer and provides top level service ever time . I am very excited to see he has joined the Tropicana Team and I will gladly be moving my business over to the Tropicana knowing that Doug is there  ."
            ],
            [
                "Douglas Teitel would be one of the Best Casino Host's I have ever had in the past 19 years in Las Vegas and all other Gaming locations . He knows how to treat a customer and provides top level service ever time . I am very excited to see he has joined the Tropicana Team and I will gladly be moving my business over to the Tropicana knowing that Doug is there  ."
            ],
            [
                "Connie Naill",
                "Marketing/Sales",
                "January 30, 2015, Connie worked with Douglas but at different companies",
                "Doug is making things exciting over at the Tropicana. Please let me know when you need tickets. I look forward to doing business!"
            ],
            [
                "Connie Naill",
                "Marketing/Sales",
                "January 30, 2015, Connie worked with Douglas but at different companies"
            ],
            [
                "Connie Naill",
                "Marketing/Sales",
                "January 30, 2015, Connie worked with Douglas but at different companies"
            ],
            [
                "Connie Naill",
                "Marketing/Sales",
                "January 30, 2015, Connie worked with Douglas but at different companies"
            ],
            "Marketing/Sales",
            [
                "Doug is making things exciting over at the Tropicana. Please let me know when you need tickets. I look forward to doing business!"
            ],
            [
                "Doug is making things exciting over at the Tropicana. Please let me know when you need tickets. I look forward to doing business!"
            ],
            [
                "Chauncey White",
                "IT Manager at Westport Properties Inc",
                "December 22, 2014, Chauncey was a client of Douglas’",
                "I had the opportunity to work with Doug the past week, I can say that I was extremely impressed. Doug was a pleasure to work with and handled any requests I made immediately. If you are looking for someone to help you out with Vegas, I highly recommend Doug."
            ],
            [
                "Chauncey White",
                "IT Manager at Westport Properties Inc",
                "December 22, 2014, Chauncey was a client of Douglas’"
            ],
            [
                "Chauncey White",
                "IT Manager at Westport Properties Inc",
                "December 22, 2014, Chauncey was a client of Douglas’"
            ],
            [
                "Chauncey White",
                "IT Manager at Westport Properties Inc",
                "December 22, 2014, Chauncey was a client of Douglas’"
            ],
            "IT Manager at Westport Properties Inc",
            [
                "I had the opportunity to work with Doug the past week, I can say that I was extremely impressed. Doug was a pleasure to work with and handled any requests I made immediately. If you are looking for someone to help you out with Vegas, I highly recommend Doug."
            ],
            [
                "I had the opportunity to work with Doug the past week, I can say that I was extremely impressed. Doug was a pleasure to work with and handled any requests I made immediately. If you are looking for someone to help you out with Vegas, I highly recommend Doug."
            ],
            [
                "Brad Williamson",
                "Regional Head - North America at Grail Research",
                "September 17, 2014, Brad worked with Douglas but at different companies",
                "Whether you're a high-roller or just know someone who is, Doug's knowledge of all things Vegas and his ability to make things happen will amaze."
            ],
            [
                "Brad Williamson",
                "Regional Head - North America at Grail Research",
                "September 17, 2014, Brad worked with Douglas but at different companies"
            ],
            [
                "Brad Williamson",
                "Regional Head - North America at Grail Research",
                "September 17, 2014, Brad worked with Douglas but at different companies"
            ],
            [
                "Brad Williamson",
                "Regional Head - North America at Grail Research",
                "September 17, 2014, Brad worked with Douglas but at different companies"
            ],
            "Regional Head - North America at Grail Research",
            [
                "Whether you're a high-roller or just know someone who is, Doug's knowledge of all things Vegas and his ability to make things happen will amaze."
            ],
            [
                "Whether you're a high-roller or just know someone who is, Doug's knowledge of all things Vegas and his ability to make things happen will amaze."
            ],
            [
                "Stephen Lehtonen",
                "Engagement Partner, Innovation Practice Lead at Growthink",
                "September 3, 2014, Stephen worked with Douglas but at different companies",
                "I met Douglas at his hotel and he immediately made us feel at ease and part of the \"party.\" Las Vegas is all about hospitality and Douglas understands this innately. On my next trip to Las Vegas, I am looking for Douglas Teitel! I suggest anyone reading this does the same."
            ],
            [
                "Stephen Lehtonen",
                "Engagement Partner, Innovation Practice Lead at Growthink",
                "September 3, 2014, Stephen worked with Douglas but at different companies"
            ],
            [
                "Stephen Lehtonen",
                "Engagement Partner, Innovation Practice Lead at Growthink",
                "September 3, 2014, Stephen worked with Douglas but at different companies"
            ],
            [
                "Stephen Lehtonen",
                "Engagement Partner, Innovation Practice Lead at Growthink",
                "September 3, 2014, Stephen worked with Douglas but at different companies"
            ],
            "Engagement Partner, Innovation Practice Lead at Growthink",
            [
                "I met Douglas at his hotel and he immediately made us feel at ease and part of the \"party.\" Las Vegas is all about hospitality and Douglas understands this innately. On my next trip to Las Vegas, I am looking for Douglas Teitel! I suggest anyone reading this does the same."
            ],
            [
                "I met Douglas at his hotel and he immediately made us feel at ease and part of the \"party.\" Las Vegas is all about hospitality and Douglas understands this innately. On my next trip to Las Vegas, I am looking for Douglas Teitel! I suggest anyone reading this does the same."
            ],
            [
                "Angelina Grossi",
                "Vice President of Strategic Accounts",
                "April 27, 2014, Angelina was a client of Douglas’",
                "I would highly recommend Doug Teitel, he was an excellent host to our executive. sales and marketing group at Amerit Fleet Solutions at the Cosmopolitan Hotel. Everyone had an incredible time, and he really went the extra mile to make the experience personal and special for us. We would definitely have future meetings and events at the hotel and come back to see Doug! Thanks for everything!"
            ],
            [
                "Angelina Grossi",
                "Vice President of Strategic Accounts",
                "April 27, 2014, Angelina was a client of Douglas’"
            ],
            [
                "Angelina Grossi",
                "Vice President of Strategic Accounts",
                "April 27, 2014, Angelina was a client of Douglas’"
            ],
            [
                "Angelina Grossi",
                "Vice President of Strategic Accounts",
                "April 27, 2014, Angelina was a client of Douglas’"
            ],
            "Vice President of Strategic Accounts",
            [
                "I would highly recommend Doug Teitel, he was an excellent host to our executive. sales and marketing group at Amerit Fleet Solutions at the Cosmopolitan Hotel. Everyone had an incredible time, and he really went the extra mile to make the experience personal and special for us. We would definitely have future meetings and events at the hotel and come back to see Doug! Thanks for everything!"
            ],
            [
                "I would highly recommend Doug Teitel, he was an excellent host to our executive. sales and marketing group at Amerit Fleet Solutions at the Cosmopolitan Hotel. Everyone had an incredible time, and he really went the extra mile to make the experience personal and special for us. We would definitely have future meetings and events at the hotel and come back to see Doug! Thanks for everything!"
            ],
            [
                "Corbin R. Collier",
                "Inside Sales Account Executive at EPIC Aviation",
                "June 9, 2016, Douglas worked with Corbin R. but at different companies",
                "Rarely do you find an employee that contributes so much to both the corporate culture and revenue. Corbin is an amazing salesman, one of the best in the industry. But above that, he is a pleasure to work with."
            ],
            [
                "Corbin R. Collier",
                "Inside Sales Account Executive at EPIC Aviation",
                "June 9, 2016, Douglas worked with Corbin R. but at different companies"
            ],
            [
                "Corbin R. Collier",
                "Inside Sales Account Executive at EPIC Aviation",
                "June 9, 2016, Douglas worked with Corbin R. but at different companies"
            ],
            [
                "Corbin R. Collier",
                "Inside Sales Account Executive at EPIC Aviation",
                "June 9, 2016, Douglas worked with Corbin R. but at different companies"
            ],
            "Inside Sales Account Executive at EPIC Aviation",
            [
                "Rarely do you find an employee that contributes so much to both the corporate culture and revenue. Corbin is an amazing salesman, one of the best in the industry. But above that, he is a pleasure to work with."
            ],
            [
                "Rarely do you find an employee that contributes so much to both the corporate culture and revenue. Corbin is an amazing salesman, one of the best in the industry. But above that, he is a pleasure to work with."
            ],
            [
                "Brett Reitz",
                "Director, Business Development at BTT",
                "April 20, 2012, Brett was a client of Douglas’",
                "Brett's understanding of the secondary ticket market today not only benefits the St. Louis Cardinals now, but sets up them for growth in the future. It is a pleasure to work w/ Brett on a day to day basis."
            ],
            [
                "Brett Reitz",
                "Director, Business Development at BTT",
                "April 20, 2012, Brett was a client of Douglas’"
            ],
            [
                "Brett Reitz",
                "Director, Business Development at BTT",
                "April 20, 2012, Brett was a client of Douglas’"
            ],
            [
                "Brett Reitz",
                "Director, Business Development at BTT",
                "April 20, 2012, Brett was a client of Douglas’"
            ],
            "Director, Business Development at BTT",
            [
                "Brett's understanding of the secondary ticket market today not only benefits the St. Louis Cardinals now, but sets up them for growth in the future. It is a pleasure to work w/ Brett on a day to day basis."
            ],
            [
                "Brett's understanding of the secondary ticket market today not only benefits the St. Louis Cardinals now, but sets up them for growth in the future. It is a pleasure to work w/ Brett on a day to day basis."
            ]
        ],
        "skills": [
            [
                "Marketing",
                "See 278 endorsements for Marketing",
                "99+",
                "Marketing",
                "Endorse",
                "Endorsed by G. R. Boone and 19 others who are highly skilled at this",
                "Endorsed by Babak Motamedi and 4 other mutual connections"
            ],
            [
                "Marketing",
                "See 278 endorsements for Marketing",
                "99+"
            ],
            [
                "Event Management",
                "See 214 endorsements for Event Management",
                "99+",
                "Event Management",
                "Endorse",
                "Endorsed by Karen L. May and 12 others who are highly skilled at this",
                "Endorsed by Allen Jenkins and 2 other mutual connections"
            ],
            [
                "Event Management",
                "See 214 endorsements for Event Management",
                "99+"
            ],
            [
                "Hospitality",
                "See 187 endorsements for Hospitality",
                "99+",
                "Hospitality",
                "Endorse",
                "Endorsed by Michelle Paladino, who is highly skilled at this",
                "Endorsed by Karen L. May (mutual connection)"
            ],
            [
                "Hospitality",
                "See 187 endorsements for Hospitality",
                "99+"
            ]
        ],
        "summary": "  Facebook: https://www.facebook.com/DouglasTeitel Instagram: @dougteitel Twitter: @DouglasTeitel\n  \n  \n",
        "name": "Douglas Teitel",
        "title": "Director of Jet Card Sales at Jet Linx",
        "url": "linkedin.com/in/dteitel",
        "phone": "(702) 843-4444 (Mobile)",
        "email": "dougteitel@hotmail.com"
    }
]