[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "17 Mutual Connections",
                "You and Jeffrey both know Dan Nienhauser, Dimitri Ponomareff, and 15 others"
            ],
            [
                "Jeffrey can introduce you to 6 people at American Express",
                "You are following American Express"
            ],
            [
                "Show more highlights"
            ],
            [
                "In this week's Distributed Data Show, I sit down with Kathryn Erickson to discuss the merits of running distributed databases in Docker and announce the availability of official Docker images for DataStax  Enterprise.",
                "Jeffrey shared this"
            ],
            [
                "Found an unexpected surprise in the mail yesterday. Thanks O'Reilly Media!",
                "Jeffrey shared this"
            ],
            [
                "Thank you John Reese Williams, AIA and the Frank Lloyd Wright Foundation for hosting a behind the scenes tour this morning of Taliesin West.  Caruso Turley Scott Structural Engineers was honored to participate.",
                "Jeffrey liked"
            ],
            [
                "Free JavaScript Fundamentals Online Course at Galvanize Phoenix",
                "Jeffrey liked"
            ],
            [
                "How to choose a database for your microservices",
                "Jeffrey liked"
            ],
            [
                "If you're interested in graph database technology then this week's episode of the Distributed Data Show is for you.  Duyhai Doan gives some great tips on coming up to speed on the Gremlin query language:",
                "Jeffrey shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Technical Evangelist",
                "Company Name",
                "DataStax",
                "Dates Employed",
                "Jan 2017 – Present",
                "Employment Duration",
                "11 mos",
                "Location",
                "Scottsdale, Arizona",
                "I help developers and their organizations to be successful with Apache Cassandra and DataStax Enterprise through speaking, writing, sharing, creating reference implementations, and developer-to-developer contact."
            ],
            [
                "Systems Architect",
                "Company Name",
                "Choice Hotels International",
                "Dates Employed",
                "Nov 2013 – Jan 2017",
                "Employment Duration",
                "3 yrs 3 mos",
                "Location",
                "Phoenix, Arizona Area",
                "At Choice, I served as lead architect for a cloud based reservation system built on Amazon Web Services. In this greenfield project, the largest in the history of Choice IT, I worked with development teams to guide service identification, APIs and design patterns in accordance with a microservice-style architecture. On this project, I learned a tremendous amount about architecting, developing and supporting cloud applications, especially how to build performance and reliability into a large-scale distributed system. As a member of the Enterprise Architecture team, I helped select the technology stack used for new development, and authored guidelines for REST APIs, Apache Cassandra and Drools. My experience in helping Choice adopt Cassandra led to the opportunity to write a book about Cassandra (see below under Publications). I also performed technical due diligence in support of M&A activities, resulting in the successful acquisition of a vacation rental technology company."
            ],
            [
                "Software/Systems Architect",
                "Company Name",
                "General Dynamics Mission Systems",
                "Dates Employed",
                "Oct 2001 – Nov 2013",
                "Employment Duration",
                "12 yrs 2 mos",
                "Location",
                "Scottsdale, AZ",
                "When Motorola sold its government business in 2001, my organization became part of General Dynamics. I continued work on the Openings SOA project and various Command and Control (C2) systems for the US Army and US Marine Corps. I was a frequent contributor to technical proposals in pursuit of new business. Although these efforts were invariably intense periods of activity, I really enjoyed the challenge of creating architectures under tight deadlines.In 2003, I contributed to a technical proposal that was awarded a $400M contract to build automated planning, part of the US Army Future Combat Systems program. From 2004-2008, I served as the  Software Architect, including design of a common planning framework, service identification, and documentation of design patterns and guidance. FCS PPS was the largest software project in our business unit's history, in which we managed 5 subcontract organizations and were subcontracted to Boeing. To deal with this scale, I developed a system for tracking, prioritizing, escalating, and closing architectural issues. My contributions were recognized both by GD and Boeing with technical awards.After transitioning my responsibilities to architects I had mentored over the years, I joined a group known as the Office of Design from 2008-2013. Our business unit had grown through acquisition and new business to ~500 engineers working on ~50 projects at 5 different sites. I helped create architectural standards for the business unit to ensure consistency and frequently traveled to remote sites to get “red” projects back on track. Helping these projects involved identifying architecture and process flaws and putting plans in place to address them. To be successful, I had to build trust with staff in each organization so that we could deal with the root issues objectively and proactively. On one occasion, my efforts were key in a customer deciding to maintain the primary contract for a site with ~50 employees."
            ],
            [
                "Software Engineer",
                "Company Name",
                "Motorola",
                "Dates Employed",
                "Jun 1996 – Oct 2001",
                "Employment Duration",
                "5 yrs 5 mos",
                "Location",
                "Scottsdale, AZ",
                "My first job out of college was as a software developer on the US Army Joint Stars Common Ground Station (1996-1999). This radar ground station was successfully deployed in the second Iraq war and other conflicts, providing situational awareness that gave our soldiers a strategic advantage. After completing development tasks on several key software components ahead of schedule, I fixed defects throughout the system, including user interfaces, business logic, and databases. This exposure led to a growing interest in code craftsmanship and software architecture.  My interest in new architectures led to my involvement in a multi-year research and development effort known as Openwings (1999-2004). Openwings was a groundbreaking, open Service-Oriented Architecture (SOA) framework for network-centric, high-availability systems in the defense industry, which was developed in collaboration with Sun Microsystems and featured at the JavaOne conference. After developing reference implementations for infrastructure components providing discovery, service hosting, management and security, I served roles including Tech Lead, Project Lead, Developer Training, and Architect."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "University of Arizona",
                "Degree Name",
                "Bachelor of Science (BS)",
                "Field Of Study",
                "Computer Engineering",
                "Grade",
                "Summa cum laude, with honors",
                "Dates attended or expected graduation",
                "1992 – 1996",
                "After starting out as an Electrical Engineering major, I quickly discovered that my true passion was software development and switched to Computer Engineering, which allowed me to build a solid foundation of both computer architecture and computer science. I especially enjoyed courses on concurrent programming, operating systems, and AI."
            ],
            "Recommendations",
            [
                "Software Architecture (2967358)",
                "6,908 members"
            ],
            [
                "DataStax",
                "16,970 followers"
            ],
            [
                "Amazon AWS Architects",
                "31,892 members"
            ],
            [
                "TPM / Techpost Media",
                "51,146 members"
            ],
            [
                "University of Arizona",
                "231,235 followers"
            ],
            [
                "Choice Hotels International",
                "50,357 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Software Architecture (2967358)",
                "6,908 members"
            ],
            [
                "Software Architecture (2967358)",
                "6,908 members"
            ],
            [
                "DataStax",
                "16,970 followers"
            ],
            [
                "DataStax",
                "16,970 followers"
            ],
            [
                "Amazon AWS Architects",
                "31,892 members"
            ],
            [
                "Amazon AWS Architects",
                "31,892 members"
            ],
            [
                "TPM / Techpost Media",
                "51,146 members"
            ],
            [
                "TPM / Techpost Media",
                "51,146 members"
            ],
            [
                "University of Arizona",
                "231,235 followers"
            ],
            [
                "University of Arizona",
                "231,235 followers"
            ],
            [
                "Choice Hotels International",
                "50,357 followers"
            ],
            [
                "Choice Hotels International",
                "50,357 followers"
            ]
        ],
        "recommendations": [
            [
                "Brad Shroyer",
                "Senior UX Designer",
                "December 17, 2016, Jeffrey was senior to Brad but didn’t manage directly",
                "I worked with Brad on an airspace management system for the US Army. On this project he demonstrated the ability to build camaraderie with our system users, using human-centered design techniques to understand their needs and pain points. He then used this knowledge to create intuitive and efficient UI/UX designs and refined these through multiple user evaluations. This work was a key factor in our team's success in modernizing a 10+ year old battlefield system for a new generation of soldiers, and it also helped keep an important contract for the company."
            ],
            [
                "Brad Shroyer",
                "Senior UX Designer",
                "December 17, 2016, Jeffrey was senior to Brad but didn’t manage directly"
            ],
            [
                "Brad Shroyer",
                "Senior UX Designer",
                "December 17, 2016, Jeffrey was senior to Brad but didn’t manage directly"
            ],
            [
                "Brad Shroyer",
                "Senior UX Designer",
                "December 17, 2016, Jeffrey was senior to Brad but didn’t manage directly"
            ],
            "Senior UX Designer",
            [
                "I worked with Brad on an airspace management system for the US Army. On this project he demonstrated the ability to build camaraderie with our system users, using human-centered design techniques to understand their needs and pain points. He then used this knowledge to create intuitive and efficient UI/UX designs and refined these through multiple user evaluations. This work was a key factor in our team's success in modernizing a 10+ year old battlefield system for a new generation of soldiers, and it also helped keep an important contract for the company."
            ],
            [
                "I worked with Brad on an airspace management system for the US Army. On this project he demonstrated the ability to build camaraderie with our system users, using human-centered design techniques to understand their needs and pain points. He then used this knowledge to create intuitive and efficient UI/UX designs and refined these through multiple user evaluations. This work was a key factor in our team's success in modernizing a 10+ year old battlefield system for a new generation of soldiers, and it also helped keep an important contract for the company."
            ]
        ],
        "skills": [],
        "summary": "    Evangelist, Architect, Mentor, and Author.  As an Evangelist, I spread the word about Apache Cassandra, SOA/microservices and cloud architecture. I've served as the Architect of large, complex, \"industry first\" distributed systems, including an automated battle planning system and a cloud-based hotel reservation system.I enjoy Mentoring other architects, tech leads, and developers to help them take the next step in their careers.I'm the Author of Cassandra, The Definitive Guide, 2nd Edition (O’Reilly).\n  \n  \n",
        "name": "Jeffrey Carpenter",
        "title": "Technical Evangelist @ DataStax",
        "url": "linkedin.com/in/jeffreyscarpenter",
        "phone": "",
        "email": "jeffreyscarpenter@cox.net"
    }
]