[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "60 Mutual Connections",
                "You and Kelton both know Max Hansen, Derek Neighbors, and 58 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Manager of Sales and Marketing",
                "Company Name",
                "Bluespan Wireless Internet",
                "Dates Employed",
                "Feb 2015 – Present",
                "Employment Duration",
                "3 yrs",
                "Location",
                "Tucson, Arizona Area",
                "-Identify business opportunities by identifying prospects and evaluating their position in the industry; researching and analyzing sales options.-Sell products by establishing contact and developing relationships with prospects; recommending solutions.-Maintain relationships with clients by providing support, information, and guidance; researching and recommending new opportunities; recommending profit and service improvements.-Identify product improvements or new products by remaining current on industry trends, market activities, and competitors.-Prepare reports by collecting, analyzing, and summarizing information.-Maintain quality service by establishing and enforcing organization standards.-Maintain professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; bench marking state-of-the-art practices; participating in professional societies.-Contribute to team effort by accomplishing related results as needed.-Identify marketing opportunities by identifying consumer requirements; defining market, competitor's share, and competitor's strengths and weaknesses; forecasting projected business; establishing targeted market share.-Achieve marketing and sales operational objectives by contributing marketing and sales information and recommendations to strategic plans and reviews; preparing and completing action plans; implementing production, productivity, quality, and customer-service standards; resolving problems; completing audits; identifying trends; determining system improvements; implementing change."
            ],
            [
                "Grounds Crew at Tempe Diablo",
                "Company Name",
                "City of Tempe",
                "Dates Employed",
                "Sep 2014 – Jan 2015",
                "Employment Duration",
                "5 mos",
                "Location",
                "Tempe, Arizona",
                "• Assisted in preparation, maintenance and restoration of grounds as directed, including any and all activities or tasks fundamental to baseball field care.• Set-up and broke down equipment for batting practice and games.• Dragged infield between innings as directed.• Operated powered equipment such as mowers, tractors, twin-axle vehicles and sod cutters.• Used hand tools such as shovels, rakes and hedge and brush trimmers.• Ensured use of proper equipment and adhered to safety standards and precautions.• Maintained, cleaned and repaired tools, equipment and structures.• Gathered and removed litter.• Provided support in other stadium activities and special events.• Performed other duties as assigned."
            ],
            [
                "Specialist",
                "Company Name",
                "Snap Booth Entertainment",
                "Dates Employed",
                "May 2012 – Jan 2015",
                "Employment Duration",
                "2 yrs 9 mos",
                "Location",
                "Phoenix Metro Area",
                "•     Transported booths to and from venues•     Set up and ran booths at events•     Trained new employees on procedures and duties with the booths"
            ],
            [
                "Customer Service Representative",
                "Company Name",
                "DesignAShirt.com",
                "Dates Employed",
                "Jul 2014 – Sep 2014",
                "Employment Duration",
                "3 mos",
                "Location",
                "Tempe, AZ",
                "-Attract potential customers by answering product and service questions; suggesting information about other products and services.-Open customer accounts by recording account information.-Maintain customer records by updating account information.-Resolves product or service problems by clarifying the customer's complaint; determining the cause of the problem; selecting and explaining the best solution to solve the problem; expediting correction or adjustment; following up to ensure resolution.-Maintain financial accounts by processing customer adjustments.-Recommend potential products or services to management by collecting customer information and analyzing customer needs.-Prepare product or service reports by collecting and analyzing customer information.-Contribute to team effort by accomplishing related results as needed.-Service existing accounts, obtains orders, and establishes new accounts by planning and organizing daily work schedule to call on existing or potential sales outlets and other trade factors.-Adjust content of sales presentations by studying the type of sales outlet or trade factor.-Focus sales efforts by studying existing and potential volume of dealers.-Submit orders by referring to price lists and product literature.-Keep management informed by submitting activity and results reports, such as daily call reports, weekly work plans, and monthly and annual territory analyses.-Monitor competition by gathering current marketplace information on pricing, products, new products, delivery schedules, merchandising techniques, etc.-Recommend changes in products, service, and policy by evaluating results and competitive developments.-Resolve customer complaints by investigating problems; developing solutions; preparing reports; making recommendations to management.-Provide historical records by maintaining records on area and customer sales."
            ],
            [
                "Assistant",
                "Company Name",
                "DesignAShirt.com",
                "Dates Employed",
                "May 2014 – Jul 2014",
                "Employment Duration",
                "3 mos",
                "Location",
                "Tempe, Arizona",
                "-Forwards information by receiving and distributing communications; collecting and mailing correspondence; copying information.-Maintains supplies by checking stock to determine inventory levels; anticipating requirements; placing and expediting orders; verifying receipt; stocking items; delivering supplies to work stations.-Maintains equipment by completing preventive maintenance; troubleshooting failures; calling for repairs; monitoring equipment operation; monitoring and purchasing meter fund-Maintains office schedule by picking-up and delivering items using automobile.-Serves customers by backing-up receptionist; answering questions; forwarding messages; confirming customer orders; keeping customers informed of order status.-Updates job knowledge by participating in educational opportunities.-Enhances organization reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Mesa Community College",
                "Degree Name",
                "Associate of Arts (AA)",
                "Field Of Study",
                "Liberal Arts and Sciences, General Studies and Humanities",
                "Dates attended or expected graduation",
                "2012 – 2014",
                "Activities and Societies:",
                "College Baseball"
            ],
            [
                "Mesa Community College",
                "Degree Name",
                "Associate of Arts (AA)",
                "Field Of Study",
                "Liberal Arts and Sciences, General Studies and Humanities",
                "Dates attended or expected graduation",
                "2012 – 2014",
                "Activities and Societies:",
                "College Baseball"
            ],
            [
                "College of Southern Idaho",
                "Degree Name",
                "Associate of Arts (AA)",
                "Field Of Study",
                "Liberal Arts and Sciences, General Studies and Humanities",
                "Dates attended or expected graduation",
                "2011 – 2012",
                "Activities and Societies:",
                "Men's Basketball Team"
            ],
            [
                "College of Southern Idaho",
                "Degree Name",
                "Associate of Arts (AA)",
                "Field Of Study",
                "Liberal Arts and Sciences, General Studies and Humanities",
                "Dates attended or expected graduation",
                "2011 – 2012",
                "Activities and Societies:",
                "Men's Basketball Team"
            ],
            [
                "Chandler High School",
                "Degree Name",
                "High School Diploma",
                "Dates attended or expected graduation",
                "2007 – 2011",
                "Activities and Societies:",
                "Varsity Baseball, Varsity Basketball, AV Club"
            ],
            [
                "Chandler High School",
                "Degree Name",
                "High School Diploma",
                "Dates attended or expected graduation",
                "2007 – 2011",
                "Activities and Societies:",
                "Varsity Baseball, Varsity Basketball, AV Club"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Teachers Aide",
                "Company Name",
                "Chandler Unified School District",
                "Dates volunteered",
                "Feb 2010 – Feb 2010",
                "Volunteer duration",
                "1 mo",
                "Cause",
                "Education"
            ],
            "Recommendations",
            [
                "Remington Arms Company",
                "29,474 followers"
            ],
            [
                "Big Green Door",
                "779 followers"
            ],
            [
                "FCA Fiat Chrysler Automobiles",
                "306,573 followers"
            ],
            [
                "Sole Technology",
                "8,275 followers"
            ],
            [
                "VNN",
                "4,851 followers"
            ],
            [
                "Perry Ellis International",
                "18,766 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Remington Arms Company",
                "29,474 followers"
            ],
            [
                "Remington Arms Company",
                "29,474 followers"
            ],
            [
                "Big Green Door",
                "779 followers"
            ],
            [
                "Big Green Door",
                "779 followers"
            ],
            [
                "FCA Fiat Chrysler Automobiles",
                "306,573 followers"
            ],
            [
                "FCA Fiat Chrysler Automobiles",
                "306,573 followers"
            ],
            [
                "Sole Technology",
                "8,275 followers"
            ],
            [
                "Sole Technology",
                "8,275 followers"
            ],
            [
                "VNN",
                "4,851 followers"
            ],
            [
                "VNN",
                "4,851 followers"
            ],
            [
                "Perry Ellis International",
                "18,766 followers"
            ],
            [
                "Perry Ellis International",
                "18,766 followers"
            ]
        ],
        "recommendations": [
            [
                "Collin Bonngard",
                "Supplier Management at Boeing",
                "July 16, 2014, Collin worked with Kelton in the same group",
                "Collin is one of those rare colleagues who also naturally serves as an inspiring mentor for the whole staff. With a background in business and four years’ worth of experience as an manager, Collin exhibits strong interpersonal skills and a unique capacity for empathy. These qualities most notably translate in his ability to motivate a team to care about its project and be invested in the project’s success. Collin is the go-to person for conflict resolution and problem solving; when fights break out in pre-event meetings, he steps in to diffuse tension and induce compromising. Though he’s never one to draw attention to himself, Collin's positive attitude and the respect others feel toward him are palpable."
            ],
            [
                "Collin Bonngard",
                "Supplier Management at Boeing",
                "July 16, 2014, Collin worked with Kelton in the same group"
            ],
            [
                "Collin Bonngard",
                "Supplier Management at Boeing",
                "July 16, 2014, Collin worked with Kelton in the same group"
            ],
            [
                "Collin Bonngard",
                "Supplier Management at Boeing",
                "July 16, 2014, Collin worked with Kelton in the same group"
            ],
            "Supplier Management at Boeing",
            [
                "Collin is one of those rare colleagues who also naturally serves as an inspiring mentor for the whole staff. With a background in business and four years’ worth of experience as an manager, Collin exhibits strong interpersonal skills and a unique capacity for empathy. These qualities most notably translate in his ability to motivate a team to care about its project and be invested in the project’s success. Collin is the go-to person for conflict resolution and problem solving; when fights break out in pre-event meetings, he steps in to diffuse tension and induce compromising. Though he’s never one to draw attention to himself, Collin's positive attitude and the respect others feel toward him are palpable."
            ],
            [
                "Collin is one of those rare colleagues who also naturally serves as an inspiring mentor for the whole staff. With a background in business and four years’ worth of experience as an manager, Collin exhibits strong interpersonal skills and a unique capacity for empathy. These qualities most notably translate in his ability to motivate a team to care about its project and be invested in the project’s success. Collin is the go-to person for conflict resolution and problem solving; when fights break out in pre-event meetings, he steps in to diffuse tension and induce compromising. Though he’s never one to draw attention to himself, Collin's positive attitude and the respect others feel toward him are palpable."
            ]
        ],
        "skills": [],
        "summary": "    As an individual who thrives in a social setting, I aspire to work in an environment that allows me to utilize my personal skills at their fullest. I have a strong work ethic and am eager to take on new challenges! I’m proficient with various social media platforms, as well as marketing—a quick learner, especially electronically. With a consistent background in the sporting industry, that’s where I would like to see myself at the end of the day, above all else; to be involved with baseball specifically would be most ideal.\n  \n  \n",
        "name": "Kelton Wood",
        "title": "Manager of Sales and Marketing",
        "url": "",
        "phone": "",
        "email": ""
    }
]