[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "2 Mutual Connections",
                "You and Ben both know Bray Brockbank and Gayle Bass"
            ],
            [
                "About Application Development and Programming",
                "Ben liked"
            ],
            [
                "Introducing the Docker Global Professional Certification Program",
                "Ben liked"
            ],
            [
                "Got a new award from EC-Council: 'Instructor of the Year' for Germany!",
                "Ben liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "EVP - Sales, Marketing and Product",
                "Company Name",
                "Learn on Demand Systems",
                "Dates Employed",
                "Oct 2017 – Present",
                "Employment Duration",
                "1 mo"
            ],
            [
                "Global Senior Director, Partner Portfolios (Microsoft, Google, AWS, Red Hat)",
                "Company Name",
                "Global Knowledge",
                "Dates Employed",
                "Dec 2011 – Oct 2017",
                "Employment Duration",
                "5 yrs 11 mos",
                "Location",
                "Cary, North Carolina",
                "I manage a $150M+ global product portfolio spanning multiple partnerships and countries with direct P&L ownership. As General Manager, I provide senior strategic leadership for all aspects of positioning, developing, launching, and maintaining an overall portfolio of training products and services including Microsoft, Amazon, Google, SAP, SAS, Docker, Red Hat and Application Development:- Management of a team of product managers driving innovation into product portfolios by maximizing growth and profitability opportunities through new related product offerings, expanded capabilities and new partnerships while driving efficient product launch planning, budgeting, tracking, and reporting processes.- Matrixed management, influence and leadership across a diverse set of organizations including sales, marketing, operations, finance, IT, and executive management to enable the successful launch, revenue generation, and profitability of training products and services.- Market research and awareness of emerging technologies, adoption cycles, product versioning, and new product opportunities within the global portfolios with a goal of positioning Global Knowledge as the corporate training provider of choice.- Financial managem2ent of product portfolios in order to maximize performance metrics, profitability, and revenue growth"
            ],
            [
                "Senior Director – Product Management and Partner Programs",
                "Company Name",
                "Global Knowledge",
                "Dates Employed",
                "Dec 2011 – Oct 2016",
                "Employment Duration",
                "4 yrs 11 mos",
                "Location",
                "United States",
                "I manage a $100M+ in revenue product portfolio spanning multiple partnerships with direct P&L ownership at the Direct Margin level. Senior strategic leadership for all aspects of positioning, developing, launching, and maintaining the overall portfolio of training products and services including Microsoft, Amazon, Google, SAP, SAS, and Red Hat plus all Partner programs (managing over 60 partners):- Management of a team of product and partner managers driving innovation into product lines and partnerships, maximizing growth and profitability opportunities while driving efficient product launch planning, budgeting, tracking, and reporting processes.- Matrixed management, influence and leadership across a diverse set of organizations including sales, marketing, operations, finance, IT, and executive management to enable the successful launch, revenue generation, and profitability of related training products and services.- Market research and awareness of evolving technology adoption cycles, product versioning, and new product opportunities within the related software and solution sets with a goal of positioning Global Knowledge as the corporate training provider of choice across North America.- Identifying, managing and reselling partners who directly deliver courses that complement existing Global Knowledge product lines. Dozens of partners are in the worldwide partner program including VMWare, Red Hat, IBM, Pearson and SkillSoft.- Financial management of the related product lines in order to maximize performance metrics, profitability, and revenue growth across public Open Enrollment and private Enterprise sales channels. - Providing leadership and guidance to US Marketing organizations for the establishment of efficient and market leading open enrollment schedules across the related product lines.- Development of business case justifications for new related product offerings, expanded capabilities and new partnerships for existing product lines."
            ],
            [
                "Director, Product Management Group - Microsoft Learning",
                "Company Name",
                "Microsoft",
                "Dates Employed",
                "Oct 2007 – Dec 2011",
                "Employment Duration",
                "4 yrs 3 mos",
                "Location",
                "Redmond, WA",
                "Recruited to deliver subject matter expertise and hold ownership of all Microsoft Official Learning Products, including Microsoft Press Books, Microsoft Official Courseware and Microsoft Official E-Learning. Full P&L accountability for over $100 million in revenues, managing a team of up to 35 product managers. Delivered the strategic vision and project leadership to define product features, set pricing and establish long-term product strategy. Developed large-scale training platforms reaching millions of learners. Also managed the Microsoft Official Certification products team (all certifications) plus originally joined Microsoft to lead the Microsoft Learning digital marketing team (including www.microsoft.com/learning with over 1.6M visits per month). - Collaborated with strategic partners, including O’Reilly and Element K to manage and grow the Microsoft Press and E-Learning product line. As a result, Microsoft realized significant cost savings and a doubling of the production of titles. Microsoft Press product line exceeded target goals by 200%.- Championed and led the transition of the business from hardcover and paper books to a digital product with e-courseware and e-books, driving over 90% in cost savings and a faster time to market with no impact on customer satisfaction levels.- Led the full product development lifecycle from conception through production and full-scale launch of several new products and business models including Learning Snacks, 3rd party community courses, Jump Start online classes, digital courseware and training apps for Windows Phone 7; opening new markets and driving profits.  - Recognized for superior performance with two highly coveted Microsoft Gold Star awards."
            ],
            [
                "Vice-President, Collaboration",
                "Company Name",
                "Thomson NETg",
                "Dates Employed",
                "Jan 2006 – May 2007",
                "Employment Duration",
                "1 yr 5 mos",
                "Location",
                "Scottsdale, AZ",
                "Brought on board to establish the vision and direction of a strategic business unit as an “intrapreneur” to reinvigorate their training services business. Held full P&L accountability and directed a team of over 40 to build, deliver and sell online learning web services, including online instructor-led classes and 24x7 mentoring service. Company was acquired by Skillsoft. - Turned-around poor performance and declining revenues and brought the business unit to profitability, growing revenues over 30% to over $10 million.- Created and implemented a rapid course development model, which cut costs by 50%.- Reduced time-to-market by 60% through optimizing processes and streamlining procedures, taking the time to develop and launch a course from months to weeks."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "The University of Glasgow",
                "Degree Name",
                "Master of Arts (M.A.) (incomplete)",
                "Field Of Study",
                "Political Science",
                "Dates attended or expected graduation",
                "1991 – 1993",
                "Double Honors – International Politics and History – completed second year of four year program."
            ],
            [
                "The University of Glasgow",
                "Degree Name",
                "Master of Arts (M.A.) (incomplete)",
                "Field Of Study",
                "Political Science",
                "Dates attended or expected graduation",
                "1991 – 1993",
                "Double Honors – International Politics and History – completed second year of four year program."
            ],
            [
                "St. Thomas University (CA)",
                "Degree Name",
                "Bachelor of Arts (B.A.) (incomplete)",
                "Field Of Study",
                "Political Science",
                "Dates attended or expected graduation",
                "1988 – 1991",
                "Honors – International Political Science – completed third year of four year program and accepted into M.A. program at Glasgow University, Scotland."
            ],
            [
                "St. Thomas University (CA)",
                "Degree Name",
                "Bachelor of Arts (B.A.) (incomplete)",
                "Field Of Study",
                "Political Science",
                "Dates attended or expected graduation",
                "1988 – 1991",
                "Honors – International Political Science – completed third year of four year program and accepted into M.A. program at Glasgow University, Scotland."
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 47 more skills"
            ],
            "Recommendations",
            [
                "Degreed",
                "4,660 followers"
            ],
            [
                "The eLearning Guild",
                "67,054 members"
            ],
            [
                "ROI Training",
                "382 followers"
            ],
            [
                "Nutanix",
                "74,883 followers"
            ],
            [
                "Learn on Demand Systems",
                "299 followers"
            ],
            [
                "ctc TrainCanada (Acquired by Global Knowledge)",
                "929 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Degreed",
                "4,660 followers"
            ],
            [
                "Degreed",
                "4,660 followers"
            ],
            [
                "The eLearning Guild",
                "67,054 members"
            ],
            [
                "The eLearning Guild",
                "67,054 members"
            ],
            [
                "ROI Training",
                "382 followers"
            ],
            [
                "ROI Training",
                "382 followers"
            ],
            [
                "Nutanix",
                "74,883 followers"
            ],
            [
                "Nutanix",
                "74,883 followers"
            ],
            [
                "Learn on Demand Systems",
                "299 followers"
            ],
            [
                "Learn on Demand Systems",
                "299 followers"
            ],
            [
                "ctc TrainCanada (Acquired by Global Knowledge)",
                "929 followers"
            ],
            [
                "ctc TrainCanada (Acquired by Global Knowledge)",
                "929 followers"
            ]
        ],
        "recommendations": [
            [
                "Lee Anne Caylor",
                "Independent Consultant",
                "October 13, 2011, Ben worked with Lee Anne in the same group",
                "Ben is incredibly strategic, well-read and articulate.  He can work with any level of an organization and adds value every step of the way.  He has an innate ability to see what is coming around the corner and can translate that into business decisions.He is one of the most intelligent people I've worked with - the partners ask for his presence at events and seek his advice in meetings.  Ben is one of a kind!  (and fun to work with!)"
            ],
            [
                "Lee Anne Caylor",
                "Independent Consultant",
                "October 13, 2011, Ben worked with Lee Anne in the same group"
            ],
            [
                "Lee Anne Caylor",
                "Independent Consultant",
                "October 13, 2011, Ben worked with Lee Anne in the same group"
            ],
            [
                "Lee Anne Caylor",
                "Independent Consultant",
                "October 13, 2011, Ben worked with Lee Anne in the same group"
            ],
            "Independent Consultant",
            [
                "Ben is incredibly strategic, well-read and articulate.  He can work with any level of an organization and adds value every step of the way.  He has an innate ability to see what is coming around the corner and can translate that into business decisions.He is one of the most intelligent people I've worked with - the partners ask for his presence at events and seek his advice in meetings.  Ben is one of a kind!  (and fun to work with!)"
            ],
            [
                "Ben is incredibly strategic, well-read and articulate.  He can work with any level of an organization and adds value every step of the way.  He has an innate ability to see what is coming around the corner and can translate that into business decisions.He is one of the most intelligent people I've worked with - the partners ask for his presence at events and seek his advice in meetings.  Ben is one of a kind!  (and fun to work with!)"
            ],
            [
                "John Norby",
                "Sr. Support Planner at Microsoft",
                "August 19, 2011, Ben was senior to John but didn’t manage directly",
                "Ben is a quick thinker, very creative and demonstrates a lot of passion in his work. He's always trying new things which push the envelope and moves the group in a positive direction. Ben is able to take a concept and wrap a good solution around it for customers. I've always enjoyed thinking through ideas with him."
            ],
            [
                "John Norby",
                "Sr. Support Planner at Microsoft",
                "August 19, 2011, Ben was senior to John but didn’t manage directly"
            ],
            [
                "John Norby",
                "Sr. Support Planner at Microsoft",
                "August 19, 2011, Ben was senior to John but didn’t manage directly"
            ],
            [
                "John Norby",
                "Sr. Support Planner at Microsoft",
                "August 19, 2011, Ben was senior to John but didn’t manage directly"
            ],
            "Sr. Support Planner at Microsoft",
            [
                "Ben is a quick thinker, very creative and demonstrates a lot of passion in his work. He's always trying new things which push the envelope and moves the group in a positive direction. Ben is able to take a concept and wrap a good solution around it for customers. I've always enjoyed thinking through ideas with him."
            ],
            [
                "Ben is a quick thinker, very creative and demonstrates a lot of passion in his work. He's always trying new things which push the envelope and moves the group in a positive direction. Ben is able to take a concept and wrap a good solution around it for customers. I've always enjoyed thinking through ideas with him."
            ],
            [
                "Pablo Bernal",
                "Director at Microsoft Corporation",
                "August 16, 2011, Pablo reported directly to Ben",
                "I had an excellent experience working for Ben at Microsoft. His very deep knowledge of the IT and Education industries, keen strategic instincts, and people managing abilities make him an outstanding leader from whom I learned a great deal. I also appreciated Ben's attention to my career development. Finally, Ben's unique personality and sense of humor made it a pleasure to work with him."
            ],
            [
                "Pablo Bernal",
                "Director at Microsoft Corporation",
                "August 16, 2011, Pablo reported directly to Ben"
            ],
            [
                "Pablo Bernal",
                "Director at Microsoft Corporation",
                "August 16, 2011, Pablo reported directly to Ben"
            ],
            [
                "Pablo Bernal",
                "Director at Microsoft Corporation",
                "August 16, 2011, Pablo reported directly to Ben"
            ],
            "Director at Microsoft Corporation",
            [
                "I had an excellent experience working for Ben at Microsoft. His very deep knowledge of the IT and Education industries, keen strategic instincts, and people managing abilities make him an outstanding leader from whom I learned a great deal. I also appreciated Ben's attention to my career development. Finally, Ben's unique personality and sense of humor made it a pleasure to work with him."
            ],
            [
                "I had an excellent experience working for Ben at Microsoft. His very deep knowledge of the IT and Education industries, keen strategic instincts, and people managing abilities make him an outstanding leader from whom I learned a great deal. I also appreciated Ben's attention to my career development. Finally, Ben's unique personality and sense of humor made it a pleasure to work with him."
            ],
            [
                "Ryan Danner",
                "Director, Global Marketing at Red Hat",
                "July 5, 2011, Ryan worked with Ben in different groups",
                "Ben is a superstar.  Period.  He brings an unparalleled enthusiasm to everything he does.  It’s not enough for leaders to merely plot the course forward.  To really succeed, they have to communicate that vision and inspire others to believe in the course they’ve outlined.  Ben has an uncanny ability do just that.  He’s grounded in multi-disciplinary fundamentals and relentlessly focused on creating value for our customers.  People feel his passion, believe in his mission and join him on the adventure.  It’s been a pleasure to work in tandem with Ben and I hope our paths cross again in the future, both professionally and personally."
            ],
            [
                "Ryan Danner",
                "Director, Global Marketing at Red Hat",
                "July 5, 2011, Ryan worked with Ben in different groups"
            ],
            [
                "Ryan Danner",
                "Director, Global Marketing at Red Hat",
                "July 5, 2011, Ryan worked with Ben in different groups"
            ],
            [
                "Ryan Danner",
                "Director, Global Marketing at Red Hat",
                "July 5, 2011, Ryan worked with Ben in different groups"
            ],
            "Director, Global Marketing at Red Hat",
            [
                "Ben is a superstar.  Period.  He brings an unparalleled enthusiasm to everything he does.  It’s not enough for leaders to merely plot the course forward.  To really succeed, they have to communicate that vision and inspire others to believe in the course they’ve outlined.  Ben has an uncanny ability do just that.  He’s grounded in multi-disciplinary fundamentals and relentlessly focused on creating value for our customers.  People feel his passion, believe in his mission and join him on the adventure.  It’s been a pleasure to work in tandem with Ben and I hope our paths cross again in the future, both professionally and personally."
            ],
            [
                "Ben is a superstar.  Period.  He brings an unparalleled enthusiasm to everything he does.  It’s not enough for leaders to merely plot the course forward.  To really succeed, they have to communicate that vision and inspire others to believe in the course they’ve outlined.  Ben has an uncanny ability do just that.  He’s grounded in multi-disciplinary fundamentals and relentlessly focused on creating value for our customers.  People feel his passion, believe in his mission and join him on the adventure.  It’s been a pleasure to work in tandem with Ben and I hope our paths cross again in the future, both professionally and personally."
            ],
            [
                "Cynthia Kludt Grasseth",
                "Marketing Manager",
                "June 22, 2011, Ben was senior to Cynthia but didn’t manage directly",
                "When Ben talks people listen.They listen because Ben is a proven leader. He is strategic, visionary, intelligent. In addition to all of the qualities you would expect from someone who provides though leadership, Ben is also passionate and witty. Not only will Ben drive your business forward he will do so with humor and a certain swagger. It will be a good ride."
            ],
            [
                "Cynthia Kludt Grasseth",
                "Marketing Manager",
                "June 22, 2011, Ben was senior to Cynthia but didn’t manage directly"
            ],
            [
                "Cynthia Kludt Grasseth",
                "Marketing Manager",
                "June 22, 2011, Ben was senior to Cynthia but didn’t manage directly"
            ],
            [
                "Cynthia Kludt Grasseth",
                "Marketing Manager",
                "June 22, 2011, Ben was senior to Cynthia but didn’t manage directly"
            ],
            "Marketing Manager",
            [
                "When Ben talks people listen.They listen because Ben is a proven leader. He is strategic, visionary, intelligent. In addition to all of the qualities you would expect from someone who provides though leadership, Ben is also passionate and witty. Not only will Ben drive your business forward he will do so with humor and a certain swagger. It will be a good ride."
            ],
            [
                "When Ben talks people listen.They listen because Ben is a proven leader. He is strategic, visionary, intelligent. In addition to all of the qualities you would expect from someone who provides though leadership, Ben is also passionate and witty. Not only will Ben drive your business forward he will do so with humor and a certain swagger. It will be a good ride."
            ],
            [
                "Leo Osahor",
                "Founder & CEO, flightSpeak",
                "May 21, 2011, Ben was senior to Leo but didn’t manage directly",
                "I had the pleasure of working on Ben's team for almost two years.Ben is an oustanding charismatic leader that is deeply passionate about technology and learning. His capacity to connect with others with a sense of conviction and humor is infectious,  and this driveshis ability to lead his team effectively.Ben's also super keen on innovation - his desire to continually prototype and reiterate on product development keeps his team continuously growing and learning.He's a mover and shaker - any team that Ben joins should saddle up; the ride is surely going up.All the best Ben!"
            ],
            [
                "Leo Osahor",
                "Founder & CEO, flightSpeak",
                "May 21, 2011, Ben was senior to Leo but didn’t manage directly"
            ],
            [
                "Leo Osahor",
                "Founder & CEO, flightSpeak",
                "May 21, 2011, Ben was senior to Leo but didn’t manage directly"
            ],
            [
                "Leo Osahor",
                "Founder & CEO, flightSpeak",
                "May 21, 2011, Ben was senior to Leo but didn’t manage directly"
            ],
            "Founder & CEO, flightSpeak",
            [
                "I had the pleasure of working on Ben's team for almost two years.Ben is an oustanding charismatic leader that is deeply passionate about technology and learning. His capacity to connect with others with a sense of conviction and humor is infectious,  and this driveshis ability to lead his team effectively.Ben's also super keen on innovation - his desire to continually prototype and reiterate on product development keeps his team continuously growing and learning.He's a mover and shaker - any team that Ben joins should saddle up; the ride is surely going up.All the best Ben!"
            ],
            [
                "I had the pleasure of working on Ben's team for almost two years.Ben is an oustanding charismatic leader that is deeply passionate about technology and learning. His capacity to connect with others with a sense of conviction and humor is infectious,  and this driveshis ability to lead his team effectively.Ben's also super keen on innovation - his desire to continually prototype and reiterate on product development keeps his team continuously growing and learning.He's a mover and shaker - any team that Ben joins should saddle up; the ride is surely going up.All the best Ben!"
            ],
            [
                "Hari Govind",
                "Facebook is hiring rockstar Technical PMs! Contact me!!",
                "May 19, 2011, Ben worked with Hari in the same group",
                "Ben is a high powered, driven and committed evangelist of the role of technology in education. His single minded focus over the last decade in furthering the cause of eduction, and exploiting technology to further this cause was evident in the strategies, and playbook Ben helped establish at Microsoft. In Digital Marketing, Ben was instrumental in the push to adopt social and community strategies as key to crowdsourcing knowledge and retraining millions of Microsoft consumers, and connecting knowledge seekers with subject matter experts. In Product Management, Ben was committed to improving and scaling out a just in time learning environment for large enterprise customers.Personally, I've enjoyed my interactions with Ben. He is a great partner and kindred spirit in how technology can be applied to solve real problems, and making a difference to millions of people.Sincerely,Hari"
            ],
            [
                "Hari Govind",
                "Facebook is hiring rockstar Technical PMs! Contact me!!",
                "May 19, 2011, Ben worked with Hari in the same group"
            ],
            [
                "Hari Govind",
                "Facebook is hiring rockstar Technical PMs! Contact me!!",
                "May 19, 2011, Ben worked with Hari in the same group"
            ],
            [
                "Hari Govind",
                "Facebook is hiring rockstar Technical PMs! Contact me!!",
                "May 19, 2011, Ben worked with Hari in the same group"
            ],
            "Facebook is hiring rockstar Technical PMs! Contact me!!",
            [
                "Ben is a high powered, driven and committed evangelist of the role of technology in education. His single minded focus over the last decade in furthering the cause of eduction, and exploiting technology to further this cause was evident in the strategies, and playbook Ben helped establish at Microsoft. In Digital Marketing, Ben was instrumental in the push to adopt social and community strategies as key to crowdsourcing knowledge and retraining millions of Microsoft consumers, and connecting knowledge seekers with subject matter experts. In Product Management, Ben was committed to improving and scaling out a just in time learning environment for large enterprise customers.Personally, I've enjoyed my interactions with Ben. He is a great partner and kindred spirit in how technology can be applied to solve real problems, and making a difference to millions of people.Sincerely,Hari"
            ],
            [
                "Ben is a high powered, driven and committed evangelist of the role of technology in education. His single minded focus over the last decade in furthering the cause of eduction, and exploiting technology to further this cause was evident in the strategies, and playbook Ben helped establish at Microsoft. In Digital Marketing, Ben was instrumental in the push to adopt social and community strategies as key to crowdsourcing knowledge and retraining millions of Microsoft consumers, and connecting knowledge seekers with subject matter experts. In Product Management, Ben was committed to improving and scaling out a just in time learning environment for large enterprise customers.Personally, I've enjoyed my interactions with Ben. He is a great partner and kindred spirit in how technology can be applied to solve real problems, and making a difference to millions of people.Sincerely,Hari"
            ],
            [
                "Ron Wen",
                "Developer Outreach and Marketing at IBM",
                "September 22, 2013, Ben worked with Ron in different groups",
                "Ron is an excellent marketing professional and an asset to any team. He is creative, hardworking and likes to think outside of the box. As an example, thanks to his efforts he has significantly raised the market awareness of Global Knowledge's Microsoft courses through multiple multi-media campaigns (including new bootcamp videos), social media messaging and web page optimization. I particularly respect his knowledge of what is happening in the marketing industry and helping us understand the impact of those changes."
            ],
            [
                "Ron Wen",
                "Developer Outreach and Marketing at IBM",
                "September 22, 2013, Ben worked with Ron in different groups"
            ],
            [
                "Ron Wen",
                "Developer Outreach and Marketing at IBM",
                "September 22, 2013, Ben worked with Ron in different groups"
            ],
            [
                "Ron Wen",
                "Developer Outreach and Marketing at IBM",
                "September 22, 2013, Ben worked with Ron in different groups"
            ],
            "Developer Outreach and Marketing at IBM",
            [
                "Ron is an excellent marketing professional and an asset to any team. He is creative, hardworking and likes to think outside of the box. As an example, thanks to his efforts he has significantly raised the market awareness of Global Knowledge's Microsoft courses through multiple multi-media campaigns (including new bootcamp videos), social media messaging and web page optimization. I particularly respect his knowledge of what is happening in the marketing industry and helping us understand the impact of those changes."
            ],
            [
                "Ron is an excellent marketing professional and an asset to any team. He is creative, hardworking and likes to think outside of the box. As an example, thanks to his efforts he has significantly raised the market awareness of Global Knowledge's Microsoft courses through multiple multi-media campaigns (including new bootcamp videos), social media messaging and web page optimization. I particularly respect his knowledge of what is happening in the marketing industry and helping us understand the impact of those changes."
            ],
            [
                "Tjeerd Veninga",
                "Sr Program Manager Pitch Perfect - Online sales training & in person coaching at Microsoft",
                "August 14, 2011, Ben was senior to Tjeerd but didn’t manage directly",
                "Tjeerd is one of those rare people that you naturally like and respect the moment you meet him. I have always thought of Tjeerd as the 'velvet glove' as he is easygoing but firm when the situation requires it and his long string of successes reflects this approach. Super smart and passionate he is of high value to any role and team."
            ],
            [
                "Tjeerd Veninga",
                "Sr Program Manager Pitch Perfect - Online sales training & in person coaching at Microsoft",
                "August 14, 2011, Ben was senior to Tjeerd but didn’t manage directly"
            ],
            [
                "Tjeerd Veninga",
                "Sr Program Manager Pitch Perfect - Online sales training & in person coaching at Microsoft",
                "August 14, 2011, Ben was senior to Tjeerd but didn’t manage directly"
            ],
            [
                "Tjeerd Veninga",
                "Sr Program Manager Pitch Perfect - Online sales training & in person coaching at Microsoft",
                "August 14, 2011, Ben was senior to Tjeerd but didn’t manage directly"
            ],
            "Sr Program Manager Pitch Perfect - Online sales training & in person coaching at Microsoft",
            [
                "Tjeerd is one of those rare people that you naturally like and respect the moment you meet him. I have always thought of Tjeerd as the 'velvet glove' as he is easygoing but firm when the situation requires it and his long string of successes reflects this approach. Super smart and passionate he is of high value to any role and team."
            ],
            [
                "Tjeerd is one of those rare people that you naturally like and respect the moment you meet him. I have always thought of Tjeerd as the 'velvet glove' as he is easygoing but firm when the situation requires it and his long string of successes reflects this approach. Super smart and passionate he is of high value to any role and team."
            ]
        ],
        "skills": [
            [
                "Product Management",
                "See 146 endorsements for Product Management",
                "99+",
                "Product Management",
                "Endorse",
                "Endorsed by Priti Shah and 7 others who are highly skilled at this"
            ],
            [
                "Product Management",
                "See 146 endorsements for Product Management",
                "99+"
            ],
            [
                "Strategy",
                "See 94 endorsements for Strategy",
                "94",
                "Strategy",
                "Endorse",
                "Endorsed by Winnie Wong and 1 other who is highly skilled at this",
                "Endorsed by 33 of Ben’s colleagues at Global Knowledge"
            ],
            [
                "Strategy",
                "See 94 endorsements for Strategy",
                "94"
            ],
            [
                "Team Leadership",
                "See 87 endorsements for Team Leadership",
                "87",
                "Team Leadership",
                "Endorse",
                "Endorsed by Chris Barefoot, who is highly skilled at this"
            ],
            [
                "Team Leadership",
                "See 87 endorsements for Team Leadership",
                "87"
            ]
        ],
        "summary": "    Visionary pioneer, creative, and technology savvy, leading the development and launch of state-of-the-art solutions that deliver outstanding performance, sales and profits. Loves to get hands-on, incubate and then drive to scale. Recently I have been focused on working with our partners including Microsoft, Google and AWS to drive their partner channels' capacity, capabilities and consumption of their cloud technologies.Business strategist, evangelist, solutions driver and team leader with strong operations management abilities and an entrepreneurial spirit to build and grow successful companies from the ground up. Leadership and performance excellence demonstrated by spearheading new product development activities and capturing new opportunities in a global environment. Record of extraordinary results achieved through technology innovation and team inspiration.Specialties: Operations, Change & Project Management / New Business Startups & Turnarounds / Strategic Planning & Visionary Leadership / Team Leadership, Motivation & Development  / P&L & Budget Management / Process Improvement & Cost ReductionsSkills include: Managing multiple product roadmaps, leading product teams and product managers, defining product positioning, determined and drove product direction, developed product vision and product planning, created product definition to meet market requirements and product life cycle for continuous competitive differentiation with iterative product releasesEmail: ben_watson@msn.com\n  \n  \n",
        "name": "Ben Watson",
        "title": "EVP - Sales, Marketing and Product at Learn on Demand Systems (LODS)",
        "url": "linkedin.com/in/bengwatson",
        "phone": "",
        "email": "ben_watson@msn.com"
    }
]