[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "169 Mutual Connections",
                "You and Marc both know John Fanning, Eric Keosky-Smith, and 167 others"
            ],
            [
                "Simple Trick To Get A Job When You Don't Have Any Experience | #HelpMeJT",
                "Marc liked"
            ],
            [
                "Emerging Technologies— Things To Come",
                "(Infographic)",
                "Marc liked"
            ],
            [
                "Dr. Gary Samuelson Explains the NEW Genetic Results",
                "Marc shared this"
            ],
            [
                "Listen to me read Finding My Virginity",
                "Marc liked"
            ],
            [
                "Cloud Computing - An Industry Guide",
                "(Infographic)",
                "Marc liked a comment"
            ],
            [
                "RICK PALLACK WISHES YOU A THRILLER OF A HALLOWEEN",
                "RICK PALLACK VISITING MICHAEL JACKSON BACKSTAGE BEFORE HIS CONCERT",
                "PALLACK DESIGNS FOR JACKSON ARE FEATURED ON EXHIBIT IN THE LOS ANGELES GRAMMY MUSEUM AND CREDITS \"PALLACK FOR DESIGNING MANY OF JACKSON'S MOST ICONIC LOOKS AND CREATING AN ERA\"",
                "COPYRIGHT RICK PALLACK",
                "ALL RIGHTS RESERVED",
                "Marc liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Chairman / Founder / CEO",
                "Company Name",
                "Buy Direct Development International Companies",
                "Dates Employed",
                "Mar 1989 – Present",
                "Employment Duration",
                "28 yrs 9 mos",
                "Location",
                "Calabasas, CA / Scottsdale, AZ",
                "Buy Direct Companies assists clients who are seeking to take their business to the next level and/or develop a product and take it to market. We facilitate their company’s growth by collaborating with them first to create a master vision, and then develop and implement strategies to obtain the vision. Our primary focus is working with real estate companies, generating multi-billion dollar development deals in all areas of real estate, in particular multi-family residential and commercial projects. Our expertise in generating marketing initiatives and creating demand by establishing relationships between international buyers and sellers creates huge profit opportunities for our clients. Clients include: Hedge Funds,All Federal Housing Agency,Wells Fargo, Bank of America, NationStar, Hud, Fannie Mae, Freddie Mac, Inremreo.com, Plasmology4, Google.com,  CO-Signer.com, Apple,Microsoft, Amazon, Lifelock, PowerCoco, Ford Motors,Ringling Bros, Beamz Interactive, MusicandMemory.org, ReplyBuy.com, Greater Phoenix Real Estate Alliance (GPREA), CNN Microsoft. Nike, Adidas, Puma, Spalding, Hanes, Disney (licensing of products), Mattel, QVC, Univision , Walgreens, Home Shopping Network, Coca-Cola, Pepsi, Starwood,  Hilton, Hyatt, Sony, Apple, Gamestop, Target Stores, Wal-Mart, K-Mart, Sears, Speedo, NBA, NHL, MLB, MSL, PGA, LPGA, Johnson & Johnson, Abbott Labs, Ace, HBO, NBC, ABC, CBS, America Online, All Areas of Entertainment , Medical and Sport industry."
            ],
            [
                "Executive Director: Strategic Business Advisor: Hedge Funds/Government Agencies",
                "Company Name",
                "IN REM REO Services",
                "Dates Employed",
                "Aug 2012 – Aug 2014",
                "Employment Duration",
                "2 yrs 1 mo",
                "Location",
                "Greater Chicago Area",
                "Experience resolving as well as identifying title issues pre or post foreclosure which can be handled through the REO, Deed in lieu or for Short Sale disposition of the property. SpecialtiesConcentrating in all legal matters related to REO closings as a partner with Boiko and Osimani for over a Decade. EXPERIENCED IN DIFFICULT TITLE CURATIVE RESOLUTION for marketable-insurable real estate title. Representing Hedge Funds, Private Investors, Servicers, Mortgage Companies, Banks and Private Mortgage Insurance entities.About IN REM REO ServicesIn Rem REO Services is a nationwide resource for the REO closer. We work with REO management to get your assets closed. We have a first-rate staff of experienced Real Estate Professionals who take pride in providing the best services for our clients. We offer individualized attention with every REO closing for a flat rate fee. We are not a title company. We place the order with the title company. Therefore, we offer an objective perspective in working with title already in place or from any title company the client prefers. We work with Fidelity National Title, First American Title, Land America-Commonwealth and Stewart to name a few and assist in solving title issues which affect most files post foreclosure. We are the solution between the foreclosure attorney and title company to assist in getting assets closed quickly. We have closed thousands of files over the years for title companies and foreclosure attorneys that do not want to be bogged down with difficult REO closings. Getting started is easy. All we need is the property address and tax id number and we will order the title either preliminary (prior to contract) or when the file goes under contract for purchase. Remember, the client can choose the title company if there is a preference. Headquarters3435-41 N.Lincoln Ave. Chicago, IL 60657 United States Websitehttp://inremreo.com"
            ],
            [
                "Global Strategic Accounts : Director",
                "Company Name",
                "ReplyBuy",
                "Dates Employed",
                "Sep 2013 – Jul 2014",
                "Employment Duration",
                "11 mos",
                "Location",
                "Scottsdale, Az",
                "The platform for same-day sales and marketing. ReplyBuy enables businesses to engage with mobile customers and complete safe and secure purchases with a simple text message. Deploy campaigns, manage customers, track revenue, measure conversion and effectiveness all from a single dashboard.WATCH VIDEO BELOW : AND START MOVING PRODUCT AND SERVICES TODAY."
            ],
            [
                "CEO / PRESIDENT",
                "Company Name",
                "JKaufman Companies",
                "Dates Employed",
                "Oct 2012 – May 2014",
                "Employment Duration",
                "1 yr 8 mos",
                "Location",
                "Manhattan, New York  / Scottsdale, Arizona",
                "Marc Cohen comes to J Kaufman Companies and J Kaufman Consulting with over 30 years of highly proven experience as a visionary global international leader with top-level global business organizations, executives and business owners. As CEO and President of J Kaufman Companies and J Kaufman Consulting he will generate that same expert business acumen by envisioning, developing, and implementing new strategic synergies to take J Kaufman Companies business to new heights. This will create a paradigm for the 21 st century that impacts the quality of life for businesses, governments and individuals throughout the WORLD.J KAUFMAN COMPANIES (formerly DisabilityWorks,inc.) is a strategy/consulting firm that focuses on developing innovative solutions for corporations, government agencies, non for profits and educational institutions. With an emphasis on the diversity, disability & aging space J Kaufman Companies is building its strategies around two fundamental models, \" The Adaptation Construct\" and \"The Design for Life\" methodology setting us apart from other firms offering cutting edge knowledge that will enhance any organizations bottom line on multiple levels.Interested in working with corporations, government agencies and educational institutionsWorking on Issues such as : Customized Strategies, IndividualExecutiveCoaching,Marketing/BrandingIndividual Employee Development, Accessibility/Adaptive Technology/Inclusive Design, Shadow Consulting, Workshops, Political Consulting, Messaging,Media Strategy,Motivational SpeakingSpecialties: J Kaufman Companies  is a firm who's goal is to help organizations engage in innovative solutions that will drive results on all levels. With an emphasis on diversity disability. Capitalizing on this knowledge J Kaufman Companies is creating A NEW PARADIGM FOR THE 21st CENTURY  that impacts the quality of life for business, governments, educational institutions, and individuals throughout the WORLD."
            ],
            [
                "Executive Director: Beamz  Music Therapy Education for Special Needs",
                "Company Name",
                "Beamz Interactive Inc.",
                "Dates Employed",
                "Apr 2011 – Apr 2014",
                "Employment Duration",
                "3 yrs 1 mo",
                "Location",
                "Scottsdale, AZ",
                "Beamz Interactive takes pride in providing a highly effective music therapy system that has proven to help individuals with Autism, Alzheimer’s disease, TBI (Traumatic Brain Injury), etc., as well as those in a hospital, rehabilitation, senior care, and hospice setting. We work alongside major non-profit organizations to develop needed music therapy education/special needs lesson plans and software applications, along with using Beamz innovative hardware."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Entrepreneurism at HKU",
                "Degree Name",
                "Master of Enterpreneurism",
                "Field Of Study",
                "Visionary Strategic Intelligence Advisor",
                "Dates attended or expected graduation",
                "1976 – 1980",
                "Activities and Societies:",
                "Boot Strapping Team, Startups Society, Growth Companies Committee"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 47 more skills"
            ],
            "Recommendations",
            [
                "Velocify",
                "3,591 followers"
            ],
            [
                "GE Healthcare",
                "569,137 followers"
            ],
            [
                "Fotki Inc.",
                "971 followers"
            ],
            [
                "Bratney Companies",
                "1,146 followers"
            ],
            [
                "On Startups - The Community For Entrepreneurs",
                "893,684 members"
            ],
            [
                "Tim BrownTim Brown is a LinkedIn Influencer",
                "CEO at IDEO",
                "1,413,498 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Velocify",
                "3,591 followers"
            ],
            [
                "Velocify",
                "3,591 followers"
            ],
            [
                "GE Healthcare",
                "569,137 followers"
            ],
            [
                "GE Healthcare",
                "569,137 followers"
            ],
            [
                "Fotki Inc.",
                "971 followers"
            ],
            [
                "Fotki Inc.",
                "971 followers"
            ],
            [
                "Bratney Companies",
                "1,146 followers"
            ],
            [
                "Bratney Companies",
                "1,146 followers"
            ],
            [
                "On Startups - The Community For Entrepreneurs",
                "893,684 members"
            ],
            [
                "On Startups - The Community For Entrepreneurs",
                "893,684 members"
            ],
            [
                "Tim BrownTim Brown is a LinkedIn Influencer",
                "CEO at IDEO",
                "1,413,498 followers"
            ],
            [
                "Tim BrownTim Brown is a LinkedIn Influencer",
                "CEO at IDEO",
                "1,413,498 followers"
            ],
            [
                "Tim Brown is a LinkedIn Influencer"
            ]
        ],
        "recommendations": [
            [
                "Stephen G. Barr",
                "Ski Bum at Taos Ski Valley, Inc.",
                "January 5, 2014, Stephen G. worked with Marc but at different companies",
                "I have had the pleasure of knowing Marc now for several years and have consulted with him on several of his projects and have found him to be highly professional, unquestionably ethical, financially prudent and always seeking to assist others with their initiatives and projects. I recommend him most highly!"
            ],
            [
                "Stephen G. Barr",
                "Ski Bum at Taos Ski Valley, Inc.",
                "January 5, 2014, Stephen G. worked with Marc but at different companies"
            ],
            [
                "Stephen G. Barr",
                "Ski Bum at Taos Ski Valley, Inc.",
                "January 5, 2014, Stephen G. worked with Marc but at different companies"
            ],
            [
                "Stephen G. Barr",
                "Ski Bum at Taos Ski Valley, Inc.",
                "January 5, 2014, Stephen G. worked with Marc but at different companies"
            ],
            "Ski Bum at Taos Ski Valley, Inc.",
            [
                "I have had the pleasure of knowing Marc now for several years and have consulted with him on several of his projects and have found him to be highly professional, unquestionably ethical, financially prudent and always seeking to assist others with their initiatives and projects. I recommend him most highly!"
            ],
            [
                "I have had the pleasure of knowing Marc now for several years and have consulted with him on several of his projects and have found him to be highly professional, unquestionably ethical, financially prudent and always seeking to assist others with their initiatives and projects. I recommend him most highly!"
            ],
            [
                "Greg Martenson",
                "Chief Financial Officer at PH TECH",
                "September 21, 2011, Greg worked with Marc but at different companies",
                "I have worked with Marc over the last 2 years in a partner capacity on several projects.  Marc has proven to have a high level of energy, vision, integrity, and sense of purpose.  Marc truly wants to make a difference in the world and help as many people as possible.  His passion for helping people relieve pain is a committed one and one that he is making great strides in.  Marc has and will continue to make a significant positive impact in the healthcare world.  I fully endorse Marc as an individual and business partner."
            ],
            [
                "Greg Martenson",
                "Chief Financial Officer at PH TECH",
                "September 21, 2011, Greg worked with Marc but at different companies"
            ],
            [
                "Greg Martenson",
                "Chief Financial Officer at PH TECH",
                "September 21, 2011, Greg worked with Marc but at different companies"
            ],
            [
                "Greg Martenson",
                "Chief Financial Officer at PH TECH",
                "September 21, 2011, Greg worked with Marc but at different companies"
            ],
            "Chief Financial Officer at PH TECH",
            [
                "I have worked with Marc over the last 2 years in a partner capacity on several projects.  Marc has proven to have a high level of energy, vision, integrity, and sense of purpose.  Marc truly wants to make a difference in the world and help as many people as possible.  His passion for helping people relieve pain is a committed one and one that he is making great strides in.  Marc has and will continue to make a significant positive impact in the healthcare world.  I fully endorse Marc as an individual and business partner."
            ],
            [
                "I have worked with Marc over the last 2 years in a partner capacity on several projects.  Marc has proven to have a high level of energy, vision, integrity, and sense of purpose.  Marc truly wants to make a difference in the world and help as many people as possible.  His passion for helping people relieve pain is a committed one and one that he is making great strides in.  Marc has and will continue to make a significant positive impact in the healthcare world.  I fully endorse Marc as an individual and business partner."
            ],
            [
                "Rick McPartlin",
                "Using Revenue Science to help Companies Survive and Thrive",
                "September 21, 2011, Rick worked with Marc but at different companies",
                "Sometimes the most important things are character and integrity.  At times like that reach out for Marc Cohen.Marc understands what it takes to be successful.  He applies that understanding for himself and those he works with.If you need someone you can count on reach out to Marc and he will reach back."
            ],
            [
                "Rick McPartlin",
                "Using Revenue Science to help Companies Survive and Thrive",
                "September 21, 2011, Rick worked with Marc but at different companies"
            ],
            [
                "Rick McPartlin",
                "Using Revenue Science to help Companies Survive and Thrive",
                "September 21, 2011, Rick worked with Marc but at different companies"
            ],
            [
                "Rick McPartlin",
                "Using Revenue Science to help Companies Survive and Thrive",
                "September 21, 2011, Rick worked with Marc but at different companies"
            ],
            "Using Revenue Science to help Companies Survive and Thrive",
            [
                "Sometimes the most important things are character and integrity.  At times like that reach out for Marc Cohen.Marc understands what it takes to be successful.  He applies that understanding for himself and those he works with.If you need someone you can count on reach out to Marc and he will reach back."
            ],
            [
                "Sometimes the most important things are character and integrity.  At times like that reach out for Marc Cohen.Marc understands what it takes to be successful.  He applies that understanding for himself and those he works with.If you need someone you can count on reach out to Marc and he will reach back."
            ],
            [
                "Andrew Kolikoff",
                "Helping Businesses Attract, Nurture and Keep Talent",
                "September 16, 2011, Andrew worked with Marc but at different companies",
                "Enthusiastic, passionate, relentless... these are the first words that come to mind when I think of Marc.  Marc is a natural born salesman/pitch man who says what he means and means what he says.  AKA, a human being who actually cares about people and results."
            ],
            [
                "Andrew Kolikoff",
                "Helping Businesses Attract, Nurture and Keep Talent",
                "September 16, 2011, Andrew worked with Marc but at different companies"
            ],
            [
                "Andrew Kolikoff",
                "Helping Businesses Attract, Nurture and Keep Talent",
                "September 16, 2011, Andrew worked with Marc but at different companies"
            ],
            [
                "Andrew Kolikoff",
                "Helping Businesses Attract, Nurture and Keep Talent",
                "September 16, 2011, Andrew worked with Marc but at different companies"
            ],
            "Helping Businesses Attract, Nurture and Keep Talent",
            [
                "Enthusiastic, passionate, relentless... these are the first words that come to mind when I think of Marc.  Marc is a natural born salesman/pitch man who says what he means and means what he says.  AKA, a human being who actually cares about people and results."
            ],
            [
                "Enthusiastic, passionate, relentless... these are the first words that come to mind when I think of Marc.  Marc is a natural born salesman/pitch man who says what he means and means what he says.  AKA, a human being who actually cares about people and results."
            ],
            [
                "Dave Sherman - National Sales Training Manager for Mobile Mini",
                "National Sales Trainer at Mobile Mini Inc - Portable Storage Solution Specialists",
                "September 16, 2011, Dave Sherman - worked with Marc but at different companies",
                "Marc has to be one of the most helpful people I have ever met. He goes out of his way to help me grow my business and refers me to the people that I really need to meet.  He is a seriously valuable member of my network."
            ],
            [
                "Dave Sherman - National Sales Training Manager for Mobile Mini",
                "National Sales Trainer at Mobile Mini Inc - Portable Storage Solution Specialists",
                "September 16, 2011, Dave Sherman - worked with Marc but at different companies"
            ],
            [
                "Dave Sherman - National Sales Training Manager for Mobile Mini",
                "National Sales Trainer at Mobile Mini Inc - Portable Storage Solution Specialists",
                "September 16, 2011, Dave Sherman - worked with Marc but at different companies"
            ],
            [
                "Dave Sherman - National Sales Training Manager for Mobile Mini",
                "National Sales Trainer at Mobile Mini Inc - Portable Storage Solution Specialists",
                "September 16, 2011, Dave Sherman - worked with Marc but at different companies"
            ],
            "National Sales Trainer at Mobile Mini Inc - Portable Storage Solution Specialists",
            [
                "Marc has to be one of the most helpful people I have ever met. He goes out of his way to help me grow my business and refers me to the people that I really need to meet.  He is a seriously valuable member of my network."
            ],
            [
                "Marc has to be one of the most helpful people I have ever met. He goes out of his way to help me grow my business and refers me to the people that I really need to meet.  He is a seriously valuable member of my network."
            ],
            [
                "Tom Alkazin",
                "Owner, Alkazin & Associates",
                "September 16, 2011, Marc worked with Tom in the same group",
                "Marc is one of the most energetic individuals I know.  With a continued concern for others, Marc consistently applies his energy to get results for himself and for others."
            ],
            [
                "Tom Alkazin",
                "Owner, Alkazin & Associates",
                "September 16, 2011, Marc worked with Tom in the same group"
            ],
            [
                "Tom Alkazin",
                "Owner, Alkazin & Associates",
                "September 16, 2011, Marc worked with Tom in the same group"
            ],
            [
                "Tom Alkazin",
                "Owner, Alkazin & Associates",
                "September 16, 2011, Marc worked with Tom in the same group"
            ],
            "Owner, Alkazin & Associates",
            [
                "Marc is one of the most energetic individuals I know.  With a continued concern for others, Marc consistently applies his energy to get results for himself and for others."
            ],
            [
                "Marc is one of the most energetic individuals I know.  With a continued concern for others, Marc consistently applies his energy to get results for himself and for others."
            ]
        ],
        "skills": [
            [
                "Entrepreneurship",
                "See 538 endorsements for Entrepreneurship",
                "99+",
                "Entrepreneurship",
                "Endorse",
                "Endorsed by Ryan Scott and 54 others who are highly skilled at this",
                "Endorsed by Kay McDonald and 11 other mutual connections"
            ],
            [
                "Entrepreneurship",
                "See 538 endorsements for Entrepreneurship",
                "99+"
            ],
            [
                "Start-ups",
                "See 487 endorsements for Start-ups",
                "99+",
                "Start-ups",
                "Endorse",
                "Endorsed by Sean Sheppard and 18 others who are highly skilled at this",
                "Endorsed by Brion Crum and 11 other mutual connections"
            ],
            [
                "Start-ups",
                "See 487 endorsements for Start-ups",
                "99+"
            ],
            [
                "Marketing Strategy",
                "See 408 endorsements for Marketing Strategy",
                "99+",
                "Marketing Strategy",
                "Endorse",
                "Endorsed by Peter Paul Kaputsos and 11 others who are highly skilled at this",
                "Endorsed by Brion Crum and 7 other mutual connections"
            ],
            [
                "Marketing Strategy",
                "See 408 endorsements for Marketing Strategy",
                "99+"
            ]
        ],
        "summary": "    Marc Cohen has over 30 years of experience as a global international leader with top-level business organizations,executives and business owners. As the Founder and CEO of Buy Direct Development International Companies, an global international organization that specializes in envisioning, developing, and implementing visionary strategies solutions to take multi billion businesses to the next level. My current focus is assisting businesses that have NEEDED VALUE in All areas of International Network Marketing,  Real Estate, Healthcare. Green Energy, Medical, E- Mobile Platform  RevenueTexting Communication, Technology, Food and Clothing, Marc will envision their future business organization model and orchestrate a plan to achieve it by putting a strategic expert team in place, creating multiple revenue streams within their organizations, and making the necessary major contacts. Marc's expertise in building strategic international relationships and connecting others has always been key to his tremendous success, as well as the success of his clients. Marc thrive on working with global high-level individuals, an organizations where his expert visionary and networking skills will drive his clients organizations revenue and profitability upward.after recrutting and staffing expert level indivisible within each high level category.Specialties: VISIONARY INFLUENCER !!!! Global International Government Contacts, Sports Visionary Advisor, Asset Managers, Healthcare, Military Visionary Advisor, Disability Diversity Advisor, Real Estate, Hedge Funds, REITS, Competitive Analysis, Financing, Franchising, Mergers and Acquisition, Strategic Marketing, Contract Negotiation, Venture Capital, Mortgage, Banking Lending, Insurance Marketing, Visionary Strategic Intelligence Advisor, Capital Markets, Government Liaison, Nonprofits, Technology, Medical, Manufacturers, Foreign Organizations, Suppliers, International Trade.\n  \n  \n",
        "name": "Marc Cohen",
        "title": "Chairman / Founder / CEO /  Buy Direct Companies: GLOBAL VISIONARY  INFLUENCER STRATEGIC INTELLIGENT ADVISOR",
        "url": "linkedin.com/in/marc-cohen-34ab8a22",
        "phone": "480.600.0071 (Mobile)",
        "email": "marc@buydirectdev.com"
    }
]