[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "45 Mutual Connections",
                "You and Austin both know Aaron D. Bare, Keith Rezendes, and 43 others"
            ],
            [
                "You both studied at Northern Arizona University",
                "You both studied at Northern Arizona University in 2010"
            ],
            [
                "Progress pic of our 5-foot wide custom built pivot door.  This is the master bedroom door to our Frank Lloyd Wright ultra-modern Camelback project.  We are nearing completion on this amazing home and photography will soon follow.",
                "Austin liked"
            ],
            [
                "Take advantage of your range time, use what you have available.",
                "TC3 range training. Quick warm up for time...Care Under fire - two rounds on target 7yds apply TQ, move to next threat two rds on target 7yds apply TQ. Move back to 15yds two rds on target move to cover Tactical Field Care wound pack (verbalized hold pressure 3min) pressure dressing once secured time stops.",
                "Caveats:",
                "This was very impromptu iphone video & on-take",
                "Verbalizing can create training scars",
                "For sure PPE if they're not a team mate",
                "Additional cover would be nice if you have it...",
                "etc. point is to get out there and train",
                "Switch up add additional skills: Combat reload(ammo load), patient drags/carries, all the way to evac",
                "Stay Frosty!",
                "Austin liked"
            ],
            [
                "Over the weekend we realized we need help in the Lancaster Texas area with the horses please contact me if you are a horse person willing to help 🙏Update : thanks to Linkedin this is Chuck, remember him he was living out of his car,  A Veteran honoring the wishes of his son Brian who died December 18, 2006 and Iraq , remember Chuck was trying to take care of Able  and Sundance , Brian‘s to beloved horses and do so Chuck was living in his car,  thanks to you all Chuck is now in an apartment full of food the horses are being worked on , Chuck has all his bills caught up and thanks to Shane Batson he has a job, and many other things . Which is very important to Chuck as he needs to feel he is still useful. Also a special thanks to Patricia Thomason McCamey for her personally helping Chuck get his life back , this is the power of Linkedin God Bless",
                "Austin liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Owner",
                "Company Name",
                "American Construction & Renovation",
                "Dates Employed",
                "2014 – Present",
                "Employment Duration",
                "3 yrs",
                "Location",
                "7345 E Evans St Suite 6 Scottsdale, AZ 85260",
                "American Construction! operates with what some would call old-fashioned values. When you hire American Construction you can expect our team members to be clean cut & friendly. Our Philosophy is simple... Treat others how you would like to be treated.We operate in the Scottsdale, Cave Creek, Rio Verde and Paradise Valley Locations.Mostly Serving the following communities: +Desert Mountain+Troon North+Arcadia+Biltmore+Desert Ridge+Rio VerdeCreated and Implemented highly recommended Construction business in the Scottsdale, Rio Verde, Cave Creek and Paradise Valley Area. Prepared and produced construction estimates; sold services to residential and commercial owners and built strong customer relationships and referrals through Quality of Work, Customer Service and High Standards. Established streamlined systems, technologies and processes to maximize efficiency and productivity. Enhanced company image through highly professional work ethic and customer service.Established Construction estimating procedure, saved 50% management time by streamlined proposals. Maintained updated and current proposals through local and domestic lumber yards in order to account for all materials needed. Increased subcontractor bid coverage to more than 4 bidders per trade, a gain of 65% more competent bids for projects, by reducing cost plans and plan distribution through outsourcing.Licensed - Bonded - InsuredROC #312445 |#312446"
            ],
            [
                "Founder",
                "Company Name",
                "American Lifestyle Homes",
                "Dates Employed",
                "Jan 2012 – Present",
                "Employment Duration",
                "5 yrs 11 mos",
                "Location",
                "7345 E Evans St Suite 6 Scottsdale, AZ 85260"
            ],
            [
                "Business Consultant",
                "Company Name",
                "Goodman's Landscaping",
                "Dates Employed",
                "Aug 2016 – Present",
                "Employment Duration",
                "1 yr 4 mos",
                "Location",
                "Phoenix, Arizona"
            ],
            [
                "Author | Publisher",
                "Company Name",
                "\"Idea 2 Business\"",
                "Dates Employed",
                "May 2014 – Present",
                "Employment Duration",
                "3 yrs 7 mos",
                "Location",
                "USA",
                "Working on my first book to publish by Christmas 2017. \"Idea 2 Business\" will be about how to build a successful business from start to running successfully. I wanted to create a book that is made for the small business. I know there are many books about how to make millions or how to books that are not very specific in step by step procedures. After creating a couple successful businesses I would like to help others do the same. My book will mainly focus on starting small-medium sized companies in the services industry. However my steps will flow into any business, this book will focus on what I know and from my experiences in the service industry and sales."
            ],
            [
                "Senior Medic",
                "Company Name",
                "United States Army National Guard",
                "Dates Employed",
                "Jan 2008 – Present",
                "Employment Duration",
                "9 yrs 11 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Provide emergency medical treatment, limited primary care, force health protection, evacuation in a variety of operational and clinical settings from point of injury or illness though the continuum of military health care and, as field combat medic, provides emergency medical care and treatment at point of wounding on the battlefield or to battle and non-battle casualties during peacetime and wartime. Assist with out patient care and treatment and supervises field and clinical medical facilities under the supervision of a physician, nurse, or physicians assistant. “Exceptionally Meritorious Service as the team medic in support of Operation Enduring Freedom. Sergeant Richardson’s outstanding dedication to duty contributed to the overwhelming success of the Commands mission. His actions are in keeping with the finest traditions of military service and reflect great credit upon himself, Bravo Company, The 1st Battalion, 41st Field Artillery, Combined task force Raider, and the United States Army”Impact leader with over 10 (+) years of experience in military medical and law enforcement organizations as a senior leader, manager and practitioner. Proven ability to conduct research, synthesize and present results for complex problems and executives. Extensive experience in planning, risk management, safety training, communications and operations. High-Performance Motivator designed and implemented professional leadership training and ethics based programs tailored to organizational needs and development of moral maturity and judgement."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Notre Dame College Preparatory",
                "Degree Name",
                "Diploma",
                "Field Of Study",
                "High School",
                "Dates attended or expected graduation",
                "2002 – 2005",
                "Played on Golf and Tennis Teams."
            ],
            [
                "Notre Dame College Preparatory",
                "Degree Name",
                "Diploma",
                "Field Of Study",
                "High School",
                "Dates attended or expected graduation",
                "2002 – 2005",
                "Played on Golf and Tennis Teams."
            ],
            [
                "Military",
                "Degree Name",
                "Combat Medic",
                "Field Of Study",
                "Medicine",
                "Dates attended or expected graduation",
                "2008 – 2020"
            ],
            [
                "Military",
                "Degree Name",
                "Combat Medic",
                "Field Of Study",
                "Medicine",
                "Dates attended or expected graduation",
                "2008 – 2020"
            ],
            [
                "Northern Arizona University",
                "Degree Name",
                "Small Business Adminstration",
                "Field Of Study",
                "Business Administration and Management",
                "Grade",
                "A",
                "Dates attended or expected graduation",
                "2010 – 2017",
                "Activities and Societies:",
                "Assist Teachers in instructing some classes with the business experience I already have in operating companies from a senior level.",
                "This major will provide you with knowledge, skills, and resources to start, manage, and grow a small business. Specifically, this program will help turn an initial business idea into a reality through a series of 'must-do' actions and learning activities. This program includes placement in an internship, where you will gain real-world experience in small business management. As a capstone project, you will synthesize all of the program's learning experiences by completing a thorough and well-written business plan for a business idea."
            ],
            [
                "Northern Arizona University",
                "Degree Name",
                "Small Business Adminstration",
                "Field Of Study",
                "Business Administration and Management",
                "Grade",
                "A",
                "Dates attended or expected graduation",
                "2010 – 2017",
                "Activities and Societies:",
                "Assist Teachers in instructing some classes with the business experience I already have in operating companies from a senior level.",
                "This major will provide you with knowledge, skills, and resources to start, manage, and grow a small business. Specifically, this program will help turn an initial business idea into a reality through a series of 'must-do' actions and learning activities. This program includes placement in an internship, where you will gain real-world experience in small business management. As a capstone project, you will synthesize all of the program's learning experiences by completing a thorough and well-written business plan for a business idea."
            ],
            [
                "Penn foster university",
                "Degree Name",
                "HVAC Technician",
                "Field Of Study",
                "Heating, Ventilation, Air comditioning and Refrigeration.",
                "Dates attended or expected graduation",
                "2010 – 2011",
                "One year school to receive HVAC Certification Technician"
            ],
            [
                "Penn foster university",
                "Degree Name",
                "HVAC Technician",
                "Field Of Study",
                "Heating, Ventilation, Air comditioning and Refrigeration.",
                "Dates attended or expected graduation",
                "2010 – 2011",
                "One year school to receive HVAC Certification Technician"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Team Member",
                "Company Name",
                "Team Rubicon",
                "Dates volunteered",
                "Jan 2013 – Jan 2013",
                "Volunteer duration",
                "1 mo",
                "Cause",
                "Disaster and Humanitarian Relief",
                "Team Rubicon seeks to provide our veterans with three things they lose after leaving the military: a purpose, gained through disaster relief; community, built by serving with others; and self-worth, from recognizing the impact one individual can make. Coupled with leadership development and other opportunities, TR also aims to \"bridge the gap\" between military and civilian life. I love being apart of the team and it really allows to to still have that sense of worth."
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 33 more skills"
            ],
            "Recommendations",
            [
                "West Point Thoroughbreds",
                "357 followers"
            ],
            [
                "Dynamic Campus",
                "3,434 followers"
            ],
            [
                "Work It Daily",
                "73,515 followers"
            ],
            [
                "Combat2College Inc.",
                "71 followers"
            ],
            [
                "Butler Design Group",
                "377 followers"
            ],
            [
                "CSW Contractors, Inc.",
                "2,214 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "West Point Thoroughbreds",
                "357 followers"
            ],
            [
                "West Point Thoroughbreds",
                "357 followers"
            ],
            [
                "Dynamic Campus",
                "3,434 followers"
            ],
            [
                "Dynamic Campus",
                "3,434 followers"
            ],
            [
                "Work It Daily",
                "73,515 followers"
            ],
            [
                "Work It Daily",
                "73,515 followers"
            ],
            [
                "Combat2College Inc.",
                "71 followers"
            ],
            [
                "Combat2College Inc.",
                "71 followers"
            ],
            [
                "Butler Design Group",
                "377 followers"
            ],
            [
                "Butler Design Group",
                "377 followers"
            ],
            [
                "CSW Contractors, Inc.",
                "2,214 followers"
            ],
            [
                "CSW Contractors, Inc.",
                "2,214 followers"
            ]
        ],
        "recommendations": [
            [
                "Klaudia Bristol",
                "Regional Manager at Integrated Marketing Systems (IMS)",
                "May 9, 2013, Klaudia worked with Austin in different groups",
                "I worked with Austin at the Westin Phoenix Downtown and he was always very friendly, very positive and his work was completed in a timely manor without mistakes. All of the hotel rooms were maintained well and in immaculate condition thanks to Austin and Chuck Szilagyi. The meeting and banquet rooms were always ready for the upcoming events without any issues. It was nice to work with you Austin."
            ],
            [
                "Klaudia Bristol",
                "Regional Manager at Integrated Marketing Systems (IMS)",
                "May 9, 2013, Klaudia worked with Austin in different groups"
            ],
            [
                "Klaudia Bristol",
                "Regional Manager at Integrated Marketing Systems (IMS)",
                "May 9, 2013, Klaudia worked with Austin in different groups"
            ],
            [
                "Klaudia Bristol",
                "Regional Manager at Integrated Marketing Systems (IMS)",
                "May 9, 2013, Klaudia worked with Austin in different groups"
            ],
            "Regional Manager at Integrated Marketing Systems (IMS)",
            [
                "I worked with Austin at the Westin Phoenix Downtown and he was always very friendly, very positive and his work was completed in a timely manor without mistakes. All of the hotel rooms were maintained well and in immaculate condition thanks to Austin and Chuck Szilagyi. The meeting and banquet rooms were always ready for the upcoming events without any issues. It was nice to work with you Austin."
            ],
            [
                "I worked with Austin at the Westin Phoenix Downtown and he was always very friendly, very positive and his work was completed in a timely manor without mistakes. All of the hotel rooms were maintained well and in immaculate condition thanks to Austin and Chuck Szilagyi. The meeting and banquet rooms were always ready for the upcoming events without any issues. It was nice to work with you Austin."
            ]
        ],
        "skills": [
            [
                "Construction",
                "See 112 endorsements for Construction",
                "99+",
                "Construction",
                "Endorse",
                "Ino Loloci and 99+ connections have given endorsements for this skill"
            ],
            [
                "Construction",
                "See 112 endorsements for Construction",
                "99+"
            ],
            [
                "Renovation",
                "See 90 endorsements for Renovation",
                "90",
                "Renovation",
                "Endorse",
                "Ino Loloci and 89 connections have given endorsements for this skill"
            ],
            [
                "Renovation",
                "See 90 endorsements for Renovation",
                "90"
            ],
            [
                "Leadership",
                "See 78 endorsements for Leadership",
                "78",
                "Leadership",
                "Endorse",
                "Endorsed by Garry Cole, MS, CESCO, CHEC, CSM (USA-Retired) and 3 others who are highly skilled at this"
            ],
            [
                "Leadership",
                "See 78 endorsements for Leadership",
                "78"
            ]
        ],
        "summary": "    Austin Richardson is a skilled businessman with multiple years of experience in running, developing and creating businesses. Married to Famous Race Horse Jockey Cassie Papineau, and have a 5 year old son named Colt and 2 year old daughter named Callie.A self-made leader and experienced professional with more than 16 years of experience emphasizing sales, marketing and business development in Technology Implementation, Team building, Building Construction, Residential Remodeling, Application Development, Website Development and Customer Service Oriented Business. Skilled and knowledgeable with software analysis, distribution, manufacturing and DeliveryHighly customer-centric with excellent relationship building skills as evidenced by achievement in building over 5 profitable and expanding companies, primarily through referrals and client relations. Directs all aspects of the process of improvement life cycle including: proposals, contracting, business process analysis, project planning, resourcing, training, delivery, close-out, and continuous improvement. Strong sales and marketings skills to build new business and cultivate existing customer relationships. Self-confident, organized and highly motivated. Bring creativity and an entrepreneurial spirit to all business endeavors.Specialized in root cause analysis with relationship skills to inspire teams to outperform expectations, bridge project goals and technology solutions in alignment with company strategy. Experienced interfacing with senior management, business personnel, technical groups, operations, clients and vendors. A proven leader and consistently recognized for delivering projects on time and under budget while providing exceptional profitable business outcomes. Thrive on opportunities to collaborate with clients, personnel and senior executives. Drive innovation and identify and translate customer needs into concrete, marketable initiatives in the logistics processes. .\n  \n  \n",
        "name": "Austin Richardson",
        "title": "Builder | Business Consultant | General Contractor",
        "url": "linkedin.com/in/austin-richardson-7596b866",
        "phone": "4802260976 (Mobile)",
        "email": "allamericaninnovation@gmail.com"
    }
]