[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "389 Mutual Connections",
                "You and Ron both know Curtis Gunn, Amanda Vega, and 387 others"
            ],
            [
                "Ron can introduce you to 8 people at Performance Energy Services, LLC",
                "Ron worked at Performance Energy Services, LLC"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Manager SmallBiz/Group Membership",
                "Company Name",
                "LegalShield, Independent Associate",
                "Dates Employed",
                "May 2017 – Present",
                "Employment Duration",
                "10 mos",
                "Location",
                "Tucson, Arizona Area",
                "SMALLBIZ Powered by LegalShield and GoSmallBizAs a small business owner, you face ‘big business’ problems, but on a small business budget. Powered by LegalShield and GoSmallBiz gives you the ability to be more proactive and preventive in your daily decision making.SMALLBIZDo you have to prioritize or limit questions to your attorney based on how much the answers or time will cost you?Are you sometimes forced to make ‘fingers crossed’ or ‘Google’ decisions about your business?Just because you have access to an attorney, do you always use them?Do you have a team of consultants to answer your sales, marketing, tax, accounting and HR questions?KEY BENEFITSUnlimited Legal ConsultationLegal CorrespondenceDebt CollectionContract & Document ReviewUnlimited Business ConsultationCRM with Email MarketingE-Commerce WebsiteHR & Business Planning ToolsWITH OUR SERVICE, YOUR BUSINESS HAS AFFORDABLE LEGAL PROTECTION,CONSULTING AND TOOLS THAT WILL:Empower and simplify your decision makingAllow you to maximize your resources and minimize costProtect and grow your businessSMALLBIZ Powered by LegalShield and GoSmallBiz"
            ],
            [
                "Owner",
                "Company Name",
                "Strategic Safety Training and Consulting",
                "Dates Employed",
                "May 2016 – Present",
                "Employment Duration",
                "1 yr 10 mos",
                "Location",
                "Phoenix, Arizona Area",
                "http://www.sstcaz.com/"
            ],
            [
                "Safety Manager",
                "Company Name",
                "Integrity Staffing Solutions",
                "Dates Employed",
                "Oct 2015 – Dec 2015",
                "Employment Duration",
                "3 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Primary Functions: •    Communicate safety policies and practices to staff members and associates. •    Ensure all staff members and associates have received training on safe work practices. •    Conduct and manage audits of staff members and associates to ensure they are demonstrating safe work practices.•    Partner with Integrity Onsite Manager and Client Safety Manager to drive an environment where individuals think about working safe, as much as they think about working quickly.•    Build relationships with Integrity managers, Client managers, and outside medical providers through daily interaction and weekly meetings. Solicit their input on safety programs and concerns.•    Communicate with them regarding status of Integrity safety programs and safety incidents/injuries.•    Audit and manage database entry of all safety incidents and injuries occurring in the facility. •    Analyze data for trends and outliers that need to be addressed. Communicate findings, contributing factors, and potential solutions to Director of Risk Management, On-Site Manager and Client managers.•    Ensure the building is conducting thorough investigations into all safety incidents. •    Train safety staff members and Integrity managers on conducting investigations utilizing root-cause analysis and positive associate communication.•    Comply with all Federal and State Employment and Safety Laws.  Understand and communicate OSHA policies and regulations as it relates to our business."
            ],
            [
                "Safety Representative, FSO",
                "Company Name",
                "Performance Energy Services, LLC",
                "Dates Employed",
                "May 2014 – Jun 2015",
                "Employment Duration",
                "1 yr 2 mos",
                "Location",
                "Houma, Louisiana",
                "Conduct morning and weekly safety meetings.Oversee safety of daily operations.Provide feedback and counseling for unsafe behaviors and or actions.Develop and implement safety changes.All requirements of the FSO as stated in 33CFR section 105."
            ],
            [
                "HSSE Paramedic",
                "Company Name",
                "Falck Safety Services (US)",
                "Dates Employed",
                "Aug 2012 – May 2014",
                "Employment Duration",
                "1 yr 10 mos",
                "All duties of Paramedic in addition to assisting in the implementation of the Safety Project Execution Plan for the work site. Work closely with the Construction Management Team on implementation of projects to enhance the management of personnel health and safety that is critical to continuous improvement in safety performance. Continuously monitors the work environment, especially for work performed under specific Permit to Work requirements. Communicates appropriate safety related information on an accurate and timely basis to the work force. Support or leads hazard identification exercises.Participate in regular safety meetings with the contractors and related interested parties with the view to discussing safety concerns and actions common to all. Assist supervision and management in conducting incident investigations. Encourage overall hazard identification and reporting as well as immediate reporting of all incidents and near miss incidents by all site personnel. Ensure contractors coordinate appropriate orientation or other training for personnel commencing employment in compliance with the specific safety project execution. In conjunction with project contractors, ensure the display and dissemination of safety material suitable for construction toolbox topics or other project meetings. Maintain positive, consultative relationships to ensure expectations are met in the areas of loss control, environmental performance and quality. Provided ongoing leadership, coaching, and key point tipping service to all major project personnel in safety and loss control techniques, while being visible, approachable and available to all levels, with the objective of improving our efficiency and minimizing our losses. In conjunction with project management and construction management and/or project contractors, coordinate thorough investigation of all incidents and coordinate audits. Organized and issues daily/monthly safety reports as required."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Phoenix College",
                "Field Of Study",
                "Instructor certifications; EMT, Fire 1&2, PALS, ACLS"
            ],
            [
                "Phoenix College",
                "Field Of Study",
                "Instructor certifications; EMT, Fire 1&2, PALS, ACLS"
            ],
            [
                "Glendale Community College",
                "Degree Name",
                "E.M.T, Fire Operations",
                "Field Of Study",
                "Hazmat, Fire, Medical"
            ],
            [
                "Glendale Community College",
                "Degree Name",
                "E.M.T, Fire Operations",
                "Field Of Study",
                "Hazmat, Fire, Medical"
            ],
            [
                "Northern Pioneer College",
                "Degree Name",
                "EMT Instructor Course",
                "Field Of Study",
                "Emergency Medical Services",
                "Coursework required to instruct the Emergency Medical Technician class. Refresher courses also received from this college including PHIL'S, ACLS, PALS, PTLS, and BLS."
            ],
            [
                "Northern Pioneer College",
                "Degree Name",
                "EMT Instructor Course",
                "Field Of Study",
                "Emergency Medical Services",
                "Coursework required to instruct the Emergency Medical Technician class. Refresher courses also received from this college including PHIL'S, ACLS, PALS, PTLS, and BLS."
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "CEO",
                "Company Name",
                "Racers Against Child Endangerment Inc.",
                "Dates volunteered",
                "Jan 2002 – Mar 2010",
                "Volunteer duration",
                "8 yrs 3 mos",
                "Cause",
                "Children",
                "Administrator"
            ],
            "Recommendations",
            [
                "True View Windows™",
                "87 followers"
            ],
            [
                "Republic West",
                "26 followers"
            ],
            [
                "Brandi Carpet, LLC",
                "13 followers"
            ],
            [
                "Water Damage Phoenix",
                "4 followers"
            ],
            [
                "City of Mesa",
                "3,126 followers"
            ],
            [
                "Elmco/Stewart Sales Inc",
                "27 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "True View Windows™",
                "87 followers"
            ],
            [
                "True View Windows™",
                "87 followers"
            ],
            [
                "Republic West",
                "26 followers"
            ],
            [
                "Republic West",
                "26 followers"
            ],
            [
                "Brandi Carpet, LLC",
                "13 followers"
            ],
            [
                "Brandi Carpet, LLC",
                "13 followers"
            ],
            [
                "Water Damage Phoenix",
                "4 followers"
            ],
            [
                "Water Damage Phoenix",
                "4 followers"
            ],
            [
                "City of Mesa",
                "3,126 followers"
            ],
            [
                "City of Mesa",
                "3,126 followers"
            ],
            [
                "Elmco/Stewart Sales Inc",
                "27 followers"
            ],
            [
                "Elmco/Stewart Sales Inc",
                "27 followers"
            ]
        ],
        "recommendations": [
            [
                "Dan Saban",
                "The Saban Group, LLC",
                "October 5, 2016, Dan worked with Ron but at different companies",
                "During my 32 year law enforcement career I was blessed with the opportunity to work along side of some incredible men & women from the law enforcement and fire service communities. One of which was/is Mr. Ron Smith.   Ron has impeccable integrity, unwavering dedication, unmatched reliability, and most of all a true servant’s heart. Ron leads by example and is willing to take on any task at any level and complete it with thoroughness and accuracy.   It was an honor to serve with Ron; however, it’s been a true privilege to call him “my friend.”   I offer Ron the highest professional endorsement I can offer and I close by saying, “I’d go through any door with Ron, any time, any place!”"
            ],
            [
                "Dan Saban",
                "The Saban Group, LLC",
                "October 5, 2016, Dan worked with Ron but at different companies"
            ],
            [
                "Dan Saban",
                "The Saban Group, LLC",
                "October 5, 2016, Dan worked with Ron but at different companies"
            ],
            [
                "Dan Saban",
                "The Saban Group, LLC",
                "October 5, 2016, Dan worked with Ron but at different companies"
            ],
            "The Saban Group, LLC",
            [
                "During my 32 year law enforcement career I was blessed with the opportunity to work along side of some incredible men & women from the law enforcement and fire service communities. One of which was/is Mr. Ron Smith.   Ron has impeccable integrity, unwavering dedication, unmatched reliability, and most of all a true servant’s heart. Ron leads by example and is willing to take on any task at any level and complete it with thoroughness and accuracy.   It was an honor to serve with Ron; however, it’s been a true privilege to call him “my friend.”   I offer Ron the highest professional endorsement I can offer and I close by saying, “I’d go through any door with Ron, any time, any place!”"
            ],
            [
                "During my 32 year law enforcement career I was blessed with the opportunity to work along side of some incredible men & women from the law enforcement and fire service communities. One of which was/is Mr. Ron Smith.   Ron has impeccable integrity, unwavering dedication, unmatched reliability, and most of all a true servant’s heart. Ron leads by example and is willing to take on any task at any level and complete it with thoroughness and accuracy.   It was an honor to serve with Ron; however, it’s been a true privilege to call him “my friend.”   I offer Ron the highest professional endorsement I can offer and I close by saying, “I’d go through any door with Ron, any time, any place!”"
            ]
        ],
        "skills": [],
        "summary": "    Strategic Safety Training and Consulting has long-term goals to provide your company with\n      \n      world class Safety Leadership, Education and Consulting.   By recognizing hazards in the w...\n        \n\n...",
        "name": "Ron Smith",
        "title": "Take PRIDE!",
        "url": "",
        "phone": "",
        "email": ""
    }
]