[
    {
        "experience": [
            "Highlights",
            [
                "23 Mutual Connections",
                "You and Caleb both know Robert Haines, Michael Peters, and 21 others"
            ],
            [
                "Caleb can introduce you to 6 people at IBM",
                "Caleb worked at IBM"
            ],
            [
                "Show more",
                "Show more highlights"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "User Experience Manager",
                "Company Name",
                "IBM",
                "Dates Employed",
                "Oct 2016 – Present",
                "Employment Duration",
                "1 yr 1 mo",
                "I'm currently making really really smart (and complex) systems friendly to: humans and other systems"
            ],
            [
                "User Experience Manager",
                "Company Name",
                "INSYS Group, Inc.",
                "Dates Employed",
                "May 2016 – Present",
                "Employment Duration",
                "1 yr 6 mos"
            ],
            [
                "Senior Business Technology Consultant",
                "Company Name",
                "Impact Legacy, LLC",
                "Dates Employed",
                "Nov 2015 – Nov 2016",
                "Employment Duration",
                "1 yr 1 mo",
                "Impact legacy is a full service consulting company committed to empowering entrepreneurs in the areas of:Leadership empowerment, Technology and MarketingResponsibilities: Client Account Manager, Technology ConsultantSkills: Project management, Client Engagement, Business Development, Product Roadmaps, Business Model generation,Business Model Canvas, Product ManagementResults Obtained:o Drive the completion of product features and product roadmaps to completiono Build teams of software developers to fulfill business requirements and commitmentso Help small businesses transform their use of technology from ‘Cost Center’ to a source of Value Creationo Provide SMB’s Technology assessments in order reveal gaps in overall alignment with corporate strategyo Provide systems architecture in order to fulfill corporate goalso Provide Product Roadmaps to guarantee alignment across product teams and entire companyo Project Management"
            ],
            [
                "Product Manager",
                "Company Name",
                "Carvana",
                "Dates Employed",
                "Jul 2014 – Jul 2015",
                "Employment Duration",
                "1 yr 1 mo",
                "Skills: Project management, product development, software development management, product performance, leadership, change management, capacity planning, performance engineering, agile techniques for softwaremanagementResults Obtained:o Worked within Scrum teams to continuously improve the quality of product offered through the careful use of metrics and analytical frameworks that quantify user-interaction and buying patternso Build wireframes and design artifacts to produce mobile applications that drive customer engagemento Effectively managed software development teams to build required software products/serviceso Identified supply chain gaps in the entire product delivery process: purchasing, inventory, and marketingo Created framework for auto-leasing serviceo Create new features to help customers purchase cars onlineo Designed frameworks for data integration by creating and implementing several API’s to integrate loan data with big data vendorso Build features and product roadmaps that aligns business strategy to development efforto Engaged customers in test sites “beta sites” in order to optimize sales process and gain insights into every phase of the supply chain using usertesting.com, and similar services/tools"
            ],
            [
                "Software Development Manager",
                "Company Name",
                "HomeSmart Realty",
                "Dates Employed",
                "Oct 2012 – Oct 2013",
                "Employment Duration",
                "1 yr 1 mo",
                "Results Obtained:o Worked within Scrum teams in managing the delivery & lifecycle of the cornerstone product for real estatemarketing for the agentso Employed frameworks to manage ‘big data’ in order to deliver value through mobile applicationso Expanded existing application capabilities and performance by implementing new ideas and completingmajor projects on time so as to meet customer demands and contractual agreementso Established a framework for continuous performance improvement by an integrated methodology ofreviewing queries across the application stack for efficiency and reliabilityo Established best practice software techniques. By implementing a mix of Kanban and SCRUM methodologieso Programmed modules for reporting, statistical dashboards using a variety of programming languageso Created an agile workflow for bug fixes, new features development and special projectso Application Profiling: Used several tools to understand the underpinnings of  applications so as to resolvebugs and find memory leako Standardized development environment: established an operating system and guidelines for on boardingnew developers.o Focused priorities for system availability, performance and resource allocation by prioritizing budgets fornew web servers to ensure reliability and deliverability of services.o Developed what-if capacity scenarios to meet hardware and software needs to future proof applications.o Incorporated email deliverability services to ensure that marketing efforts were effective and producedresults. This included selecting and vetting email deliverability companies and testing out several emaildeliverability API’so Development of Java applications to augment internal tools thereby improving productivityo Retrain Quality Assurance personnel for effective testingo Capacity planning: Database Stability and Redundancy: Created a backup system to resolve the single point of failure problemso Release cycles"
            ],
            [
                "Product Development Manager",
                "Company Name",
                "Netblit LLC",
                "Dates Employed",
                "Jan 2009 – Jan 2013",
                "Employment Duration",
                "4 yrs 1 mo",
                "Responsibilities: - Lead and manage a team of application engineers and Web developers, overseeing their work, andensuring that they build high quality applications and features for various small to mid size companies - Allocateappropriate resources to ensure predictable delivery of multiple applications and projects. Prototype several applicationsusing various technology stacks, including Java/JEE, MySQL, SQL Server, ColdFusion, HTML5, JavaScript, ActionScript, AdobeFlexResults Obtained:o Created a book of business and maintained customer accounts in good standing for over four yearso Effectively captured business requirements for all customers so that their needs could be met on time and onbudgeto Managed the development and delivery of new mobile applications per customer demands and needso Oversaw the architecture and design of new software features and capabilities to meet customer expectationsSkills: Programming, Management, Client relationship management"
            ],
            [
                "Senior Software Engineer",
                "Company Name",
                "Attainia, Inc.",
                "Dates Employed",
                "Sep 2007 – Jan 2012",
                "Employment Duration",
                "4 yrs 5 mos",
                "Location",
                "Mountain View California",
                "Responsibilities: Developed and integrated the various capital equipment procurement suite of applications with other value added external systems via API’s and extensive database operations such as; data scrubbing, data formatting, and data mining. In addition, I employed industry standard practices e.g. SCRUM and other agile techniques to ensure that deadlines and milestones were met. I employed several programming languages including, Java, C#, .NET, Adobe Flex, Coldfusion, MySQL, TSQL, JavaScript, HTML5, ActionScript, XML so that the solutions I developed met customer expectations and matched their current software and hardware configurations."
            ],
            [
                "IT Manager",
                "Company Name",
                "Northern Arizona University",
                "Dates Employed",
                "Sep 2003 – Jun 2007",
                "Employment Duration",
                "3 yrs 10 mos",
                "As the IT administrator helped to maintain efficient operations at the department. Some of the tasks involved were: updating software on workstations and other devices on the network, network programming and configuration, network security and protection: antivirus and group policy controls, Provided support for network devices: printers, scanners and copiers"
            ],
            [
                "IT",
                "Company Name",
                "Deloitte",
                "Dates Employed",
                "Jun 2004 – Aug 2004",
                "Employment Duration",
                "3 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Worked within IT department; developed ability to troubleshoot technical problems, ability to relate with executives and solve their technical problems, Exposure to enterprise storage systems"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Landmark",
                "Field Of Study",
                "Leadership and Management",
                "Dates attended or expected graduation",
                "2015 – 2017",
                "Activities and Societies:",
                "Team Building, Leadership and Management",
                "Leadership, Management, Enrollment, Business Relationships, Communications Training, Coaching, Mentoring"
            ],
            [
                "Landmark",
                "Field Of Study",
                "Leadership and Management",
                "Dates attended or expected graduation",
                "2015 – 2017",
                "Activities and Societies:",
                "Team Building, Leadership and Management",
                "Leadership, Management, Enrollment, Business Relationships, Communications Training, Coaching, Mentoring"
            ],
            [
                "Northern Arizona University",
                "Field Of Study",
                "International Business"
            ],
            [
                "Northern Arizona University",
                "Field Of Study",
                "International Business"
            ],
            [
                "Northern Arizona University",
                "Degree Name",
                "BS",
                "Field Of Study",
                "Computer Science;"
            ],
            [
                "Northern Arizona University",
                "Degree Name",
                "BS",
                "Field Of Study",
                "Computer Science;"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "INSYS Group, Inc.",
                "2,936 followers"
            ],
            [
                "Northern Arizona University",
                "100,826 followers"
            ],
            [
                "Mobile Product Management",
                "42,497 members"
            ],
            [
                "Agile and Lean Software Development",
                "153,634 members"
            ],
            [
                "Landmark",
                "28,083 followers"
            ],
            [
                "IBM",
                "3,663,016 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (412)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "INSYS Group, Inc.",
                "2,936 followers"
            ],
            [
                "INSYS Group, Inc.",
                "2,936 followers"
            ],
            [
                "Northern Arizona University",
                "100,826 followers"
            ],
            [
                "Northern Arizona University",
                "100,826 followers"
            ],
            [
                "Mobile Product Management",
                "42,497 members"
            ],
            [
                "Mobile Product Management",
                "42,497 members"
            ],
            [
                "Agile and Lean Software Development",
                "153,634 members"
            ],
            [
                "Agile and Lean Software Development",
                "153,634 members"
            ],
            [
                "Landmark",
                "28,083 followers"
            ],
            [
                "Landmark",
                "28,083 followers"
            ],
            [
                "IBM",
                "3,663,016 followers"
            ],
            [
                "IBM",
                "3,663,016 followers"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Management",
                "See 8 endorsements for Management",
                "8",
                "Management",
                "Endorse",
                "NAGA SAI AYTHA and 7 connections have given endorsements for this skill"
            ],
            [
                "Management",
                "See 8 endorsements for Management",
                "8"
            ],
            [
                "Leadership",
                "See 8 endorsements for Leadership",
                "8",
                "Leadership",
                "Endorse",
                "NAGA SAI AYTHA and 7 connections have given endorsements for this skill"
            ],
            [
                "Leadership",
                "See 8 endorsements for Leadership",
                "8"
            ],
            [
                "Project Management",
                "See 7 endorsements for Project Management",
                "7",
                "Project Management",
                "Endorse",
                "NAGA SAI AYTHA and 6 connections have given endorsements for this skill"
            ],
            [
                "Project Management",
                "See 7 endorsements for Project Management",
                "7"
            ],
            [
                "Program Management",
                "See 4 endorsements for Program Management",
                "4",
                "Program Management",
                "Endorse"
            ],
            [
                "Program Management",
                "See 4 endorsements for Program Management",
                "4"
            ],
            [
                "Strategic Planning",
                "See 3 endorsements for Strategic Planning",
                "3",
                "Strategic Planning",
                "Endorse"
            ],
            [
                "Strategic Planning",
                "See 3 endorsements for Strategic Planning",
                "3"
            ],
            [
                "Product Management",
                "See 2 endorsements for Product Management",
                "2",
                "Product Management",
                "Endorse"
            ],
            [
                "Product Management",
                "See 2 endorsements for Product Management",
                "2"
            ],
            [
                "Business Analysis",
                "See 2 endorsements for Business Analysis",
                "2",
                "Business Analysis",
                "Endorse"
            ],
            [
                "Business Analysis",
                "See 2 endorsements for Business Analysis",
                "2"
            ],
            [
                "Software Development",
                "See 2 endorsements for Software Development",
                "2",
                "Software Development",
                "Endorse"
            ],
            [
                "Software Development",
                "See 2 endorsements for Software Development",
                "2"
            ],
            [
                "Technical Product Management",
                "See 1 endorsement for Technical Product Management",
                "1",
                "Technical Product Management",
                "Endorse"
            ],
            [
                "Technical Product Management",
                "See 1 endorsement for Technical Product Management",
                "1"
            ],
            [
                "Product Strategy",
                "See 1 endorsement for Product Strategy",
                "1",
                "Product Strategy",
                "Endorse"
            ],
            [
                "Product Strategy",
                "See 1 endorsement for Product Strategy",
                "1"
            ],
            [
                "Business Strategy",
                "See 1 endorsement for Business Strategy",
                "1",
                "Business Strategy",
                "Endorse"
            ],
            [
                "Business Strategy",
                "See 1 endorsement for Business Strategy",
                "1"
            ],
            [
                "SQL",
                "See 1 endorsement for SQL",
                "1",
                "SQL",
                "Endorse"
            ],
            [
                "SQL",
                "See 1 endorsement for SQL",
                "1"
            ]
        ],
        "summary": "  Product guy with a technical background; passionate about data and user experiences\n  \n  \n",
        "name": "Caleb Carter",
        "title": "User Experience Manager at IBM",
        "url": "linkedin.com/in/caleb-carter-983529112",
        "phone": null,
        "email": "calebcarter00@gmail.com"
    }
]