[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "116 Mutual Connections",
                "You and Adam both know Amy Donohue, Lance Faulkner, CSM, CSPO, and 114 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Producer, Director, Writer",
                "Company Name",
                "Brothers' Ink Productions",
                "Dates Employed",
                "Apr 2003 – Present",
                "Employment Duration",
                "14 yrs 8 mos",
                "Motion Picture Production Company - The company has participated in over 40 film festivals across the country, won over 20 awards for their films and screenplays, and sold and optioned several screenplays. Many of the films have aired on TV and most recently, Brothers' Ink Productions signed a contract with the Department of Defense for them to play \"Reveille\" on the American Forces Network and the Pentagon Channel throughout 2007. Brothers’ Ink Productions won a Rocky Mountain Emmy® Award for \"Reveille\" on October 6th, 2007.Brothers' Ink Productions is an award-winning production company focused on creating commercial films that are high in quality at conservative budgets. Brothers' Ink is releasing their first feature film in 2013 called Locker 13. Locker 13 is a thriller anthology movie with all stories revolving around a mysterious locker number 13."
            ],
            [
                "Senior Rainmaker Consultant",
                "Company Name",
                "The Rainmaker Institute",
                "Dates Employed",
                "May 2013 – Present",
                "Employment Duration",
                "4 yrs 7 mos",
                "The Rainmaker Institute is the nation's largest law firm marketing company specializing in working with small law firms. Over 9,000 attorneys have benefited from applying our proven Rainmaker Marketing System.We provide live 2-day law firm marketing boot camps, in house custom seminars and outsourced marketing services for small law firms (1-50 attorneys).See www.RainmakerRetreat.com or www.TheRainmakerInstitute.com for more information."
            ],
            [
                "Owner",
                "Company Name",
                "Book Rack Mesa",
                "Dates Employed",
                "Aug 2010 – May 2014",
                "Employment Duration",
                "3 yrs 10 mos",
                "Location",
                "1752 South Signal Butte Rd. Suite #108 Mesa, Az. 85209",
                "This small community bookstore in Mesa, Arizona started out of the garages of the twins in late 2009. They started selling books online as a hobbie, selling educational tools for teachers and students on Amazon. What began as a few boxes in the corner of their garages, soon grew to mountains of books taking up the space that used to house a few family cars. Their wives Daniella and Monica, seeing the hobby grow and grow, convinced Adam and Donovan to open a brick and mortar store in the fall of 2010.The small community bookstore offers not only new and used books, but DVD's, CD's, Blu-Ray, Audio Books, Video Games, Board Games, Lego, Action Figures, and Collectibles. We buy - sell - and trade! We are located in the Walmart parking lot between Gamestop and Cold Stone Creamery on Signal Butte and the US 60. Look at our website at www.bookrackonline.com or call us at 480-380-0044."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Eastern Arizona College",
                "Field Of Study",
                "General Studies"
            ],
            [
                "Eastern Arizona College",
                "Field Of Study",
                "General Studies"
            ],
            [
                "The University of Utah",
                "Field Of Study",
                "Film/Cinema/Video Studies"
            ],
            [
                "The University of Utah",
                "Field Of Study",
                "Film/Cinema/Video Studies"
            ],
            "Recommendations",
            [
                "University of Utah - Employment",
                "145,683 followers"
            ],
            [
                "AFOL: Adult Fans of LEGO Group",
                "8,209 members"
            ],
            [
                "Arizona Attorney Networking and Referral Group (AANRG)",
                "828 members"
            ],
            [
                "The Rainmaker Institute",
                "761 followers"
            ],
            [
                "Triplets, Twins & More",
                "2,351 members"
            ],
            [
                "Jenkins Entertainment",
                "34 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "University of Utah - Employment",
                "145,683 followers"
            ],
            [
                "University of Utah - Employment",
                "145,683 followers"
            ],
            [
                "AFOL: Adult Fans of LEGO Group",
                "8,209 members"
            ],
            [
                "AFOL: Adult Fans of LEGO Group",
                "8,209 members"
            ],
            [
                "Arizona Attorney Networking and Referral Group (AANRG)",
                "828 members"
            ],
            [
                "Arizona Attorney Networking and Referral Group (AANRG)",
                "828 members"
            ],
            [
                "The Rainmaker Institute",
                "761 followers"
            ],
            [
                "The Rainmaker Institute",
                "761 followers"
            ],
            [
                "Triplets, Twins & More",
                "2,351 members"
            ],
            [
                "Triplets, Twins & More",
                "2,351 members"
            ],
            [
                "Jenkins Entertainment",
                "34 followers"
            ],
            [
                "Jenkins Entertainment",
                "34 followers"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "    Adam majored in Film Studies at the University of Utah and worked with movie distribution for Harkins Theatres throughout Arizona. He was instrumental in opening several huge multi-plex theatres in new regions for the company, worked as a liaison during special screenings, and won company awards in marketing and management.  During this time he was instrumental in personally facilitating visits by Academy Award winners Tom Hanks and Jodie Foster, as well as the cast of Wolverine, Tom Cruise, Bruce Campbell, Greg Kinnear, the Wayans Bros and directors, Tony and Ridley Scott, Randall Wallace, Kevin Smith and Garry Marshall. Adam, along with his twin brother Donovan, formed a production company in 2004 and have produced and directed films which were screened in over 40 film festivals across the country. They won over 20 awards for their films and screenplays, and several of the films have aired on TV. Donovan and Adam won a Rocky Mountain Emmy® Award for \"Reveille\" on October 6th, 2007. He has written, optioned and produced several screenplays.For many years, Adam has specialized in directing, writing and producing a plethora of programs in classic and new media. He specializes in providing a cinematic storytelling experience for advertisers/brand marketers that want to reach their audience in a new and effective way. Some highlights include a 30 minute interview with New York Best Selling Author J.A. Jance, a viral public service announcement for battered women, a10-minute short film about military veterans that was viewed over 6 million times on Google and the release of an informative children’s book called, “Dream” that included a book tour where he spoke to elementary schools throughout Arizona about the importance making your dreams come true. Adam is currently married to an amazing woman, has two amazing boys, and a cat that visits when she wants.\n  \n  \n",
        "name": "Adam Montierth",
        "title": "Writer, Director, Producer for Brothers' Ink Productions / Senior Rainmaker Consultant at The Rainmaker Institute.",
        "url": "linkedin.com/in/adam-montierth-53588573",
        "phone": "",
        "email": "adam@brothers-ink.com"
    }
]