[
    {
        "experience": [
            "Highlights",
            [
                "8 Mutual Connections",
                "You and Caitlin both know Sean Sheppard, Michael Cymerman, and 6 others"
            ],
            [
                "Check out this link",
                "Caitlin liked"
            ],
            [
                "Enjoyed my first day of training at FANUC Robotics Headquarters!",
                "Caitlin liked"
            ],
            [
                "ABS Technology is looking for a Web Developer for an opportunity supporting a client headquartered in Colorado Springs. Remote work is an option! Send me your resume cjohnson @abstechnology.com",
                "Caitlin shared this"
            ],
            [
                "Fall Tech Fest 2017",
                "Caitlin shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Staffing Solutions Manager",
                "Company Name",
                "ABS Technology",
                "Dates Employed",
                "Aug 2016 – Present",
                "Employment Duration",
                "1 yr 3 mos",
                "Location",
                "Virginia Beach, Virginia",
                "Essential Functions•\tMaintains all job functions as the Talent Acquisition Manager in conjunction with building the Staffing business unit.•\tManage ABS career website: develop and publish all internal and external job postings. •\tTrusted partner at the executive level regarding important hiring decisions. •\tMaintains market knowledge on best of breed recruiting tools, technology, and skillsets. •\tMaintains working knowledge regarding competitive pay, benefits, and total compensation package in relation to information technology positions in the local markets; Virginia Beach, Richmond, Roanoke, and the DC Metro Area, and provides guidance to leadership. •\tResponsible for executing and exceeding department goals and metrics.•\tProvide weekly, monthly, quarterly, and annual P&L tracking to key stakeholders.•\tResponsible for all hiring, training, and mentoring of ABS Staffing recruiters and team members.Recruiting Management Responsibilities•\tAdvocated, created, and implemented the ABS internal candidate application process and proactively safeguards that all ABS hiring managers adhere to all internal applicant interviewing policies.•\tPlan and guide development and implementation of recruitment strategy and initiatives to meet organizational objectives.•\tPartners with internal ABS hiring managers and external client hiring managers to develop job descriptions, job postings, and fill open positions.•\tConsistently creates and executes recruiting and hiring strategies by providing a diverse candidate pool to ensure growth throughout ABS and with clients.•\tProactively builds a large network of professional connections via LinkedIn, networking events, and through technology “meet-ups”.•\tOversees the sourcing and placement of candidates whose values are in line with the organizational goals and needs.•\tEnsure services and policies follow company standards, professional standards, and state and federal laws and regulations."
            ],
            [
                "Talent Acquisition Manager",
                "Company Name",
                "ABS Technology",
                "Dates Employed",
                "Nov 2015 – Aug 2016",
                "Employment Duration",
                "10 mos",
                "Location",
                "Virginia Beach, Virginia",
                "•\tResponsible for the Full Life Cycle Recruitment of all ABS Technology employees along with supporting outside sales for occasional staff augmentation engagements.•\tConsistently created and executed against recruiting and hiring strategies.•\tProvided a diverse candidate pool to ensure successful growth throughout ABS and with clients. •\tSME for Talent Sourcing, recruiting, and staffing in the Information Technology Industryo\tKnowledgeable in recruiting for all IT related skillsets, to include: desktop support, software engineers, mobile developers, web developers, network engineers, security engineers, project managers, system administrators, etc.  •\tProvided; sourcing, screening, candidate management, and labor market expertise. •\tActively sourced candidates using LinkedIn, ABS Career Site, CareerBuilder, Indeed, etc.•\tMaintained a candidate database and strong pipeline of candidates.•\tInterviewed all candidates through an initial process and provided feedback to the appropriate. hiring manager, participated in hiring decision discussion.•\tNegotiated salary and compensation packages with candidates.•\tCoordinated secondary phone interviews and in person interviews with appropriate hiring manager.•\tAttended career fairs, college fairs, and actively looked for new networking opportunities to maintain a solid candidate pool."
            ],
            [
                "Account Executive",
                "Company Name",
                "Super Systems Inc (SSI)",
                "Dates Employed",
                "Oct 2015 – Nov 2015",
                "Employment Duration",
                "2 mos",
                "Location",
                "Richmond, Virginia Area",
                "Super Systems, Inc. is a leading provider of IT workforce solutions and services to companies spanning the continental United States. Super Systems provides workforce solutions in the government and healthcare sectors as well as to Fortune 1000 companies . With a combined 50 yrs of experience in staffing and recruiting, the Super System's team can be relied upon to tackle any situation. We specialize in providing full-time, temporary, contract-to-hire and permanent placement services. Super Systems is a certified MBE, SDB, 8(a) and SWaM business with a national presence.•\tResponsible for selling IT staffing solutions to a new market for SSi; Richmond.•\tCold called a minimum of 70 decision makers daily.•\tExecuted multiple new contracts for SSi and was responsible for winning net new staffing business.•\tNegotiated contracts with HR, procurement, and IT directors.•\tAttended meetings with decision makers.•\tResponsible for recruiting and placing candidates while selling staffing into the new market."
            ],
            [
                "Senior IT Recruiter",
                "Company Name",
                "Super Systems Inc (SSI)",
                "Dates Employed",
                "Dec 2014 – Oct 2015",
                "Employment Duration",
                "11 mos",
                "Location",
                "Hampton Roads",
                "•\tResponsible for full life cycle recruitment for candidates in the information technology field.•\tGathered requirements from account managers and researched job descriptions.•\tUtilized resources such as; LinkedIn, CareerBuilder, Monster, and other various job boards to find the right candidates with skill sets ranging from software engineers, systems architects, cyber security analysts, project managers, etc.•\tQualified candidates for positions; ensured candidates were suitable based on requirements, responsible for compensation package negotiation, ensured candidates met experience requirements, skills, educations, and personal attributions.•\tMaintained a minimum of 50 outbound calls daily.•\tExcelled in performance in finding, screening, and placing candidates.•\tConsistently exceed all requirements set forth by management and was promoted into an Account Manager position after being with SSi for less than a year."
            ],
            [
                "Emergency Department Technician",
                "Company Name",
                "Sentara Healthcare",
                "Dates Employed",
                "Jun 2012 – Nov 2014",
                "Employment Duration",
                "2 yrs 6 mos",
                "Location",
                "Hampton, Virginia",
                "•\tAssisted doctors with patient diagnosis and examination, injections, suture removal, and started Intravenous (IV). lines for blood draws and medication administration.•\tTreated patients within scope of practice as defined by Virginia State Law.•\tPerformed various lab tests (pregnancy, glucose, electrolytes, heart enzymes etc.).•\tObserved and monitored for life threatening patient conditions (ECG changes, low oxygen saturations, hyper/hypo tension etc.) and notified attending physicians.•\tRecognized by patients, nurses, and doctors for outstanding patient care and high attention to details.•\tConsistently maintained composure and professionalism under high stress situations."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Old Dominion University",
                "Degree Name",
                "Bachelor of Science (B.S.)",
                "Field Of Study",
                "Biology, General",
                "Dates attended or expected graduation",
                "2009 – 2013",
                "Activities and Societies:",
                "The Diversity Institute",
                "Graduated Cum Laude with a degree in Biology, minor in psychology, and concentration in pre-medical studies. Awarded Dean's list, participated in leadership courses and the Diversity Institute."
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "YAC President - Hampton Roads Chapter",
                "Company Name",
                "AFCEA International",
                "Dates volunteered",
                "Sep 2017 – Present",
                "Volunteer duration",
                "2 mos",
                "Cause",
                "Science and Technology",
                "The Young AFCEAN program offers professionals 40 years old and under unparalleled networking opportunities with senior leaders. It also includes the opportunity to work with others who will become future leaders in industry, military, government and academia. AFCEA is unique in the way it includes young members in leadership, management and planning throughout the association and its chapters. Young AFCEANs also have board-level representation in AFCEA International. The Hampton Roads Young AFCEA Leadership Team, or YAC Leadership Team, is responsible for the coordination of subcommittees, programs, and events to ensure increased membership and participation of Young AFCEANs in the Hampton Roads areaFor more information and to become a Young AFCEAN, please contact us at YAC@afceahamptonroads.orgJoin us on slack!  yachr.slack.comCheck us  out on facebook: https://www.facebook.com/Young-AFCEAN-Hampton-Roads-Chapter-113558102040946/?ref=bookmarks"
            ],
            [
                "YAC President - Hampton Roads Chapter",
                "Company Name",
                "AFCEA International",
                "Dates volunteered",
                "Sep 2017 – Present",
                "Volunteer duration",
                "2 mos",
                "Cause",
                "Science and Technology",
                "The Young AFCEAN program offers professionals 40 years old and under unparalleled networking opportunities with senior leaders. It also includes the opportunity to work with others who will become future leaders in industry, military, government and academia. AFCEA is unique in the way it includes young members in leadership, management and planning throughout the association and its chapters. Young AFCEANs also have board-level representation in AFCEA International. The Hampton Roads Young AFCEA Leadership Team, or YAC Leadership Team, is responsible for the coordination of subcommittees, programs, and events to ensure increased membership and participation of Young AFCEANs in the Hampton Roads areaFor more information and to become a Young AFCEAN, please contact us at YAC@afceahamptonroads.orgJoin us on slack!  yachr.slack.comCheck us  out on facebook: https://www.facebook.com/Young-AFCEAN-Hampton-Roads-Chapter-113558102040946/?ref=bookmarks"
            ],
            [
                "YAC Private Sector VP-Hampton Roads Chapter",
                "Company Name",
                "AFCEA International",
                "Dates volunteered",
                "Jan 2017 – Sep 2017",
                "Volunteer duration",
                "9 mos",
                "Cause",
                "Science and Technology"
            ],
            [
                "YAC Private Sector VP-Hampton Roads Chapter",
                "Company Name",
                "AFCEA International",
                "Dates volunteered",
                "Jan 2017 – Sep 2017",
                "Volunteer duration",
                "9 mos",
                "Cause",
                "Science and Technology"
            ],
            "Recommendations",
            [
                "StartFinder",
                "838 followers"
            ],
            [
                "Facebook",
                "1,730,071 followers"
            ],
            [
                "CACI International Inc",
                "81,124 followers"
            ],
            [
                "ABS Technology",
                "2,012 followers"
            ],
            [
                "Optiv Inc",
                "9,652 followers"
            ],
            [
                "Technology Leadership CIO CTO CISO CDO CAO ★ Blockchain Cloud Social Digital Security AI IoT Fintech",
                "131,803 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "StartFinder",
                "838 followers"
            ],
            [
                "StartFinder",
                "838 followers"
            ],
            [
                "Facebook",
                "1,730,071 followers"
            ],
            [
                "Facebook",
                "1,730,071 followers"
            ],
            [
                "CACI International Inc",
                "81,124 followers"
            ],
            [
                "CACI International Inc",
                "81,124 followers"
            ],
            [
                "ABS Technology",
                "2,012 followers"
            ],
            [
                "ABS Technology",
                "2,012 followers"
            ],
            [
                "Optiv Inc",
                "9,652 followers"
            ],
            [
                "Optiv Inc",
                "9,652 followers"
            ],
            [
                "Technology Leadership CIO CTO CISO CDO CAO ★ Blockchain Cloud Social Digital Security AI IoT Fintech",
                "131,803 members"
            ],
            [
                "Technology Leadership CIO CTO CISO CDO CAO ★ Blockchain Cloud Social Digital Security AI IoT Fintech",
                "131,803 members"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "    At ABS Technology, we strive to be the best partner and thought leader in technologysolutions. We align ourselves with other trusted partners to provide advanced solutionsempowered by emerging and sophisticated technologies.Since 1972, we’ve been designing integrated technology systems that deliver the mostadvanced solutions to our customers. Through our dedication to success and customerservice, we’ve become a trusted partner to our clients spanning the Healthcare, K-12,Higher Education, Government and Commercial sectors.Our Staffing options provide Clients with fully vetted out candidates who have been put through our ABS recruiting and screening process along with a technical interview with internal engineers. This ensures that only the top qualified candidates are sent to Clients.Permanent Placement: Used when a Client needs qualified candidates that they need to hire on permanently and quickly. Contract to hire: contracting engagement with the option to hire the candidate on permanently after 6 months. Long term contracting: This is an option that can accommodate any project duration.  ABS candidates are onsite full time for a defined time that can be extended at the clients’ request.  Staffing as a Service (SAAS):ABS ensures that there are no gaps in service. Our team of expert engineers are available to backfill contractors when something unexpected occurs. \n  \n  \n",
        "name": "Caitlin (Caitie) Johnson",
        "title": "Staffing Solutions Manager at ABS Technology",
        "url": "linkedin.com/in/caitlin-johnson-a2a66050",
        "phone": "7574192215 (Work)",
        "email": "cjohnson@abstechnology.com"
    }
]