[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "25 Mutual Connections",
                "You and Diana both know Eric Keosky-Smith, Trish Bear, and 23 others"
            ],
            [
                "Mob programming - Without the Torches and Pitchforks",
                "Diana shared this"
            ],
            [
                "Mob programming - Without the Torches and Pitchforks",
                "Diana liked a comment"
            ],
            [
                "Hope you were able to catch Thene's talk on The Agile Continuum at #agileaz. She is an amazing Agile leader with tremendous knowledge and wisdom.",
                "Diana replied to a comment"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Scrum Master",
                "Company Name",
                "Solera Health",
                "Dates Employed",
                "Oct 2016 – Present",
                "Employment Duration",
                "1 yr 1 mo",
                "Location",
                "Phoenix, Arizona Area",
                "The Solera network connects patients, payers and physicians to a network of partners who are preventing and managing chronic disease.  One of our leading programs uses proprietary technology to connect people to low or no-cost Diabetes Prevention Programs.        Learn more at: SoleraNetwork.com  and  Solera4me.comAs Scrum master I facilitate sprint ceremonies in a way that fosters a culture of self-organization.   I guide and coach the Scrum team and other parts of the organization on how to use and improve our Agile/Scrum practices.  I support the scrum team in the identification and elimination of impediments.  I am proud to be working in a team that chooses to create an environment where problems can be raised without fear of blame or retribution, we work to focus on problem-solving and iterative improvements."
            ],
            [
                "Sctum Master, Product Manger, iOS Developer",
                "Company Name",
                "5000 Solutions",
                "Dates Employed",
                "Dec 2014 – Present",
                "Employment Duration",
                "2 yrs 11 mos",
                "Location",
                "Scottsdale",
                "Agile Project Manager- Bringing together a team- Creating an environment for self-organization to thrive- Cultivating a culture of trust and mutual respectDeveloping Apps- Gather user stories from customers - Mobile App Development- Human Computer InteractionDeveloping applications and programs which provide users with solutions for diverse problems."
            ],
            [
                "Agile Coach, Scrum Master, iOS Developer",
                "Company Name",
                "Feed Inc.",
                "Dates Employed",
                "Aug 2015 – Oct 2016",
                "Employment Duration",
                "1 yr 3 mos",
                "Location",
                "Scottsdale, Az",
                "Agile Coach:·\tCreate an effective agile team culture, which enabled us to deliver a production ready app in just 3 months.  ·\tTrained team members on Agile processes creating a structure for clear communication and strong teamwork.  ·\tFacilitate meetings to negotiate agreement on MVP feature set with stakeholders and set clear team goals. ·\tOptimize strengths of each team member to cultivate a Highly Effective Team.·\tMentor less experienced team members.·\tCoach people to self-organize & take initiative. Scrum Master:·\tLead all agile ceremonies including: Sprint Planning, Daily Scrum, Sprint Review and Sprint Retrospective.·\tBacklog maintenance including working with Product Owner to prioritize stories and all aspects of story life-cycle. ·\tCoordinate action between team members, including drafting and reviewing internal and external communications.iOS Developer:·\tPair program to decrease errors and advance learning for team members.  ·\tProgram in Swift programming language for the iPhone and iPad platforms.  ·\tPosted Secured Messaging App in App Store January 2016 and posted maintenance releases as needed."
            ],
            [
                "Founder & CEO",
                "Company Name",
                "5000 Solutions, LLC.",
                "Dates Employed",
                "2001 – Aug 2015",
                "Employment Duration",
                "14 yrs",
                "Location",
                "Scottsdale, Arizona",
                "Business and Personal Life Coaching; Facilitation for experiential learning in environments including rock climbing, rappelling and meditation.  Team building, tribe cultivation, self discovery and non-judgmental self observation.  Specializing in success strategies and stress relief.Solution domains include: stress relief, overcoming challenges, utilizing success strategies, pain relief, focused attention.Cultivate Community: Facilitate master mind groups and experiential learning eventsMy signature use of experiential learning environments creates a deeper connection within a group.  For over 10 years I’ve used rock climbing and rappelling to create challenge situations including overcoming fear.    What we DO WITH the learning after the event is much more important than the event itself.  I work with the individuals and the team members during and after the “team Building event” to open up personal learning as well as practical tools for applying what they learned about themselves to the workplace.  Know your Personal Success strategies and the strategies of other team members so you can and work better as a team.Success Strategies: Unlock and Activate Personal Success Strategies in the workplaceUnlock personal strategies through pursuit of your dreams and activate these strategies in the workplace through group and private coaching.  Employees use their strategy to be more effective at work."
            ],
            [
                "Product Owner",
                "Company Name",
                "STARSHINE",
                "Dates Employed",
                "Aug 2013 – Jan 2014",
                "Employment Duration",
                "6 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Product Owner – StarShine AcademyAs Product Owner I developed the product throughout the entire product life cycle.  My role included: developing requirements, marketing, design, production, budget as well as utilizing the corporate vision in the creation of the product.  Requirements: Gathering requirements, market research, customer interviews and product testing.Marketing: Develop and implement marketing strategies for products including  launch, special conference sales and ongoing marketing.  Create marketing materials.  Provide product details for press about the first release as well as product description.  Design: Identify the core values and needs of the company so that they can be incorporated into the very fabric of the product.  Designing products involves owning every aspect of the product and seeing it through as an implementer, collaborator and leader. Production: Lead team and engage in hands on work to find and create packaging materials and to locate source materials for the production of the final product. Used my engineering skills to design a process for assembly of the final product. Negotiate partnerships. Create documentation and instructions.Budget:  Assess and document the planned and actual budgets.Vision: Our products are designed to leverage the proprietary corporate knowledge and package it in a way that serves our customers and supporters."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Newfield Network",
                "Degree Name",
                "Coaching Certificate",
                "Field Of Study",
                "Coaching Certification Training",
                "Dates attended or expected graduation",
                "2003 – 2004",
                "Activities and Societies:",
                "Business Coaching",
                "Learned the refined skills to be an effective coach.  As an engineer, I am well versed at solving problems, as a coach I learned to hold a space for others to find their own solutions to problems."
            ],
            [
                "Newfield Network",
                "Degree Name",
                "Coaching Certificate",
                "Field Of Study",
                "Coaching Certification Training",
                "Dates attended or expected graduation",
                "2003 – 2004",
                "Activities and Societies:",
                "Business Coaching",
                "Learned the refined skills to be an effective coach.  As an engineer, I am well versed at solving problems, as a coach I learned to hold a space for others to find their own solutions to problems."
            ],
            [
                "Arizona State University",
                "Degree Name",
                "BS",
                "Field Of Study",
                "Computer Systems Engineering",
                "Dates attended or expected graduation",
                "1987 – 1993",
                "Activities and Societies:",
                "Honors Society, Hiking Club",
                "Learned to program computers and develop software using the latest development methodologies."
            ],
            [
                "Arizona State University",
                "Degree Name",
                "BS",
                "Field Of Study",
                "Computer Systems Engineering",
                "Dates attended or expected graduation",
                "1987 – 1993",
                "Activities and Societies:",
                "Honors Society, Hiking Club",
                "Learned to program computers and develop software using the latest development methodologies."
            ],
            [
                "Ira A. Fulton Schools of Engineering at Arizona State University",
                "Degree Name",
                "BS Computer Science"
            ],
            [
                "Ira A. Fulton Schools of Engineering at Arizona State University",
                "Degree Name",
                "BS Computer Science"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Director of Mentoring Program",
                "Company Name",
                "The Alliance of Technology and Women",
                "Dates volunteered",
                "Jun 2003 – May 2005",
                "Volunteer duration",
                "2 yrs",
                "Cause",
                "Science and Technology",
                "We started a Mentoring program for women in technology.  We designed and implemented the program from the ground up.  We recruited a team of volunteers to coordinate the mentoring.  We also recruited and trained the mentors.  Our first year we had 20 participants.   I was the Co-Director and Founder of the Phoenix Mentoring program."
            ],
            "Recommendations",
            [
                "Feed Inc",
                "2 followers"
            ],
            [
                "GENERAL DYNAMICS CONNECTIONS",
                "11,127 members"
            ],
            [
                "Arizona State University",
                "386,304 followers"
            ],
            [
                "Padmasree WarriorPadmasree Warrior is a LinkedIn Influencer",
                "CEO NIO U.S",
                "328,559 followers"
            ],
            [
                "Women in Business presented by Foxfire Events at Microsoft",
                "617 members"
            ],
            [
                "Choice Hotels International",
                "49,823 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Feed Inc",
                "2 followers"
            ],
            [
                "Feed Inc",
                "2 followers"
            ],
            [
                "GENERAL DYNAMICS CONNECTIONS",
                "11,127 members"
            ],
            [
                "GENERAL DYNAMICS CONNECTIONS",
                "11,127 members"
            ],
            [
                "Arizona State University",
                "386,304 followers"
            ],
            [
                "Arizona State University",
                "386,304 followers"
            ],
            [
                "Padmasree WarriorPadmasree Warrior is a LinkedIn Influencer",
                "CEO NIO U.S",
                "328,559 followers"
            ],
            [
                "Padmasree WarriorPadmasree Warrior is a LinkedIn Influencer",
                "CEO NIO U.S",
                "328,559 followers"
            ],
            [
                "Padmasree Warrior is a LinkedIn Influencer"
            ],
            [
                "Women in Business presented by Foxfire Events at Microsoft",
                "617 members"
            ],
            [
                "Women in Business presented by Foxfire Events at Microsoft",
                "617 members"
            ],
            [
                "Choice Hotels International",
                "49,823 followers"
            ],
            [
                "Choice Hotels International",
                "49,823 followers"
            ]
        ],
        "recommendations": [
            [
                "David Kuster",
                "Senior Backend Developer and Application Architect",
                "April 25, 2016, Diana worked with David in the same group",
                "Diana did a fantastic job at Feed of being able to diplomatically work around a variety of constraints while fostering a collaborative and cohesive team environment, communicating objectives clearly, and motivating rapid development. She is great at bringing people together so that different perspectives are heard and new ways of working together are considered. Diana did this while managing multiple iOS developers and writing Swift code herself. I would not hesitate to work with Diana again in the future."
            ],
            [
                "David Kuster",
                "Senior Backend Developer and Application Architect",
                "April 25, 2016, Diana worked with David in the same group"
            ],
            [
                "David Kuster",
                "Senior Backend Developer and Application Architect",
                "April 25, 2016, Diana worked with David in the same group"
            ],
            [
                "David Kuster",
                "Senior Backend Developer and Application Architect",
                "April 25, 2016, Diana worked with David in the same group"
            ],
            "Senior Backend Developer and Application Architect",
            [
                "Diana did a fantastic job at Feed of being able to diplomatically work around a variety of constraints while fostering a collaborative and cohesive team environment, communicating objectives clearly, and motivating rapid development. She is great at bringing people together so that different perspectives are heard and new ways of working together are considered. Diana did this while managing multiple iOS developers and writing Swift code herself. I would not hesitate to work with Diana again in the future."
            ],
            [
                "Diana did a fantastic job at Feed of being able to diplomatically work around a variety of constraints while fostering a collaborative and cohesive team environment, communicating objectives clearly, and motivating rapid development. She is great at bringing people together so that different perspectives are heard and new ways of working together are considered. Diana did this while managing multiple iOS developers and writing Swift code herself. I would not hesitate to work with Diana again in the future."
            ],
            [
                "Scooter David",
                "Android Engineer at EachScape",
                "April 28, 2013, Scooter reported directly to Diana",
                "Diana is a strategist.  She provides an endless stream of out of the box ideas and strategies with the energy to implement everything she brainstorms.  Diana fiercely attacks problems with a persistence that is inspirational.  She’s very organized and a good communicator.  Plus, she’s very approachable and makes herself available to help in any way she can."
            ],
            [
                "Scooter David",
                "Android Engineer at EachScape",
                "April 28, 2013, Scooter reported directly to Diana"
            ],
            [
                "Scooter David",
                "Android Engineer at EachScape",
                "April 28, 2013, Scooter reported directly to Diana"
            ],
            [
                "Scooter David",
                "Android Engineer at EachScape",
                "April 28, 2013, Scooter reported directly to Diana"
            ],
            "Android Engineer at EachScape",
            [
                "Diana is a strategist.  She provides an endless stream of out of the box ideas and strategies with the energy to implement everything she brainstorms.  Diana fiercely attacks problems with a persistence that is inspirational.  She’s very organized and a good communicator.  Plus, she’s very approachable and makes herself available to help in any way she can."
            ],
            [
                "Diana is a strategist.  She provides an endless stream of out of the box ideas and strategies with the energy to implement everything she brainstorms.  Diana fiercely attacks problems with a persistence that is inspirational.  She’s very organized and a good communicator.  Plus, she’s very approachable and makes herself available to help in any way she can."
            ],
            [
                "Rich Ellis",
                "iOS Engineer",
                "September 27, 2016, Diana managed Rich directly",
                "Rich is one of those developers who has a very diverse set of skills.  He can seamlessly move between resolving technical issues, discussing product design, and exploring business ramifications.  He is able to efficiently learn “enough” about a new area to get something working quickly, yet he is also able to think critically about a problem or an architecture which enables him to make good long term decisions. Rich is great at making quick mock ups of UI design, both electronically and on paper/whiteboard. He is also thorough, especially when determining the root cause of bugs and working to resolve them long term. Finally, when in-depth, detailed learning is needed, Rich can work on a problem or domain and propel himself along the learning path to become the team expert in that new area.  Rich and I worked together at a startup, and he has also done iOS consulting work for me at 5000 Solutions, Inc.  He and I have pair programmed in Xcode and he is easy to work with, both as the lead and as the learner. He would be a great fit for an Agile Development Team and I highly recommend him."
            ],
            [
                "Rich Ellis",
                "iOS Engineer",
                "September 27, 2016, Diana managed Rich directly"
            ],
            [
                "Rich Ellis",
                "iOS Engineer",
                "September 27, 2016, Diana managed Rich directly"
            ],
            [
                "Rich Ellis",
                "iOS Engineer",
                "September 27, 2016, Diana managed Rich directly"
            ],
            "iOS Engineer",
            [
                "Rich is one of those developers who has a very diverse set of skills.  He can seamlessly move between resolving technical issues, discussing product design, and exploring business ramifications.  He is able to efficiently learn “enough” about a new area to get something working quickly, yet he is also able to think critically about a problem or an architecture which enables him to make good long term decisions. Rich is great at making quick mock ups of UI design, both electronically and on paper/whiteboard. He is also thorough, especially when determining the root cause of bugs and working to resolve them long term. Finally, when in-depth, detailed learning is needed, Rich can work on a problem or domain and propel himself along the learning path to become the team expert in that new area.  Rich and I worked together at a startup, and he has also done iOS consulting work for me at 5000 Solutions, Inc.  He and I have pair programmed in Xcode and he is easy to work with, both as the lead and as the learner. He would be a great fit for an Agile Development Team and I highly recommend him."
            ],
            [
                "Rich is one of those developers who has a very diverse set of skills.  He can seamlessly move between resolving technical issues, discussing product design, and exploring business ramifications.  He is able to efficiently learn “enough” about a new area to get something working quickly, yet he is also able to think critically about a problem or an architecture which enables him to make good long term decisions. Rich is great at making quick mock ups of UI design, both electronically and on paper/whiteboard. He is also thorough, especially when determining the root cause of bugs and working to resolve them long term. Finally, when in-depth, detailed learning is needed, Rich can work on a problem or domain and propel himself along the learning path to become the team expert in that new area.  Rich and I worked together at a startup, and he has also done iOS consulting work for me at 5000 Solutions, Inc.  He and I have pair programmed in Xcode and he is easy to work with, both as the lead and as the learner. He would be a great fit for an Agile Development Team and I highly recommend him."
            ],
            [
                "Wesley Filleman",
                "Owner/CEO at Mobile Integrated Solutions, LLC",
                "March 24, 2016, Diana was a client of Wesley’s",
                "Wes is the one the best swift programmers I know.  But what is more amazing, is he is also an incredible mentor.  He is able to provide high value at ALL stages of iOS development.  He designs code which is easy maintain and utilizes the best of the latest tools.  He is able to step in and quickly implement a portion of the project or break the work into modules which are appropriate for the level of knowledge of each team member.  If you are looking for a consultant for a small or large iOS project I highly recommend Wes.  Wes and I have worked on multiple apps in various phases and I would gladly take the opportunity to work with him in the future."
            ],
            [
                "Wesley Filleman",
                "Owner/CEO at Mobile Integrated Solutions, LLC",
                "March 24, 2016, Diana was a client of Wesley’s"
            ],
            [
                "Wesley Filleman",
                "Owner/CEO at Mobile Integrated Solutions, LLC",
                "March 24, 2016, Diana was a client of Wesley’s"
            ],
            [
                "Wesley Filleman",
                "Owner/CEO at Mobile Integrated Solutions, LLC",
                "March 24, 2016, Diana was a client of Wesley’s"
            ],
            "Owner/CEO at Mobile Integrated Solutions, LLC",
            [
                "Wes is the one the best swift programmers I know.  But what is more amazing, is he is also an incredible mentor.  He is able to provide high value at ALL stages of iOS development.  He designs code which is easy maintain and utilizes the best of the latest tools.  He is able to step in and quickly implement a portion of the project or break the work into modules which are appropriate for the level of knowledge of each team member.  If you are looking for a consultant for a small or large iOS project I highly recommend Wes.  Wes and I have worked on multiple apps in various phases and I would gladly take the opportunity to work with him in the future."
            ],
            [
                "Wes is the one the best swift programmers I know.  But what is more amazing, is he is also an incredible mentor.  He is able to provide high value at ALL stages of iOS development.  He designs code which is easy maintain and utilizes the best of the latest tools.  He is able to step in and quickly implement a portion of the project or break the work into modules which are appropriate for the level of knowledge of each team member.  If you are looking for a consultant for a small or large iOS project I highly recommend Wes.  Wes and I have worked on multiple apps in various phases and I would gladly take the opportunity to work with him in the future."
            ]
        ],
        "skills": [],
        "summary": "    An Agile Coach and Scrum Master who has used agile principles throughout her career in roles including:  iOS developer, strategist, coach, thought partner, engineer, maker, mentor and facilitator. She creates highly effective teams while cultivating creativity and collaboration.   Specialties:  Cultivating teams with effective communication and lasting connections.  Empowering teams and individuals to overcoming challenges (especially ones which seem impossible).  Facilitating learning and stretching into a new area.  Helping you learn to listen to your inner wisdom. Unlocking personal success strategies and applying them to overcome current impediments at work.As coach and mentor at Climbing Edge, Diana Sherwood has  blended her professional coaching skills with her passion for rock climbing.  Participants often say that the climbing and rappelling events are life changing.  People who work with Diana tap into their personal wisdom.Agile Coach/Scrum Master: participating in product development throughout all phases of product life cycle.  Collaborating with cross-discipline teams to augment the team as a pair programmer, mentor and/or trainer.  \n  \n  \n",
        "name": "Diana Sherwood",
        "title": "Scrum Master at Solera Health",
        "url": "linkedin.com/in/dianasherwood5000",
        "phone": "602 888 6312 (Work)",
        "email": "diana@5000solutions.com"
    }
]