[
    {
        "experience": [
            "Highlights",
            [
                "79 Mutual Connections",
                "You and Luke both know John Furrier, Jeff Pulver, and 77 others"
            ],
            [
                "OK - I admit it. I often stink at doing some of the things that are normally ascribed to being a CEO. But I have a good reason: I love working with our customers and our dev team to extend the Weave platform.",
                "Over the past few weeks the Conteneo team has been working on planning out two major enhancements. First, we're going to make Teams a first class object in the platform and release a set of license options designed for teams. We're taking a fresh approach to the concept of a team - one that matches our decades of Agile experience and one that won't be bound to outdated notions of hierarchy.",
                "The second major enhancement we're working on are continued ways to make Idea Engine more powerful and more dynamic. Specifically, we know that we have the best platform for scaling collaboration, especially when you want dozens to hundreds of teams leveraging the same framework. Where we will be investing in improvements is in making the framework creation and framework use process more dynamic.",
                "OK - enough of this post. Back to the dreamlog and backlog. And if you have any dreams or backlog items for Weave - send them my way :-).",
                "Luke shared this"
            ],
            [
                "I am in the middle of writing a 3-year license agreement to the Conteneo Weave platform for a F100 customer.",
                "The date of the automatic extension? 31-Dec-2020.",
                "It is really cool to write that date -- 2020 -- as part of a long term contract.",
                "It is even more cool to know that F100 companies are putting that kind of trust into Conteneo and have the confidence that we're the company that will be there for them over the long haul.",
                "Luke liked a comment"
            ],
            [
                "Sometimes I get lucky and get to see alternative collaboration technologies in action. Today I'm with a client who has a super huge Microsoft Surface device. We're drawing Prune the Product Trees and Impact-Effort matrixes on it to illustrate the conceptual models underlying these frameworks.",
                "Then we started to talk about their real collaboration needs: multiple teams located in Chicago, Munich, China and a few additional locations. And the need to manage multiple trees with clearly defined semantics.",
                "So I introduced them to Weave - and watched them immediately move from the Surface Hub (which is cool for drawing) and Weave (which is cool for collaboration at scale).",
                ":-).",
                "Luke replied to a comment"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Founder and CEO",
                "Company Name",
                "Conteneo Inc.",
                "Dates Employed",
                "Mar 2010 – Present",
                "Employment Duration",
                "7 yrs 8 mos",
                "Location",
                "Mountain View, CA",
                "Conteneo helps companies create, market, and sell products and services faster through collaborative, social, serious games.  Our products include:Innovation Games® Online: a serious gaming platform that enables large numbers of people to collaborate in small groups to generate unique insights through visual collaboration and virtual market games; Knowsy®: a brand engagement platform for mobile devices disguised as a great, engaging, addictive gameKnowsy Knows: a white label version of Knowsy that enables merchants to generate contests and sales professionals to target large accounts. We provide design, production, and facilitation services directly and through a global network of more than 2000 trained facilitators. We're determined to change the world and have one heck of a good time doing it. E.B. White would be proud!"
            ],
            [
                "Agile Product Management / Product Strategy Consultant",
                "Company Name",
                "Enthiosys, Inc.",
                "Dates Employed",
                "Jan 2003 – Feb 2010",
                "Employment Duration",
                "7 yrs 2 mos",
                "Location",
                "Mountain View, CA",
                "Founder and Consultant at Enthiosys, Inc. Enthiosys helps software companies achieve business agility through agile product management processes and practices. As the leading Agile product management consulting firm, we help our clients deliver on the company-wide promise and power of Agile."
            ],
            [
                "Agile Product Management / Product Strategy Consultant",
                "Company Name",
                "QUALCOMM",
                "Dates Employed",
                "2003 – Jun 2006",
                "Employment Duration",
                "3 yrs",
                "Location",
                "Various locations"
            ],
            [
                "Vice President, U.S. Business Development",
                "Company Name",
                "Aladdin Knowledge Systems, Inc.",
                "Dates Employed",
                "Dec 2000 – Nov 2002",
                "Employment Duration",
                "2 yrs",
                "Managed strategic business relationships with more than one dozen technology partners including CISCO, CA, HP, Tadpole; defined business and launch plans; educated Aladdin and partner sales forces and channels on partnerships. Results: Increased sales pipeline by more than $500K.Vice President, Engineering:TRANSFORMED a lethargic, low-trust group into a focused team in less than 90 days.STOPPED a chronically failing product by instituting stage-gate development process with go/kill criteria.RENEGOTIATED several technology in-license agreements (PRVW).CREATED the integrated product vision of the ALDN and PRVW products and core technologies: new, unified pricing models; sales collateral; branding, naming, and positioning; and new sales training programs.GUIDED product development organization during the transition and acquisition by Aladdin Knowledge Systems while instituting proven best practices.MERGED the Portland and Santa Clara development organizations."
            ],
            [
                "Founder",
                "Company Name",
                "jenek Financial Services",
                "Dates Employed",
                "Aug 2000 – Dec 2000",
                "Employment Duration",
                "5 mos",
                "jenek Financial Services was formed to create parent-controlled financial services that promote financial literacy. Developed business concept and plan, presented to several investors."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "University of Michigan",
                "Degree Name",
                "MSE",
                "Field Of Study",
                "Computer Science and Engineering",
                "Dates attended or expected graduation",
                "1992"
            ],
            [
                "University of Michigan",
                "Degree Name",
                "MSE",
                "Field Of Study",
                "Computer Science and Engineering",
                "Dates attended or expected graduation",
                "1992"
            ],
            [
                "University of Michigan",
                "Degree Name",
                "BSE",
                "Field Of Study",
                "Computer Engineering",
                "Dates attended or expected graduation",
                "1991",
                "magna cum laude"
            ],
            [
                "University of Michigan",
                "Degree Name",
                "BSE",
                "Field Of Study",
                "Computer Engineering",
                "Dates attended or expected graduation",
                "1991",
                "magna cum laude"
            ],
            [
                "Erie Community College",
                "Degree Name",
                "ASE",
                "Field Of Study",
                "Computer Science",
                "Dates attended or expected graduation",
                "1982 – 1984"
            ],
            [
                "Erie Community College",
                "Degree Name",
                "ASE",
                "Field Of Study",
                "Computer Science",
                "Dates attended or expected graduation",
                "1982 – 1984"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 34 more skills"
            ],
            "Recommendations",
            [
                "Peter ArvaiPeter Arvai is a LinkedIn Influencer",
                "CEO and Co-Founder @ Prezi",
                "101,696 followers"
            ],
            [
                "University of Michigan",
                "398,990 followers"
            ],
            [
                "Anne TothAnne Toth is a LinkedIn Influencer",
                "Tech Policy Advisor",
                "107,009 followers"
            ],
            [
                "Mark LeslieMark Leslie is a LinkedIn Influencer",
                "Managing Partner, Leslie Ventures.  Lecturer at Stanford GSB.  Board Member  at Various Companies and Non-Profits",
                "28,433 followers"
            ],
            [
                "Brad GarlinghouseBrad Garlinghouse is a LinkedIn Influencer",
                "CEO at Ripple",
                "59,721 followers"
            ],
            [
                "Enthiosys - EVENTS!",
                "18 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Peter ArvaiPeter Arvai is a LinkedIn Influencer",
                "CEO and Co-Founder @ Prezi",
                "101,696 followers"
            ],
            [
                "Peter ArvaiPeter Arvai is a LinkedIn Influencer",
                "CEO and Co-Founder @ Prezi",
                "101,696 followers"
            ],
            [
                "Peter Arvai is a LinkedIn Influencer"
            ],
            [
                "University of Michigan",
                "398,990 followers"
            ],
            [
                "University of Michigan",
                "398,990 followers"
            ],
            [
                "Anne TothAnne Toth is a LinkedIn Influencer",
                "Tech Policy Advisor",
                "107,009 followers"
            ],
            [
                "Anne TothAnne Toth is a LinkedIn Influencer",
                "Tech Policy Advisor",
                "107,009 followers"
            ],
            [
                "Anne Toth is a LinkedIn Influencer"
            ],
            [
                "Mark LeslieMark Leslie is a LinkedIn Influencer",
                "Managing Partner, Leslie Ventures.  Lecturer at Stanford GSB.  Board Member  at Various Companies and Non-Profits",
                "28,433 followers"
            ],
            [
                "Mark LeslieMark Leslie is a LinkedIn Influencer",
                "Managing Partner, Leslie Ventures.  Lecturer at Stanford GSB.  Board Member  at Various Companies and Non-Profits",
                "28,433 followers"
            ],
            [
                "Mark Leslie is a LinkedIn Influencer"
            ],
            [
                "Brad GarlinghouseBrad Garlinghouse is a LinkedIn Influencer",
                "CEO at Ripple",
                "59,721 followers"
            ],
            [
                "Brad GarlinghouseBrad Garlinghouse is a LinkedIn Influencer",
                "CEO at Ripple",
                "59,721 followers"
            ],
            [
                "Brad Garlinghouse is a LinkedIn Influencer"
            ],
            [
                "Enthiosys - EVENTS!",
                "18 members"
            ],
            [
                "Enthiosys - EVENTS!",
                "18 members"
            ]
        ],
        "recommendations": [
            [
                "Kevin Paylow",
                "Be amazing. Be persuasive. Be deliberate. I can help.",
                "May 31, 2017, Kevin worked with Luke but at different companies",
                "When I read \"Innovation Games\" I liked the process; when I applied them \"in the wild\" I loved the results. I've been a raving fan ever since, handing out copies of the book to colleagues engaged in Voice of X, product management, innovation or marketing. Then I had the opportunity to work with Luke as he prepped to speak at a conference. He's smart (obviously!) but more importantly he's passionate, engaged and authentic. He demonstrates he believes in and cares deeply about serious games - and how they can help companies, governments and individuals."
            ],
            [
                "Kevin Paylow",
                "Be amazing. Be persuasive. Be deliberate. I can help.",
                "May 31, 2017, Kevin worked with Luke but at different companies"
            ],
            [
                "Kevin Paylow",
                "Be amazing. Be persuasive. Be deliberate. I can help.",
                "May 31, 2017, Kevin worked with Luke but at different companies"
            ],
            [
                "Kevin Paylow",
                "Be amazing. Be persuasive. Be deliberate. I can help.",
                "May 31, 2017, Kevin worked with Luke but at different companies"
            ],
            "Be amazing. Be persuasive. Be deliberate. I can help.",
            [
                "When I read \"Innovation Games\" I liked the process; when I applied them \"in the wild\" I loved the results. I've been a raving fan ever since, handing out copies of the book to colleagues engaged in Voice of X, product management, innovation or marketing. Then I had the opportunity to work with Luke as he prepped to speak at a conference. He's smart (obviously!) but more importantly he's passionate, engaged and authentic. He demonstrates he believes in and cares deeply about serious games - and how they can help companies, governments and individuals."
            ],
            [
                "When I read \"Innovation Games\" I liked the process; when I applied them \"in the wild\" I loved the results. I've been a raving fan ever since, handing out copies of the book to colleagues engaged in Voice of X, product management, innovation or marketing. Then I had the opportunity to work with Luke as he prepped to speak at a conference. He's smart (obviously!) but more importantly he's passionate, engaged and authentic. He demonstrates he believes in and cares deeply about serious games - and how they can help companies, governments and individuals."
            ],
            [
                "Jesse Fewell",
                "Innovation. Collaboration. Agility.",
                "January 2, 2017, Jesse worked with Luke but at different companies",
                "Luke is more than just an industry innovator, he's an energizer that makes everyone around him better...kinda like \"the Jordan effect\" for collaboration. I rely on him not just for business ventures, but to help me keep line-of-sight from \"what I do\" to \"why I do it\""
            ],
            [
                "Jesse Fewell",
                "Innovation. Collaboration. Agility.",
                "January 2, 2017, Jesse worked with Luke but at different companies"
            ],
            [
                "Jesse Fewell",
                "Innovation. Collaboration. Agility.",
                "January 2, 2017, Jesse worked with Luke but at different companies"
            ],
            [
                "Jesse Fewell",
                "Innovation. Collaboration. Agility.",
                "January 2, 2017, Jesse worked with Luke but at different companies"
            ],
            "Innovation. Collaboration. Agility.",
            [
                "Luke is more than just an industry innovator, he's an energizer that makes everyone around him better...kinda like \"the Jordan effect\" for collaboration. I rely on him not just for business ventures, but to help me keep line-of-sight from \"what I do\" to \"why I do it\""
            ],
            [
                "Luke is more than just an industry innovator, he's an energizer that makes everyone around him better...kinda like \"the Jordan effect\" for collaboration. I rely on him not just for business ventures, but to help me keep line-of-sight from \"what I do\" to \"why I do it\""
            ],
            [
                "Wes Bright",
                "Product Owner Leader, Digital Services at Frost Bank",
                "April 27, 2015, Wes was a client of Luke’s",
                "Luke Hohmann is one of the world’s experts on how to understand what your customers want and then predictably, consistently, give it to them.   He's also a great example of how being intentional about meeting new people might net you a great friend or an incredible mentor-- in my case, I got both.  In 2010, he was the first consultant brought into work with the Rackspace Product team (the team that would build the world's second largest public cloud) when it came time to scale the product development capability.  He aligned us around Agile Development, and also taught us how to structure collaboration to better understand our customers. A few years later, one of the reasons I got promoted to Director is because I co-created our Customer Advisory Council, and our team had off-the-chart results.  Luke was the central figure in making us successful for our first event.  He taught us to fish, and we were able to nail the next two events on our own.  We ended up with Net Promoter Scores above 75 for all events, each time hosting an audience of 40 of our most influential customers. Luke has a seemingly endless reserve of positivity, energy, and persistence, and is someone whom I'm grateful to know."
            ],
            [
                "Wes Bright",
                "Product Owner Leader, Digital Services at Frost Bank",
                "April 27, 2015, Wes was a client of Luke’s"
            ],
            [
                "Wes Bright",
                "Product Owner Leader, Digital Services at Frost Bank",
                "April 27, 2015, Wes was a client of Luke’s"
            ],
            [
                "Wes Bright",
                "Product Owner Leader, Digital Services at Frost Bank",
                "April 27, 2015, Wes was a client of Luke’s"
            ],
            "Product Owner Leader, Digital Services at Frost Bank",
            [
                "Luke Hohmann is one of the world’s experts on how to understand what your customers want and then predictably, consistently, give it to them.   He's also a great example of how being intentional about meeting new people might net you a great friend or an incredible mentor-- in my case, I got both.  In 2010, he was the first consultant brought into work with the Rackspace Product team (the team that would build the world's second largest public cloud) when it came time to scale the product development capability.  He aligned us around Agile Development, and also taught us how to structure collaboration to better understand our customers. A few years later, one of the reasons I got promoted to Director is because I co-created our Customer Advisory Council, and our team had off-the-chart results.  Luke was the central figure in making us successful for our first event.  He taught us to fish, and we were able to nail the next two events on our own.  We ended up with Net Promoter Scores above 75 for all events, each time hosting an audience of 40 of our most influential customers. Luke has a seemingly endless reserve of positivity, energy, and persistence, and is someone whom I'm grateful to know."
            ],
            [
                "Luke Hohmann is one of the world’s experts on how to understand what your customers want and then predictably, consistently, give it to them.   He's also a great example of how being intentional about meeting new people might net you a great friend or an incredible mentor-- in my case, I got both.  In 2010, he was the first consultant brought into work with the Rackspace Product team (the team that would build the world's second largest public cloud) when it came time to scale the product development capability.  He aligned us around Agile Development, and also taught us how to structure collaboration to better understand our customers. A few years later, one of the reasons I got promoted to Director is because I co-created our Customer Advisory Council, and our team had off-the-chart results.  Luke was the central figure in making us successful for our first event.  He taught us to fish, and we were able to nail the next two events on our own.  We ended up with Net Promoter Scores above 75 for all events, each time hosting an audience of 40 of our most influential customers. Luke has a seemingly endless reserve of positivity, energy, and persistence, and is someone whom I'm grateful to know."
            ],
            [
                "Chad Carpenter",
                "User Experience Architect at Edward Jones",
                "May 22, 2012, Chad worked with Luke but at different companies",
                "Luke gave me the tools and courage to meet with virtually any group, regardless of political history, and to tackle any project, regardless of previous issues. Innovation games have enabled me to provide clarity on software development problems and to generate alternative solutions that meet user needs. Luke has provided me the discipline to discover things I didn't know I didn't know and provided a framework that allows insights to emerge from end users and customers."
            ],
            [
                "Chad Carpenter",
                "User Experience Architect at Edward Jones",
                "May 22, 2012, Chad worked with Luke but at different companies"
            ],
            [
                "Chad Carpenter",
                "User Experience Architect at Edward Jones",
                "May 22, 2012, Chad worked with Luke but at different companies"
            ],
            [
                "Chad Carpenter",
                "User Experience Architect at Edward Jones",
                "May 22, 2012, Chad worked with Luke but at different companies"
            ],
            "User Experience Architect at Edward Jones",
            [
                "Luke gave me the tools and courage to meet with virtually any group, regardless of political history, and to tackle any project, regardless of previous issues. Innovation games have enabled me to provide clarity on software development problems and to generate alternative solutions that meet user needs. Luke has provided me the discipline to discover things I didn't know I didn't know and provided a framework that allows insights to emerge from end users and customers."
            ],
            [
                "Luke gave me the tools and courage to meet with virtually any group, regardless of political history, and to tackle any project, regardless of previous issues. Innovation games have enabled me to provide clarity on software development problems and to generate alternative solutions that meet user needs. Luke has provided me the discipline to discover things I didn't know I didn't know and provided a framework that allows insights to emerge from end users and customers."
            ],
            [
                "Steve Johnson",
                "Build a winning product in under 10 steps. Author, speaker, consultant, guitar player.",
                "April 1, 2012, Steve worked with Luke but at different companies",
                "I had the pleasure of working on a project with Luke and would gladly do so again. His mind races at a million miles an hour! He has more ideas in a morning than many people have in a lifetime. And Luke is a people-person. He truly enjoys spending time with his team and wants to help them both professionally and personally. If you haven’t already, you should read “Innovation Games” (available on Amazon and elsewhere) to spark your creative juices. Or play one of his games online at www.innovationgames.comI look forward to working with Luke again in the future."
            ],
            [
                "Steve Johnson",
                "Build a winning product in under 10 steps. Author, speaker, consultant, guitar player.",
                "April 1, 2012, Steve worked with Luke but at different companies"
            ],
            [
                "Steve Johnson",
                "Build a winning product in under 10 steps. Author, speaker, consultant, guitar player.",
                "April 1, 2012, Steve worked with Luke but at different companies"
            ],
            [
                "Steve Johnson",
                "Build a winning product in under 10 steps. Author, speaker, consultant, guitar player.",
                "April 1, 2012, Steve worked with Luke but at different companies"
            ],
            "Build a winning product in under 10 steps. Author, speaker, consultant, guitar player.",
            [
                "I had the pleasure of working on a project with Luke and would gladly do so again. His mind races at a million miles an hour! He has more ideas in a morning than many people have in a lifetime. And Luke is a people-person. He truly enjoys spending time with his team and wants to help them both professionally and personally. If you haven’t already, you should read “Innovation Games” (available on Amazon and elsewhere) to spark your creative juices. Or play one of his games online at www.innovationgames.comI look forward to working with Luke again in the future."
            ],
            [
                "I had the pleasure of working on a project with Luke and would gladly do so again. His mind races at a million miles an hour! He has more ideas in a morning than many people have in a lifetime. And Luke is a people-person. He truly enjoys spending time with his team and wants to help them both professionally and personally. If you haven’t already, you should read “Innovation Games” (available on Amazon and elsewhere) to spark your creative juices. Or play one of his games online at www.innovationgames.comI look forward to working with Luke again in the future."
            ],
            [
                "Johnny Scarborough",
                "VP, Global Support & Engineering Operations",
                "October 6, 2010, Johnny was a client of Luke’s",
                "I first met Luke while we were working up a partnership between Enthiosys and GlobalLogic and it has been a fantastic adventure ever since. I have learned something new and valuable from each and every interaction I have had with Luke. He has an infectious quality about him that I have seen impact not just in myself but whomever he is around. His energy seems to be boundless and his creativity off the charts. If you want to drive better results out of your organization and do so while having a genuine good time you need to get Luke and his Innovation Games into your business."
            ],
            [
                "Johnny Scarborough",
                "VP, Global Support & Engineering Operations",
                "October 6, 2010, Johnny was a client of Luke’s"
            ],
            [
                "Johnny Scarborough",
                "VP, Global Support & Engineering Operations",
                "October 6, 2010, Johnny was a client of Luke’s"
            ],
            [
                "Johnny Scarborough",
                "VP, Global Support & Engineering Operations",
                "October 6, 2010, Johnny was a client of Luke’s"
            ],
            "VP, Global Support & Engineering Operations",
            [
                "I first met Luke while we were working up a partnership between Enthiosys and GlobalLogic and it has been a fantastic adventure ever since. I have learned something new and valuable from each and every interaction I have had with Luke. He has an infectious quality about him that I have seen impact not just in myself but whomever he is around. His energy seems to be boundless and his creativity off the charts. If you want to drive better results out of your organization and do so while having a genuine good time you need to get Luke and his Innovation Games into your business."
            ],
            [
                "I first met Luke while we were working up a partnership between Enthiosys and GlobalLogic and it has been a fantastic adventure ever since. I have learned something new and valuable from each and every interaction I have had with Luke. He has an infectious quality about him that I have seen impact not just in myself but whomever he is around. His energy seems to be boundless and his creativity off the charts. If you want to drive better results out of your organization and do so while having a genuine good time you need to get Luke and his Innovation Games into your business."
            ],
            [
                "David Brinkley",
                "Director of Distribution & Customer Resources at Roanoke Cement",
                "October 6, 2010, David was a client of Luke’s",
                "Luke's vast knowledge and creative approach was a significant benefit to the success of our project. THANK-YOU LUKE!"
            ],
            [
                "David Brinkley",
                "Director of Distribution & Customer Resources at Roanoke Cement",
                "October 6, 2010, David was a client of Luke’s"
            ],
            [
                "David Brinkley",
                "Director of Distribution & Customer Resources at Roanoke Cement",
                "October 6, 2010, David was a client of Luke’s"
            ],
            [
                "David Brinkley",
                "Director of Distribution & Customer Resources at Roanoke Cement",
                "October 6, 2010, David was a client of Luke’s"
            ],
            "Director of Distribution & Customer Resources at Roanoke Cement",
            [
                "Luke's vast knowledge and creative approach was a significant benefit to the success of our project. THANK-YOU LUKE!"
            ],
            [
                "Luke's vast knowledge and creative approach was a significant benefit to the success of our project. THANK-YOU LUKE!"
            ],
            [
                "gerold kathan",
                "digital strategy and transformation",
                "September 22, 2017, gerold worked with Luke in the same group",
                "I met Gerold (Cactus ;-) when I was working as a strategy consultant for bwin.party. I was immediately drawn to his ability to think strategically about complex problems and to help organizations use frameworks to structure work and visualize how tactical efforts in distributed development teams contributed to larger business goals."
            ],
            [
                "gerold kathan",
                "digital strategy and transformation",
                "September 22, 2017, gerold worked with Luke in the same group"
            ],
            [
                "gerold kathan",
                "digital strategy and transformation",
                "September 22, 2017, gerold worked with Luke in the same group"
            ],
            [
                "gerold kathan",
                "digital strategy and transformation",
                "September 22, 2017, gerold worked with Luke in the same group"
            ],
            "digital strategy and transformation ",
            [
                "I met Gerold (Cactus ;-) when I was working as a strategy consultant for bwin.party. I was immediately drawn to his ability to think strategically about complex problems and to help organizations use frameworks to structure work and visualize how tactical efforts in distributed development teams contributed to larger business goals."
            ],
            [
                "I met Gerold (Cactus ;-) when I was working as a strategy consultant for bwin.party. I was immediately drawn to his ability to think strategically about complex problems and to help organizations use frameworks to structure work and visualize how tactical efforts in distributed development teams contributed to larger business goals."
            ],
            [
                "Gary Green",
                "Leading software development teams to deliver products with meaningful business results",
                "July 19, 2017, Luke was Gary’s teacher",
                "I am very happy to write this recommendation for Gary. I've known him as a friend for several years and can attest to his work ethic and commitment to agile practices. In 2017 Gary lead the effort to manage and prepare the data from our San José citywide participatory budgeting project focused on a Zero-Based Budgeting initiative. He worked very hard to ensure that all facilitators understood their roles and made certain the data was useful to the city, completing all of the work for the city."
            ],
            [
                "Gary Green",
                "Leading software development teams to deliver products with meaningful business results",
                "July 19, 2017, Luke was Gary’s teacher"
            ],
            [
                "Gary Green",
                "Leading software development teams to deliver products with meaningful business results",
                "July 19, 2017, Luke was Gary’s teacher"
            ],
            [
                "Gary Green",
                "Leading software development teams to deliver products with meaningful business results",
                "July 19, 2017, Luke was Gary’s teacher"
            ],
            "Leading software development teams to deliver products with meaningful business results",
            [
                "I am very happy to write this recommendation for Gary. I've known him as a friend for several years and can attest to his work ethic and commitment to agile practices. In 2017 Gary lead the effort to manage and prepare the data from our San José citywide participatory budgeting project focused on a Zero-Based Budgeting initiative. He worked very hard to ensure that all facilitators understood their roles and made certain the data was useful to the city, completing all of the work for the city."
            ],
            [
                "I am very happy to write this recommendation for Gary. I've known him as a friend for several years and can attest to his work ethic and commitment to agile practices. In 2017 Gary lead the effort to manage and prepare the data from our San José citywide participatory budgeting project focused on a Zero-Based Budgeting initiative. He worked very hard to ensure that all facilitators understood their roles and made certain the data was useful to the city, completing all of the work for the city."
            ]
        ],
        "skills": [
            [
                "Product Management",
                "See 532 endorsements for Product Management",
                "99+",
                "Product Management",
                "Endorse",
                "Endorsed by Steve Johnson and 44 others who are highly skilled at this",
                "Endorsed by Vijayant \"VJ\" Kanwar and 2 other mutual connections"
            ],
            [
                "Product Management",
                "See 532 endorsements for Product Management",
                "99+"
            ],
            [
                "Agile Methodologies",
                "See 455 endorsements for Agile Methodologies",
                "99+",
                "Agile Methodologies",
                "Endorse",
                "Endorsed by Gerard Meszaros and 102 others who are highly skilled at this",
                "Endorsed by Vijayant \"VJ\" Kanwar (mutual connection)"
            ],
            [
                "Agile Methodologies",
                "See 455 endorsements for Agile Methodologies",
                "99+"
            ],
            [
                "Strategy",
                "See 406 endorsements for Strategy",
                "99+",
                "Strategy",
                "Endorse",
                "Endorsed by Michael Pierantozzi and 26 others who are highly skilled at this",
                "Endorsed by Vijayant \"VJ\" Kanwar (mutual connection)"
            ],
            [
                "Strategy",
                "See 406 endorsements for Strategy",
                "99+"
            ]
        ],
        "summary": "    Luke Hohmann is the Founder and CEO of Conteneo, Inc. Grounded in the science of play, Conteneo’s enterprise software platforms and professional services merge serious games, data analytics, domain expertise and collaboration to help enterprises optimize decision making in the areas of strategy, innovation, sales, product development and market research. Conteneo has a wide array of customers from startups to Fortune 500 enterprises including HP, Adobe, Rackspace, Serena Software, Oracle, Cisco and Reed Elsevier among others. These customers are currently using Conteneo to help solve their truly enduring problems: identifying unmet needs, developing and aligning on strategic choices, creating compelling offerings, and improving delivery processes.Conteneo's brands include Weave, Innovation Games®, Knowsy®, Common Ground for Action and Trilicious. Luke's is also the co-founder of Every Voice Engaged Foundation, a 501 3(c) nonprofit that that helps citizens, governments and nonprofit organizations collaboratively solve problems that are unsolvable without civic engagement. EVEF has been a leader in the Participatory Budgeting movement, helping citizens prioritize hundreds of millions of dollars through Budget Games. A former United States National Junior Pairs Figure Skating Champion, in his spare time, Luke likes roughhousing with his four kids, his wife’s cooking, and long runs in the Santa Cruz mountains. Luke’s an old school Silicon Valley entrepreneur. Instead of building a company to flip, he’s building a company to change the world.\n  \n  \n",
        "name": "Luke Hohmann",
        "title": "Founder and CEO at Conteneo, Inc.",
        "url": "linkedin.com/in/lukehohmann",
        "phone": "+14085290319 (Mobile)",
        "email": "luke.hohmann@conteneo.co"
    }
]