[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "118 Mutual Connections",
                "You and Babak both know Ed Nusbaum, Marc Burch, and 116 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Founder, CEO",
                "Company Name",
                "Kazzit - Where the Wine Grows",
                "Dates Employed",
                "Jan 2014 – Present",
                "Employment Duration",
                "3 yrs 11 mos",
                "Location",
                "Scottsdale, AZ",
                "Kazzit is the most comprehensive online informational resource within the wine community by connecting wineries, vineyards, restaurateurs, collectors, and enthusiasts and to help them share information about their services, products, experiences and consumer needs.Kazzit adds value for both producers and customers alike. For producers, Kazzit provides a professional-looking platform where your winery or vineyard can be easily discovered by actively looking customers. With a variety of service offerings, Kazzit provides simple yet beautiful customer-oriented knowledge management solution for every size business, from boutique local growers to nationwide industry leaders. For buyers, Kazzit matches customers with specific wineries and vineyards via customizable searches based on geography, varietals, and reviews. Customers are presented with producer-generated media including virtual tours, videos, photos, and other information that allows producers to tell their story and present their products to actively searching customers.",
                "Media (2)",
                "This position has 2 media",
                "Kazzit - Your International Winery Guide",
                "Kazzit - Your International Winery Guide",
                "This media is a video",
                "Kazzit - Best US Wineries, International Winery Guide",
                "Kazzit - Best US Wineries, International Winery Guide",
                "This media is a link"
            ],
            [
                "Founder/Managing Director",
                "Company Name",
                "Aufarin Advisory Group",
                "Dates Employed",
                "Jan 2008 – Present",
                "Employment Duration",
                "9 yrs 11 mos",
                "Location",
                "Washington, DC/ Los Angeles, CA",
                "At Aufarin Advisory Group (AAG), we’ve always liked to think that we’re defined as much by who our customers are as by what we do. As a specialty consulting firm providing expertise in the areas of corporate structure, finance, business development, product management and more, we’ve developed a process of working closely with a diverse range of business types. It is that diversity of experience that has helped to make us the premiere advisory and consulting firm we are today.Since our founding in 2010, AAG has served clients of every imaginable size. We’ve consulted for small startup enterprises and provided similar services on a larger scale to huge corporations. From our offices in the United States and overseas, the members of our expert team have brought their decades of experience and achievements to bear in every project they’ve done. Their success at helping all our clients is evidenced by the awards they’ve won and the satisfied responses of our customers.Sample projects below: Advised and led negotiations with the City of Gwangju, South Korea for the sale and implementation of a $300M post-production and 3D conversion film studio; initiated sales of additional facilities to parties in Singapore and France; and developed relationships with library owners (Warner Brother, MGM, and CBS) for 3D content conversionEstablished trade relations on behalf of client with the governments of Angola, Burkina Faso, Peru, and Mexico through direct negotiations with their ambassadors and other high-level officials Negotiated licensing agreement with Advanced Green Innovation (“AGI”) for developing their sales pipeline. Secured contracts with Wal-Mart, Target, Airgas and Orscheln Industries and led discussions with the Egyptian and Mexican Ministers of Energy regarding the potential use of AGI technology",
                "Media (1)",
                "This position has 1 media",
                "Aufarin | Business Consulting",
                "Aufarin | Business Consulting",
                "This media is a link"
            ],
            [
                "CEO",
                "Company Name",
                "VC Dynamics",
                "Dates Employed",
                "Feb 2013 – Nov 2014",
                "Employment Duration",
                "1 yr 10 mos",
                "Location",
                "Scottsdale, AZ",
                "Originally retained for business development consulting services to aid in avoiding dissolution of the business and later asked to become CEO.Reorganized business structure and revenue models, avoiding collapse of business and resulting in $6M in net revenue during first year of management and $14M in net revenue during year two.Expansion of business model into multiple verticals creating multiple revenue streams which resulted in the strategic sales of the business with unanimous board approval.---VC Dynamics provides internet marketing services to businesses, small-to-large, looking to expand its number one resource, customers. Whether you need more patients, clients, customers, leads, online presence and more.VC Dynamics understands the importance of marketing, but more importantly knows that converting marketing dollars into sales is the key to success. The principals of VC Dynamics has a diverse background as entrepreneurs that gives insight beyond the technology related to internet marketing. We know internet marketing is good but only great when coupled with an effective strategy tied closely to the particular industry operated by its various clients at an affordable price.VC Dynamics achieves this strategy by the use of three distinct categories, search engine saturation, business directory saturation and social saturation.In addition to the background of the principals and a proprietary technology that is above the rest, VC Dynamics achieves the results you want by taking the guess work out of it. Simply put, our solution provides targeted, filtered and qualified leads.We look at your target market, geo, demographics, age, and more. We then create a targeted campaign on this filtered data and deliver qualified leads that want to talk to you not just clicks, visitors or calls. Anyone can give you that but we choose not to as our solution is centralized around you and not us."
            ],
            [
                "Founder",
                "Company Name",
                "MonkeyTek",
                "Dates Employed",
                "2012 – 2013",
                "Employment Duration",
                "1 yr",
                "Location",
                "Phoenix, AZ",
                "MonkeyTek offeed products that are highly functional and never boring. Your possessions say a lot about who you are, and with MonkeyTek accessories you communicate to everyone that you are a modern individual who cares about style as much as function. MonkeyTek produced premium cases, battery backs, and other accessories for your mobile life. Since we create our own products, we are able to customize any large order to your exact needs.In 2013 I sold the MonkeyTek brand to a strategic buyer."
            ],
            [
                "President",
                "Company Name",
                "The Walkabout Group",
                "Dates Employed",
                "2002 – 2008",
                "Employment Duration",
                "6 yrs",
                "Location",
                "Phoenix, AZ",
                "Assembled and converted a $2.3B portfolio of distressed properties located throughout the United States to four- and five-star hotel properties involving strategic relationships with domestic and international finance partners and internationally branded hotels including Sage Hospitality Starwood, Hilton, and MarriottDeveloped a residential luxury subdivision consisting of sixteen homes with a total area of 128,000 square feet and completed value of $28.8M Achieved a development portfolio including nearly every type of construction project including office, single-family residential, multi-tenant retail, and luxury residential developments across the western United States"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Portland State University",
                "Field Of Study",
                "Business Administration and Management, General",
                "Dates attended or expected graduation",
                "1998 – 2000"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Clothing Drive Volunteer",
                "Company Name",
                "Save the Family Foundation of Arizona",
                "Dates volunteered",
                "Jan 2006 – Jan 2006",
                "Volunteer duration",
                "1 mo",
                "Cause",
                "Children"
            ],
            [
                "Clothing Drive Volunteer",
                "Company Name",
                "Save the Family Foundation of Arizona",
                "Dates volunteered",
                "Jan 2006 – Jan 2006",
                "Volunteer duration",
                "1 mo",
                "Cause",
                "Children"
            ],
            [
                "Volunteer",
                "Company Name",
                "Boys & Girls Clubs of America",
                "Dates volunteered",
                "2008 – 2010",
                "Volunteer duration",
                "2 yrs",
                "Cause",
                "Children"
            ],
            [
                "Volunteer",
                "Company Name",
                "Boys & Girls Clubs of America",
                "Dates volunteered",
                "2008 – 2010",
                "Volunteer duration",
                "2 yrs",
                "Cause",
                "Children"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 47 more skills"
            ],
            "Recommendations",
            [
                "Hotel Group Network",
                "219,857 members"
            ],
            [
                "Kendall-Jackson Wine Estates",
                "4,694 followers"
            ],
            [
                "Private Equity Investment Group | PrivateEquity.com",
                "186,635 members"
            ],
            [
                "iWineRadio, Wine and Dine Radio",
                "65 followers"
            ],
            [
                "CampusPoint",
                "1,002 followers"
            ],
            [
                "Wine2.0",
                "14,217 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Hotel Group Network",
                "219,857 members"
            ],
            [
                "Hotel Group Network",
                "219,857 members"
            ],
            [
                "Kendall-Jackson Wine Estates",
                "4,694 followers"
            ],
            [
                "Kendall-Jackson Wine Estates",
                "4,694 followers"
            ],
            [
                "Private Equity Investment Group | PrivateEquity.com",
                "186,635 members"
            ],
            [
                "Private Equity Investment Group | PrivateEquity.com",
                "186,635 members"
            ],
            [
                "iWineRadio, Wine and Dine Radio",
                "65 followers"
            ],
            [
                "iWineRadio, Wine and Dine Radio",
                "65 followers"
            ],
            [
                "CampusPoint",
                "1,002 followers"
            ],
            [
                "CampusPoint",
                "1,002 followers"
            ],
            [
                "Wine2.0",
                "14,217 members"
            ],
            [
                "Wine2.0",
                "14,217 members"
            ]
        ],
        "recommendations": [
            [
                "Matt Nixon",
                "Can technology help us to be more effectively Human? (Analytics, Automation, Cloud, Security)",
                "March 20, 2016, Matt worked with Babak but at different companies",
                "It is truly rare to encounter someone with Babak's combination of strategic innovation, contagious enthusiasm, and gracious spirit. He is not only disrupting, but reimagining the winery booking market, and his success to date comes as no surprise to anyone who's worked with him. If you have the opportunity to work with Babak in any capacity, I would recommend taking full advantage."
            ],
            [
                "Matt Nixon",
                "Can technology help us to be more effectively Human? (Analytics, Automation, Cloud, Security)",
                "March 20, 2016, Matt worked with Babak but at different companies"
            ],
            [
                "Matt Nixon",
                "Can technology help us to be more effectively Human? (Analytics, Automation, Cloud, Security)",
                "March 20, 2016, Matt worked with Babak but at different companies"
            ],
            [
                "Matt Nixon",
                "Can technology help us to be more effectively Human? (Analytics, Automation, Cloud, Security)",
                "March 20, 2016, Matt worked with Babak but at different companies"
            ],
            "Can technology help us to be more effectively Human? (Analytics, Automation, Cloud, Security)",
            [
                "It is truly rare to encounter someone with Babak's combination of strategic innovation, contagious enthusiasm, and gracious spirit. He is not only disrupting, but reimagining the winery booking market, and his success to date comes as no surprise to anyone who's worked with him. If you have the opportunity to work with Babak in any capacity, I would recommend taking full advantage."
            ],
            [
                "It is truly rare to encounter someone with Babak's combination of strategic innovation, contagious enthusiasm, and gracious spirit. He is not only disrupting, but reimagining the winery booking market, and his success to date comes as no surprise to anyone who's worked with him. If you have the opportunity to work with Babak in any capacity, I would recommend taking full advantage."
            ],
            [
                "Lynn Krielow Chamberlain",
                "NSF ATE Project Director for Pacific Northwest Wine Education Collaborative at Yakima Valley College",
                "August 22, 2015, Lynn Krielow worked with Babak in different groups",
                "LinkedIn is a wonderful way to connect to people in the wine industry.  I am amazed at the opportunities that Babak's new Kazzit online resource will provide in the ongoing effort to bring people together for mutual benefit.  His work and travel experience is amazing for one so young. His competency in multiple languages is a real plus that few individuals can lay claim to.  He is creative, driven, resourceful, and well spoken.  It has been my pleasure making his acquaintance via iWineRadio and I hope to continue the relationship with future conversations via Kazzit's platform."
            ],
            [
                "Lynn Krielow Chamberlain",
                "NSF ATE Project Director for Pacific Northwest Wine Education Collaborative at Yakima Valley College",
                "August 22, 2015, Lynn Krielow worked with Babak in different groups"
            ],
            [
                "Lynn Krielow Chamberlain",
                "NSF ATE Project Director for Pacific Northwest Wine Education Collaborative at Yakima Valley College",
                "August 22, 2015, Lynn Krielow worked with Babak in different groups"
            ],
            [
                "Lynn Krielow Chamberlain",
                "NSF ATE Project Director for Pacific Northwest Wine Education Collaborative at Yakima Valley College",
                "August 22, 2015, Lynn Krielow worked with Babak in different groups"
            ],
            "NSF ATE Project Director for Pacific Northwest Wine Education Collaborative at Yakima Valley College",
            [
                "LinkedIn is a wonderful way to connect to people in the wine industry.  I am amazed at the opportunities that Babak's new Kazzit online resource will provide in the ongoing effort to bring people together for mutual benefit.  His work and travel experience is amazing for one so young. His competency in multiple languages is a real plus that few individuals can lay claim to.  He is creative, driven, resourceful, and well spoken.  It has been my pleasure making his acquaintance via iWineRadio and I hope to continue the relationship with future conversations via Kazzit's platform."
            ],
            [
                "LinkedIn is a wonderful way to connect to people in the wine industry.  I am amazed at the opportunities that Babak's new Kazzit online resource will provide in the ongoing effort to bring people together for mutual benefit.  His work and travel experience is amazing for one so young. His competency in multiple languages is a real plus that few individuals can lay claim to.  He is creative, driven, resourceful, and well spoken.  It has been my pleasure making his acquaintance via iWineRadio and I hope to continue the relationship with future conversations via Kazzit's platform."
            ],
            [
                "Cornelia Thompson, MBA",
                "Accounting Specialist",
                "July 16, 2015, Cornelia reported directly to Babak",
                "I had the opportunity to work under the direction of Babak Motamedi at VC Dynamics, Inc.  As CEO he was the driving force which catapulted VC Dynamics from an unknown to an industry leader in less than a year.  Mr. Motamedi has a proven track record of explosive sales increase and business acumen.  He turned a business start up into a multi million dollar producing company.  Lead Generation is a fast growing and fast moving industry, which requires expert insight, coupled with drive and determination; Babak brought all of this to VC Dynamics.He is the go-to-guy for forging the right marketing mix and strategy to hedge forward in an ever-changing industry. Babak's candor was vividly noticeable in every aspect of VC Dynamics.  He was truly inspiring and taught all of us not just myself to set the bar higher and how to cut a path through the impossible.  He was the glue that brought it all together."
            ],
            [
                "Cornelia Thompson, MBA",
                "Accounting Specialist",
                "July 16, 2015, Cornelia reported directly to Babak"
            ],
            [
                "Cornelia Thompson, MBA",
                "Accounting Specialist",
                "July 16, 2015, Cornelia reported directly to Babak"
            ],
            [
                "Cornelia Thompson, MBA",
                "Accounting Specialist",
                "July 16, 2015, Cornelia reported directly to Babak"
            ],
            "Accounting Specialist",
            [
                "I had the opportunity to work under the direction of Babak Motamedi at VC Dynamics, Inc.  As CEO he was the driving force which catapulted VC Dynamics from an unknown to an industry leader in less than a year.  Mr. Motamedi has a proven track record of explosive sales increase and business acumen.  He turned a business start up into a multi million dollar producing company.  Lead Generation is a fast growing and fast moving industry, which requires expert insight, coupled with drive and determination; Babak brought all of this to VC Dynamics.He is the go-to-guy for forging the right marketing mix and strategy to hedge forward in an ever-changing industry. Babak's candor was vividly noticeable in every aspect of VC Dynamics.  He was truly inspiring and taught all of us not just myself to set the bar higher and how to cut a path through the impossible.  He was the glue that brought it all together."
            ],
            [
                "I had the opportunity to work under the direction of Babak Motamedi at VC Dynamics, Inc.  As CEO he was the driving force which catapulted VC Dynamics from an unknown to an industry leader in less than a year.  Mr. Motamedi has a proven track record of explosive sales increase and business acumen.  He turned a business start up into a multi million dollar producing company.  Lead Generation is a fast growing and fast moving industry, which requires expert insight, coupled with drive and determination; Babak brought all of this to VC Dynamics.He is the go-to-guy for forging the right marketing mix and strategy to hedge forward in an ever-changing industry. Babak's candor was vividly noticeable in every aspect of VC Dynamics.  He was truly inspiring and taught all of us not just myself to set the bar higher and how to cut a path through the impossible.  He was the glue that brought it all together."
            ],
            [
                "Matt Troyky",
                "Creative Director at Kazzit.com/Herban Planet.com",
                "July 10, 2015, Babak was a client of Matt’s",
                "Working with Babak has been nothing but a pleasure. He is extremely competent, results-driven and efficient. His track record of success speaks for itself. I would recommend his services to anyone with complete confidence."
            ],
            [
                "Matt Troyky",
                "Creative Director at Kazzit.com/Herban Planet.com",
                "July 10, 2015, Babak was a client of Matt’s"
            ],
            [
                "Matt Troyky",
                "Creative Director at Kazzit.com/Herban Planet.com",
                "July 10, 2015, Babak was a client of Matt’s"
            ],
            [
                "Matt Troyky",
                "Creative Director at Kazzit.com/Herban Planet.com",
                "July 10, 2015, Babak was a client of Matt’s"
            ],
            "Creative Director at Kazzit.com/Herban Planet.com",
            [
                "Working with Babak has been nothing but a pleasure. He is extremely competent, results-driven and efficient. His track record of success speaks for itself. I would recommend his services to anyone with complete confidence."
            ],
            [
                "Working with Babak has been nothing but a pleasure. He is extremely competent, results-driven and efficient. His track record of success speaks for itself. I would recommend his services to anyone with complete confidence."
            ],
            [
                "J. Christian Olin",
                "Vice President of Sales and Business Development",
                "July 10, 2015, Babak was senior to J. Christian but didn’t manage directly",
                "I worked with Babak for about 2 years as his VP of Sales.  Throughout this time he was supportive,positive and always had time to jump in and get his hands dirty if asked.  His leadership was respected and admired from the bottom up. As a CEO his management style is only surpassed by his ability to think outside the box and get things done."
            ],
            [
                "J. Christian Olin",
                "Vice President of Sales and Business Development",
                "July 10, 2015, Babak was senior to J. Christian but didn’t manage directly"
            ],
            [
                "J. Christian Olin",
                "Vice President of Sales and Business Development",
                "July 10, 2015, Babak was senior to J. Christian but didn’t manage directly"
            ],
            [
                "J. Christian Olin",
                "Vice President of Sales and Business Development",
                "July 10, 2015, Babak was senior to J. Christian but didn’t manage directly"
            ],
            "Vice President of Sales and Business Development",
            [
                "I worked with Babak for about 2 years as his VP of Sales.  Throughout this time he was supportive,positive and always had time to jump in and get his hands dirty if asked.  His leadership was respected and admired from the bottom up. As a CEO his management style is only surpassed by his ability to think outside the box and get things done."
            ],
            [
                "I worked with Babak for about 2 years as his VP of Sales.  Throughout this time he was supportive,positive and always had time to jump in and get his hands dirty if asked.  His leadership was respected and admired from the bottom up. As a CEO his management style is only surpassed by his ability to think outside the box and get things done."
            ],
            [
                "Erica Sorensen",
                "Senior Content Curator at Kazzit",
                "July 10, 2015, Erica reported directly to Babak",
                "I have had the privilege of working with Babak for almost three years now and I can say he is the best boss I've ever had the pleasure of working with. He is very personable and has always given me guidance to expand my skills. As an extremely driven individual, he doesn't quit until the job is done. If you're looking for a smart, respectful, and driven leader, then Babak is your guy!"
            ],
            [
                "Erica Sorensen",
                "Senior Content Curator at Kazzit",
                "July 10, 2015, Erica reported directly to Babak"
            ],
            [
                "Erica Sorensen",
                "Senior Content Curator at Kazzit",
                "July 10, 2015, Erica reported directly to Babak"
            ],
            [
                "Erica Sorensen",
                "Senior Content Curator at Kazzit",
                "July 10, 2015, Erica reported directly to Babak"
            ],
            "Senior Content Curator at Kazzit",
            [
                "I have had the privilege of working with Babak for almost three years now and I can say he is the best boss I've ever had the pleasure of working with. He is very personable and has always given me guidance to expand my skills. As an extremely driven individual, he doesn't quit until the job is done. If you're looking for a smart, respectful, and driven leader, then Babak is your guy!"
            ],
            [
                "I have had the privilege of working with Babak for almost three years now and I can say he is the best boss I've ever had the pleasure of working with. He is very personable and has always given me guidance to expand my skills. As an extremely driven individual, he doesn't quit until the job is done. If you're looking for a smart, respectful, and driven leader, then Babak is your guy!"
            ],
            [
                "Aaron Williams Security Consultant, TSCM, Executive Protection",
                "Senior Analyst for Enterprise Operational Security at T-Mobile",
                "January 15, 2013, Aaron Williams worked with Babak but at different companies",
                "It has been my great pleasure to work with Babak on various projects throughout the years. His business acumen, negotiation skills, and project leadership experience are superior to those 20 years his senior. Babak's assistance and guidance with my latest venture has helped make my business profitable after a year of operation. Babak is a phenomenal business consultant and I will continue to seek his services as I grow my business."
            ],
            [
                "Aaron Williams Security Consultant, TSCM, Executive Protection",
                "Senior Analyst for Enterprise Operational Security at T-Mobile",
                "January 15, 2013, Aaron Williams worked with Babak but at different companies"
            ],
            [
                "Aaron Williams Security Consultant, TSCM, Executive Protection",
                "Senior Analyst for Enterprise Operational Security at T-Mobile",
                "January 15, 2013, Aaron Williams worked with Babak but at different companies"
            ],
            [
                "Aaron Williams Security Consultant, TSCM, Executive Protection",
                "Senior Analyst for Enterprise Operational Security at T-Mobile",
                "January 15, 2013, Aaron Williams worked with Babak but at different companies"
            ],
            "Senior Analyst for Enterprise Operational Security at T-Mobile",
            [
                "It has been my great pleasure to work with Babak on various projects throughout the years. His business acumen, negotiation skills, and project leadership experience are superior to those 20 years his senior. Babak's assistance and guidance with my latest venture has helped make my business profitable after a year of operation. Babak is a phenomenal business consultant and I will continue to seek his services as I grow my business."
            ],
            [
                "It has been my great pleasure to work with Babak on various projects throughout the years. His business acumen, negotiation skills, and project leadership experience are superior to those 20 years his senior. Babak's assistance and guidance with my latest venture has helped make my business profitable after a year of operation. Babak is a phenomenal business consultant and I will continue to seek his services as I grow my business."
            ],
            [
                "Karin O'Brien",
                "Clinical Nurse Specialist",
                "October 7, 2015, Babak worked with Karin but at different companies",
                "My name is Babak Motamedi & I am the founder & CEO of Kazzit, the worlds most comprehensive winery guide.  Karin extended and invitation for a interview to share Kazzit with her audience.  I found per process, demeanor and conduct to be exceptional.  Her interviewing skill are excellent as well as how she tells the story.  I was very happy with the experience and the outcome."
            ],
            [
                "Karin O'Brien",
                "Clinical Nurse Specialist",
                "October 7, 2015, Babak worked with Karin but at different companies"
            ],
            [
                "Karin O'Brien",
                "Clinical Nurse Specialist",
                "October 7, 2015, Babak worked with Karin but at different companies"
            ],
            [
                "Karin O'Brien",
                "Clinical Nurse Specialist",
                "October 7, 2015, Babak worked with Karin but at different companies"
            ],
            "Clinical Nurse Specialist ",
            [
                "My name is Babak Motamedi & I am the founder & CEO of Kazzit, the worlds most comprehensive winery guide.  Karin extended and invitation for a interview to share Kazzit with her audience.  I found per process, demeanor and conduct to be exceptional.  Her interviewing skill are excellent as well as how she tells the story.  I was very happy with the experience and the outcome."
            ],
            [
                "My name is Babak Motamedi & I am the founder & CEO of Kazzit, the worlds most comprehensive winery guide.  Karin extended and invitation for a interview to share Kazzit with her audience.  I found per process, demeanor and conduct to be exceptional.  Her interviewing skill are excellent as well as how she tells the story.  I was very happy with the experience and the outcome."
            ]
        ],
        "skills": [
            [
                "Marketing",
                "See 97 endorsements for Marketing",
                "97",
                "Marketing",
                "Endorse",
                "Endorsed by Andrew Goodstein and 3 others who are highly skilled at this",
                "Endorsed by Samir Trivedi and 1 other mutual connection"
            ],
            [
                "Marketing",
                "See 97 endorsements for Marketing",
                "97"
            ],
            [
                "Leadership",
                "See 82 endorsements for Leadership",
                "82",
                "Leadership",
                "Endorse",
                "Endorsed by Jeremy Crance and 1 other who is highly skilled at this",
                "Endorsed by Douglas Teitel (mutual connection)"
            ],
            [
                "Leadership",
                "See 82 endorsements for Leadership",
                "82"
            ],
            [
                "Start-ups",
                "See 81 endorsements for Start-ups",
                "81",
                "Start-ups",
                "Endorse",
                "Endorsed by Samir Trivedi (mutual connection)",
                "Endorsed by 3 of Babak’s colleagues at Kazzit"
            ],
            [
                "Start-ups",
                "See 81 endorsements for Start-ups",
                "81"
            ]
        ],
        "summary": "    Babak Motamedi holds more than 18 years of experience in a variety of business fields including International Business Negotiation, Business Consulting, Business Management, Entrepreneurship, Real Estate Development, Capital Acquisition, Project Management, and General Contracting.After being General Manager, he had gained enough experience and skills to become President and CEO for various companies, including a business consulting company and a real estate development firm. He maintained this profession option from 2001 to present day. Babak has not only achieved expert status in his career but also enjoys what he does immensely.Working for so many companies and venturing into multiple fields, Babak Motamedi has experience working in South Korea, China, Hong Kong, Thailand, Argentina, Iceland, and USA. He has managed, supervised, and completed the operational checks on countless projects and business operations, which enhanced his communication, leadership, groupthink, risk mitigation, and many other skills.Being a work-oriented person, Babak hold additional skills in contact law, international banking, startups, corporate structuring, and more. All these skills, including the professional skills he has acquired make him an expert and knowledgeable project and business manager. Babak Motamedi’s style and shade of work is one of dedication, passion, and enthusiasm. He loves a challenge and never backs down from them – in fact, he remains set on finding a solution rather than giving up. He has worked with countless clients, partners, customers, and employers, in multiple countries and has enjoyed great business relationships with all of them, maintained in a professional yet friendly manner. Through his style of work, manner of work, and work ethics based on integrity, dedication, and hard work, he is a positive, professional, and competent person to work with.Babak’s dedication to his commitments, be they personal or professional, reflect his personality.\n  \n  \n",
        "name": "Babak Motamedi",
        "title": "Founder, CEO at Kazzit - Where the Wine Grows",
        "url": "linkedin.com/in/bmotamedi",
        "phone": "602-399-7396 (Work)",
        "email": "babak@aufarin.com"
    }
]