[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "79 Mutual Connections",
                "You and Rajesh both know Anila Arthanari, Bernard Ong, and 77 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "CEO/CTO",
                "Company Name",
                "TechMileage Software Solutions",
                "Dates Employed",
                "Aug 2008 – Present",
                "Employment Duration",
                "9 yrs 4 mos",
                "Location",
                "Tempe / Phoenix AZ",
                "Maintain executive level relationships with partners and clients. Lead and develop company's technology & business strategy. - Providing technology solutions to clients with complex business problems- Lead company's cutting edge portfolio with technologies like Big Data, Mobile development - Lead company's growth in applying Machine learning and Predictive modeling - Established the company's strength as a partner of Cloudera, IBM etc.- Helped build new services around model governance for banks- Identified areas of technology development and acquired relevant certifications- Support in application development and other IT services- Create new partnership opportunities for the company - Drive company towards new technology areas to increase revenue- Attend local mixers, and develops relationships to sustain growth of the company.- Develop Business Plans and cash flow projections- Leading company-wide community of consultants - Established a global delivery modelHelped TechMileage acquire clients like Large Bank, Large healthcare organization, Sears Holding, Cableone, Netgear, Apollo Group, Matson Navigation, Large Financial Organizations and Avnet. Helped TechMileage to grow in cutting edge areas like Bigdata, Machine learning, Advanced Analytics etc."
            ],
            [
                "Lead Technical Architect",
                "Company Name",
                "American Express",
                "Dates Employed",
                "Sep 2009 – Mar 2012",
                "Employment Duration",
                "2 yrs 7 mos",
                "Location",
                "Phoenix",
                "Lead Architect for Web Analytics, Application development and Data migration platforms. Drove innovative ideas to centralize the global web analytics solutions. Helped American Express in an enterprise wide initiative of integrating online analytics data with offline analytics data to calculate ROI on different business initiatives. A huge addition to American Express campaign management capability.Executed projects estimating 4+ million in cost per year. Biggest project being 2+ millionEstablished the team of 30+ resources including software engineers, managers and business analysts.Lead integration of 200+ web analytics integration projects world wide in different technologies including java, .net, Mobile.Lead 14+ ETL project involving huge infrastructure redesign projects. Set up the Integration Best Practices and Architecture Solutions Strategy.Lead cost saving initiatives in different areas including web analytics, interactive offline reporting and emerging mobile platforms.Managing and Mentoring team for enterprise wide and share holder goalsExecuted development projects in agile methodology.Technologies Included Java/J2EE, Mobile, Web Services (SOAP, XML WSDL, MQ Series, Websphere), ETL, Informatica, DB2 etc."
            ],
            [
                "Senior Consultant/Architect",
                "Company Name",
                "Prolifics",
                "Dates Employed",
                "May 2007 – Feb 2009",
                "Employment Duration",
                "1 yr 10 mos",
                "Location",
                "New York / Phoenix",
                "Manage and guide technical strategy, product positioning and enablement for Tivoli Business Automation, Security and Websphere XD product lines- Provided Integration Best Practices and Architecture Solutions Strategy white paper- Interviewed Business Line IT and assessed current state and future requirements- Conducted Needs and GAP Analysis – Physical and Logical States- Formulated Vision and Scope for Integration Architecture- Integration Architecture with Web Services (MQSeries, WMQI, Websphere, J2EE, Portal )"
            ],
            [
                "Business Development",
                "Company Name",
                "IntraEdge Inc",
                "Dates Employed",
                "2007 – 2009",
                "Employment Duration",
                "2 yrs"
            ],
            [
                "Programmer analyst",
                "Company Name",
                "TSYS",
                "Dates Employed",
                "Jan 2005 – May 2007",
                "Employment Duration",
                "2 yrs 5 mos"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Indian Institute of Technology, Delhi",
                "Degree Name",
                "B Tech",
                "Field Of Study",
                "Chemical Engineering",
                "Dates attended or expected graduation",
                "1997 – 2001"
            ],
            [
                "Indian Institute of Technology, Delhi",
                "Degree Name",
                "B Tech",
                "Field Of Study",
                "Chemical Engineering",
                "Dates attended or expected graduation",
                "1997 – 2001"
            ],
            [
                "Sainik School Ghorakhal",
                "Degree Name",
                "High School",
                "Dates attended or expected graduation",
                "1989 – 1996"
            ],
            [
                "Sainik School Ghorakhal",
                "Degree Name",
                "High School",
                "Dates attended or expected graduation",
                "1989 – 1996"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "The Clorox Company",
                "121,589 followers"
            ],
            [
                "IMS - Integrated Mechanization Solutions",
                "740 followers"
            ],
            [
                "National Bank of Arizona",
                "2,314 followers"
            ],
            [
                "MongoDB",
                "45,030 followers"
            ],
            [
                "The 41st Parameter",
                "1,637 followers"
            ],
            [
                "Indian Institute of Technology, Delhi",
                "59,959 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "The Clorox Company",
                "121,589 followers"
            ],
            [
                "The Clorox Company",
                "121,589 followers"
            ],
            [
                "IMS - Integrated Mechanization Solutions",
                "740 followers"
            ],
            [
                "IMS - Integrated Mechanization Solutions",
                "740 followers"
            ],
            [
                "National Bank of Arizona",
                "2,314 followers"
            ],
            [
                "National Bank of Arizona",
                "2,314 followers"
            ],
            [
                "MongoDB",
                "45,030 followers"
            ],
            [
                "MongoDB",
                "45,030 followers"
            ],
            [
                "The 41st Parameter",
                "1,637 followers"
            ],
            [
                "The 41st Parameter",
                "1,637 followers"
            ],
            [
                "Indian Institute of Technology, Delhi",
                "59,959 followers"
            ],
            [
                "Indian Institute of Technology, Delhi",
                "59,959 followers"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Enterprise Software",
                "See 89 endorsements for Enterprise Software",
                "89",
                "Enterprise Software",
                "Endorse",
                "Endorsed by Michael Chapman and 2 others who are highly skilled at this",
                "Endorsed by Thiru Thangarathinam and 2 other mutual connections"
            ],
            [
                "Enterprise Software",
                "See 89 endorsements for Enterprise Software",
                "89"
            ],
            [
                "Cloud Computing",
                "See 76 endorsements for Cloud Computing",
                "76",
                "Cloud Computing",
                "Endorse",
                "Endorsed by Michael Chapman and 4 others who are highly skilled at this",
                "Endorsed by Thiru Thangarathinam and 2 other mutual connections"
            ],
            [
                "Cloud Computing",
                "See 76 endorsements for Cloud Computing",
                "76"
            ],
            [
                "Databases",
                "See 59 endorsements for Databases",
                "59",
                "Databases",
                "Endorse",
                "Endorsed by Ram Sivaguru and 1 other who is highly skilled at this",
                "Endorsed by Glen Chamberlain and 2 other mutual connections"
            ],
            [
                "Databases",
                "See 59 endorsements for Databases",
                "59"
            ],
            [
                "Mobile Applications",
                "See 44 endorsements for Mobile Applications",
                "44",
                "Mobile Applications",
                "Endorse"
            ],
            [
                "Mobile Applications",
                "See 44 endorsements for Mobile Applications",
                "44"
            ],
            [
                "Web Analytics",
                "See 29 endorsements for Web Analytics",
                "29",
                "Web Analytics",
                "Endorse"
            ],
            [
                "Web Analytics",
                "See 29 endorsements for Web Analytics",
                "29"
            ]
        ],
        "summary": "    Entrepreneur with excellent experience in information technology. Diverse background with technologies and business domains. Have managed multi-million Dollar portfolios. Results oriented and hard working individual. Able to provide - - Outstanding expertise in Software/Web Application Development- High performance solutions with Big Data, Hadoop, Cassandra, HBase & Cloud Computing- Predictive Analytics, Machine learning  & Modeling complex solutions- Databases, Data Migrations, ETL,Business Intelligence and other software services- Mobile Development - iOS, Android & Windows- Sharepoint, Domino development and migration- Enterprise Web Analytics and SEO- Domain knowledge - Finance, Logistics, Retail, Education, Healtcare, Software - IBM, Open source, Microsoft platforms- Building strong and well-rounded teams- Competitive prices and QualitySpecialties: Strong technology background, Enterprise software applications, Big Data, All aspects of product/application development, Advanced Analytics, Warehouse/Logistics, Web Analytics, Enterprise Mobile Development, Outsourcing – offshore and onshore\n  \n  \n",
        "name": "Rajesh Kumar",
        "title": "CEO/CTO at TechMileage Software Solutions",
        "url": "linkedin.com/in/rajeshkum",
        "phone": "",
        "email": "rajeshkr.79@gmail.com"
    }
]