[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "207 Mutual Connections",
                "You and Carine both know Eric Keosky-Smith, Ed Nusbaum, and 205 others"
            ],
            [
                "If you are an entrepreneur, an aspiring entrepreneur, or already in the Phoenix startup ecosystem and you don't know who Stephen Viramontes is, I highly suggest you change that!",
                "I had the pleasure of hosting him on the Dawn of the Devs podcast this morning, and he BLEW ME AWAY with his unique story of entrepreneurship challenges, setbacks, and ultimate successes.",
                "When you chat with V (as he calls himself) you can tell immediately that not only is he passionate about entrepreneurship & business in general, but also about protecting and growing our local startup ecosystem here in Phoenix.",
                "V is a huge startup advocate here in Phoenix, and we are extremely lucky to have him!",
                "PS. He is also the Chief Organizer of Phx Startup Week (coming to you February 19th-23rd) so keep an eye out for programming updates soon!",
                "#YesPHX #PhxStartupWeek",
                "Carine liked"
            ],
            [
                "Did you know that you can catch a ride & help us out! Download @lyft w/code \"GIRLSINTECHPHX.\" We get a $10 donation & you get a Lyft discount!",
                "Carine shared this"
            ],
            [
                "Who's coming tomorrow? #GITPHX #yesphx #asuventuredevils",
                "Carine shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Commercial Reviewer",
                "Company Name",
                "National Science Foundation SBIR/STTR",
                "Dates Employed",
                "Jul 2017 – Present",
                "Employment Duration",
                "4 mos",
                "Location",
                "Washington D.C. Metro Area"
            ],
            [
                "Venture Devils Mentor",
                "Company Name",
                "Arizona State University",
                "Dates Employed",
                "May 2017 – Present",
                "Employment Duration",
                "6 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Educate and challenge the iterative advancement of the founder(s) and their affiliated venture(s)."
            ],
            [
                "Board Member - Mentorship Chair",
                "Company Name",
                "Girls in Tech Phoenix",
                "Dates Employed",
                "Mar 2017 – Present",
                "Employment Duration",
                "8 mos",
                "Our goal is to create a culture of diversity in the Metro Phoenix technology scene. No less. A BHAG for sure (Big Hairy Audacious Goal). Sign up here: https://phoenix.girlsintech.org/#keepInTouch and stay tuned for upcoming event.Girls in Tech (GIT) is a global non-profit focused on the engagement, education and empowerment of girls and women who are passionate about technology. Today, GIT aims to accelerate the growth of innovative women entering into the high-tech industry and building startups. With headquarters in San Francisco and more than 50,000 members located around the globe, GIT relies on volunteer efforts to lead each of the 60 local chapters.It’s one thing to say you’re committed to diversity in tech, it’s another to take actionable steps. This is not a zero-sum game. Each one of us exists in the interest of the others. Don't stay behind."
            ],
            [
                "Entrepreneurship Aficionado",
                "Company Name",
                "Altima Business Marketplace",
                "Dates Employed",
                "Jan 2017 – Present",
                "Employment Duration",
                "10 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Ready to take your business higher, faster?Altima Business Marketplace is your personal assistant for expert-sourced, custom-searched and reliable answers, without paying MBA prices.You are an expert in your field but a novice in many areas of business. Here are the five challenges you are probably facing:Why am I unable to raise the capital I need?Where do I find new clients?How do I increase sales and grow?What should I focus on and when? What does my financial runway look like?Limit uncertainty, avoid pain and expand your financial runway with Altima Business Marketplace: Loan Prep: Loan Prep grooms you for the relationship you want to secure with new strategic business partners who need to thoroughly understand your business goals and needs in exchange for their financial backing.Strategic Selling: Strategic Selling is your power tool to see the world through your best customers’ eyes and stand in their shoes, increasing opportunities and closing more sales.Go Plan: The Go Plan is your lifeline that instantly crystallizes your vision and fosters focus. Using a lean startup template, the Go Plan enhances new or existing business models along with an execution plan to get to revenue or increase revenue faster. Financial Fitness: Financial Fitness bridges your financial understanding gaps. Having a better grasp on the finances behind your business, Financial Fitness expands your financial runway and showcases your business performance to financial backers.Plan Pro Review: A business and/or finance experts will be assigned to review, and provide a comprehensive written report highlighting the gaps and their recommendations to strengthen your documents, with a focus on receiving funding.Being an entrepreneur is one of those few sink-or-swim jobs where you learn as you go. Now you can confidently call the shots!"
            ],
            [
                "ASU/WPC Entrepreneurship Expert",
                "Company Name",
                "Arizona State University - W. P. Carey School of Business",
                "Dates Employed",
                "Jan 2017 – Present",
                "Employment Duration",
                "10 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Support, advise and offer guidance to students from all walks to nurture tomorrow's entrepreneurs."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Universite Paul Sabatier - France",
                "Field Of Study",
                "Biology Research"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Bookstore fairy",
                "Company Name",
                "Unity on the Bay",
                "Dates volunteered",
                "2009 – 2014",
                "Volunteer duration",
                "5 yrs"
            ],
            "Recommendations",
            [
                "TechBA",
                "1,764 followers"
            ],
            [
                "Girls in Tech Phoenix",
                "130 followers"
            ],
            [
                "Networking Phoenix - LI group",
                "9,901 members"
            ],
            [
                "gLOVE Treat",
                "2 followers"
            ],
            [
                "CoFoundersLab: The Largest Network of Entrepreneurs Online",
                "60,291 members"
            ],
            [
                "Fox & Fin Financial",
                "53 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "TechBA",
                "1,764 followers"
            ],
            [
                "TechBA",
                "1,764 followers"
            ],
            [
                "Girls in Tech Phoenix",
                "130 followers"
            ],
            [
                "Girls in Tech Phoenix",
                "130 followers"
            ],
            [
                "Networking Phoenix - LI group",
                "9,901 members"
            ],
            [
                "Networking Phoenix - LI group",
                "9,901 members"
            ],
            [
                "gLOVE Treat",
                "2 followers"
            ],
            [
                "gLOVE Treat",
                "2 followers"
            ],
            [
                "CoFoundersLab: The Largest Network of Entrepreneurs Online",
                "60,291 members"
            ],
            [
                "CoFoundersLab: The Largest Network of Entrepreneurs Online",
                "60,291 members"
            ],
            [
                "Fox & Fin Financial",
                "53 followers"
            ],
            [
                "Fox & Fin Financial",
                "53 followers"
            ]
        ],
        "recommendations": [
            [
                "Robert Valdez",
                "Selling Businesses at GoldStar Business Brokers",
                "February 14, 2016, Carine worked with Robert but at different companies",
                "I truly enjoy working with Robert. He is very intentional in his actions, looking at creative ways to accomplish his clients' goals to their best interests. If you are a small business owner and are thinking about selling your business, Robert is the business broker to contact."
            ],
            [
                "Robert Valdez",
                "Selling Businesses at GoldStar Business Brokers",
                "February 14, 2016, Carine worked with Robert but at different companies"
            ],
            [
                "Robert Valdez",
                "Selling Businesses at GoldStar Business Brokers",
                "February 14, 2016, Carine worked with Robert but at different companies"
            ],
            [
                "Robert Valdez",
                "Selling Businesses at GoldStar Business Brokers",
                "February 14, 2016, Carine worked with Robert but at different companies"
            ],
            "Selling Businesses at GoldStar Business Brokers",
            [
                "I truly enjoy working with Robert. He is very intentional in his actions, looking at creative ways to accomplish his clients' goals to their best interests. If you are a small business owner and are thinking about selling your business, Robert is the business broker to contact."
            ],
            [
                "I truly enjoy working with Robert. He is very intentional in his actions, looking at creative ways to accomplish his clients' goals to their best interests. If you are a small business owner and are thinking about selling your business, Robert is the business broker to contact."
            ],
            [
                "Kathryn (Katie) Joy",
                "Sales Manager at Fairway Independent Mortgage Corporation",
                "September 13, 2014, Carine worked with Kathryn (Katie) but at different companies",
                "I first met Katie in a lead group and what I immediately noticed was her passion for helping people. She knows her industry like no other and with her genuine care, she will make the most complex process look effortless."
            ],
            [
                "Kathryn (Katie) Joy",
                "Sales Manager at Fairway Independent Mortgage Corporation",
                "September 13, 2014, Carine worked with Kathryn (Katie) but at different companies"
            ],
            [
                "Kathryn (Katie) Joy",
                "Sales Manager at Fairway Independent Mortgage Corporation",
                "September 13, 2014, Carine worked with Kathryn (Katie) but at different companies"
            ],
            [
                "Kathryn (Katie) Joy",
                "Sales Manager at Fairway Independent Mortgage Corporation",
                "September 13, 2014, Carine worked with Kathryn (Katie) but at different companies"
            ],
            "Sales Manager at Fairway Independent Mortgage Corporation",
            [
                "I first met Katie in a lead group and what I immediately noticed was her passion for helping people. She knows her industry like no other and with her genuine care, she will make the most complex process look effortless."
            ],
            [
                "I first met Katie in a lead group and what I immediately noticed was her passion for helping people. She knows her industry like no other and with her genuine care, she will make the most complex process look effortless."
            ]
        ],
        "skills": [],
        "summary": "    Passionate. Idealist. Vegan. Challenges Enthusiast. I didn’t set out to be an entrepreneurship aficionado. I studied Biology Research. That’s how strong an impression Africa made on me as a 15-year-old exchange student. I wanted to save the world! And still do!Early on, I flew straight to the Caribbean, where I successfully exercised my entrepreneurial mindset to create and exit four ventures. Eventually joining the ranks of the corporate world, my job was to go, wherever in the world where HQ was acquiring companies, and grow them to where they would be sold or a permanent team would take over.Happy Corporate Dropout, I am a Partner and Director of Strategy at Altima Business Solutions, a 17-year-old business accelerator, who cultivate, mentor and “rise” entrepreneurs who create today’s jobs given access to capital, expertise, skill and talent. I focus on critical path, commercialization of technologies and growth. I contribute to startups, small and medium-sized businesses by poking and probing your business model to uncover and resolve the gaps that affect your company’s powers. I worked in five different countries, visited countless others and crossed a shark in my first dive. I speak fluently three languages and knit for charity. Peer Collaborator for the Nelson Mandela Fellowship Program, Venture Devils Mentor at Arizona State University, Entrepreneurship Expert Mentor at WP Carey School of Business, SBIR/STTR Commercial Reviewer at the National Science Foundation, I serve as Director of the Board at Girls In Tech Phoenix, a global non-profit focused on the engagement, education and empowerment of girls and women who are passionate about technology, and chair the Mentorship Committee to create a culture of diversity in the Phoenix tech scene.My mission: RESTORE CRITICAL THINKING!What type of entrepreneur are you? If you are driven by facts, meaningful actions and not by Ego, we are your partner. Let’s make the world a better place!\n  \n  \n",
        "name": "Carine Dieude",
        "title": "Partner. Entrepreneurship Aficionado. Girls In Tech PHX",
        "url": "linkedin.com/in/carinedieude",
        "phone": "602-773-1488 (Work)",
        "email": "cdieude@altimabusinesssolutions.com"
    }
]