[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "13 Mutual Connections",
                "You and Ritchie J. both know John Kretz, MBA, PMP, CSM, FBI-DHS InfraGard, Erika Flora PMP, PgMP, ITIL Expert,PRINCE2,CSP, and 11 others"
            ],
            [
                "We must all try to empathize before we criticize. Ask someone what's wrong before telling them they are wrong.",
                "Ritchie J. liked"
            ],
            [
                "Idea of the Day: Being innovative isn’t just about what you start — it’s about what you stop. “You don’t have the capacity – the time, resources or energy – to do the new things because you are busy maintaining the old ones,”",
                "Ritchie J. liked"
            ],
            [
                "Pharmacy Phamily!  I am looking to fill an open position for Lab Manager here at Potter's House Apothecary.  If you know of a great leader looking to make a change, please send them my way.  Please check out our Facebook page and website to see what a great company this truly is!",
                "https://lnkd.in/gw8gZJY",
                "www.pottershouserx.com",
                "Ritchie J. liked"
            ],
            [
                "After four days of sharing amazing experiences and knowledges we finished our Maersk Leading Others Course. It’s time to continue motivating and inspiring our Teams. The Core Values (Constant Care- Humbleness- Uprightness- Our Employees- Our Name) will determine the Ship Course and during bad weather remember AP Møller's exhortation – \"no loss should hit us which could be avoided with constant care\".#proudtobeblue",
                "Ritchie J. liked"
            ],
            [
                "I called a candidate about a new opportunity.  It was a promotion from his current role, and he had the right skills and qualifications.",
                "\"Sorry but I'm not interested,\" he politely said.",
                "I pressed him on it until he said something that really confused me.  He told me that he \"already made it to the top\".",
                "I was familiar with his current company and looked at his CV again.",
                "He wasn't anywhere near the top.  He would have needed binoculars to see the top.  He wasn't even a manager yet.",
                "He explained to me that \"making it to the top\" for him meant he loved the exact work he did each day, he loved his company, he was treated fairly and with respect, he made enough money to be comfortable, he had excellent benefits, he had flexibility, and most importantly to him, he's never missed a single football game, school play, parent-teacher conference, anniversary, birthday, or any family event.",
                "He knew what taking the next step in his career meant.  More time, travel, and sacrifice.  \"Not worth it,\" he said.",
                "Your definition of \"making it to the top\" doesn't have to be society's or anyone else's definition.  You Do You. #Steve Crider.",
                "Ritchie J. liked"
            ],
            "Recommendations",
            [
                "All Things Apple",
                "29,770 followers"
            ],
            [
                "ITSM (ITIL) Professionals",
                "144,366 members"
            ],
            [
                "Valley of the Sun United Way",
                "710 members"
            ],
            [
                "IT Utilities and Energy",
                "1,402 members"
            ],
            [
                "T. Boone PickensT. Boone Pickens is a LinkedIn Influencer",
                "Founder, Chairman and CEO at BP Capital and TBP Investments Management",
                "1,791,531 followers"
            ],
            [
                "IT Service Management Forum",
                "78,989 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "All Things Apple",
                "29,770 followers"
            ],
            [
                "All Things Apple",
                "29,770 followers"
            ],
            [
                "ITSM (ITIL) Professionals",
                "144,366 members"
            ],
            [
                "ITSM (ITIL) Professionals",
                "144,366 members"
            ],
            [
                "Valley of the Sun United Way",
                "710 members"
            ],
            [
                "Valley of the Sun United Way",
                "710 members"
            ],
            [
                "IT Utilities and Energy",
                "1,402 members"
            ],
            [
                "IT Utilities and Energy",
                "1,402 members"
            ],
            [
                "T. Boone PickensT. Boone Pickens is a LinkedIn Influencer",
                "Founder, Chairman and CEO at BP Capital and TBP Investments Management",
                "1,791,531 followers"
            ],
            [
                "T. Boone PickensT. Boone Pickens is a LinkedIn Influencer",
                "Founder, Chairman and CEO at BP Capital and TBP Investments Management",
                "1,791,531 followers"
            ],
            [
                "T. Boone Pickens is a LinkedIn Influencer"
            ],
            [
                "IT Service Management Forum",
                "78,989 members"
            ],
            [
                "IT Service Management Forum",
                "78,989 members"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "    Experienced Information Technology Analyst with solid background in Team Leadership and Coworker Development.Specialties: Windows, MacOS, DOS; Thin Clients; MSOffice, Access, WordPerfect, Lotus 1-2-3, Harvard Graphics, Remedy, Webex, Email clients, Browsers (Netscape, IE, Firefox), Citrix client; RetrospectPBX, Cisco Call Manager, Cisco UnityTCP/IP, AppleTalk, Remote AccessNorton, DiskWarrior, Apple Disk Utility, GhostC/C++, Visual Basic; SQLERP, Controls, Electronic Commerce, Networking & Distributed Computing, Client/Server Networks; Database Management, Website Development; Network backup, Security\n  \n  \n",
        "name": "Ritchie J. Smith",
        "title": "I make people's lives a little easier.",
        "url": "linkedin.com/in/ritchiejsmith",
        "phone": "",
        "email": "ritchiesmith@yahoo.com"
    }
]