[
    {
        "experience": [
            "Highlights",
            [
                "154 Mutual Connections",
                "You and Justin both know Wayne Neale, Sergey Zaytsev, and 152 others"
            ],
            [
                "Send Money to Friends and Family in Messenger with PayPal",
                "Justin liked"
            ],
            [
                "I am pleased to announce another strong quarter of growth with Q3 2017 earnings results. Tune in for my recap and read more here: http://bit.ly/2hR9I6D",
                "Justin liked"
            ],
            [
                "PayPal’s quarter exceeded expectations across the board",
                "Justin liked"
            ],
            [
                "Betting on a skyrocketing tech stock ahead of earnings",
                "Justin liked"
            ],
            [
                "Venmo Launches Pay With Venmo At 2M Merchants",
                "Justin liked"
            ],
            [
                "Our vision for Venmo isn’t only to offer the go-to app for payments between friends—we see it becoming a ubiquitous digital wallet that people can use to pay wherever and however they want, using whatever device they prefer. Now, with the holiday season fast-approaching, we’re launching new capabilities so Venmo customers can use their Venmo accounts at millions of merchants that accept PayPal, including lululemon, Forever 21, and Foot Locker. Read more about how we are continuing to improve the payment experience: http://bit.ly/2xKc6XL",
                "Justin liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Senior Manager, Global Talent Acquisition (Talent Sourcing & Talent Attraction Programs)",
                "Company Name",
                "PayPal",
                "Dates Employed",
                "Sep 2011 – Present",
                "Employment Duration",
                "6 yrs 2 mos",
                "Location",
                "Scottsdale, AZ",
                "In my current role with PayPal, created by the separation from eBay Inc., I have two main areas of leadership and support:  Talent Sourcing and Talent Attraction Programs.For Talent Sourcing, I have worldwide responsibility for developing and leading strategies to deliver sourcing solutions and programs to fuel PayPal’s talent pipeline globally.  I am responsible for driving a consistent global approach, methodology and best practice to ensure all candidate engagement, contact and experience is exceptional.  As the PayPal family becomes more global and diverse, we continue to be focused on meeting the company’s current hiring demands as well proactively building pipelines for future hiring.  My team is expected to continuously increase their business and external commercial acumen as well as emerging candidate sourcing strategies in order to deliver a highly qualified and diverse talent pipeline. I also have the opportunity to head the Global Talent Attraction Programs team, exploring innovative solutions to engage with the best talent for PayPal.  I manage multiple programs in support of global recruiting initiatives, identifying and securing sourcing channels and media plans to support the recruiting/sourcing function.  I work closely with our business partners both externally and internally to ensure we have the programs and resources needed, leveraging the tools and processes created and implemented globally.  Overall, the Talent Attraction and Programs function manages the Talent Attraction Channels, ERP, Social Media, Labor Market Intelligence, Community Integration, Data/Analytics and many other programs on behalf of the entire Global Talent Acquisition team.I have an incredible job!  Every day I work with amazingly talented and passionate partners to drive the PayPal business through connecting candidates with the next opportunity in their respective careers.",
                "Media (1)",
                "This position has 1 media",
                "PayPal 2016 Big Game Commercial - \"There's a New Money in Town\"",
                "PayPal 2016 Big Game Commercial - \"There's a New Money in Town\"",
                "This media is a video"
            ],
            [
                "Senior Manager, Global Talent Acquisition (Talent Sourcing)",
                "Company Name",
                "eBay Inc",
                "Dates Employed",
                "Sep 2014 – Jul 2015",
                "Employment Duration",
                "11 mos",
                "Location",
                "Scottsdale, AZ",
                "eBay Inc. is a global commerce platform and payments leader. eBay Inc. is comprised of three business units with their own distinct brand:  eBay enables individuals and business to buy and sell online; PayPal enables individuals and businesses to send and receive digital payments; eBay Enterprise enables commerce, retailing and digital marketing for merchants.  Our success is tied to our purpose—creating more opportunities and enabling others to win while making a positive social impact."
            ],
            [
                "Manager, Global Talent Acquisition (Talent Sourcing)",
                "Company Name",
                "PayPal",
                "Dates Employed",
                "Sep 2011 – Sep 2014",
                "Employment Duration",
                "3 yrs 1 mo",
                "Location",
                "Scottsdale, AZ",
                "Fueled by a fundamental belief that having access to ﬁnancial services creates opportunity, PayPal (Nasdaq: PYPL) is committed to democratizing ﬁnancial services and empowering people and businesses to join and thrive in the global economy.  Our open digital payments platform gives PayPal’s nearly 200 million active account holders the conﬁdence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person.  Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and ﬂexibility when sending payments, paying or getting paid.  Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom, enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.As the PayPal family becomes more global and diverse, my focus within the Global Talent Acquisition Team is meeting the company’s current hiring demands as well proactively building pipelines for future hiring.  My team is expected to continuously increase their business and external commercial acumen as well as emerging candidate sourcing strategies in order to deliver a highly qualified and diverse talent pipeline to meet the hiring needs of the business. Key deliverables and responsibilities for my team include, but are not limited to:•\tProvide an excellent customer experience for the candidate, TA team and hiring management.•\tPartner with key stakeholders to develop appropriate sourcing strategies for hiring initiatives.•\tProvide market knowledge and innovative talent sourcing strategies to support our markets in the Americas, EMEA and APAC.•\tLeverage the capabilities and increase the usage of our ATS (Workday) and improve overall operational excellence in candidate attraction, engagement and tracking."
            ],
            [
                "Recruiting Manager",
                "Company Name",
                "Jawa",
                "Dates Employed",
                "Jan 2010 – Dec 2011",
                "Employment Duration",
                "2 yrs",
                "Location",
                "Scottsdale, AZ",
                "•\tDeveloped and implemented a corporate/technical recruiting division for JAWA, including the design of all standards and procedures.•\tManaged all recruiting activities for executive management, software/games development & engineering, QA, network infrastructure, IT, systems security, marketing, business development, accounting, finance, legal and public relation positions.•\tResponsible for the full life-cycle of recruiting activities including: qualifying job requisitions and descriptions with managers, sourcing qualified candidates, job postings, database mining and internet recruiting, screening candidates, scheduling interviews, negotiating salaries, making offers, checking references, background checks and processing paperwork.•\tAdditionally, responsible for the tracking of all open positions and metrics by preparing and publishing a weekly Staffing Summary that was distributed to executive management and all key stake holders.•\tHired and managed a staff of professional recruiters and one recruiting assistant."
            ],
            [
                "Recruiting Manager",
                "Company Name",
                "Digital Madhouse",
                "Dates Employed",
                "Jun 2010 – Nov 2011",
                "Employment Duration",
                "1 yr 6 mos",
                "Location",
                "Scottsdale, AZ",
                "•\tEngaged and influenced senior management to support and implement Talent Acquisition initiatives across the organization. •\tPartnered with studio hiring management to uncover, attract and engage the best technical talent, actively providing the Recruiting/TA expertise required to build the company from concept to a 50-person studio.•\tSuccessfully displayed strong sourcing skills, excellent client management skills and a keen understanding of how to assess and obtain candidates for an incredibly high talent bar. •\tLed the development and implementation of systems and processes to drive continuous learning and knowledge sharing across the organization in support of the HR/Recruiting strategies."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "The University of New Mexico",
                "Degree Name",
                "Bachelors of Business Administration",
                "Field Of Study",
                "Finance"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 47 more skills"
            ],
            "Recommendations",
            [
                "Boolean Strings - The Internet Sourcing Community",
                "54,699 members"
            ],
            [
                "Lemonade Outta Lemons",
                "26 members"
            ],
            [
                "Database Experts",
                "32,771 members"
            ],
            [
                "Amazon",
                "2,647,888 followers"
            ],
            [
                "Braintree",
                "22,556 followers"
            ],
            [
                "Guy KawasakiGuy Kawasaki is a LinkedIn Influencer",
                "Chief evangelist + keynote speaker",
                "2,612,286 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Boolean Strings - The Internet Sourcing Community",
                "54,699 members"
            ],
            [
                "Boolean Strings - The Internet Sourcing Community",
                "54,699 members"
            ],
            [
                "Lemonade Outta Lemons",
                "26 members"
            ],
            [
                "Lemonade Outta Lemons",
                "26 members"
            ],
            [
                "Database Experts",
                "32,771 members"
            ],
            [
                "Database Experts",
                "32,771 members"
            ],
            [
                "Amazon",
                "2,647,888 followers"
            ],
            [
                "Amazon",
                "2,647,888 followers"
            ],
            [
                "Braintree",
                "22,556 followers"
            ],
            [
                "Braintree",
                "22,556 followers"
            ],
            [
                "Guy KawasakiGuy Kawasaki is a LinkedIn Influencer",
                "Chief evangelist + keynote speaker",
                "2,612,286 followers"
            ],
            [
                "Guy KawasakiGuy Kawasaki is a LinkedIn Influencer",
                "Chief evangelist + keynote speaker",
                "2,612,286 followers"
            ],
            [
                "Guy Kawasaki is a LinkedIn Influencer"
            ]
        ],
        "recommendations": [
            [
                "Carlos Rojas, PMP",
                "Project Management Office (PMO) Director, Clinical & Translational Research",
                "December 5, 2014, Justin worked with Carlos in the same group",
                "Justin and I worked together on optimizing sourcing efforts on a global scale. Justin understands the sourcing process at a very detailed level and was a key factor in helping me understand the project objectives and the background content needed to execute.  I witnessed his strong rapport with people across PayPal and eBay and how effective he was in presenting and building a compelling case to stakeholders at all levels.  Justin's combination of technical knowledge and charisma results in an ideal advocate for enterprise efforts, as he is trusted, credible, and effective.  I was fortunate to learn from Justin and benefit from his professional reputation."
            ],
            [
                "Carlos Rojas, PMP",
                "Project Management Office (PMO) Director, Clinical & Translational Research",
                "December 5, 2014, Justin worked with Carlos in the same group"
            ],
            [
                "Carlos Rojas, PMP",
                "Project Management Office (PMO) Director, Clinical & Translational Research",
                "December 5, 2014, Justin worked with Carlos in the same group"
            ],
            [
                "Carlos Rojas, PMP",
                "Project Management Office (PMO) Director, Clinical & Translational Research",
                "December 5, 2014, Justin worked with Carlos in the same group"
            ],
            "Project Management Office (PMO) Director, Clinical & Translational Research",
            [
                "Justin and I worked together on optimizing sourcing efforts on a global scale. Justin understands the sourcing process at a very detailed level and was a key factor in helping me understand the project objectives and the background content needed to execute.  I witnessed his strong rapport with people across PayPal and eBay and how effective he was in presenting and building a compelling case to stakeholders at all levels.  Justin's combination of technical knowledge and charisma results in an ideal advocate for enterprise efforts, as he is trusted, credible, and effective.  I was fortunate to learn from Justin and benefit from his professional reputation."
            ],
            [
                "Justin and I worked together on optimizing sourcing efforts on a global scale. Justin understands the sourcing process at a very detailed level and was a key factor in helping me understand the project objectives and the background content needed to execute.  I witnessed his strong rapport with people across PayPal and eBay and how effective he was in presenting and building a compelling case to stakeholders at all levels.  Justin's combination of technical knowledge and charisma results in an ideal advocate for enterprise efforts, as he is trusted, credible, and effective.  I was fortunate to learn from Justin and benefit from his professional reputation."
            ],
            [
                "Tom Meigs",
                "Help create opportunity for others with eBay!",
                "March 1, 2013, Tom reported directly to Justin",
                "Justin is an excellent manager and leader - always deftly guiding the development of his team towards improved technique, market acumen, efficiency and all new heights of delivery.  His intuition and deep experience are constantly visible at every decision point. I feel fortunate to be just one of the team members he continues to inspire."
            ],
            [
                "Tom Meigs",
                "Help create opportunity for others with eBay!",
                "March 1, 2013, Tom reported directly to Justin"
            ],
            [
                "Tom Meigs",
                "Help create opportunity for others with eBay!",
                "March 1, 2013, Tom reported directly to Justin"
            ],
            [
                "Tom Meigs",
                "Help create opportunity for others with eBay!",
                "March 1, 2013, Tom reported directly to Justin"
            ],
            "Help create opportunity for others with eBay!",
            [
                "Justin is an excellent manager and leader - always deftly guiding the development of his team towards improved technique, market acumen, efficiency and all new heights of delivery.  His intuition and deep experience are constantly visible at every decision point. I feel fortunate to be just one of the team members he continues to inspire."
            ],
            [
                "Justin is an excellent manager and leader - always deftly guiding the development of his team towards improved technique, market acumen, efficiency and all new heights of delivery.  His intuition and deep experience are constantly visible at every decision point. I feel fortunate to be just one of the team members he continues to inspire."
            ],
            [
                "Kacey Claiborne",
                "Director of Talent Acquisition at CROSSMARK",
                "May 5, 2017, Justin managed Kacey directly",
                "Kacey is a true professional, and someone you can always count on to get the job done!  She has an amazing work ethic, and she possesses an inherent drive to create fantastic candidate/customer experiences.  Simply put, she is great with people!  It may sound simple, but when you work in recruiting (or any branch of human resources), you learn that people are dynamic and unpredictable.  Kacey is patient, understanding and creative.  She will find a way to satisfy her clients, her candidates and her business partners or come to an agreeable compromise.  I greatly enjoyed working with her, and I always appreciated her upbeat personality and employee/brand advocacy.  I would bring her back to any of my teams in a moment’s notice, as she is truly an asset and one with incredible value!"
            ],
            [
                "Kacey Claiborne",
                "Director of Talent Acquisition at CROSSMARK",
                "May 5, 2017, Justin managed Kacey directly"
            ],
            [
                "Kacey Claiborne",
                "Director of Talent Acquisition at CROSSMARK",
                "May 5, 2017, Justin managed Kacey directly"
            ],
            [
                "Kacey Claiborne",
                "Director of Talent Acquisition at CROSSMARK",
                "May 5, 2017, Justin managed Kacey directly"
            ],
            "Director of Talent Acquisition at CROSSMARK",
            [
                "Kacey is a true professional, and someone you can always count on to get the job done!  She has an amazing work ethic, and she possesses an inherent drive to create fantastic candidate/customer experiences.  Simply put, she is great with people!  It may sound simple, but when you work in recruiting (or any branch of human resources), you learn that people are dynamic and unpredictable.  Kacey is patient, understanding and creative.  She will find a way to satisfy her clients, her candidates and her business partners or come to an agreeable compromise.  I greatly enjoyed working with her, and I always appreciated her upbeat personality and employee/brand advocacy.  I would bring her back to any of my teams in a moment’s notice, as she is truly an asset and one with incredible value!"
            ],
            [
                "Kacey is a true professional, and someone you can always count on to get the job done!  She has an amazing work ethic, and she possesses an inherent drive to create fantastic candidate/customer experiences.  Simply put, she is great with people!  It may sound simple, but when you work in recruiting (or any branch of human resources), you learn that people are dynamic and unpredictable.  Kacey is patient, understanding and creative.  She will find a way to satisfy her clients, her candidates and her business partners or come to an agreeable compromise.  I greatly enjoyed working with her, and I always appreciated her upbeat personality and employee/brand advocacy.  I would bring her back to any of my teams in a moment’s notice, as she is truly an asset and one with incredible value!"
            ],
            [
                "Bruce Stander",
                "Advisor & Technology Consultant to HR, Talent Acquisition & Staffing Companies",
                "May 5, 2017, Justin was a client of Bruce’s",
                "Let me begin with the fact that Bruce excels in customer management skills. Besides bringing all the \"regular\" skills to the table, like being proactive, timely, organized, helping his customer to succeed and having a positive attitude, Bruce is always willing to go the extra mile.  He really impressed me by working hard internally with his company to make the unique things happen, which I had asked for (since we were investigating new functionalities for his products beyond what was historically more usual).  Bruce gets things done, and he does so keeping his customer at the center.  He does not retreat easily, even when faced with tough asks, and Bruce has a skillful and mindful approach to his follow-up with customers in the most pleasant way, where the partnership is nice and easy.  I was happy to work with Bruce previously, and I would welcome the partnership again on future projects/implementations!"
            ],
            [
                "Bruce Stander",
                "Advisor & Technology Consultant to HR, Talent Acquisition & Staffing Companies",
                "May 5, 2017, Justin was a client of Bruce’s"
            ],
            [
                "Bruce Stander",
                "Advisor & Technology Consultant to HR, Talent Acquisition & Staffing Companies",
                "May 5, 2017, Justin was a client of Bruce’s"
            ],
            [
                "Bruce Stander",
                "Advisor & Technology Consultant to HR, Talent Acquisition & Staffing Companies",
                "May 5, 2017, Justin was a client of Bruce’s"
            ],
            "Advisor & Technology Consultant to HR, Talent Acquisition & Staffing Companies",
            [
                "Let me begin with the fact that Bruce excels in customer management skills. Besides bringing all the \"regular\" skills to the table, like being proactive, timely, organized, helping his customer to succeed and having a positive attitude, Bruce is always willing to go the extra mile.  He really impressed me by working hard internally with his company to make the unique things happen, which I had asked for (since we were investigating new functionalities for his products beyond what was historically more usual).  Bruce gets things done, and he does so keeping his customer at the center.  He does not retreat easily, even when faced with tough asks, and Bruce has a skillful and mindful approach to his follow-up with customers in the most pleasant way, where the partnership is nice and easy.  I was happy to work with Bruce previously, and I would welcome the partnership again on future projects/implementations!"
            ],
            [
                "Let me begin with the fact that Bruce excels in customer management skills. Besides bringing all the \"regular\" skills to the table, like being proactive, timely, organized, helping his customer to succeed and having a positive attitude, Bruce is always willing to go the extra mile.  He really impressed me by working hard internally with his company to make the unique things happen, which I had asked for (since we were investigating new functionalities for his products beyond what was historically more usual).  Bruce gets things done, and he does so keeping his customer at the center.  He does not retreat easily, even when faced with tough asks, and Bruce has a skillful and mindful approach to his follow-up with customers in the most pleasant way, where the partnership is nice and easy.  I was happy to work with Bruce previously, and I would welcome the partnership again on future projects/implementations!"
            ]
        ],
        "skills": [
            [
                "Internet Recruiting",
                "See 324 endorsements for Internet Recruiting",
                "99+",
                "Internet Recruiting",
                "Endorse",
                "Endorsed by Aaron Pullman and 16 others who are highly skilled at this",
                "Endorsed by Patricia Stinson and 14 other mutual connections"
            ],
            [
                "Internet Recruiting",
                "See 324 endorsements for Internet Recruiting",
                "99+"
            ],
            [
                "Applicant Tracking Systems",
                "See 195 endorsements for Applicant Tracking Systems",
                "99+",
                "Applicant Tracking Systems",
                "Endorse",
                "Endorsed by Aaron Pullman and 9 others who are highly skilled at this",
                "Endorsed by Sue Lane and 13 other mutual connections"
            ],
            [
                "Applicant Tracking Systems",
                "See 195 endorsements for Applicant Tracking Systems",
                "99+"
            ],
            [
                "Sourcing",
                "See 182 endorsements for Sourcing",
                "99+",
                "Sourcing",
                "Endorse",
                "Endorsed by Steve Rath and 22 others who are highly skilled at this",
                "Endorsed by Tim Kirby and 12 other mutual connections"
            ],
            [
                "Sourcing",
                "See 182 endorsements for Sourcing",
                "99+"
            ]
        ],
        "summary": "    I am a Talent Acquisition leader with experience in all aspects of talent management, sourcing, recruiting and talent attraction programs within dynamic, high-growth organizations. I believe in the power of the Talent Acquisition function to inform and shape overall strategic direction and to be a core enabler of business performance.  With that in mind, my team actively contributes to the company’s customer experience transformation by partnering with leaders across the organization on all topics related to talent attraction, hiring and engagement.  The function must be laser-focused on attracting and hiring the world’s leading talent to further a company’s desire to be an innovative industry leader.\n  \n  \n",
        "name": "Justin Copp",
        "title": "Fostering PayPal's hunt for great talent!",
        "url": "linkedin.com/in/jcopp",
        "phone": "",
        "email": "jcopp@paypal.com"
    }
]