[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "114 Mutual Connections",
                "You and Pratham both know John Furrier, Adwait Ullal, and 112 others"
            ],
            [
                "The Infosys-ATP World Tour Partnership: Re-inventing the tennis experience",
                "Pratham liked"
            ],
            [
                "Hello Everybody,",
                "I am open for new opportunities in the field of SQA(Functional Testing), having an experience of 4.5 years.",
                "Location : Preferably Bangalore or Pune. Okay with other cities as well.",
                "Kindly let me know if there are suitable openings.",
                "Thanks in Advance! :)",
                "Pratham liked a comment"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Student - Computer Applications | Software Quality Analyst",
                "Company Name",
                "Wipro Technologies",
                "Dates Employed",
                "May 2013 – Present",
                "Employment Duration",
                "4 yrs 7 mos",
                "Location",
                "Electronic City, Bangalore",
                "Enterprise Security Framework for State Street CorporationThis project is aimed to build a Common Security Framework & act as an Authorization Platform for all the Applications moving on to the Cloud Platform. The project deals with providing quality assurance for Identity and Access management of various internal applications of State Street to ensure corporate security policy. It is also the Entitlement (Functional & Data) store for Cloud & other Applications. The Platform is workflow based where all the Entitlements are maintained & requested by Users. The Platform adheres to Corporate Information Standard (CIS) by applying Rules (Separation of Duty, Identity-based etc.) & appropriate filters. The Enterprise Security Framework project is intended to be the security architecture for all new and existing State Street applications across the corporation and eSF team helps to establish and preserve trust between State Street and their customers and regulators.SailPoint for State Street CorporationSailPoint provides identity governance solutions with on-premises and cloud-based identity and access management software for the most complex challenges.An identity management system refers to an information system, or to a set of technologies that can be used for enterprise or cross-network identity management. Access governance system, Identity and access management system, Entitlement management system, User provisioning system are interchangeably used for Identity Management SystemIdentity management (IDM) describes the management of individual identities, their authentication, authorization, roles, and privileges within or across system and enterprise boundaries with the goal of increasing security and productivity while decreasing cost, downtime, and repetitive tasks."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Birla Institute of Technology and Science, Pilani",
                "Degree Name",
                "Master’s Degree",
                "Field Of Study",
                "Computer Software Engineering",
                "Dates attended or expected graduation",
                "2014 – 2017"
            ],
            [
                "Birla Institute of Technology and Science, Pilani",
                "Degree Name",
                "Master’s Degree",
                "Field Of Study",
                "Computer Software Engineering",
                "Dates attended or expected graduation",
                "2014 – 2017"
            ],
            [
                "Srinivas Institute of Management Studies, Mangalore University",
                "Degree Name",
                "Bachelor’s Degree",
                "Field Of Study",
                "Computer Applications",
                "Dates attended or expected graduation",
                "2010 – 2013"
            ],
            [
                "Srinivas Institute of Management Studies, Mangalore University",
                "Degree Name",
                "Bachelor’s Degree",
                "Field Of Study",
                "Computer Applications",
                "Dates attended or expected graduation",
                "2010 – 2013"
            ],
            "Recommendations",
            [
                "Narendra ModiNarendra Modi is a LinkedIn Influencer",
                "Prime Minister of India",
                "2,384,078 followers"
            ],
            [
                "Ministry of Testing - the online software testing community",
                "37,719 members"
            ],
            [
                "QualityAssurance",
                "10,283 members"
            ],
            [
                "ISTQB Technical Test Analyst study & networking group",
                "17,299 members"
            ],
            [
                "ISTQB Certification",
                "4,938 members"
            ],
            [
                "Testing",
                "20,362 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Narendra ModiNarendra Modi is a LinkedIn Influencer",
                "Prime Minister of India",
                "2,384,078 followers"
            ],
            [
                "Narendra ModiNarendra Modi is a LinkedIn Influencer",
                "Prime Minister of India",
                "2,384,078 followers"
            ],
            [
                "Narendra Modi is a LinkedIn Influencer"
            ],
            [
                "Ministry of Testing - the online software testing community",
                "37,719 members"
            ],
            [
                "Ministry of Testing - the online software testing community",
                "37,719 members"
            ],
            [
                "QualityAssurance",
                "10,283 members"
            ],
            [
                "QualityAssurance",
                "10,283 members"
            ],
            [
                "ISTQB Technical Test Analyst study & networking group",
                "17,299 members"
            ],
            [
                "ISTQB Technical Test Analyst study & networking group",
                "17,299 members"
            ],
            [
                "ISTQB Certification",
                "4,938 members"
            ],
            [
                "ISTQB Certification",
                "4,938 members"
            ],
            [
                "Testing",
                "20,362 members"
            ],
            [
                "Testing",
                "20,362 members"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "    •Accreditation from \"International Software Testing Qualifications Board\" as a Certified Tester Foundation Level - CTFL.•Accreditation from \"International Software Testing Qualifications Board\" as a Certified Tester Foundation Level - Agile Tester - CTFL-AT•Extensive experience in Quality Assurance and Quality Control, Requirement Gathering, Test Planning, Effort Estimations, Creating and Executing Test Cases, Defect Tracking, Task Allocation, Client Communication, Status Reporting and Client Interaction.•Expertise in understanding the Business Requirements and Functional Specifications during requirement phase to identify the process gaps and provide alternatives to the project team.•Expertise in Sanity Testing, Smoke, Black Box, GUI, Functionality, Regression, Compatibility, System, Data Migration and User Acceptance Testing(UAT) for enterprise web and client/server applications.•Project Delivery experience, managing work and resources in a geographically split onsite - offshore model. •Extensive experience in preparing documentation on QA Status Reports, QA Summary Reports, Bug Tracking Report, QA Test Logs, Risk Planning, Identifying, Analyzing, Monitoring and Mitigating risks, Issue Escalation and Track to closure.•Well versed with Agile Methodology (SCRUM), Software Development (SDLC), Software Test Life Cycle (STLC), Defect Life Cycle•Expertise in interacting with Development, Production Operations, Infrastructure, and other groups to Present, Isolate, and Resolve Issues.•Technically Competent, Result-Oriented with Strong Analytical and Reasoning Skills.\n  \n  \n",
        "name": "Pratham Nayak",
        "title": "ISTQB Certified | Software Quality Analyst at Wipro",
        "url": "linkedin.com/in/prathamnayak",
        "phone": "",
        "email": "pratham.nayak@gmail.com"
    }
]