[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "13 Mutual Connections",
                "You and Mike both know Dan Clarke, Gelie Akhenblit, and 11 others"
            ],
            [
                "Mike can introduce you to 9 people at Jacobsen, A Textron Company",
                "Mike worked at Jacobsen, A Textron Company"
            ],
            [
                "What does it really take to attract top talent?",
                "To recruit these talented and rare salespeople, employers need to take a hard look at what they are offering prospective candidates, and if they are doing what it really takes to attract ‘A’ players.",
                "Hiring managers fail to acquire top performers when they don’t evaluate how their company is positioned to attract salespeople who are not actively looking for a new employer.",
                "Elite salespeople want to work for market leaders with strong value propositions that offer high earning potential and career growth opportunities.",
                "And in today's hypercompetitive market, it has never been more critical to get the right sales talent on your team to meet and exceed growth goals. That's why Peak put together our top 3 ways to attract top talent with actionable advise in a video (link in the comments). What do you do to attract top talent?",
                "Mike liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "President & CEO - Managing Director",
                "Company Name",
                "Bello Sol Inc",
                "Dates Employed",
                "Nov 2012 – Present",
                "Employment Duration",
                "5 yrs",
                "Location",
                "Tolleson AZ",
                "Capitalize on the opportunity to lead forward-thinking multi-business operations, including driving revenue growth encompassing  sales growth in hospitality transportation, retail day spas, real estate & consultation organization.  Lead all facets of sales, marketing, operations, membership sales, new business development, profit / loss, team building / training, inventory control, and new product launch initiatives. Proactively consult among companies requiring restructuring consultation and advisement, including writing & executing business plans to establish procedures for sales, marketing, pricing, and online presence.  Secure and align organizational resources to support the restructuring, strategic planning, & marketing for turnaround of product sales, retail operations, SEO, SEM, & PPC. Built highly profitable relationships with, LinkedIn, Facebook, Google, Salesforce, Cisco, EA Sports, Apple, ESPN, 49ers, Tasha, Jindilli, Skin Scripts, among others.\tIncreased 2017 YTD sales by 24% and retail membership sales by 8% and net cash flow 38%.\tSuccessfully spent $20,000 of SEO a month to profitably generate $600,000+ in new sales monthly.\tRedesigned website and marketing materials, and implemented new SEO strategies.\tExceeded budgeted projections for a consulting division by 47% in 2015 and 21% in 2016.\tCollaborated with companies on key sales, business, marketing, and executive / staff training.\tPartnered with ESPN Game Day for the 2016 Super Bowl, including managing logistics &         providing transportation for NFL teams, CBS, ESPN, and major companies (2,500+ moves).\tCoordinated transportation for event moving 89,000+ people in four days.\tRecruited to manage the sales and marketing for four departments at Bauer’s Transportation, including developing new programs & marketing ideas to increase sales over previous years for Charter Sales, Events Logistics Management, Business Development  and Get 2 the Event.",
                "Media (2)",
                "This position has 2 media",
                "1 (1).jpg",
                "1 (1).jpg",
                "This media is an image",
                "Sales Development Program (1)",
                "Sales Development Program (1)",
                "This media is a document"
            ],
            [
                "President & GM",
                "Company Name",
                "Golf Ventures West LLC",
                "Dates Employed",
                "Dec 2003 – Oct 2012",
                "Employment Duration",
                "8 yrs 11 mos",
                "Golf Ventures joined the AP Apollo family in 1998 and has the industry advantage and leadership to be the premier partner with Helena Chemical & Fertilizer, Jacobsen and EZ-GO  Textron Companies also partners with other national vendors to offer a complete coverage for all your turf grass needs.Golf Ventures expanded West into Southern California, Arizona, Nevada and Baja in 2004 and quickly became one of the USA largest dealers in the turf grass maintenance industry. In 2009 Golf Ventures West expanded into Northern California & Northern Nevada and 2010 expansion continued into Georgia, Alabama and Northern Florida.Recruited to direct the executive oversight, control, and management of all sales, business, and marketing operations with a $35 million budget for a distributor of turf grass maintenance equipment, chemicals, fertilizer, grass seed, and accessories.•\tExecuted aggressive expansion of operations, growing from two retail stores in one state to 10 stores in six states, overseeing all staff hiring, sales plans, marketing campaigns, inventory, parts, and services•\tGrew dealership to position as the industry’s competitive leader, fostering relationships with key industry clients and businesses (B2C & B2B)•\tDeveloped and implemented business plan and dealer program for pricing, warranties, co-op financing, and parts•\tRecruited and hired team of growth-minded general managers and sales staff, assessing talents and expertise for placing in best-fit roles and situations throughout the company•\tManaged $6+ million in inventory and coordinated product distribution with a fleet of 50 trucks \tManaged and expanded account base to 9,000+, contracting with 3,000 government agencies and several pro sports teams–LA Dodgers, LA Angels of Anaheim, SF 49ers, and Oakland Raiders\tCollaborated on 50+ PGA events, including the Masters, US Open, and Pebble Beach"
            ],
            [
                "President & CEO",
                "Company Name",
                "TK Alliance Inc",
                "Dates Employed",
                "Oct 2002 – Dec 2003",
                "Employment Duration",
                "1 yr 3 mos",
                "Location",
                "Carmel Indiana",
                "TK Alliance owned Sona Laser Centers/Med Spa, Managed retail operations and Real Estate division.Sales, Marketing, Operations, P&L Management, Managing business development, working with RN's, Doctors and staff. equipment dealers and other professional companies. Recruited to open new franchise and establish market and brand positioning for organization, including within the medical spa industry. •\tDeveloped and executed the strategic planning and executive management from the ground up, creating a solid foundation of employees, financials, and operations•\tCultivated key client relationships with major industry leaders, including the New Orleans Pelicans (formerly the Hornets) of the NBA •\tPartnered with equipment dealers nationally for training, coaching, and development to increase sales •\tOversaw six-month construction process of new franchise, working with contractors on design and build outSelected Achievements     $18 million annual revenue achieved in short term by initiating and launching real estate division     $3 million in sales secured through franchise business in medical spa sector     125% increase in sales within first six months, growing monthly sales from $22,000 to $175,000"
            ],
            [
                "VP of Worldwide Sales, WM / President of Lastec / Managing Director of Lastec UK",
                "Company Name",
                "Wood-Mizer LLC",
                "Dates Employed",
                "Sep 1998 – Jan 2002",
                "Employment Duration",
                "3 yrs 5 mos",
                "Location",
                "Indianapolis, Indiana Area",
                "Selected to transform the operations for an international division through enhanced sales structures, brand initiatives, pricing programs, and marketing strategies to position the company for short- and long-term growth.•\tOversaw and directed all aspects of the retail and call center operations, managing 13 direct reports, 350 retail personnel, and 65 sales staff•\tDrove significant sales and profit growth year over year, consistently exceeding financial targets•\tCoordinated and represented company at more than 100 annual trade shows, maintaining key accounts, launching new products, and generating leads•\tTraveled extensively throughout Europe, China, and the United States to build and maintain key partnerships and establish an international dealer base of 15 dealers and 45 dealers domesticallySelected Achievements*\tGrew sales from $4 million annually to $16 million by identifying new opportunities, setting pricing programs, and targeted marketing campaigns*\t400% increase in annual revenue and 700% in profits by developing leasing and financing programs to improve product sales*\t$7 million increase in sales by developing new equipment in collaboration with a Chinese company, launching six new products*\t13% increase in equipment GP and 21% increase in part sales by developing and implementing pricing and financing programs and retail service operation plan*\tNegotiated and closed a long-term contract with John Deere to develop private-label products resulting in $7 million increase in sales*\tOversaw construction of two 15,000 sq ft buildings, increasing facilities to over 50,000 sq ft"
            ],
            [
                "Executive Management",
                "Company Name",
                "HV Carter Company",
                "Dates Employed",
                "1994 – 1998",
                "Employment Duration",
                "4 yrs",
                "Location",
                "Livermore Ca",
                "Sales, Marketing, Multi Operations Management, leasing, P&L with three locations in Northern CA. We achieved dealer of the year three out of four years for Jacobsen Textron and won many dealer  awards from other manufactures."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Warren National University",
                "Degree Name",
                "Bachelor of Science in Business Administration",
                "Field Of Study",
                "Business and International Marketing"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "President, 2015 / Vice President, 2014 / Director, 2013",
                "Company Name",
                "ACMSA Arizona Cowboy Mounted Shooting",
                "Dates volunteered",
                "Feb 2013 – Nov 2015",
                "Volunteer duration",
                "2 yrs 10 mos",
                "ACMSA is a not-for-profit Corporation  whose objective is to  organize competitions and build mounted shooting.  • The benefits earned by the Club go back to shooters in the form of  paybacks, prizes and lower fees.  • Members are encouraged to help at Club events and projects.   • Yearly we supported charity's like Horses Help and Atlasta Home  Horse Rescue in 2014 • ACMSA actively recruits, trains and mentors beginning mounted  shooters. We have many members ready to make new friends and  train beginners in a low pressure atmosphere.  We also have over  ten of the top trainers in the sport working out of this area.    • We endorse the NRA and Gun Safety training programs."
            ],
            [
                "President, 2015 / Vice President, 2014 / Director, 2013",
                "Company Name",
                "ACMSA Arizona Cowboy Mounted Shooting",
                "Dates volunteered",
                "Feb 2013 – Nov 2015",
                "Volunteer duration",
                "2 yrs 10 mos",
                "ACMSA is a not-for-profit Corporation  whose objective is to  organize competitions and build mounted shooting.  • The benefits earned by the Club go back to shooters in the form of  paybacks, prizes and lower fees.  • Members are encouraged to help at Club events and projects.   • Yearly we supported charity's like Horses Help and Atlasta Home  Horse Rescue in 2014 • ACMSA actively recruits, trains and mentors beginning mounted  shooters. We have many members ready to make new friends and  train beginners in a low pressure atmosphere.  We also have over  ten of the top trainers in the sport working out of this area.    • We endorse the NRA and Gun Safety training programs."
            ],
            [
                "President & CEO",
                "Company Name",
                "Pony 4 Precious a non profit corporation 501 (c)3",
                "Dates volunteered",
                "Oct 2016 – Present",
                "Volunteer duration",
                "1 yr 1 mo",
                "Cause",
                "Animal Welfare",
                "Our mission is to educate children on miniature ponies and horses through free online education training programs, working with horse rescue origination's and awarding yearly scholarships."
            ],
            [
                "President & CEO",
                "Company Name",
                "Pony 4 Precious a non profit corporation 501 (c)3",
                "Dates volunteered",
                "Oct 2016 – Present",
                "Volunteer duration",
                "1 yr 1 mo",
                "Cause",
                "Animal Welfare",
                "Our mission is to educate children on miniature ponies and horses through free online education training programs, working with horse rescue origination's and awarding yearly scholarships."
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 34 more skills"
            ],
            "Recommendations",
            [
                "Hartland",
                "1,167 followers"
            ],
            [
                "Amdocs",
                "217,092 followers"
            ],
            [
                "Goertek Electronics",
                "2,760 followers"
            ],
            [
                "Manthan",
                "14,573 followers"
            ],
            [
                "GPM, Inc.",
                "315 followers"
            ],
            [
                "DB&A - DeWolff, Boberg & Associates, Inc",
                "6,253 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Hartland",
                "1,167 followers"
            ],
            [
                "Hartland",
                "1,167 followers"
            ],
            [
                "Amdocs",
                "217,092 followers"
            ],
            [
                "Amdocs",
                "217,092 followers"
            ],
            [
                "Goertek Electronics",
                "2,760 followers"
            ],
            [
                "Goertek Electronics",
                "2,760 followers"
            ],
            [
                "Manthan",
                "14,573 followers"
            ],
            [
                "Manthan",
                "14,573 followers"
            ],
            [
                "GPM, Inc.",
                "315 followers"
            ],
            [
                "GPM, Inc.",
                "315 followers"
            ],
            [
                "DB&A - DeWolff, Boberg & Associates, Inc",
                "6,253 followers"
            ],
            [
                "DB&A - DeWolff, Boberg & Associates, Inc",
                "6,253 followers"
            ]
        ],
        "recommendations": [
            [
                "William Kenney",
                "Vice President at Smithco",
                "December 9, 2012, William worked with Mike in different groups",
                "Although we were with different companies, we had the same goals in selling my products with Mike serving as the distribution channel to the same customer base.  Mike was focused and highly driven.  I worked with him for about 15 years on and off and each occasion brought more success.  I endorse Mike in particular for his sales management record."
            ],
            [
                "William Kenney",
                "Vice President at Smithco",
                "December 9, 2012, William worked with Mike in different groups"
            ],
            [
                "William Kenney",
                "Vice President at Smithco",
                "December 9, 2012, William worked with Mike in different groups"
            ],
            [
                "William Kenney",
                "Vice President at Smithco",
                "December 9, 2012, William worked with Mike in different groups"
            ],
            "Vice President at Smithco",
            [
                "Although we were with different companies, we had the same goals in selling my products with Mike serving as the distribution channel to the same customer base.  Mike was focused and highly driven.  I worked with him for about 15 years on and off and each occasion brought more success.  I endorse Mike in particular for his sales management record."
            ],
            [
                "Although we were with different companies, we had the same goals in selling my products with Mike serving as the distribution channel to the same customer base.  Mike was focused and highly driven.  I worked with him for about 15 years on and off and each occasion brought more success.  I endorse Mike in particular for his sales management record."
            ],
            [
                "Lou Gore",
                "Director of Sales - Mid Atlantic",
                "November 1, 2012, Lou worked with Mike but at different companies",
                "Mike is a highly skilled business manager. As a vendor, it was impressive to watch the business he managed grow in difficult economic environments. He enters new markets and developes sound business practices to service new demands being placed on his peeople and operations."
            ],
            [
                "Lou Gore",
                "Director of Sales - Mid Atlantic",
                "November 1, 2012, Lou worked with Mike but at different companies"
            ],
            [
                "Lou Gore",
                "Director of Sales - Mid Atlantic",
                "November 1, 2012, Lou worked with Mike but at different companies"
            ],
            [
                "Lou Gore",
                "Director of Sales - Mid Atlantic",
                "November 1, 2012, Lou worked with Mike but at different companies"
            ],
            "Director of Sales - Mid Atlantic",
            [
                "Mike is a highly skilled business manager. As a vendor, it was impressive to watch the business he managed grow in difficult economic environments. He enters new markets and developes sound business practices to service new demands being placed on his peeople and operations."
            ],
            [
                "Mike is a highly skilled business manager. As a vendor, it was impressive to watch the business he managed grow in difficult economic environments. He enters new markets and developes sound business practices to service new demands being placed on his peeople and operations."
            ],
            [
                "Tina Singh",
                "tinapreet@gmail.com|Creative Director|",
                "August 3, 2017, Mike was a client of Tina’s",
                "Tina is amazing. I have used her for many projects from developing a few new company business logos, new marketing flyers, customer form letters and so much more.  Tina has worked on three business helping with the marketing development for me on companies I manage.  5 Stars Rating Mike EastwoodCEOBello Sol Inc"
            ],
            [
                "Tina Singh",
                "tinapreet@gmail.com|Creative Director|",
                "August 3, 2017, Mike was a client of Tina’s"
            ],
            [
                "Tina Singh",
                "tinapreet@gmail.com|Creative Director|",
                "August 3, 2017, Mike was a client of Tina’s"
            ],
            [
                "Tina Singh",
                "tinapreet@gmail.com|Creative Director|",
                "August 3, 2017, Mike was a client of Tina’s"
            ],
            "tinapreet@gmail.com|Creative Director|",
            [
                "Tina is amazing. I have used her for many projects from developing a few new company business logos, new marketing flyers, customer form letters and so much more.  Tina has worked on three business helping with the marketing development for me on companies I manage.  5 Stars Rating Mike EastwoodCEOBello Sol Inc"
            ],
            [
                "Tina is amazing. I have used her for many projects from developing a few new company business logos, new marketing flyers, customer form letters and so much more.  Tina has worked on three business helping with the marketing development for me on companies I manage.  5 Stars Rating Mike EastwoodCEOBello Sol Inc"
            ],
            [
                "Nolan Duke",
                "President at G.C Duke Equipment Ltd.",
                "January 9, 2015, Nolan was a client of Mike’s",
                "Nolan is a highly skilled business manager. As a vendor, it was impressive to watch the business he managed grow in difficult economic environments. He enters new markets and developes sound business practices to service new demands being placed on his peeople and operations"
            ],
            [
                "Nolan Duke",
                "President at G.C Duke Equipment Ltd.",
                "January 9, 2015, Nolan was a client of Mike’s"
            ],
            [
                "Nolan Duke",
                "President at G.C Duke Equipment Ltd.",
                "January 9, 2015, Nolan was a client of Mike’s"
            ],
            [
                "Nolan Duke",
                "President at G.C Duke Equipment Ltd.",
                "January 9, 2015, Nolan was a client of Mike’s"
            ],
            "President at G.C Duke Equipment Ltd.",
            [
                "Nolan is a highly skilled business manager. As a vendor, it was impressive to watch the business he managed grow in difficult economic environments. He enters new markets and developes sound business practices to service new demands being placed on his peeople and operations"
            ],
            [
                "Nolan is a highly skilled business manager. As a vendor, it was impressive to watch the business he managed grow in difficult economic environments. He enters new markets and developes sound business practices to service new demands being placed on his peeople and operations"
            ]
        ],
        "skills": [
            [
                "New Business Development",
                "See 153 endorsements for New Business Development",
                "99+",
                "New Business Development",
                "Endorse",
                "Trevor Soares and 99+ connections have given endorsements for this skill"
            ],
            [
                "New Business Development",
                "See 153 endorsements for New Business Development",
                "99+"
            ],
            [
                "Operations Management",
                "See 67 endorsements for Operations Management",
                "67",
                "Operations Management",
                "Endorse",
                "Endorsed by PATRICK J COONEY and 1 other who is highly skilled at this",
                "Endorsed by 5 of Mike’s colleagues at Jacobsen, A Textron Company"
            ],
            [
                "Operations Management",
                "See 67 endorsements for Operations Management",
                "67"
            ],
            [
                "Sales",
                "See 99 endorsements for Sales",
                "99",
                "Sales",
                "Endorse",
                "Endorsed by Geno Souza and 4 others who are highly skilled at this",
                "Endorsed by 2 of Mike’s colleagues at Wood-Mizer LLC"
            ],
            [
                "Sales",
                "See 99 endorsements for Sales",
                "99"
            ]
        ],
        "summary": "     A trusted, long-term leader to drive and support your organization for consistent, continued future growth and success. “It’s not only your people . . . it’s your process, too.”~  ~  ~  ~  EXECUTIVE LEADERSHIP  ~  ~  ~  ~As a seasoned executive with 25 years of experience, in sales, marketing. P&L and retail operations. My key area of expertise is to design new, more powerful, and profitable strategies for large and small organizations (annual revenues of $2M–$250 million) to increase sales, expand market share, and grow revenues.*  $600,000–$800,000 a month in new business by planning and executing improved, targeted \t\tmarketing and SEO strategies to generate new clients with Bello Sol, Inc. 2017 were 24% sales growth.*  61% increase in sales within three years as President of Golf Venture West.~  ~  ~  ~  NETWORKING & COLLABORATION  ~  ~  ~  ~As we are a global community of industries and people today, I leverage a vast network of relationships to secure multi-million dollar contracts with industry-leading companies. national accounts, government agencies, professional sports. *  New contracts in 2016,  partnering with Stanford, LinkedIn,Facebook, Kaiser Hospital, Google, Cisco, EA Sports, Apple, ESPN, and the SF 49ers  ~  ~  ~  ~  SPECIALTIES  ~  ~  ~  ~New Business DevelopmentGlobal OperationsMaximizing Sales & RevenueRestructuringsRevenue & Profit GrowthExecutive DirectionStrategic PartnershipsSales & MarketingInternational BusinessStrategic Planning~  ~  ~  ~  INDUSTRIES  ~  ~  ~  ~ManufacturingTransportationDistributionDealershipsRetailB2B & B2CI’m looking for a company at the cutting edge,with my background help a company with my skills to lead a team of sales territory managers, business managers or retail operations and make a difference. If you are looking for someone with energy, passion, creative problem-solving skills, and unstoppable sales ambition, please contact me at mdeastwood60@gmail.com or 925-482-4182.\n  \n  \n",
        "name": "Mike Eastwood",
        "title": "Executive of Sales & Marketing I Manufacturing I Hospitality I  Dealerships I  \nRetail Operations I Golf Industry",
        "url": "linkedin.com/in/mikedeastwood",
        "phone": "925-482-4182 (Home)",
        "email": "mdeastwood60@gmail.com"
    }
]