[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "38 Mutual Connections",
                "You and Peter both know Sean Sheppard, Chris Kitze, and 36 others"
            ],
            [
                "You Only Eat What You Kill",
                "Peter shared this"
            ],
            [
                "CBD industry needs an ‘Emerald Exchange’ type event where Hemp Farmers can connect directly with MJ and Hemp Product Manufacturers. The brokers in this market along with fake buyers are the reason no one trusts anyone and prices continue to fall, hurting the limited number of farmers who are trying to cultivate quality honest product. Need to cut out the middle man and help everyone get a fair price to truly calm down this market. Let’s build long term business relationships and treat people with respect.",
                "Looking to connect with Hemp Farms and CBD product manufacturers around the country to facilitate this movement.",
                "Peter commented"
            ],
            [
                "Cannabis colleagues: Here is my cannabis question for this weekend!",
                "I'm having a hard time getting into those sweet dabs. Any advice or thoughts?",
                "More detail: I smoke flower mainly because I love the taste. Dabbing gives my lungs pain.",
                "I'm no rookie here.",
                "Why? Why can’t I dab like champ? Meg Champion Thoughts?",
                "Peter commented"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Co-Owner",
                "Company Name",
                "Avia Travel Services",
                "Dates Employed",
                "Apr 2017 – Present",
                "Employment Duration",
                "7 mos",
                "Location",
                "Long Beach, California",
                "Avia Travel Services is a hospitality travel technology solutions provider founded in 1994 which provides private label, B2B and B2C web based travel booking engines, group and event lodging applications as well as travel services for both the FIT leisure and group travel space."
            ],
            [
                "Founder",
                "Company Name",
                "Entrepreneurs Credit Card",
                "Dates Employed",
                "Dec 2016 – Present",
                "Employment Duration",
                "11 mos",
                "Location",
                "Greater San Diego Area",
                "Taking from a business lifetime of entrepreneurial start-ups, with a Rolodex of service and financial contacts spanning over 4 decades, I have created what stands to become the single greatest access to start-up capital ever created. The \"Entrepreneurs Credit Card\" and attendant Program of successfully establishing one's own business stands as an unmatched opportunity. Never before has an unsecured capital debt structure in this magnitude ($175k) been available to the newly minted entrepreneur, complete with an initial outsourced and seasoned support team of professional service providers. Coupled with my own actual hard-won experience, earned over 150 start-ups in literally dozens of fields,  the \"Entrepreneurs Credit Card\" recipient will receive the greatest possible chance of business success ever available before to the start-up applicant.https://www.linkedin.com/pulse/entrepreneurs-credit-card-launched-peter-burns?trk=prof-posthttp://entcreditcard.com/imagineUpdate:Since the publication of the Linked In blog of December 10th (see link), outlining my \"Start-Up Program\" utilizing the $100k \"Entrepreneurs Credit Card\" as the initial funding resource...we are in definitive talks with 27 would-be entrepreneurs, representing nearly $3 million of funding commitments for 27 brand new business launches!https://www.linkedin.com/pulse/baking-cakeentrepreneur-style-peter-burns?trk=mp-reader-cardhttp://entcreditcard.com/imagine"
            ],
            [
                "Founder",
                "Company Name",
                "Luxury Product Placement",
                "Dates Employed",
                "Mar 2015 – Present",
                "Employment Duration",
                "2 yrs 8 mos",
                "Location",
                "Greater New York City Area, Southern California",
                "Taking from a lifetime of experience in living among members of \"The 1%\"​ (New Canaan, Nantucket, Sanibel Island) having family members that run both a very successful NYSE company and multi-billion dollar wealth fund and being at the stage of my life (I'm 60, unmarried with two grown children with families), I have just turned my avocation into my latest venture in Luxury Lifestyle Management. In the late 90s, I was one of the first members of the pioneer Destination Club, loved it and always wanted to figure out a way to turn this part-time lifestyle, into a full time profession. In doing what comes naturally, I have realized that lifelong dream.This unique application of monetizing underutilized assets (vacation villas, jets and yachts) will create a new \"disruptive technology\"​, first, in the field of Luxury Vacation Villa Rentals. Across the USA and the world, Luxury Vacation Homes and Villas are already popular. Prime destinations like California, Florida  and Colorado have many homes and villas available and demand is also high in other cities across the USA and the world.What is just as intriguing is that this niche market also opens up the most unique application of a truly, \"21st Century Product Placement Service,\"​ yet another \"disruptive technology.\" (www.theassetexchangecollection.com)I have surrounded myself with diverse industry leaders to form the new entity and am very busy aggregating elite products and services such as the finest luxury tour providers, private jet travel, yacht excursions, luxury watches, luxury furniture, and a plethora of luxury goods and the largest collection of exceptional multi-million dollar residences in the finest resort locations on the planet...exclusively for the patronage of luxury lifestyle clients. A luxury web site will organize and catalog these assets for villa members and clients."
            ],
            [
                "Founder- Business Development Division",
                "Company Name",
                "HLCost Seg.com",
                "Dates Employed",
                "Feb 2008 – Present",
                "Employment Duration",
                "9 yrs 9 mos",
                "Location",
                "Southern California",
                "UPDATE-I recently re-entered the Cost Segregation Marketing business and have been directing clients to my new engineering partner (35,000 cost segregation studies to date). I am also utilizing my Patent Pending Charitable Fund Raising Tool, using Cost Segregation Studies to generate US Tax Refunds that are then donated to designated 501c3s. (www.hlcostseg.com). We have successfully adapted the powerful cost segregation engineering process to our client base of luxury vacation villas and boutique hotels. (www.hlcostseg.com)Cost Segregation Initiatives (www.costseganalysts.com) markets the engineering process known as the Cost Segregation Study. This process, fully recognized by the IRS as a legitimate and powerful way to return significant tax benefits to the for profit, commercial property owner (individual, corporate) has been \"on the books\" for 20 years but seldom used outside of the \"The Big 4\" and only on behalf of only their highest paying clients. In fact, out of the estimated 81MM commercial buildings in the U.S. in private hands, only an estimated 20,000 cost segregation studies were performed in 2006. This means that there are approximately $400B in untapped tax benefits, which could be in the hands of the property owners. Cost Segregation Initiatives, has created a seamless method to free up these tax benefits to interested commercial property owners at a fraction of the cost that the \"Big 4\" would charge for the exact same service. Our engineers are all \"Big 4\" trained experts.www.hlcostseg.com"
            ],
            [
                "Co-Founder",
                "Company Name",
                "HL Villas (www.hlvillas.com)",
                "Dates Employed",
                "Mar 2015 – Present",
                "Employment Duration",
                "2 yrs 8 mos",
                "Location",
                "Boston, San Diego",
                "Over the past two years, after recognizing the fact that multi-million dollar vacation villas are occupied an industry average of only 26%, we started acquiring blocks of unused time in nearly 1000 such spectacular villas around the world. Due to the unique methodology of acquiring this unused time, we are then able to offer these villas at unpublished rates...often 30%-40% off the retail pricing to members of our Closed User Groups. This is unprecedented...luxury vacation villas that are \"full service\" (concierge, private chef, et al) at significantly discounted rates to luxury travelers looking for deals offered nowhere else. This company is truly a \"game changer\" in the luxury vacation world.www.hlvillas.com   www.lv4less.com"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Harvard Business School",
                "Degree Name",
                "OPM",
                "Field Of Study",
                "Business",
                "Dates attended or expected graduation",
                "1986 – 1987",
                "Activities and Societies:",
                "OPM 13"
            ],
            [
                "Harvard Business School",
                "Degree Name",
                "OPM",
                "Field Of Study",
                "Business",
                "Dates attended or expected graduation",
                "1986 – 1987",
                "Activities and Societies:",
                "OPM 13"
            ],
            [
                "University of Virginia",
                "Field Of Study",
                "Business",
                "Dates attended or expected graduation",
                "1976 – 1977",
                "Activities and Societies:",
                "St. Anthony Hall"
            ],
            [
                "University of Virginia",
                "Field Of Study",
                "Business",
                "Dates attended or expected graduation",
                "1976 – 1977",
                "Activities and Societies:",
                "St. Anthony Hall"
            ],
            [
                "United States Military Academy Preparatory School",
                "Field Of Study",
                "Pre-Law Studies",
                "Dates attended or expected graduation",
                "1975 – 1976",
                "Activities and Societies:",
                "Editor of School Newspaper, Lacrosse team"
            ],
            [
                "United States Military Academy Preparatory School",
                "Field Of Study",
                "Pre-Law Studies",
                "Dates attended or expected graduation",
                "1975 – 1976",
                "Activities and Societies:",
                "Editor of School Newspaper, Lacrosse team"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Entrepreneur-In-Residence",
                "Company Name",
                "NGO",
                "Dates volunteered",
                "Aug 2013 – Mar 2014",
                "Volunteer duration",
                "8 mos",
                "Cause",
                "Economic Empowerment",
                "I volunteered for an international charity in Ethiopia for 6 months. I acted as the de facto Entrepreneur-In-Residence assisting the NGO in creating unique opportunities to help their beneficiaries. I created at least one grant opportunity and obtained the sponsored funding (over $130k) for the charity. There are a dozen additional initiatives that I came up with and which may become NGO projects in the future. https://docs.google.com/a/stern.nyu.edu/file/d/0B7rvWfEJ-mLXRnY1Z0xMRVFYMnM/edit?usp=drive_web"
            ],
            "Recommendations",
            [
                "Ivy League Startups & Entrepreneurs: Ivy & Oxford Cambridge MIT Stanford Duke Berkeley Chicago",
                "16,702 members"
            ],
            [
                "House of Waterford Crystal",
                "501 followers"
            ],
            [
                "Scott CaseScott Case is a LinkedIn Influencer",
                "President at Upside; Founding CTO priceline.com",
                "64,501 followers"
            ],
            [
                "Amara Living Ltd",
                "784 followers"
            ],
            [
                "Morpho Luxury Asset Management (Morpho Group)",
                "333 followers"
            ],
            [
                "Luxury Travel & Tourism Industry Professionals",
                "19,921 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Ivy League Startups & Entrepreneurs: Ivy & Oxford Cambridge MIT Stanford Duke Berkeley Chicago",
                "16,702 members"
            ],
            [
                "Ivy League Startups & Entrepreneurs: Ivy & Oxford Cambridge MIT Stanford Duke Berkeley Chicago",
                "16,702 members"
            ],
            [
                "House of Waterford Crystal",
                "501 followers"
            ],
            [
                "House of Waterford Crystal",
                "501 followers"
            ],
            [
                "Scott CaseScott Case is a LinkedIn Influencer",
                "President at Upside; Founding CTO priceline.com",
                "64,501 followers"
            ],
            [
                "Scott CaseScott Case is a LinkedIn Influencer",
                "President at Upside; Founding CTO priceline.com",
                "64,501 followers"
            ],
            [
                "Scott Case is a LinkedIn Influencer"
            ],
            [
                "Amara Living Ltd",
                "784 followers"
            ],
            [
                "Amara Living Ltd",
                "784 followers"
            ],
            [
                "Morpho Luxury Asset Management (Morpho Group)",
                "333 followers"
            ],
            [
                "Morpho Luxury Asset Management (Morpho Group)",
                "333 followers"
            ],
            [
                "Luxury Travel & Tourism Industry Professionals",
                "19,921 members"
            ],
            [
                "Luxury Travel & Tourism Industry Professionals",
                "19,921 members"
            ]
        ],
        "recommendations": [
            [
                "George Pauli",
                "nutraMetrix  Consultant at nutraMetrix",
                "August 27, 2017, Peter worked with George in the same group",
                "I fist met Peter Burns around 2005, been so long I don't have the exact year, but it's been at least that.  Peter loves entrepreneurism and is truly at heart a builder and connector.  When I met Peter he was establishing a \"Club e\" which was an incubator for startup businesses, any and all businesses.  Peter put together regular monthly events where like minded people got together and shared, some did business with each other and others we remained friends.  It was a fantastic experience for me as a young semi-seasoned entrepreneur.Since 2005 I would sometimes reach out to Peter, he remembered me, he opened up his contact book to help me, with no reciprocity, just open heart to help.  He has helped me more than once in the past, for that I was able to move forward and accomplish my goals a little quicker, thank you Peter.Peter today is still a go getter and has a larger heart than ever.  I recently reached out to Peter in early 2017 for some reason, don't know why, but summer 2017 I was looking for something specific.  During the conversation I asked him \"do you know anyone who is in the ..... industry\"  and he says \"yes\" so I introduced him to a friend / business guy of mine named Jerry, and in the past week or two these two guys have put together something so amazing, their combined efforts will help new entrepreneurs grow a business faster than ever in many ways never seen possible.My hats off to peter Burns, long time business colleague and friend.  Peter Than You from the bottom of my Heart!Peace,George Pauli"
            ],
            [
                "George Pauli",
                "nutraMetrix  Consultant at nutraMetrix",
                "August 27, 2017, Peter worked with George in the same group"
            ],
            [
                "George Pauli",
                "nutraMetrix  Consultant at nutraMetrix",
                "August 27, 2017, Peter worked with George in the same group"
            ],
            [
                "George Pauli",
                "nutraMetrix  Consultant at nutraMetrix",
                "August 27, 2017, Peter worked with George in the same group"
            ],
            "nutraMetrix  Consultant at nutraMetrix",
            [
                "I fist met Peter Burns around 2005, been so long I don't have the exact year, but it's been at least that.  Peter loves entrepreneurism and is truly at heart a builder and connector.  When I met Peter he was establishing a \"Club e\" which was an incubator for startup businesses, any and all businesses.  Peter put together regular monthly events where like minded people got together and shared, some did business with each other and others we remained friends.  It was a fantastic experience for me as a young semi-seasoned entrepreneur.Since 2005 I would sometimes reach out to Peter, he remembered me, he opened up his contact book to help me, with no reciprocity, just open heart to help.  He has helped me more than once in the past, for that I was able to move forward and accomplish my goals a little quicker, thank you Peter.Peter today is still a go getter and has a larger heart than ever.  I recently reached out to Peter in early 2017 for some reason, don't know why, but summer 2017 I was looking for something specific.  During the conversation I asked him \"do you know anyone who is in the ..... industry\"  and he says \"yes\" so I introduced him to a friend / business guy of mine named Jerry, and in the past week or two these two guys have put together something so amazing, their combined efforts will help new entrepreneurs grow a business faster than ever in many ways never seen possible.My hats off to peter Burns, long time business colleague and friend.  Peter Than You from the bottom of my Heart!Peace,George Pauli"
            ],
            [
                "I fist met Peter Burns around 2005, been so long I don't have the exact year, but it's been at least that.  Peter loves entrepreneurism and is truly at heart a builder and connector.  When I met Peter he was establishing a \"Club e\" which was an incubator for startup businesses, any and all businesses.  Peter put together regular monthly events where like minded people got together and shared, some did business with each other and others we remained friends.  It was a fantastic experience for me as a young semi-seasoned entrepreneur.Since 2005 I would sometimes reach out to Peter, he remembered me, he opened up his contact book to help me, with no reciprocity, just open heart to help.  He has helped me more than once in the past, for that I was able to move forward and accomplish my goals a little quicker, thank you Peter.Peter today is still a go getter and has a larger heart than ever.  I recently reached out to Peter in early 2017 for some reason, don't know why, but summer 2017 I was looking for something specific.  During the conversation I asked him \"do you know anyone who is in the ..... industry\"  and he says \"yes\" so I introduced him to a friend / business guy of mine named Jerry, and in the past week or two these two guys have put together something so amazing, their combined efforts will help new entrepreneurs grow a business faster than ever in many ways never seen possible.My hats off to peter Burns, long time business colleague and friend.  Peter Than You from the bottom of my Heart!Peace,George Pauli"
            ],
            [
                "Kim Andreello",
                "SVP Business Development at Avia Travel Services",
                "January 10, 2017, Kim worked with Peter but at different companies",
                "I value Peter on many levels. He is a true blood entrepreneur with a sharp instinct for business opportunities. His visionary abilities to recognize market trends at an early stage impress me every time we speak. In my capacity as VP of business development at Alliance I had the pleasure to work with Peter to launch a unique booking platform offering luxury villas, apartments and hotels at rates far below retail."
            ],
            [
                "Kim Andreello",
                "SVP Business Development at Avia Travel Services",
                "January 10, 2017, Kim worked with Peter but at different companies"
            ],
            [
                "Kim Andreello",
                "SVP Business Development at Avia Travel Services",
                "January 10, 2017, Kim worked with Peter but at different companies"
            ],
            [
                "Kim Andreello",
                "SVP Business Development at Avia Travel Services",
                "January 10, 2017, Kim worked with Peter but at different companies"
            ],
            "SVP Business Development at Avia Travel Services",
            [
                "I value Peter on many levels. He is a true blood entrepreneur with a sharp instinct for business opportunities. His visionary abilities to recognize market trends at an early stage impress me every time we speak. In my capacity as VP of business development at Alliance I had the pleasure to work with Peter to launch a unique booking platform offering luxury villas, apartments and hotels at rates far below retail."
            ],
            [
                "I value Peter on many levels. He is a true blood entrepreneur with a sharp instinct for business opportunities. His visionary abilities to recognize market trends at an early stage impress me every time we speak. In my capacity as VP of business development at Alliance I had the pleasure to work with Peter to launch a unique booking platform offering luxury villas, apartments and hotels at rates far below retail."
            ],
            [
                "Elliott Konick",
                "Business Broker at Sunbelt Realty and Business Advisors",
                "January 5, 2017, Elliott worked with Peter but at different companies",
                "Peter BurnsIs a supreme analyst of people's abilities. His evaluation of connecting an individual to perform their strengths and thereby introducing them with a viable contact  is truly outstanding. He creates a potential win-win for everyone involved in business development and entrepreneurship. Elliott KonickSunbelt Business and Commercial Real Broker"
            ],
            [
                "Elliott Konick",
                "Business Broker at Sunbelt Realty and Business Advisors",
                "January 5, 2017, Elliott worked with Peter but at different companies"
            ],
            [
                "Elliott Konick",
                "Business Broker at Sunbelt Realty and Business Advisors",
                "January 5, 2017, Elliott worked with Peter but at different companies"
            ],
            [
                "Elliott Konick",
                "Business Broker at Sunbelt Realty and Business Advisors",
                "January 5, 2017, Elliott worked with Peter but at different companies"
            ],
            "Business Broker at Sunbelt Realty and Business Advisors",
            [
                "Peter BurnsIs a supreme analyst of people's abilities. His evaluation of connecting an individual to perform their strengths and thereby introducing them with a viable contact  is truly outstanding. He creates a potential win-win for everyone involved in business development and entrepreneurship. Elliott KonickSunbelt Business and Commercial Real Broker"
            ],
            [
                "Peter BurnsIs a supreme analyst of people's abilities. His evaluation of connecting an individual to perform their strengths and thereby introducing them with a viable contact  is truly outstanding. He creates a potential win-win for everyone involved in business development and entrepreneurship. Elliott KonickSunbelt Business and Commercial Real Broker"
            ],
            [
                "Anthony Parent",
                "Best Selling Author | Tax Attorney for the Entrepeneur | Angel Investor",
                "December 31, 2016, Anthony worked with Peter but at different companies",
                "It's always refreshing to deal with people who see high value opportunities every where. Peter is one such person, and he is not afraid to share his best ideas. Be warned -- he is one of those people who might tell that you aren't aiming high enough. And you better be able to handle a quick pace and posses an insatiable desire to get things done."
            ],
            [
                "Anthony Parent",
                "Best Selling Author | Tax Attorney for the Entrepeneur | Angel Investor",
                "December 31, 2016, Anthony worked with Peter but at different companies"
            ],
            [
                "Anthony Parent",
                "Best Selling Author | Tax Attorney for the Entrepeneur | Angel Investor",
                "December 31, 2016, Anthony worked with Peter but at different companies"
            ],
            [
                "Anthony Parent",
                "Best Selling Author | Tax Attorney for the Entrepeneur | Angel Investor",
                "December 31, 2016, Anthony worked with Peter but at different companies"
            ],
            "Best Selling Author | Tax Attorney for the Entrepeneur | Angel Investor",
            [
                "It's always refreshing to deal with people who see high value opportunities every where. Peter is one such person, and he is not afraid to share his best ideas. Be warned -- he is one of those people who might tell that you aren't aiming high enough. And you better be able to handle a quick pace and posses an insatiable desire to get things done."
            ],
            [
                "It's always refreshing to deal with people who see high value opportunities every where. Peter is one such person, and he is not afraid to share his best ideas. Be warned -- he is one of those people who might tell that you aren't aiming high enough. And you better be able to handle a quick pace and posses an insatiable desire to get things done."
            ],
            [
                "★ Robert Tepper ★",
                "Digital Marketing Specialist - Helping Companies Target the 3% That Are Looking to Buy Exactly What You Sell.",
                "December 24, 2016, ★ Robert worked with Peter but at different companies",
                "Peter is one of the most interesting people and accomplished entrepreneurs that I have met.  That is validated when just reading his LinkedIn profile.  In fact, looking at Peter's accomplishments you almost have to question whether he could really have done all those things.  After knowing Peter for almost 10 years, I can tell you that it's all real, and that Peter is a genuine, honest guy with a big heart.  And from my recent conversations with Peter, it looks like he's just getting started!"
            ],
            [
                "★ Robert Tepper ★",
                "Digital Marketing Specialist - Helping Companies Target the 3% That Are Looking to Buy Exactly What You Sell.",
                "December 24, 2016, ★ Robert worked with Peter but at different companies"
            ],
            [
                "★ Robert Tepper ★",
                "Digital Marketing Specialist - Helping Companies Target the 3% That Are Looking to Buy Exactly What You Sell.",
                "December 24, 2016, ★ Robert worked with Peter but at different companies"
            ],
            [
                "★ Robert Tepper ★",
                "Digital Marketing Specialist - Helping Companies Target the 3% That Are Looking to Buy Exactly What You Sell.",
                "December 24, 2016, ★ Robert worked with Peter but at different companies"
            ],
            "Digital Marketing Specialist - Helping Companies Target the 3% That Are Looking to Buy Exactly What You Sell.",
            [
                "Peter is one of the most interesting people and accomplished entrepreneurs that I have met.  That is validated when just reading his LinkedIn profile.  In fact, looking at Peter's accomplishments you almost have to question whether he could really have done all those things.  After knowing Peter for almost 10 years, I can tell you that it's all real, and that Peter is a genuine, honest guy with a big heart.  And from my recent conversations with Peter, it looks like he's just getting started!"
            ],
            [
                "Peter is one of the most interesting people and accomplished entrepreneurs that I have met.  That is validated when just reading his LinkedIn profile.  In fact, looking at Peter's accomplishments you almost have to question whether he could really have done all those things.  After knowing Peter for almost 10 years, I can tell you that it's all real, and that Peter is a genuine, honest guy with a big heart.  And from my recent conversations with Peter, it looks like he's just getting started!"
            ],
            [
                "Jeff Dameron",
                "Real Estate Agent at Encore Real Estate Group",
                "December 22, 2016, Jeff worked with Peter in different groups",
                "Peter is a an exceptional Entrepreneur, who really cares about people and has helped many beginning Entrepreneurs to get started and become successful!He is creative, smart, and has an imagination that has resulted in creating 100's of top notch businesses. I am enrolled in his vision of continuing to expand Entrepreneurship globally!"
            ],
            [
                "Jeff Dameron",
                "Real Estate Agent at Encore Real Estate Group",
                "December 22, 2016, Jeff worked with Peter in different groups"
            ],
            [
                "Jeff Dameron",
                "Real Estate Agent at Encore Real Estate Group",
                "December 22, 2016, Jeff worked with Peter in different groups"
            ],
            [
                "Jeff Dameron",
                "Real Estate Agent at Encore Real Estate Group",
                "December 22, 2016, Jeff worked with Peter in different groups"
            ],
            "Real Estate Agent at Encore Real Estate Group",
            [
                "Peter is a an exceptional Entrepreneur, who really cares about people and has helped many beginning Entrepreneurs to get started and become successful!He is creative, smart, and has an imagination that has resulted in creating 100's of top notch businesses. I am enrolled in his vision of continuing to expand Entrepreneurship globally!"
            ],
            [
                "Peter is a an exceptional Entrepreneur, who really cares about people and has helped many beginning Entrepreneurs to get started and become successful!He is creative, smart, and has an imagination that has resulted in creating 100's of top notch businesses. I am enrolled in his vision of continuing to expand Entrepreneurship globally!"
            ],
            [
                "Matt Creech",
                "EVP Business Development at UNDERground Villas & Hotels",
                "December 17, 2016, Peter was a client of Matt’s",
                "Peter enthusiastically shares his energy, expertise as an entrepreneur, master networking skills, candor and integrity with the people and projects that surround him.  His ability to remove obstacles and create value make him a wonderful resource and business partner."
            ],
            [
                "Matt Creech",
                "EVP Business Development at UNDERground Villas & Hotels",
                "December 17, 2016, Peter was a client of Matt’s"
            ],
            [
                "Matt Creech",
                "EVP Business Development at UNDERground Villas & Hotels",
                "December 17, 2016, Peter was a client of Matt’s"
            ],
            [
                "Matt Creech",
                "EVP Business Development at UNDERground Villas & Hotels",
                "December 17, 2016, Peter was a client of Matt’s"
            ],
            "EVP Business Development at UNDERground Villas & Hotels",
            [
                "Peter enthusiastically shares his energy, expertise as an entrepreneur, master networking skills, candor and integrity with the people and projects that surround him.  His ability to remove obstacles and create value make him a wonderful resource and business partner."
            ],
            [
                "Peter enthusiastically shares his energy, expertise as an entrepreneur, master networking skills, candor and integrity with the people and projects that surround him.  His ability to remove obstacles and create value make him a wonderful resource and business partner."
            ],
            [
                "Aimee Phillips",
                "Writer. Editor. Social Media Manager",
                "July 25, 2016, Peter worked with Aimee but at different companies",
                "Aimee reached out to me in response to one of my Linked In posts that caught her eye and that she wanted to re-post in her Luxury Lifestyle Magazine headquartered in London. I was flattered, said \"yes\" and ever since we have had an excellent collaboration sharing new Posts that fit in well with her magazine's audience. Aimee is a professional, very well spoken (in the written word) and a pleasure to deal with. I look forward to working in tandem for a long time."
            ],
            [
                "Aimee Phillips",
                "Writer. Editor. Social Media Manager",
                "July 25, 2016, Peter worked with Aimee but at different companies"
            ],
            [
                "Aimee Phillips",
                "Writer. Editor. Social Media Manager",
                "July 25, 2016, Peter worked with Aimee but at different companies"
            ],
            [
                "Aimee Phillips",
                "Writer. Editor. Social Media Manager",
                "July 25, 2016, Peter worked with Aimee but at different companies"
            ],
            "Writer. Editor. Social Media Manager",
            [
                "Aimee reached out to me in response to one of my Linked In posts that caught her eye and that she wanted to re-post in her Luxury Lifestyle Magazine headquartered in London. I was flattered, said \"yes\" and ever since we have had an excellent collaboration sharing new Posts that fit in well with her magazine's audience. Aimee is a professional, very well spoken (in the written word) and a pleasure to deal with. I look forward to working in tandem for a long time."
            ],
            [
                "Aimee reached out to me in response to one of my Linked In posts that caught her eye and that she wanted to re-post in her Luxury Lifestyle Magazine headquartered in London. I was flattered, said \"yes\" and ever since we have had an excellent collaboration sharing new Posts that fit in well with her magazine's audience. Aimee is a professional, very well spoken (in the written word) and a pleasure to deal with. I look forward to working in tandem for a long time."
            ]
        ],
        "skills": [],
        "summary": "    I am a serial start-up entrepreneur specializing in the establishment and operation of niche market multi-location businesses. My professional experience encompasses that entrepreneurial arena. In my 40 years -- I started at age 19 -- of business formation and ownership, I've started, run, sold and/or expanded between 100-150 individual businesses in dozens of fields. In August 2013, I left the US and moved to Africa. I volunteered with a large international NGO as their de facto \"Entrepreneur-In-Residence\"​ and not only was I able to create innovative new ways to help the NGO's beneficiaries but I discovered vast new opportunities as a private businessman in \"The Dark Continent.\"​ I had been busy establishing a half a dozen new enterprises with African joint venture partners and was working closely with both the local government as well as our US Embassy to create a viable and very lucrative bilateral pipeline between my business connections in the US and those in Africa.Specialties: Since founding my first company as a teenager, I have found that my expertise lies primarily in the establishing and growing of niche market businesses in fragmented industries...of any kind. I have a particularly good skill set of recognizing opportunities early on in the process and being able to fund almost any enterprise with creative financing techniques I've learned over my career. I am manifesting this innate skill set now on a magnified basis:https://www.linkedin.com/pulse/you-wannapreneur-start-up-entrepreneur-peter-burns?trk=prof-postTwo years ago, I  entered the luxury lifestyle consulting business and I had relocated back to my roots in the North East. My new venture includes luxury vacation homes and villas.... soon luxury products like yachts and jets. (www.luxuryproductplacement.com). We now have 974 multi-million dollar vacation villas.True to my nature, I started the \"Entrepreneurs Credit Card\" three months ago and Avia Travel Services very recently too. \n  \n  \n",
        "name": "Peter Burns",
        "title": "Founder at Entrepreneurs Credit Card",
        "url": "linkedin.com/in/peterburnsiii",
        "phone": "602 492 2041 (Work)",
        "email": "peter@hlcostseg.com"
    }
]