[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "96 Mutual Connections",
                "You and Jodi both know Eric Keosky-Smith, Steven Roberts, and 94 others"
            ],
            [
                "$1 Million Gift Gives 50 Students Full-ride Scholarship to Binghamton University",
                "Jodi liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Founder",
                "Company Name",
                "U & Improved Leadership Foundation",
                "Dates Employed",
                "2016 – Present",
                "Employment Duration",
                "1 yr",
                "Location",
                "Scottsdale, Arizona",
                "The U & Improved Leadership Foundation was born from a vision of sharing the benefits of our adult experiential development training with teenagers. In August 2014, we held our first U the Teen Leader class, which was so overwhelmingly embraced by the community that individuals and businesses immediately stepped up to sponsor teens. As a result, we launched the foundation to broaden our reach to more deserving teens who otherwise would not be able to fund this extremely rewarding learning opportunity."
            ],
            [
                "Founder & CEO",
                "Company Name",
                "U & Improved",
                "Dates Employed",
                "Dec 2008 – Present",
                "Employment Duration",
                "8 yrs 11 mos",
                "Location",
                "Scottsdale, Arizona",
                "As the Founder and CEO of U & Improved, I lead my training and support team in our mission to improve people’s lives through heart-based leadership development and impact the world on a global scale. Our core classes, U the Leader and U the Communicator, empower our graduates with the hands-on experience and skills to immediately lead and communicate with confidence in all areas of their lives. Our advanced leadership classes, U the Warrior and U the Samurai, are designed for high-functioning individuals who seek to challenge their inner strength and take actionable steps toward a life of purpose and passion. We also offer U the Teen Leader -- a must for instilling focus, effective communication skills, a sense of teamwork and self-confidence in teens transitioning in adulthood.Unlike other professional and personal development training companies, U & Improved classes are small, intimate and lead students through experiential processes that give them the knowledge to immediately implement improvements in all areas of their lives. Our highly skilled trainers give each student individual attention, feedback and coaching. From Fortune 500 professionals to small business owners, our graduates emerge from our classes with the knowledge, tools and experience to immediately be more effective and responsive leaders.We also offer workshops, fast-track courses and custom corporate training."
            ],
            [
                "Chief Relationship Officer",
                "Company Name",
                "Amplify U",
                "Dates Employed",
                "Mar 2010 – Nov 2012",
                "Employment Duration",
                "2 yrs 9 mos",
                "We created Amplify U to deliver powerful personal and professional training programs to create dramatic shifts in peoples' businesses and lives. Our two and a half day weekend trainings develop people in all areas of their lives, allowing them to break the barriers that hold them back and move forward in a dynamic and powerful way, to create success both personally and professionally."
            ],
            [
                "Co-Founder",
                "Company Name",
                "Girlfriend University",
                "Dates Employed",
                "Oct 2009 – Feb 2012",
                "Employment Duration",
                "2 yrs 5 mos",
                "We developed Girlfriend University to empower and educate women with strategies for creating successful and profitable businesses. We deliver results-driven business training, coaching and strategy sessions with passion, enthusiasm and creativity with measurable, tangible benchmarks for progress and success."
            ],
            [
                "Co-Founder",
                "Company Name",
                "NOLO Design Concepts",
                "Dates Employed",
                "Jan 2005 – Oct 2008",
                "Employment Duration",
                "3 yrs 10 mos",
                "Location",
                "Scottsdale, AZ"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Southwest Institute of Healing Arts",
                "Degree Name",
                "Masters Certification in Coaching",
                "Field Of Study",
                "Coaching/Speaking/Training",
                "Dates attended or expected graduation",
                "2008 – 2009"
            ],
            [
                "Southwest Institute of Healing Arts",
                "Degree Name",
                "Masters Certification in Coaching",
                "Field Of Study",
                "Coaching/Speaking/Training",
                "Dates attended or expected graduation",
                "2008 – 2009"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor of Arts",
                "Field Of Study",
                "Interpersonal and Intercultural Communications",
                "Dates attended or expected graduation",
                "1990 – 1994"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor of Arts",
                "Field Of Study",
                "Interpersonal and Intercultural Communications",
                "Dates attended or expected graduation",
                "1990 – 1994"
            ],
            "Recommendations",
            [
                "Dr. Travis BradberryDr. Travis Bradberry is a LinkedIn Influencer",
                "Coauthor EMOTIONAL INTELLIGENCE 2.0 & President at TalentSmart",
                "2,320,931 followers"
            ],
            [
                "Women Executives Leadership Forum - The community for women senior executives",
                "19 members"
            ],
            [
                "On The Edge Of Up",
                "27 members"
            ],
            [
                "Arizona State University",
                "422,919 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,023,879 followers"
            ],
            [
                "Leading Women",
                "1,523 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Dr. Travis BradberryDr. Travis Bradberry is a LinkedIn Influencer",
                "Coauthor EMOTIONAL INTELLIGENCE 2.0 & President at TalentSmart",
                "2,320,931 followers"
            ],
            [
                "Dr. Travis BradberryDr. Travis Bradberry is a LinkedIn Influencer",
                "Coauthor EMOTIONAL INTELLIGENCE 2.0 & President at TalentSmart",
                "2,320,931 followers"
            ],
            [
                "Dr. Travis Bradberry is a LinkedIn Influencer"
            ],
            [
                "Women Executives Leadership Forum - The community for women senior executives",
                "19 members"
            ],
            [
                "Women Executives Leadership Forum - The community for women senior executives",
                "19 members"
            ],
            [
                "On The Edge Of Up",
                "27 members"
            ],
            [
                "On The Edge Of Up",
                "27 members"
            ],
            [
                "Arizona State University",
                "422,919 followers"
            ],
            [
                "Arizona State University",
                "422,919 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,023,879 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,023,879 followers"
            ],
            [
                "Richard Branson is a LinkedIn Influencer"
            ],
            [
                "Leading Women",
                "1,523 members"
            ],
            [
                "Leading Women",
                "1,523 members"
            ]
        ],
        "recommendations": [
            [
                "Kristen Young",
                "Founder | Creative Director of Tenleaf Studios",
                "January 6, 2014, Jodi managed Kristen directly",
                "Kristen's creativity and graphic design talent are boundless. She has an open mind to the concepts or guidelines and then comes up with concepts and ideas that allow you options to choose from that are a \"best fit\". She has a warm and helpful personality and always aims to go above and beyond!"
            ],
            [
                "Kristen Young",
                "Founder | Creative Director of Tenleaf Studios",
                "January 6, 2014, Jodi managed Kristen directly"
            ],
            [
                "Kristen Young",
                "Founder | Creative Director of Tenleaf Studios",
                "January 6, 2014, Jodi managed Kristen directly"
            ],
            [
                "Kristen Young",
                "Founder | Creative Director of Tenleaf Studios",
                "January 6, 2014, Jodi managed Kristen directly"
            ],
            "Founder | Creative Director of Tenleaf Studios",
            [
                "Kristen's creativity and graphic design talent are boundless. She has an open mind to the concepts or guidelines and then comes up with concepts and ideas that allow you options to choose from that are a \"best fit\". She has a warm and helpful personality and always aims to go above and beyond!"
            ],
            [
                "Kristen's creativity and graphic design talent are boundless. She has an open mind to the concepts or guidelines and then comes up with concepts and ideas that allow you options to choose from that are a \"best fit\". She has a warm and helpful personality and always aims to go above and beyond!"
            ]
        ],
        "skills": [],
        "summary": "    As a curator of inspirational quotes, I have one that drives me every day to live my passion and encourage others to embrace theirs: “There is no passion to be found in settling for a life that is less than one you are capable of living” from Nelson Mandela.I live my life, raise my two young daughters and run my business with this in mind. I believe that we all have more, want more and are capable of more — once we uncover what truly fuels our passions. After nearly 20 years as a business development and marketing professional, I made the decision to embrace my calling to make a positive impact on people’s lives and launched U & Improved in 2008. An award-winning leadership development company, U & Improved is the manifestation of Mandela’s prophetic quote. Our goal as a company is to empower the people we touch to have meaningful, powerful and fulfilling relationships with those in their work and home lives. We develop leaders who won’t settle for a life mediocrity and who lead from the heart, inspire others through their actions and take steps every minute of every day to live out the vision for their lives.U & Improved is based in Scottsdale, Arizona and led by an elite team of highly experienced trainers who give each student individualized attention, feedback and coaching. Our experiential classes are small, intimate and lead students through processes that impart the knowledge to immediately implement improvements in their personal and professional lives. Classes are challenging and rewarding and include follow-up coaching and access to an engaged, like-minded community of alumni.Has the time come for you to embrace the words of Nelson Mandela? I vote yes. Contact me right now and let me know you’re ready to take your leadership and communications skills beyond what you’ve ever imagined. I personally guarantee you that our classes are unlike anything you have ever experienced and will improve every area of your life.\n  \n  \n",
        "name": "Jodi Low",
        "title": "Founder & CEO, U & Improved | Inspirational Speaker | Corporate Trainer",
        "url": "linkedin.com/in/jodi-low-1b4a661b",
        "phone": "480-305-5665 (Work)",
        "email": "jodi@uandimproved.com"
    }
]