[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "5 Mutual Connections",
                "You and Chris both know John Fanning, Mark Zawacki, and 3 others"
            ],
            [
                "Chris can introduce you to 7 people at Facebook",
                "You are following Facebook"
            ],
            [
                "NPower California",
                "Chris shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Chief Operating Officer",
                "Company Name",
                "Project Inertia",
                "Dates Employed",
                "Jan 2017 – Present",
                "Employment Duration",
                "11 mos",
                "Location",
                "Greater San Diego Area",
                "Currently in use on highly demanding projects totaling more than $8 billion, Project Inertia brings together fragmented pieces of the construction process to create efficiencies, identifying and addressing constraints before they have a negative impact on budget or schedule.Wearing many hats every day, my primary task is to build systems, infrastructure, culture & processes that enable the company to scale and meet an explosively growing customer base."
            ],
            [
                "VP Engineering - Internet of Things",
                "Company Name",
                "Candi Controls, Inc.",
                "Dates Employed",
                "Mar 2016 – Dec 2016",
                "Employment Duration",
                "10 mos",
                "Location",
                "Oakland, CA (SF Bay Area)",
                "Candi Controls builds embedded software & cloud-hosted infrastructure to enable bi-directional control of Internet of Things (IoT) & legacy devices in commercial and industrial buildings.  Wearing many hats, but mostly focused on:   - Guiding & growing the engineering team  - Thought leadership  - Improving processes & tools  - Large scale systems design  - Developing business models & roadmaps  - Enabling & managing partner relationships  - Translating complex technology to non-technical partners & investors"
            ],
            [
                "CTO - Personal big data & IoT",
                "Company Name",
                "Sherbit",
                "Dates Employed",
                "Mar 2014 – Feb 2016",
                "Employment Duration",
                "2 yrs",
                "Location",
                "San Francisco, CA",
                "Co-founder, CTO & board member at Sherbit, a personal data analytics startup. Building internet scale big data analytics & aggregation backend with several frontends for mobile & web.  Gathered data from large numbers of IoT devices.- Integrating & normalizing data in real-time from thousands of data sources.   - Code-free provisioning & transformation of new data sources- Designed big-data analytics architecture that preserves data confidentiality while allowing population level metrics.- Built a scalable, on-demand, provider agnostic, cloud-deployed architecture."
            ],
            [
                "Managing Partner - Innovation R&D",
                "Company Name",
                "C32",
                "Dates Employed",
                "Feb 2010 – Jan 2016",
                "Employment Duration",
                "6 yrs",
                "Location",
                "San Francisco, CA & Los Angeles, CA",
                "Based in San Francisco and Los Angeles, C32 is a software & electronics R&D and management consulting firm with clients from startups to F500s. We help companies understand how to use technology to maximize results by doing 'boundary layer' research and applying findings in culturally appropriate ways.   This is my own consulting firm that I use for side projects - a few other people are involved as well.Some of our recent projects➔ Built a big data analytics tools to discover vertical specific early stage companies with traction➔ Re-hosted major analytics platform, scaling from stand-alone to multi-tenant public cloud➔ Designed streaming digital music hardware retrofits for vintage stereos",
                "Media (1)",
                "This position has 1 media",
                "Hacker League Qeo Connected Home Challenge - Judge Panel",
                "Hacker League Qeo Connected Home Challenge - Judge Panel",
                "This media is a link"
            ],
            [
                "Board Member - Technology Startups",
                "Company Name",
                "Advisory Board at Various Companies",
                "Dates Employed",
                "2005 – Jan 2016",
                "Employment Duration",
                "11 yrs",
                "Over the years, I have worked with over seventy venture backed startups.  These are some of the startups where I had a board position. I still hold board positions, but LinkedIn doesn't let you control order, so I am forcing it with an end date.Sherbit (2014 - present)https://www.sherbit.ioSherbit is a personal analytics platform.Arcimoto (2012 - 2014) http://www.arcimoto.comArcimoto is radically re-thinking transportation by building an affordable electric vehicle platform. New Earth (2010 – 2013) - http://www.earthster.orgNew Earth/Earthster has built one of the most widely used life cycle assessment platforms in the world. This platform allows organizations such as Walmart and the UN to assess environmental and other impacts of products, materials and processes. ChikPea Inc (2010 – 2011) http://www.chikpea.comChikPea's market leading cloud-based billing solutions enable metered, flat rate or other subscription-style billing to be varied over time, by market or by product combination. International Characters (2009 – Present)http://www.international-characters.comInternational Characters provides hardware based text-processing acceleration to a variety of industries. Colligent, Inc. (2006 - 2012)http://www.colligent.comColligent provides brand affinity analysis for social networks. GoldenEye (2008 – 2009)http://www.goldeneyedms.comGoldenEye built a cloud-based integrated ERP/CRM system for automotive dealerships."
            ],
            [
                "VP Corporate Development & Engineering - Public Cloud & Big Data",
                "Company Name",
                "Earthster.io",
                "Dates Employed",
                "Mar 2011 – Feb 2013",
                "Employment Duration",
                "2 yrs",
                "Location",
                "San Francisco, Boston, Toronto, Germany & UK",
                "Earthster is a cloud-based (SaaS) big-data startup which discovers & calculates sustainability metrics (LCA) across global supply chains.  Earthster raised a total $2.7m in funding from Walmart, Safeway, Georgia-Pacific & others.Built a core engineering team that re-factored a standalone big-data application for public cloud deployment as multi-tenant subscription service.  Delivered ISO-compliant lifecycle analysis (LCA) & visualizations through a platform agnostic HTML5 & Javascript browser interface designed to look & feel like a desktop application.Helped define long term product vision, including basic revenue model & product roadmap.  Managed North American and EU-based development teams."
            ],
            [
                "VP Software - Venture Capital",
                "Company Name",
                "EastLake Ventures",
                "Dates Employed",
                "Jun 2009 – Dec 2009",
                "Employment Duration",
                "7 mos",
                "Location",
                "San Francisco Bay Area",
                "Advised venture clients on potential partners, technology focus and ecosystem development."
            ],
            [
                "Chief Strategy Officer & Co-Founder - Open Source Business + Technology Strategy",
                "Company Name",
                "Olliance Group",
                "Dates Employed",
                "2001 – 2009",
                "Employment Duration",
                "8 yrs",
                "Location",
                "San Francisco Bay Area",
                "Olliance helped create an industry-wide paradigm shift, one company at a time, moving open source from the fringes to the mainstream.    Clients ranged from venture backed startups to national government and F100 companies.Helped Facebook, IBM, Accenture, eBay, Microsoft & others release large amounts of software under open source licenses and build future products around open source.  Worked with over 50 venture-backed startups on turn-arounds, revenue models & technology strategy with several successful exits.Olliance was sold to BlackDuck in December 2010."
            ],
            [
                "Interim Chief Technology Officer (CTO) - Open Source Ecosystem",
                "Company Name",
                "Free Standards Group (now the Linux Foundation)",
                "Dates Employed",
                "2005 – 2005",
                "Employment Duration",
                "less than a year",
                "Location",
                "San Francisco Bay Area",
                "The Linux Foundation is a non-profit consortium dedicated to fostering the growth of Linux. Created business & technical roadmap, responsible for re-vamping the Linux Standards Base (LSB) and evangelizing the new direction to the community."
            ],
            [
                "Interim Chief Technology Officer (CTO) - Supply Chain Analytics",
                "Company Name",
                "TRX International",
                "Dates Employed",
                "2001 – 2002",
                "Employment Duration",
                "1 yr",
                "Location",
                "San Francisco Bay Area",
                "TRX provided supply chain insight to companies, with a specialization on tracking container shipments through customs clearance.  Built the front end, which provided information in real-time regarding current clearance status, down to the individual pallet, all through a SaaS-delivered service offering.  Clients included HP, GE Gas Turbines and other major companies.  Sold in 2002."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Universiteit van Amsterdam",
                "Degree Name",
                "Master of Science (M.S.)",
                "Field Of Study",
                "Environmental Policy (Incomplete)"
            ],
            [
                "Universiteit van Amsterdam",
                "Degree Name",
                "Master of Science (M.S.)",
                "Field Of Study",
                "Environmental Policy (Incomplete)"
            ],
            [
                "University of Maine"
            ],
            [
                "University of Maine"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 47 more skills"
            ],
            "Recommendations",
            [
                "ROI·DNA",
                "3,914 followers"
            ],
            [
                "Zoote",
                "124,003 followers"
            ],
            [
                "InMobi",
                "88,519 followers"
            ],
            [
                "Angel Investor Group",
                "73,919 members"
            ],
            [
                "PINCHme",
                "2,077 followers"
            ],
            [
                "Southern California Venture Community",
                "13,897 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "ROI·DNA",
                "3,914 followers"
            ],
            [
                "ROI·DNA",
                "3,914 followers"
            ],
            [
                "Zoote",
                "124,003 followers"
            ],
            [
                "Zoote",
                "124,003 followers"
            ],
            [
                "InMobi",
                "88,519 followers"
            ],
            [
                "InMobi",
                "88,519 followers"
            ],
            [
                "Angel Investor Group",
                "73,919 members"
            ],
            [
                "Angel Investor Group",
                "73,919 members"
            ],
            [
                "PINCHme",
                "2,077 followers"
            ],
            [
                "PINCHme",
                "2,077 followers"
            ],
            [
                "Southern California Venture Community",
                "13,897 members"
            ],
            [
                "Southern California Venture Community",
                "13,897 members"
            ]
        ],
        "recommendations": [
            [
                "James Morrow",
                "Senior Javascript Engineer",
                "January 3, 2017, James reported directly to Chris",
                "Chris is one of the best engineering leaders I've had the pleasure to work with.  He's got a keen mind, loves to problem-solve, and is eminently even-keeled and reasonable.  One of his primary strengths is his ability to be a great listener, drawing out a complete understanding and consensus between the engineering minds working with him.  He has a deep curiosity and a great sense of humor.  I would love to work with him again sometime down the road."
            ],
            [
                "James Morrow",
                "Senior Javascript Engineer",
                "January 3, 2017, James reported directly to Chris"
            ],
            [
                "James Morrow",
                "Senior Javascript Engineer",
                "January 3, 2017, James reported directly to Chris"
            ],
            [
                "James Morrow",
                "Senior Javascript Engineer",
                "January 3, 2017, James reported directly to Chris"
            ],
            "Senior Javascript Engineer",
            [
                "Chris is one of the best engineering leaders I've had the pleasure to work with.  He's got a keen mind, loves to problem-solve, and is eminently even-keeled and reasonable.  One of his primary strengths is his ability to be a great listener, drawing out a complete understanding and consensus between the engineering minds working with him.  He has a deep curiosity and a great sense of humor.  I would love to work with him again sometime down the road."
            ],
            [
                "Chris is one of the best engineering leaders I've had the pleasure to work with.  He's got a keen mind, loves to problem-solve, and is eminently even-keeled and reasonable.  One of his primary strengths is his ability to be a great listener, drawing out a complete understanding and consensus between the engineering minds working with him.  He has a deep curiosity and a great sense of humor.  I would love to work with him again sometime down the road."
            ],
            [
                "Gregory Norris",
                "Co-Director, SHINE, Harvard School of Public Health; Chief Scientist, International Living Future Institute",
                "April 7, 2014, Gregory managed Chris directly",
                "Chris is exceptionally bright, creative, experienced and knowledgable. He is an excellent leader and also a very congenial team player.  We were lucky to be able to work with Chris."
            ],
            [
                "Gregory Norris",
                "Co-Director, SHINE, Harvard School of Public Health; Chief Scientist, International Living Future Institute",
                "April 7, 2014, Gregory managed Chris directly"
            ],
            [
                "Gregory Norris",
                "Co-Director, SHINE, Harvard School of Public Health; Chief Scientist, International Living Future Institute",
                "April 7, 2014, Gregory managed Chris directly"
            ],
            [
                "Gregory Norris",
                "Co-Director, SHINE, Harvard School of Public Health; Chief Scientist, International Living Future Institute",
                "April 7, 2014, Gregory managed Chris directly"
            ],
            "Co-Director, SHINE, Harvard School of Public Health; Chief Scientist, International Living Future Institute",
            [
                "Chris is exceptionally bright, creative, experienced and knowledgable. He is an excellent leader and also a very congenial team player.  We were lucky to be able to work with Chris."
            ],
            [
                "Chris is exceptionally bright, creative, experienced and knowledgable. He is an excellent leader and also a very congenial team player.  We were lucky to be able to work with Chris."
            ],
            [
                "Alex Wied",
                "Partner at Project Partners Management GmbH",
                "November 29, 2011, Alex worked with Chris but at different companies",
                "I had the privilege of working with Chris when I setup the Accenture Innovation Center for Open Source. Accenture asked Chris to assist us understanding the (commercial) open source market and identify key players, trends and technology directions relevant for large scale enterprises. We also leveraged Chris’ outstanding expertise to reflect and discuss our thoughts on shaping the Center strategically. Chris help was invaluable. His understanding of the open source market and communities in depth and breadth is very impressive. With his advice we were able to set strategic directions which - looking back - were absolutely spot on. Chris has this rare mix of very deep technology expertise and entrepreneurial leadership. I wouldn’t hesitate to hire him again and can warmly recommend Chris to any executive looking for advice in technology and business development."
            ],
            [
                "Alex Wied",
                "Partner at Project Partners Management GmbH",
                "November 29, 2011, Alex worked with Chris but at different companies"
            ],
            [
                "Alex Wied",
                "Partner at Project Partners Management GmbH",
                "November 29, 2011, Alex worked with Chris but at different companies"
            ],
            [
                "Alex Wied",
                "Partner at Project Partners Management GmbH",
                "November 29, 2011, Alex worked with Chris but at different companies"
            ],
            "Partner at Project Partners Management GmbH",
            [
                "I had the privilege of working with Chris when I setup the Accenture Innovation Center for Open Source. Accenture asked Chris to assist us understanding the (commercial) open source market and identify key players, trends and technology directions relevant for large scale enterprises. We also leveraged Chris’ outstanding expertise to reflect and discuss our thoughts on shaping the Center strategically. Chris help was invaluable. His understanding of the open source market and communities in depth and breadth is very impressive. With his advice we were able to set strategic directions which - looking back - were absolutely spot on. Chris has this rare mix of very deep technology expertise and entrepreneurial leadership. I wouldn’t hesitate to hire him again and can warmly recommend Chris to any executive looking for advice in technology and business development."
            ],
            [
                "I had the privilege of working with Chris when I setup the Accenture Innovation Center for Open Source. Accenture asked Chris to assist us understanding the (commercial) open source market and identify key players, trends and technology directions relevant for large scale enterprises. We also leveraged Chris’ outstanding expertise to reflect and discuss our thoughts on shaping the Center strategically. Chris help was invaluable. His understanding of the open source market and communities in depth and breadth is very impressive. With his advice we were able to set strategic directions which - looking back - were absolutely spot on. Chris has this rare mix of very deep technology expertise and entrepreneurial leadership. I wouldn’t hesitate to hire him again and can warmly recommend Chris to any executive looking for advice in technology and business development."
            ],
            [
                "fred popowich",
                "Executive Director, Big Data Initiative at Simon Fraser University",
                "July 9, 2010, fred was a client of Chris’",
                "Chris has provided us with some great insights into how to turn our technology into products that deal with critical market needs."
            ],
            [
                "fred popowich",
                "Executive Director, Big Data Initiative at Simon Fraser University",
                "July 9, 2010, fred was a client of Chris’"
            ],
            [
                "fred popowich",
                "Executive Director, Big Data Initiative at Simon Fraser University",
                "July 9, 2010, fred was a client of Chris’"
            ],
            [
                "fred popowich",
                "Executive Director, Big Data Initiative at Simon Fraser University",
                "July 9, 2010, fred was a client of Chris’"
            ],
            "Executive Director, Big Data Initiative at Simon Fraser University",
            [
                "Chris has provided us with some great insights into how to turn our technology into products that deal with critical market needs."
            ],
            [
                "Chris has provided us with some great insights into how to turn our technology into products that deal with critical market needs."
            ],
            [
                "Janeen Marquardt",
                "Building Successful Companies through Salesforce CRM, CPQ, & ERP; Specializing in Professional Services & Best Practices",
                "February 22, 2009, Chris worked with Janeen in the same group",
                "Chris is an extremely able manager and communicator. He can organize resources to effectively complete any project, even those in unstructured environments. I highly recommend Chris for any opportunity that may arise."
            ],
            [
                "Janeen Marquardt",
                "Building Successful Companies through Salesforce CRM, CPQ, & ERP; Specializing in Professional Services & Best Practices",
                "February 22, 2009, Chris worked with Janeen in the same group"
            ],
            [
                "Janeen Marquardt",
                "Building Successful Companies through Salesforce CRM, CPQ, & ERP; Specializing in Professional Services & Best Practices",
                "February 22, 2009, Chris worked with Janeen in the same group"
            ],
            [
                "Janeen Marquardt",
                "Building Successful Companies through Salesforce CRM, CPQ, & ERP; Specializing in Professional Services & Best Practices",
                "February 22, 2009, Chris worked with Janeen in the same group"
            ],
            "Building Successful Companies through Salesforce CRM, CPQ, & ERP; Specializing in Professional Services & Best Practices",
            [
                "Chris is an extremely able manager and communicator. He can organize resources to effectively complete any project, even those in unstructured environments. I highly recommend Chris for any opportunity that may arise."
            ],
            [
                "Chris is an extremely able manager and communicator. He can organize resources to effectively complete any project, even those in unstructured environments. I highly recommend Chris for any opportunity that may arise."
            ],
            [
                "Paul Doscher",
                "CEO",
                "February 10, 2009, Paul was a client of Chris’",
                "Chris is one of most throughtful, well versed and insightful consultants I have had the pleasure to work with. He always brings high value to any meeting with honest and straightforward advice that promotes positive action. I would hire him again."
            ],
            [
                "Paul Doscher",
                "CEO",
                "February 10, 2009, Paul was a client of Chris’"
            ],
            [
                "Paul Doscher",
                "CEO",
                "February 10, 2009, Paul was a client of Chris’"
            ],
            [
                "Paul Doscher",
                "CEO",
                "February 10, 2009, Paul was a client of Chris’"
            ],
            "CEO ",
            [
                "Chris is one of most throughtful, well versed and insightful consultants I have had the pleasure to work with. He always brings high value to any meeting with honest and straightforward advice that promotes positive action. I would hire him again."
            ],
            [
                "Chris is one of most throughtful, well versed and insightful consultants I have had the pleasure to work with. He always brings high value to any meeting with honest and straightforward advice that promotes positive action. I would hire him again."
            ],
            [
                "Shervin Talieh",
                "Founder/CEO at PartnerHero",
                "February 10, 2009, Shervin worked with Chris but at different companies",
                "Chris has been invaluable in helping us think through the various OpenSource and SaaS business model concepts we wanted to incorporate into Golden Eye. Furthermore, he is highly respected by the VC community, and was able to introduce us to several investor groups.His ability to think strategically, across multiple business functions, and follow through with execution support is what sets him apart. He has been a great asset to our executive team, and is helping us reduce our execution risks as we navigate through the various stages of corporate evolution."
            ],
            [
                "Shervin Talieh",
                "Founder/CEO at PartnerHero",
                "February 10, 2009, Shervin worked with Chris but at different companies"
            ],
            [
                "Shervin Talieh",
                "Founder/CEO at PartnerHero",
                "February 10, 2009, Shervin worked with Chris but at different companies"
            ],
            [
                "Shervin Talieh",
                "Founder/CEO at PartnerHero",
                "February 10, 2009, Shervin worked with Chris but at different companies"
            ],
            "Founder/CEO at PartnerHero",
            [
                "Chris has been invaluable in helping us think through the various OpenSource and SaaS business model concepts we wanted to incorporate into Golden Eye. Furthermore, he is highly respected by the VC community, and was able to introduce us to several investor groups.His ability to think strategically, across multiple business functions, and follow through with execution support is what sets him apart. He has been a great asset to our executive team, and is helping us reduce our execution risks as we navigate through the various stages of corporate evolution."
            ],
            [
                "Chris has been invaluable in helping us think through the various OpenSource and SaaS business model concepts we wanted to incorporate into Golden Eye. Furthermore, he is highly respected by the VC community, and was able to introduce us to several investor groups.His ability to think strategically, across multiple business functions, and follow through with execution support is what sets him apart. He has been a great asset to our executive team, and is helping us reduce our execution risks as we navigate through the various stages of corporate evolution."
            ],
            [
                "Haroon Ur Rashid",
                "Principle Software Engineer at Arbisoft",
                "July 10, 2017, Chris managed Haroon directly",
                "Haroon worked on critical fixes and new features in our core application.  He proved himself to be a dependable and hard worker with solid problem solving and technical skills. I was always impressed by Haroon’s ability to complete the work assigned to him on time and his ability to figure out complex code with little help or mentorship.   Haroon would be an asset to have on any team and I highly recommend him."
            ],
            [
                "Haroon Ur Rashid",
                "Principle Software Engineer at Arbisoft",
                "July 10, 2017, Chris managed Haroon directly"
            ],
            [
                "Haroon Ur Rashid",
                "Principle Software Engineer at Arbisoft",
                "July 10, 2017, Chris managed Haroon directly"
            ],
            [
                "Haroon Ur Rashid",
                "Principle Software Engineer at Arbisoft",
                "July 10, 2017, Chris managed Haroon directly"
            ],
            "Principle Software Engineer at Arbisoft",
            [
                "Haroon worked on critical fixes and new features in our core application.  He proved himself to be a dependable and hard worker with solid problem solving and technical skills. I was always impressed by Haroon’s ability to complete the work assigned to him on time and his ability to figure out complex code with little help or mentorship.   Haroon would be an asset to have on any team and I highly recommend him."
            ],
            [
                "Haroon worked on critical fixes and new features in our core application.  He proved himself to be a dependable and hard worker with solid problem solving and technical skills. I was always impressed by Haroon’s ability to complete the work assigned to him on time and his ability to figure out complex code with little help or mentorship.   Haroon would be an asset to have on any team and I highly recommend him."
            ],
            [
                "James Morrow",
                "Senior Javascript Engineer",
                "December 17, 2016, Chris managed James directly",
                "James is a intelligent, versatile and talented software engineer.   He is good at solving complex problems and architecting solid solutions.   At Candi, he dove into a mess of a codebase and refactored/streamlined it to make it workable and efficient.  He was also a valuable team member when it came to process and software development lifecyle issues, where his extensive experience was very helpful."
            ],
            [
                "James Morrow",
                "Senior Javascript Engineer",
                "December 17, 2016, Chris managed James directly"
            ],
            [
                "James Morrow",
                "Senior Javascript Engineer",
                "December 17, 2016, Chris managed James directly"
            ],
            [
                "James Morrow",
                "Senior Javascript Engineer",
                "December 17, 2016, Chris managed James directly"
            ],
            "Senior Javascript Engineer",
            [
                "James is a intelligent, versatile and talented software engineer.   He is good at solving complex problems and architecting solid solutions.   At Candi, he dove into a mess of a codebase and refactored/streamlined it to make it workable and efficient.  He was also a valuable team member when it came to process and software development lifecyle issues, where his extensive experience was very helpful."
            ],
            [
                "James is a intelligent, versatile and talented software engineer.   He is good at solving complex problems and architecting solid solutions.   At Candi, he dove into a mess of a codebase and refactored/streamlined it to make it workable and efficient.  He was also a valuable team member when it came to process and software development lifecyle issues, where his extensive experience was very helpful."
            ]
        ],
        "skills": [
            [
                "Start-ups",
                "See 78 endorsements for Start-ups",
                "78",
                "Start-ups",
                "Endorse",
                "Endorsed by Paul Campbell and 19 others who are highly skilled at this"
            ],
            [
                "Start-ups",
                "See 78 endorsements for Start-ups",
                "78"
            ],
            [
                "Entrepreneurship",
                "See 43 endorsements for Entrepreneurship",
                "43",
                "Entrepreneurship",
                "Endorse",
                "Endorsed by Aaron Fulkerson and 8 others who are highly skilled at this"
            ],
            [
                "Entrepreneurship",
                "See 43 endorsements for Entrepreneurship",
                "43"
            ],
            [
                "Strategy",
                "See 41 endorsements for Strategy",
                "41",
                "Strategy",
                "Endorse",
                "Endorsed by Philippe Cases and 6 others who are highly skilled at this"
            ],
            [
                "Strategy",
                "See 41 endorsements for Strategy",
                "41"
            ]
        ],
        "summary": "",
        "name": "Chris Maresca",
        "title": "Founder, Technology Executive & Board Member",
        "url": "linkedin.com/in/chrismaresca",
        "phone": "415 305 4496 (Mobile)",
        "email": "ckm@chrismaresca.com"
    }
]