[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "7 Mutual Connections",
                "You and Neha both know Alex Horovitz, Erika Flora PMP, PgMP, ITIL Expert,PRINCE2,CSP, and 5 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Senior Technical Recruiter",
                "Company Name",
                "Sumeru",
                "Dates Employed",
                "Jan 2017 – Present",
                "Employment Duration",
                "11 mos",
                "Location",
                "Washington D.C.",
                "•\tActively Looking for multiple position in multiple location;                 •\t Engineer: System Validation - I/II/III (Silicon, Board and SoC architecture, ) in Folsom, CA                 •\t Java Developer -II (Looking in CA, TX and AZ)                 •\t Electrical Designer– IV (Cadence, Perl and Schematic entry) in Austin, TXPlease share your resume at neha.prajapat@sumerusolutions.com•\tResponsible for full cycle recruiting for both contract and permanent assignments.•\tResearch and source, interview and hire candidates for placement in key accounts; Intel, Gap Inc., McAfee, Apple, USAA, Synapse, AEO and Avalanche.•\tCandidate generation from start to finish.•\tUtilize cold calling, referrals, digging through multiple sourcing channels and enjoy looking for that passive candidate and doing initial reach out just to connect."
            ],
            [
                "IT Recruiter",
                "Company Name",
                "LanceSoft, Inc.",
                "Dates Employed",
                "Aug 2015 – Jan 2017",
                "Employment Duration",
                "1 yr 6 mos",
                "Location",
                "Herndon, VA",
                "•\tManaging full recruiting lifecycle including identifying, screening, interviewing and negotiating offers with candidates.•\tWork on Challenging Engineering positions, especially priority order in and answer the assigned rec on timely manner.•\tPerforming recruiting process including but not limited to screening applicants, scheduling interviews, managing applicant tracking system, interviewing, hiring, and post recruitment process.•\tExpertise in Full Recruitment Life Cycle in IT Staffing for Contract and Permanent Placements•\tScreening Candidates - Interviewing them, testing them and going through the whole selection process•\tExcellent communication and writing skills, strong analytical and interpersonal skills, ability to meet deadlines and organize work and develop positive relationships.•\tTook accurate job descriptions from customers and matching qualified candidates to all aspects of the position and classifications•\tDeveloped sourcing strategies with a variety of hiring managers and pro-actively sourced candidates for critical skills and core positions, manage the candidate pipeline, schedule interviews and provide staffing administration support.•\tConducted follow up activities with clients, identified new job order opportunities, and identified customer needs.•\tWorked with Applicant Tracking Systems (ATS), Vendor Management Systems (VMS), and Master Services Provider (MSP) services. •\tSourcing for qualified candidates according to relevant job criteria, using computer databases, networking, Internet recruiting resources, cold calls, media, recruiting firms, and employee referrals.•\tFilled contract position & Temp to hire job orders & replacements with critical timelines."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Swami Vivekanand College of Engineering, Khandwa Road, Near Tool Naka, Indore-452020",
                "Degree Name",
                "Bachelor’s Degree",
                "Field Of Study",
                "Computer Science",
                "Dates attended or expected graduation",
                "2010 – 2014"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 18 more skills"
            ],
            "Recommendations",
            [
                "Sumeru Solutions",
                "1,759 followers"
            ],
            [
                "LanceSoft, Inc.",
                "9,861 followers"
            ],
            [
                "Swami Vivekanand College of Engineering, Khandwa Road, Near Tool Naka, Indore-452020",
                "349 followers"
            ],
            [
                "Sumeru",
                "232 followers"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Sumeru Solutions",
                "1,759 followers"
            ],
            [
                "Sumeru Solutions",
                "1,759 followers"
            ],
            [
                "LanceSoft, Inc.",
                "9,861 followers"
            ],
            [
                "LanceSoft, Inc.",
                "9,861 followers"
            ],
            [
                "Swami Vivekanand College of Engineering, Khandwa Road, Near Tool Naka, Indore-452020",
                "349 followers"
            ],
            [
                "Swami Vivekanand College of Engineering, Khandwa Road, Near Tool Naka, Indore-452020",
                "349 followers"
            ],
            [
                "Sumeru",
                "232 followers"
            ],
            [
                "Sumeru",
                "232 followers"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Sourcing",
                "See 6 endorsements for Sourcing",
                "6",
                "Sourcing",
                "Endorse",
                "Endorsed by 2 of Neha’s colleagues at LanceSoft, Inc."
            ],
            [
                "Sourcing",
                "See 6 endorsements for Sourcing",
                "6"
            ],
            [
                "Leadership",
                "See 5 endorsements for Leadership",
                "5",
                "Leadership",
                "Endorse",
                "Tyrone Evans Clark and 4 connections have given endorsements for this skill"
            ],
            [
                "Leadership",
                "See 5 endorsements for Leadership",
                "5"
            ],
            [
                "Public Speaking",
                "See 5 endorsements for Public Speaking",
                "5",
                "Public Speaking",
                "Endorse",
                "Tyrone Evans Clark and 4 connections have given endorsements for this skill"
            ],
            [
                "Public Speaking",
                "See 5 endorsements for Public Speaking",
                "5"
            ]
        ],
        "summary": "    Hiring in California for following positions;Software Engineer: Graphics - III (FreeD, Game, Maya or MEL) CAD Designer - IV (Allegro, Cadence Constraint Manager (v16.6 or later), PCB)Wireless Performance Engineer - II (Antenna, OTA and Anechoic Chamber)have experience or reference please share resume at neha.prajapat@sumerusolutions.com•\tHighly motivated professional with experience in Recruitment, Business HR, Strategic Sourcing, Vendor Management, Strategy and Planning for corporate and consulting environment.•\tExperience in managing full recruiting lifecycle including identifying, screening, interviewing and negotiating offers with candidates.•\tManage end-to-end Recruitment Life Cycle that includes sourcing, screening, scheduling & coordinating, interviewing, negotiating compensation packages and onboarding.•\tHandle high volume recruiting in a fast paced, detailed, regulated, structured environment, adhering to strict deadlines, prepare metrics on number of monthly hires.•\tAttend HR Manager Call meetings for making appropriate notes for the challenging requirements.•\tWorking for all Niche skills requirement for CPT/OPT, GC, EAD, C2C, H1/H4, L1/L2 candidates mostly on W2 employment.•\tIdentify potential candidates through the use of Boolean searches, networking, candidate referrals, web sourcing, web media, ATS database and social networking•\tExcellent communication and writing skills, strong analytical and interpersonal skills, ability to meet deadlines and organize work and develop positive relationships.•\tRecruitment utilizing various sourcing method like web portals includes Monster, Career Builder, Dice, Indeed, Google, Jobdiva, LinkedIn, SCGuild, TheLadders, etc.Technical Skills:Proficiency: \tMS Office, Excel, MS outlook and MS wordVMO Tools: \tFieldglass, IQ Navigator, BeelineOther Skills: \tATS (Applicant Tracking system), Boolean strings, LinkedIN, SC Guild, Indeed, Facebook, Ladders, Google, Twitter and other internet recruiting websites\n  \n  \n",
        "name": "Neha Prajapat",
        "title": "Looking for Java Developer (Full Stack) in TX, CA and AZ, please share resume @ neha.prajapat@sumerusolutions.com",
        "url": "linkedin.com/in/neha-prajapat-6b350476",
        "phone": "408-520-9744 (Work)",
        "email": "nhprajapat@gmail.com"
    }
]