[
    {
        "experience": [
            "Highlights",
            [
                "6 Mutual Connections",
                "You and Mar both know Tami Taylor Finch, PHR, Jennifer Rojas, and 4 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Director of Recruiting",
                "Company Name",
                "RGP",
                "Dates Employed",
                "Apr 2017 – Present",
                "Employment Duration",
                "7 mos",
                "RGP partners with business leaders to solve problems, implement initiatives, drive change and transfer knowledge. We are proven problem solvers who add value in the areas of Accounting & Finance, Interim CFO, Sr. Internal Audit, IT Audit, SOX Compliance, Advisory, Tax, Treasury, M&A/Due Diligence, Information Management & Supply Chain Management.Responsible for:  Full cycle of Talent Acquisition and Management, Performance and Compensation review, Employee On-Boarding and Assimilation; Employee Feedback and communications; Employee Business Review Meetings and Events, and development and execution of periodic recruiting strategy and relevant processes."
            ],
            [
                "Recruiting Manager",
                "Company Name",
                "Robert Half Technology",
                "Dates Employed",
                "Aug 2015 – Apr 2017",
                "Employment Duration",
                "1 yr 9 mos",
                "Location",
                "Miami/Fort Lauderdale Area",
                "At Robert Half Technology, I work with my team members who have extensive experience with recruiting in all lines of business to help companies hire highly skilled IT staff and assist professionals in finding rewarding career opportunities. For the past 5+ years I have been ‘on the inside of HR’ working with IT, Trading and Shared Services companies and have a thorough understanding of what happens ‘behind the scenes’ when a company is looking to hire the best candidate. Having this insight enables me to find the best possible ‘fit’ for both the candidate and the company.•\tManage a full desk: Sales, Marketing and Recruiting•\tManage full life cycle of recruitment. Recruiting, interviewing, scheduling interviews with hiring managers and placing highly skilled professionals•\tExpert in using recruitment tools such as LinkedIn, CareerBuilder, Monster, Dice and Indeed to recruit active and passive candidates and maintaining an ongoing pipeline for future job openings. Also, posting jobs online to attract talent •\tWorking closely with hiring managers to understand their hiring needs, educating them about skills available in the market and developing realistic and attractive job descriptions to attract the right talent•\tTarget interviews a week: 15 minimum •\tStrategizing with teammates to accomplish weekly growth goals while remaining accountable for individual growth goals•\tUse marketing, advertising and corporate communications knowledge to develop and grow my own client base by marketing our services for full-time creative/marketing staffing solutions•\tMarketing to clients via telephone as well as conduct in-person meetings with key managers to senior-level executives, for the purpose of marketing our services to prospective clients and building on existing client relationships•\tMaintaining relationships with clients and candidates on an ongoing basis•\tTarget skills: Finance, Accounting, Operations, Administrative and Information Technology."
            ],
            [
                "HR Generalist",
                "Company Name",
                "Center for Shared Services",
                "Dates Employed",
                "Sep 2013 – Aug 2015",
                "Employment Duration",
                "2 yrs",
                "Location",
                "Arlington, VA",
                "•\tAct as HR Business Partner (HRBP) and provided strategic advice to leadership to align business objectives with policies and procedures•\tDeveloped and managed the recruitment process (full life cycle). Also, was involved in training staff and hiring managers on recruitment best practices. Formulated relationships with hiring managers and was involved in strategic planning of future talent needs. Worked closely with hiring managers to develop realistic job descriptions, compensation evaluation and making offers to potential candidates•\tMitigated risk by providing expert advice on compliance, employment laws and legal requirements•\tFocused on Talent and Leadership Development and ensured the company’s culture is aligned with the vision. Formulated internal programs to help clients develop a culture that enables employees to perform in accordance to the firm’s objective•\tFormulated partnerships across the HR function to deliver value added services that reflect business objectives of the organization. Services and areas of expertise include all HR related functions - Policies and procedures, benefits (administration and analysis), employee relations, performance management, recruitment and selection (full life cycle), job classifications, leadership development, training, payroll, on-boarding, off-boarding and compensation analysis•\t Analyzed trends and metrics in partnership with HR group to develop solutions, programs and policies"
            ],
            [
                "HR Generalist",
                "Company Name",
                "iCore Networks",
                "Dates Employed",
                "May 2011 – Sep 2013",
                "Employment Duration",
                "2 yrs 5 mos",
                "Location",
                "Mclean, VA",
                "Was hired as HR Administrator and was promoted to HR Generalist within 6 months.•\tRecruitment – Managed full-life cycle of recruitment and working with Open hire, LinkedIn and other job boards. Also, responsible for managing internship programs. Worked closely with hiring managers to develop realistic job descriptions, compensation evaluation and making offers to potential candidates •\tManaged employee relations, performed specific research/investigations, counseled team members and handled HR generalist workplace issues as well as employee visa processing•\tEnsured compliance by maintaining in-depth knowledge of employment laws and legal requirements•\tCommunicated with management to implement and create effective work policies, administered various HR plans and procedures for all company personnel. Prepared and maintained employee handbook. Supervised facilities management and lead the Admin team when needed•\tManaged Benefits Administration, open enrollment and leave of absence. Worked with vendors to introduce new benefits program. Managed the entire process for associate changes, compensation and employment changes•\tGenerated day to day reports for HR and Financial needs and maintained HRIS and employee files•\tDeveloped the onboarding and offboading process from scratch, developed and designed new hires training programs •\tActed as liaison between departments to support all internal changes and requisitions•\tProcessed payroll and all hands experience with managing ADP system"
            ],
            [
                "HR Administrator",
                "Company Name",
                "Kestral - USA",
                "Dates Employed",
                "Aug 2008 – Apr 2011",
                "Employment Duration",
                "2 yrs 9 mos",
                "Location",
                "Washington, DC",
                "Started as an intern and was offered a full time role as HR Administrator within 3 months. Was transferred over to Washington DC as HR Administrator/EA in 2009.  •\tProposed and implemented processes, activities and programs for employee relations and employment •\tAssisted in recruitment, prescreened candidates and set up interviews. Managed leaves of absence, including short/long term disability, FMLA, and worker’s compensation. Supported employee relations, compensation, policy interpretation, and training•\tCoordinated and supported the recruitment and on-boarding process, including pre-employment screenings, offer letters, and new hire orientation. Performed all supervisory responsibilities for Office management, Company’s accounts and Human Resources•\tConducted New Hire Orientation and exit interviews; gave tours of the building; enrolled employees in benefit plans; resolved employee relations and benefit issues•\tAdvised Senior Management on all HR related policies and procedures; created reports for management•\tPrepared bi-weekly expense reports and bank reconciliations. Provided support to group CFO, book keeping and scheduled all executive level meetings. Established uniform procedures and practices for correspondence, reports, and other office documents; planned office layout, developed office administration operating budget, and initiate cost reduction programs•\tEstablished, organized, and assured maintenance of paper and computer records management/file systems; coordinated meetings, programs, or events by securing location and making other appropriate arrangements, preparing and issuing information and agendas, coordinating speakers, and processing minutes or other necessary follow through information"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Ciit",
                "Degree Name",
                "Bachelors in Business Administration",
                "Field Of Study",
                "Human Resources"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "Philadelphia, PA JOBS",
                "131 members"
            ],
            [
                "Sitecore",
                "11,924 members"
            ],
            [
                "Incentive Compensation - Solutions, Design & Jobs",
                "6,842 members"
            ],
            [
                "JOBS 2.0 Human Resources HR, Staffing, Recruiting, Hiring, Talent Management & Acquisition, H.R.",
                "7,162 members"
            ],
            [
                "Helios HR | Outsourcing, Consulting & Recruiting",
                "1,967 followers"
            ],
            [
                "Yii framework",
                "15,470 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Philadelphia, PA JOBS",
                "131 members"
            ],
            [
                "Philadelphia, PA JOBS",
                "131 members"
            ],
            [
                "Sitecore",
                "11,924 members"
            ],
            [
                "Sitecore",
                "11,924 members"
            ],
            [
                "Incentive Compensation - Solutions, Design & Jobs",
                "6,842 members"
            ],
            [
                "Incentive Compensation - Solutions, Design & Jobs",
                "6,842 members"
            ],
            [
                "JOBS 2.0 Human Resources HR, Staffing, Recruiting, Hiring, Talent Management & Acquisition, H.R.",
                "7,162 members"
            ],
            [
                "JOBS 2.0 Human Resources HR, Staffing, Recruiting, Hiring, Talent Management & Acquisition, H.R.",
                "7,162 members"
            ],
            [
                "Helios HR | Outsourcing, Consulting & Recruiting",
                "1,967 followers"
            ],
            [
                "Helios HR | Outsourcing, Consulting & Recruiting",
                "1,967 followers"
            ],
            [
                "Yii framework",
                "15,470 members"
            ],
            [
                "Yii framework",
                "15,470 members"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Strategic Advice",
                "See 12 endorsements for Strategic Advice",
                "12",
                "Strategic Advice",
                "Endorse",
                "Endorsed by 2 of Mar’s colleagues at iCore Networks"
            ],
            [
                "Strategic Advice",
                "See 12 endorsements for Strategic Advice",
                "12"
            ],
            [
                "Technical Recruiting",
                "See 26 endorsements for Technical Recruiting",
                "26",
                "Technical Recruiting",
                "Endorse",
                "Endorsed by Mark Verica, who is highly skilled at this",
                "Endorsed by 3 of Mar’s colleagues at iCore Networks"
            ],
            [
                "Technical Recruiting",
                "See 26 endorsements for Technical Recruiting",
                "26"
            ],
            [
                "Recruiting",
                "See 148 endorsements for Recruiting",
                "99+",
                "Recruiting",
                "Endorse",
                "Endorsed by Michelle Anton and 1 other who is highly skilled at this",
                "Endorsed by 2 of Mar’s colleagues at Robert Half Technology"
            ],
            [
                "Recruiting",
                "See 148 endorsements for Recruiting",
                "99+"
            ],
            [
                "Talent Acquisition",
                "See 24 endorsements for Talent Acquisition",
                "24",
                "Talent Acquisition",
                "Endorse"
            ],
            [
                "Talent Acquisition",
                "See 24 endorsements for Talent Acquisition",
                "24"
            ],
            [
                "Talent Management",
                "See 28 endorsements for Talent Management",
                "28",
                "Talent Management",
                "Endorse"
            ],
            [
                "Talent Management",
                "See 28 endorsements for Talent Management",
                "28"
            ],
            [
                "Personnel Management",
                "See 27 endorsements for Personnel Management",
                "27",
                "Personnel Management",
                "Endorse"
            ],
            [
                "Personnel Management",
                "See 27 endorsements for Personnel Management",
                "27"
            ],
            [
                "Interviews",
                "See 58 endorsements for Interviews",
                "58",
                "Interviews",
                "Endorse"
            ],
            [
                "Interviews",
                "See 58 endorsements for Interviews",
                "58"
            ],
            [
                "Policy",
                "See 33 endorsements for Policy",
                "33",
                "Policy",
                "Endorse"
            ],
            [
                "Policy",
                "See 33 endorsements for Policy",
                "33"
            ],
            [
                "IT Recruitment",
                "See 7 endorsements for IT Recruitment",
                "7",
                "IT Recruitment",
                "Endorse"
            ],
            [
                "IT Recruitment",
                "See 7 endorsements for IT Recruitment",
                "7"
            ],
            [
                "Onboarding",
                "See 151 endorsements for Onboarding",
                "99+",
                "Onboarding",
                "Endorse"
            ],
            [
                "Onboarding",
                "See 151 endorsements for Onboarding",
                "99+"
            ],
            [
                "Human Resources",
                "See 183 endorsements for Human Resources",
                "99+",
                "Human Resources",
                "Endorse"
            ],
            [
                "Human Resources",
                "See 183 endorsements for Human Resources",
                "99+"
            ],
            [
                "HRIS",
                "See 62 endorsements for HRIS",
                "62",
                "HRIS",
                "Endorse"
            ],
            [
                "HRIS",
                "See 62 endorsements for HRIS",
                "62"
            ],
            [
                "Employee Relations",
                "See 117 endorsements for Employee Relations",
                "99+",
                "Employee Relations",
                "Endorse"
            ],
            [
                "Employee Relations",
                "See 117 endorsements for Employee Relations",
                "99+"
            ],
            [
                "Employee Benefits",
                "See 37 endorsements for Employee Benefits",
                "37",
                "Employee Benefits",
                "Endorse"
            ],
            [
                "Employee Benefits",
                "See 37 endorsements for Employee Benefits",
                "37"
            ],
            [
                "Training",
                "See 69 endorsements for Training",
                "69",
                "Training",
                "Endorse"
            ],
            [
                "Training",
                "See 69 endorsements for Training",
                "69"
            ],
            [
                "Benefits Administration",
                "See 35 endorsements for Benefits Administration",
                "35",
                "Benefits Administration",
                "Endorse"
            ],
            [
                "Benefits Administration",
                "See 35 endorsements for Benefits Administration",
                "35"
            ],
            [
                "ADP Payroll",
                "See 54 endorsements for ADP Payroll",
                "54",
                "ADP Payroll",
                "Endorse"
            ],
            [
                "ADP Payroll",
                "See 54 endorsements for ADP Payroll",
                "54"
            ],
            [
                "Team Building",
                "See 25 endorsements for Team Building",
                "25",
                "Team Building",
                "Endorse"
            ],
            [
                "Team Building",
                "See 25 endorsements for Team Building",
                "25"
            ],
            [
                "Event Management",
                "See 19 endorsements for Event Management",
                "19",
                "Event Management",
                "Endorse"
            ],
            [
                "Event Management",
                "See 19 endorsements for Event Management",
                "19"
            ],
            [
                "Administration",
                "See 39 endorsements for Administration",
                "39",
                "Administration",
                "Endorse"
            ],
            [
                "Administration",
                "See 39 endorsements for Administration",
                "39"
            ],
            [
                "Applicant Tracking Systems",
                "See 23 endorsements for Applicant Tracking Systems",
                "23",
                "Applicant Tracking Systems",
                "Endorse"
            ],
            [
                "Applicant Tracking Systems",
                "See 23 endorsements for Applicant Tracking Systems",
                "23"
            ],
            [
                "Payroll",
                "See 42 endorsements for Payroll",
                "42",
                "Payroll",
                "Endorse"
            ],
            [
                "Payroll",
                "See 42 endorsements for Payroll",
                "42"
            ],
            [
                "Hiring",
                "See 20 endorsements for Hiring",
                "20",
                "Hiring",
                "Endorse"
            ],
            [
                "Hiring",
                "See 20 endorsements for Hiring",
                "20"
            ],
            [
                "New Hire Orientations",
                "See 48 endorsements for New Hire Orientations",
                "48",
                "New Hire Orientations",
                "Endorse"
            ],
            [
                "New Hire Orientations",
                "See 48 endorsements for New Hire Orientations",
                "48"
            ],
            [
                "Screening",
                "See 24 endorsements for Screening",
                "24",
                "Screening",
                "Endorse"
            ],
            [
                "Screening",
                "See 24 endorsements for Screening",
                "24"
            ],
            [
                "Strategy",
                "See 24 endorsements for Strategy",
                "24",
                "Strategy",
                "Endorse"
            ],
            [
                "Strategy",
                "See 24 endorsements for Strategy",
                "24"
            ],
            [
                "Organizational Development",
                "See 17 endorsements for Organizational Development",
                "17",
                "Organizational Development",
                "Endorse"
            ],
            [
                "Organizational Development",
                "See 17 endorsements for Organizational Development",
                "17"
            ],
            [
                "Performance Management",
                "See 20 endorsements for Performance Management",
                "20",
                "Performance Management",
                "Endorse"
            ],
            [
                "Performance Management",
                "See 20 endorsements for Performance Management",
                "20"
            ],
            [
                "Background Checks",
                "See 13 endorsements for Background Checks",
                "13",
                "Background Checks",
                "Endorse"
            ],
            [
                "Background Checks",
                "See 13 endorsements for Background Checks",
                "13"
            ],
            [
                "Job Descriptions",
                "See 12 endorsements for Job Descriptions",
                "12",
                "Job Descriptions",
                "Endorse"
            ],
            [
                "Job Descriptions",
                "See 12 endorsements for Job Descriptions",
                "12"
            ],
            [
                "Manage Client Relationships",
                "See 12 endorsements for Manage Client Relationships",
                "12",
                "Manage Client Relationships",
                "Endorse"
            ],
            [
                "Manage Client Relationships",
                "See 12 endorsements for Manage Client Relationships",
                "12"
            ],
            [
                "Employee Counseling, Team / Morale Building",
                "See 12 endorsements for Employee Counseling, Team / Morale Building",
                "12",
                "Employee Counseling, Team / Morale Building",
                "Endorse"
            ],
            [
                "Employee Counseling, Team / Morale Building",
                "See 12 endorsements for Employee Counseling, Team / Morale Building",
                "12"
            ],
            [
                "Compliance",
                "See 11 endorsements for Compliance",
                "11",
                "Compliance",
                "Endorse"
            ],
            [
                "Compliance",
                "See 11 endorsements for Compliance",
                "11"
            ],
            [
                "HRMS Database Administration",
                "See 11 endorsements for HRMS Database Administration",
                "11",
                "HRMS Database Administration",
                "Endorse"
            ],
            [
                "HRMS Database Administration",
                "See 11 endorsements for HRMS Database Administration",
                "11"
            ],
            [
                "Program Management",
                "See 12 endorsements for Program Management",
                "12",
                "Program Management",
                "Endorse"
            ],
            [
                "Program Management",
                "See 12 endorsements for Program Management",
                "12"
            ],
            [
                "HR Policies & Procedures",
                "See 11 endorsements for HR Policies & Procedures",
                "11",
                "HR Policies & Procedures",
                "Endorse"
            ],
            [
                "HR Policies & Procedures",
                "See 11 endorsements for HR Policies & Procedures",
                "11"
            ],
            [
                "Staff Recruitment",
                "See 11 endorsements for Staff Recruitment",
                "11",
                "Staff Recruitment",
                "Endorse"
            ],
            [
                "Staff Recruitment",
                "See 11 endorsements for Staff Recruitment",
                "11"
            ],
            [
                "FMLA",
                "See 15 endorsements for FMLA",
                "15",
                "FMLA",
                "Endorse"
            ],
            [
                "FMLA",
                "See 15 endorsements for FMLA",
                "15"
            ],
            [
                "Client Relations Skills",
                "See 10 endorsements for Client Relations Skills",
                "10",
                "Client Relations Skills",
                "Endorse"
            ],
            [
                "Client Relations Skills",
                "See 10 endorsements for Client Relations Skills",
                "10"
            ],
            [
                "Compensation analysis",
                "See 10 endorsements for Compensation analysis",
                "10",
                "Compensation analysis",
                "Endorse"
            ],
            [
                "Compensation analysis",
                "See 10 endorsements for Compensation analysis",
                "10"
            ],
            [
                "Compensation & Benefit",
                "See 10 endorsements for Compensation & Benefit",
                "10",
                "Compensation & Benefit",
                "Endorse"
            ],
            [
                "Compensation & Benefit",
                "See 10 endorsements for Compensation & Benefit",
                "10"
            ],
            [
                "Benefits Analysis",
                "See 11 endorsements for Benefits Analysis",
                "11",
                "Benefits Analysis",
                "Endorse"
            ],
            [
                "Benefits Analysis",
                "See 11 endorsements for Benefits Analysis",
                "11"
            ],
            [
                "HRIS Database Management",
                "See 11 endorsements for HRIS Database Management",
                "11",
                "HRIS Database Management",
                "Endorse"
            ],
            [
                "HRIS Database Management",
                "See 11 endorsements for HRIS Database Management",
                "11"
            ],
            [
                "Job Analysis",
                "See 17 endorsements for Job Analysis",
                "17",
                "Job Analysis",
                "Endorse"
            ],
            [
                "Job Analysis",
                "See 17 endorsements for Job Analysis",
                "17"
            ],
            [
                "Performance Appraisal",
                "See 12 endorsements for Performance Appraisal",
                "12",
                "Performance Appraisal",
                "Endorse"
            ],
            [
                "Performance Appraisal",
                "See 12 endorsements for Performance Appraisal",
                "12"
            ],
            [
                "Visas",
                "See 10 endorsements for Visas",
                "10",
                "Visas",
                "Endorse"
            ],
            [
                "Visas",
                "See 10 endorsements for Visas",
                "10"
            ],
            [
                "FLSA",
                "See 10 endorsements for FLSA",
                "10",
                "FLSA",
                "Endorse"
            ],
            [
                "FLSA",
                "See 10 endorsements for FLSA",
                "10"
            ],
            [
                "Performance Improvement",
                "See 11 endorsements for Performance Improvement",
                "11",
                "Performance Improvement",
                "Endorse"
            ],
            [
                "Performance Improvement",
                "See 11 endorsements for Performance Improvement",
                "11"
            ],
            [
                "Urdu translation",
                "See 10 endorsements for Urdu translation",
                "10",
                "Urdu translation",
                "Endorse"
            ],
            [
                "Urdu translation",
                "See 10 endorsements for Urdu translation",
                "10"
            ],
            [
                "Human Resources Information Systems (HRIS)",
                "See 45 endorsements for Human Resources Information Systems (HRIS)",
                "45",
                "Human Resources Information Systems (HRIS)",
                "Endorse"
            ],
            [
                "Human Resources Information Systems (HRIS)",
                "See 45 endorsements for Human Resources Information Systems (HRIS)",
                "45"
            ]
        ],
        "summary": "",
        "name": "Mar Kushner",
        "title": "Director of Recruiting / Talent Manager",
        "url": "linkedin.com/in/mar-kushner-83977146",
        "phone": null,
        "email": "mariam.kushner@rgp.com"
    }
]