[
    {
        "resourceName": "people/c7014425759919223244",
        "etag": "%EgUBAgcJCxoNAQIDBAUGBwgJCgsMDSIMOE9lQWkrWkNjYms9",
        "names": [
            {
                "metadata": {
                    "primary": true,
                    "source": {
                        "type": "PROFILE",
                        "id": "117321179813077898658"
                    }
                },
                "displayName": "Michael Huttner",
                "familyName": "Huttner",
                "givenName": "Michael",
                "displayNameLastFirst": "Huttner, Michael"
            }
        ],
        "emailAddresses": [
            {
                "metadata": {
                    "primary": true,
                    "source": {
                        "type": "CONTACT",
                        "id": "61583f108b55b1cc"
                    }
                },
                "value": "michael@huttner.org"
            }
        ],
        "experience": [
            [
                "Highlights"
            ],
            [
                "6 Mutual Connections",
                "You and Michael both know Michael Fulcher, Bill Brindley, and 4 others"
            ],
            [
                "Former Colorado Attorney General J.D. MacFarlane backs Democratic AG candidate Phil Weiser",
                "Michael liked"
            ],
            [
                "MilkenInstitute",
                "Michael liked"
            ],
            [
                "We've officially moved into our new HQ. It marks a milestone for us, demonstrating what we’ve accomplished over the last eight years, and envisioning what we’ll achieve moving forward.",
                "Michael liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Chief Executive Officer",
                "Company Name",
                "Powerplant Strategies",
                "Dates Employed",
                "Jun 2017 – Present",
                "Employment Duration",
                "6 mos",
                "Location",
                "Greater Denver Area",
                "CEO of Powerplant Strategies with offices in Denver, Los Angeles, New York City and Philadelphia. Powerplant Strategies provides communications, public affairs, government relations, media relations, crisis counsel, fundraising and strategic partnerships strategies for select clients in the cannabis space.  We advice provide strategic advice for cannabis investors.Huttner’s advocacy of the legal cannabis market goes back years:  In January 2010, he convened a small group of drug reform and policy leaders in Colorado where they laid out the blueprint for what became the first state to decriminalize cannabis in the US, which The Economist described as “an electoral first not only for America but for the world.\"I’ve met so many people and veterans, who have shared their personal stories of how cannabis has helped them personally and members of their family alleviate serious pain, symptoms from autoimmune diseases, epilepsy, Parkinson’s, PTSD, and has bettered their overall quality of life.These medical health benefits, the once-in-a-lifetime chance to address our nation's flawed drug polices, the opportunity to reduce both our country’s prison populations while helping to minimize our country’s opioids crisis, improve veterans’ quality of life, along with the tidal wave of emerging business opportunities are just some of the reasons why I am excited to return back to the industry.Huttner built a team, who has already been working with industry leaders, including the law firm of Vicente Sederberg, LLC, The Arcview Group—a collaboration of cannabis investors, the National Cannabis Industry Association and the New Federalism Fund as well as private companies such as Jane Technologies and THC Design. In Huttner’s new role as CEO, he will be joined by his network of experts below in the US and Canada—with more markets and partners to be announced in the near future."
            ],
            [
                "President",
                "Company Name",
                "The Huttner Group",
                "Dates Employed",
                "Nov 2010 – Present",
                "Employment Duration",
                "7 yrs 1 mo",
                "Location",
                "Boulder, CO",
                "Political Strategist, Communications and Crisis Management Expert and Entrepreneur"
            ],
            [
                "Chief Executive Officer",
                "Company Name",
                "Fenton",
                "Dates Employed",
                "Jun 2016 – May 2017",
                "Employment Duration",
                "1 yr",
                "Location",
                "Greater New York City Area",
                "Chief Executive Officer at Fenton, the social change agency, with offices in NYC, Los Angeles, San Francisco, and Washington, DC.Fenton is a social change communications agency. we use the power of stories, media and technology to make the world a better place. our clients are nonprofits, foundations and companies pioneering true sustainability. our campaigns change behavior, advance policy, build communities and transform thinking. using a range of communications tools—pr, advertising, social media, video, design, research and everything in between—we build campaigns that create lasting change."
            ],
            [
                "Founding Partner",
                "Company Name",
                "Triumph Strategy",
                "Dates Employed",
                "Jan 2015 – May 2016",
                "Employment Duration",
                "1 yr 5 mos",
                "Location",
                "Washington, DC and Boulder, CO",
                "Triumph Strategy is a public affairs, communications and disruption firm specializing in hard-hitting proactive and reactive strategies.  Services include crisis management, narrative development, rapid response communications and tactical execution.  We serve private, non-profit and public sector institutions, trade associations and unions, candidates for public office and individuals facing complex financial, legal, branding, media and image challenges.We create favorable conditions for you, focusing on the intersection of policy, politics and press. Our aggressive tactics maximize the impact of your message on policy makers, shareholders, regulators and the public-at-large.Triumph Strategy is led by seasoned advocates and attorneys with expertise in public policy, communications, digital media, research, coalition building and disruption.  First and foremost, we are sensitive to confidentiality."
            ],
            [
                "Founder and CEO",
                "Company Name",
                "ProgressNow",
                "Dates Employed",
                "Jan 2005 – Oct 2010",
                "Employment Duration",
                "5 yrs 10 mos",
                "Founder and director of communications and online progressive advocacy organization."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Brown University",
                "Degree Name",
                "BA",
                "Field Of Study",
                "Political Science",
                "Dates attended or expected graduation",
                "1988 – 1992",
                "Activities and Societies:",
                "Phi Kappa Psi, Issues Magazine, Volunteers in Providence Schools"
            ],
            [
                "Brown University",
                "Degree Name",
                "BA",
                "Field Of Study",
                "Political Science",
                "Dates attended or expected graduation",
                "1988 – 1992",
                "Activities and Societies:",
                "Phi Kappa Psi, Issues Magazine, Volunteers in Providence Schools"
            ],
            [
                "Howard University",
                "Dates attended or expected graduation",
                "1990 – 1990"
            ],
            [
                "Howard University",
                "Dates attended or expected graduation",
                "1990 – 1990"
            ],
            [
                "Cherry Creek High School",
                "Dates attended or expected graduation",
                "1984 – 1988"
            ],
            [
                "Cherry Creek High School",
                "Dates attended or expected graduation",
                "1984 – 1988"
            ],
            [
                "Graland Country Day School",
                "Dates attended or expected graduation",
                "1979 – 1984"
            ],
            [
                "Graland Country Day School",
                "Dates attended or expected graduation",
                "1979 – 1984"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Founder and CEO",
                "Company Name",
                "ProgressNow",
                "Dates volunteered",
                "Sep 2003 – Oct 2010",
                "Volunteer duration",
                "7 yrs 2 mos",
                "Cause",
                "Politics",
                "ProgressNow is a network of state based communications organizations which build and empower a permanent progressive majority, challenge and correct right-wing misinformation, and hold public leaders accountable."
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 33 more skills"
            ],
            "Recommendations",
            [
                "Democratic GAIN",
                "2,544 members"
            ],
            [
                "Reid HoffmanReid Hoffman is a LinkedIn Influencer",
                "Entrepreneur.  Product Strategist.  Investor.",
                "1,701,143 followers"
            ],
            [
                "Triumph Strategy",
                "6 followers"
            ],
            [
                "Brown University",
                "93,757 followers"
            ],
            [
                "University of California, Hastings College of the Law",
                "16,156 followers"
            ],
            [
                "University of California, Hastings College of the Law",
                "15,399 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Democratic GAIN",
                "2,544 members"
            ],
            [
                "Democratic GAIN",
                "2,544 members"
            ],
            [
                "Reid HoffmanReid Hoffman is a LinkedIn Influencer",
                "Entrepreneur.  Product Strategist.  Investor.",
                "1,701,143 followers"
            ],
            [
                "Reid HoffmanReid Hoffman is a LinkedIn Influencer",
                "Entrepreneur.  Product Strategist.  Investor.",
                "1,701,143 followers"
            ],
            [
                "Reid Hoffman is a LinkedIn Influencer"
            ],
            [
                "Triumph Strategy",
                "6 followers"
            ],
            [
                "Triumph Strategy",
                "6 followers"
            ],
            [
                "Brown University",
                "93,757 followers"
            ],
            [
                "Brown University",
                "93,757 followers"
            ],
            [
                "University of California, Hastings College of the Law",
                "16,156 followers"
            ],
            [
                "University of California, Hastings College of the Law",
                "16,156 followers"
            ],
            [
                "University of California, Hastings College of the Law",
                "15,399 followers"
            ],
            [
                "University of California, Hastings College of the Law",
                "15,399 followers"
            ]
        ],
        "recommendations": [
            [
                "Craig Fleishman",
                "Of Counsel",
                "January 18, 2017, Michael worked with Craig in the same group",
                "A bright, hard working, and passionate individual in all his undertakings."
            ],
            [
                "Craig Fleishman",
                "Of Counsel",
                "January 18, 2017, Michael worked with Craig in the same group"
            ],
            [
                "Craig Fleishman",
                "Of Counsel",
                "January 18, 2017, Michael worked with Craig in the same group"
            ],
            [
                "Craig Fleishman",
                "Of Counsel",
                "January 18, 2017, Michael worked with Craig in the same group"
            ],
            "Of Counsel",
            [
                "A bright, hard working, and passionate individual in all his undertakings."
            ],
            [
                "A bright, hard working, and passionate individual in all his undertakings."
            ]
        ],
        "skills": [
            [
                "Coalitions",
                "See 176 endorsements for Coalitions",
                "99+",
                "Coalitions",
                "Endorse",
                "Endorsed by Naomi Seligman and 5 others who are highly skilled at this"
            ],
            [
                "Coalitions",
                "See 176 endorsements for Coalitions",
                "99+"
            ],
            [
                "Political Consulting",
                "See 111 endorsements for Political Consulting",
                "99+",
                "Political Consulting",
                "Endorse",
                "Endorsed by Will Robinson and 2 others who are highly skilled at this"
            ],
            [
                "Political Consulting",
                "See 111 endorsements for Political Consulting",
                "99+"
            ],
            [
                "Social Entrepreneurship",
                "See 87 endorsements for Social Entrepreneurship",
                "87",
                "Social Entrepreneurship",
                "Endorse",
                "David Faragó and 86 connections have given endorsements for this skill"
            ],
            [
                "Social Entrepreneurship",
                "See 87 endorsements for Social Entrepreneurship",
                "87"
            ]
        ],
        "summary": "    Mr. Huttner is a corporate and political strategist, attorney and entrepreneur.  He is currently the CEO of Powerplant Strategies which provides public affairs strategies, government relations, media relations, crisis counsel, fundraising and strategic partnerships for select clients in the cannabis space.  He previously served as the CEO of Fenton, the global social change agency.  Before then he served as President of the Huttner Group, Inc., a Boulder-based firm which helps solve complex financial, communications and public policy problems in a variety of industries. Mr. Huttner has helped launch over 40 different political organizations and has led communications ‘war-rooms’ for political and private clients. He also is a Founding Partner of Triumph Strategy, LLC, in which he has worked with hedge funds, public and private corporations and other financial institutions. Mr. Huttner is the Founder of ProgressNow, a network of state-based communications organizations that moves people to action through communications and digital media. Described as the “crown jewel” of progressive investors’ efforts to build messaging power in the states, ProgressNow continues to expand with more than 3.4 million members in 23 states.Previously, Mr. Huttner was a founding partner in the Denver law firm of Foster, Graham and Huttner where he headed the firm’s political, nonprofit and lobbying practice. Prior to his private practice, he worked as Policy Advisor to Governor Roy Romer and clerked at the Clinton White House for the Office of the Counsel to the President.Mr. Huttner also has taught as an adjunct professor at the University of Denver College of Law. He earned his J.D. from the University of California, Hastings Law School, where he served on the Hastings Law Journal, and his B.A. from Brown University.\n  \n  \n",
        "name": "Michael Huttner",
        "title": "Chief Executive Officer",
        "url": "linkedin.com/in/michaelhuttner",
        "phone": "3039314547 (Mobile)",
        "email": "michael@fenton.com"
    }
]