[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "36 Mutual Connections",
                "You and Heather both know Glen Chamberlain, Jason Pierse, and 34 others"
            ],
            [
                "I had a great time meeting with three of our Management Development Program participants from our Palo Alto community.  What an inspiring group of professionals.  Times haven't changed that much!   We spent a lot of time talking about their career aspirations and their number one challenge.. comfort in presenting in front of others! I remember that fear well...way back to my early career at United Airlines. Spending time with these colleagues was truly one of the highlights of my time at our community!",
                "Heather liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Human Resources Generalist",
                "Company Name",
                "Vi at Grayhawk",
                "Dates Employed",
                "Apr 2017 – Present",
                "Employment Duration",
                "8 mos",
                "Location",
                "Scottsdale, Arizona"
            ],
            [
                "Sr. Human Resources Consultant",
                "Company Name",
                "LabCorp",
                "Dates Employed",
                "Jun 2013 – Jan 2017",
                "Employment Duration",
                "3 yrs 8 mos",
                "Location",
                "Phoenix, Arizona",
                "Provide Human Resources support to Arizona, Nevada, and Utah locations (1200+ employees)Manage full cycle recruiting, including candidate sourcing, screening, and interviewing, and job offer process, including background checks, drug/physical screenings, and job offer letters. Lead onboarding and new hire orientations.AAP Plan administration and outreach effortsWork with local universities/colleges, employment agencies, associations, and online resources to source candidates as needed; negotiated contracts with employment agenciesAssist in benefits administration, including personal leaves of absences (FMLA, ADA, STD, and LTD, etc.). Represent the company in unemployment case hearings, EEOC claims, disciplinary actions and terminations.Effectively resolve employee relations issues by conducting investigations and taking appropriate action Facilitate leadership training sessions, “Leading Ourselves, Leading Others, and Leading the business”Event planning for annual “Lab Week” and employee delight team eventsWork with various HRIS reporting"
            ],
            [
                "Human Resources Coordinator",
                "Company Name",
                "Petsmart, Inc",
                "Dates Employed",
                "Feb 2012 – May 2013",
                "Employment Duration",
                "1 yr 4 mos",
                "Manage full cycle recruiting, including candidate sourcing, screening, and interviewing, and job offer process, including background checks, drug/physical screenings, and job offer letters. Lead onboarding and new hire orientations.Own internal and external job posting and application process, and act as a primary recruiter for the HR Department supporting the Phoenix Distribution Center. Actively hire both exempt and non exempt employees.Maintain HR employment files. Assist in benefits administration, including personal leaves of absences (FMLA, ADA, STD, and LTD, etc.). Sit in on unemployment case hearings, disciplinary actions and terminations.Currently completing the steps necessary to attain PHR Certification, with expected completion in the spring of 2013."
            ],
            [
                "Recruiter",
                "Company Name",
                "Aerotek",
                "Dates Employed",
                "Sep 2010 – Mar 2012",
                "Employment Duration",
                "1 yr 7 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Developed online, phone, and face-to-face recruiting strategies to identify and build relationships with professionals whose experience ranged from manufacturing, light technical, clerical, distribution, and warehouse to other professional industries.Held professionalism, confidence, and a sense of urgency in my approach as the face of Aerotek Commercial Services.Managed contract employee’s pre-employment processes, job functionality while on assignment, and performance counseling, coaching, and disciplinary measures when necessary.Partnered with Account Manager to identify large accounts, target skill sets, and key market segments.Made 80+ outbound calls and email follow ups per day through creating a daily call sheet including career site applicants, company database prospects, personalized network and pipeline, and referrals.Generated a minimum of 7+ key leads per week for the Commercial Division.Screened, selected and submitted 9+ qualified candidates per week to client’s requirements."
            ],
            [
                "Human Resources Clerical Assistant",
                "Company Name",
                "Arizona State University",
                "Dates Employed",
                "May 2009 – Aug 2010",
                "Employment Duration",
                "1 yr 4 mos",
                "Maintained HR employment files, including I-9s (employment eligibility verification) and W-4s (personal withholding allowance). Assisted with data entry, input and verification of new employee information using PeopleSoft.Performed routine clerical functions and provided general office support. Assisted staff with record location and performed data and record auditing, including accuracy assessments of tax forms, personnel files, and offer letters.Streamlined and restructured the Tempe Campus’s main filing system which was outdated and in extreme disarray. Reviewed paperwork going back to 1999 and organized these into extensive personnel files. Created separated filing systems for each of ASU’s four campuses. Scanned all tax information for faster verification and access."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor's degree",
                "SOCIETY FOR HUMAN RESOURCE MANAGEMENT (SHRM)PHR"
            ],
            "Recommendations",
            [
                "Arizona State University",
                "386,441 followers"
            ],
            [
                "ASCP - American Society for Clinical Pathology",
                "18,160 members"
            ],
            [
                "Arizona State University",
                "424,414 followers"
            ],
            [
                "BASIS.ed",
                "3,040 followers"
            ],
            [
                "LabCorp",
                "34,265 followers"
            ],
            [
                "American Society for Clinical Laboratory Science",
                "24,269 members"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Arizona State University",
                "386,441 followers"
            ],
            [
                "Arizona State University",
                "386,441 followers"
            ],
            [
                "ASCP - American Society for Clinical Pathology",
                "18,160 members"
            ],
            [
                "ASCP - American Society for Clinical Pathology",
                "18,160 members"
            ],
            [
                "Arizona State University",
                "424,414 followers"
            ],
            [
                "Arizona State University",
                "424,414 followers"
            ],
            [
                "BASIS.ed",
                "3,040 followers"
            ],
            [
                "BASIS.ed",
                "3,040 followers"
            ],
            [
                "LabCorp",
                "34,265 followers"
            ],
            [
                "LabCorp",
                "34,265 followers"
            ],
            [
                "American Society for Clinical Laboratory Science",
                "24,269 members"
            ],
            [
                "American Society for Clinical Laboratory Science",
                "24,269 members"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "",
        "name": "Heather Seybold",
        "title": "Human Resources Generalist at Vi at Grayhawk",
        "url": "linkedin.com/in/heather-seybold-98231a31",
        "phone": "",
        "email": "heather2109@hotmail.com"
    }
]