[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "3 Mutual Connections",
                "You and India both know Keith Rezendes, Lyn Brownlee, MHRM, and 1 other"
            ],
            [
                "It's arrived! Thank you Virgin Incentives for my #FindingMyVirginity book, looking forward to getting stuck in. Hoping to gain inspiration from Richard Branson again :) #win",
                "India liked"
            ],
            [
                "Managing Conflict With Emotional Intelligence",
                "India liked"
            ],
            [
                "Don't dim your light so others can shine.  There's room for everybody at the top! #MCLyteEmpire",
                "India liked"
            ],
            [
                "Kimano’s photo",
                "India liked"
            ],
            [
                "The education nerd in me can’t help but to visit an institution of learning whenever I travel to other cities. As such, I was excited when my good friend, Joe Painter, gave me a tour of the historic (1883) Sidwell Friends School. It was great seeing the campus and meeting Bryan K. Garman who serves as the Head of School, and learning about the motto, Eluceat Omnibus Lux (Let the light shine out from all).",
                "India liked"
            ],
            [
                "Got my eyes on the Lord nothing else....",
                "India liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Assistant Principal",
                "Company Name",
                "HCPS",
                "Dates Employed",
                "2015 – Present",
                "Employment Duration",
                "2 yrs",
                "Location",
                "HCPS",
                "Preparing students for life with great leaders like our Superintendent Jeff Eakins and a great administrative staff at Leto high coupled with excellent educational leaders.* Working strategically with administrative teams to prepare students for life* Working with District Personnel to host National Association of Black School Educator's      National Conference in November 2016 as the 1st V.P. of local chapter H.A.B.S.E.* Collaborated with TSIC officials to vote for 2016 Alumni of the Year* Raised Schoolwide grant to meet the instructional needs to supply learners with sufficient   materials at a Title 1 school* Spoke as a keynote speaker at the Dorthea Edgecombe Girls Breakfast at local high school* Helped hold graduation award ceremony for all African American students in HCPS * Helped serve over 5,000 families in Health Fair at Leto High for HCPS* Volunteered for 3+ years at 5k Strides for education to raise 1 million dollars in scholarships    for at-risk learners* Implemented a school wide positive culture building initiative at Leto High* Celebrated Teachers of the Month at the high school to promote teachers across the school"
            ],
            [
                "Math Teacher",
                "Company Name",
                "HCPS",
                "Dates Employed",
                "Jan 2013 – Present",
                "Employment Duration",
                "4 yrs 11 mos",
                "Location",
                "HCPS",
                "* Taught and tutored math while impacting learners for a lifetime of greatness.* Delegated with other mathematicians towards a successful vision of peers* Transforming lives of hopeless youth through motivating moments* Setting and achieving high expectation for at risk learners who would have given up hope* Formed principles of responsible peers in students through consistency, dedication, and             perseverance    * Used Kagan,Champs, Harry Wong and other teaching concepts and techniques to guarantee       collaboration of learners and a classroom atmosphere engulfed in fun and learning* Collaborated with great administrators towards academic success and achievement of every      learner* Worked closely with other teachers and establishing healthy professional relationships* Attended professional development workshops to enhance ability and performance as a    teacher* Administered the EOC exam for learners* Co-taught successfully with great educators* Dealt with the crisis of at risk learners; shifted it into success through graduation* Collaborated with parents and  community leaders for the betterment of all students through   phone calls, emails, and through fund raising events( i.e. relay for life)* Made cultural connections with staff and students through celebrating cultural events, i.e.    Cinco de Mayo, and speaking spanish to fluent non- English speaking spanish parents of     mainstream and ELLs. * Assisted with needs around campus after school* Voted \"Most Inspirational\" by math department during PLC"
            ],
            [
                "Motivational Speaker",
                "Company Name",
                "Non Profits",
                "Dates Employed",
                "Jan 2003 – Present",
                "Employment Duration",
                "14 yrs 11 mos",
                "Location",
                "Various",
                "Motivating and Inspiring lives one message at a time. My passion is for the betterment of all, and to help bring about a paradigm shift that will cause everyone to realize their greatness. Fight the urge to be average, and make it happen for your community and for your story!! As Marco Rubio said, my story is a story of inspiration for all of America!Experiences* Spoke at YMCA (15 years +); Shared story of how the YMCA helped provide shelter for me during    H.S.* Keynote speaker at many different TSIC functions for over 15 years* Keynote speaker for induction ceremony for ACPS scholars* Graduation ceremony speaker for scholars* Talked as TSIC representative on radio broadcasting in Alachua County* Was Keynote speaker at Leonardo's fundraising dinner* Keynote speaker at Education Ball in APCS, representing 20 years of celebration* Gave speech to Commissioner of Education; it helped contribute to $ 8 million dollars increase for    scholarships for TSIC scholars* Spoke with President of the Senate to explain effectiveness of TSIC as a TSIC Scholar* MCed with Jared Torres during TSIC State Conference in Tallahassee; helped launched TSIC    Alumni Alliance with other scholars* Administered a TSIC Workshop for Mentoring in Key West, FL for TSIC Mentors* Helped raise $ 30,000 for Brevard County Scholars during Realtor fundraiser* Nominated by Board and CEO as TSIC Alumni of the Year (2012-2013)* Became a TSIC mentor- HCPS- 2013- present* Helped contribute to marketing and fundraising of TSIC Story via DVD and youtube video of    testimony (Meet India White)* Participated in Strides for Education as a volunteer and donator to help contribute to the goal of    raising 1 million dollars in scholarships* Spoke for Dorthea Edgecombe motivational girls' group* Spoke for NAPW meeting inspiring women to follow their gut"
            ],
            [
                "Graduate Student",
                "Company Name",
                "University of Florida",
                "Dates Employed",
                "Jan 2012 – Dec 2013",
                "Employment Duration",
                "2 yrs",
                "Location",
                "Gainesville, Florida Area",
                "*Ed.D in Ed Leadership- Presently a doctorate student at the University of Florida*M.ED In Ed. Leadership: Evolving into a transformational leader through multiple leadership lessons      and experiences*Collaborated with cohort to produce a sample SIP of a school* Analyzed FCAT data and data of the latest educational trends to make predictions, come up with 4   step plan (Problem Solving Cycle), and to comprehend culture and problems that occur at different      schools* Researched Maslow's Hierarchy of  needs and integrated it into each educational leader's role   (district, administrative, and instructional)* Researched accommodations for students with disabilities; unpacked the IDEA, and FAPE for   Special Needs learners* Researched classroom management and how teachers can effectively manage a classroom* Studied communication and how to deal with difficult employees; developed strategies through   research on how to handle conflict effectively from staff, students, administration* Studied ESOL and the different components of ELLs along with mandated accommodations   necessary for equity and academic success* Collaborated with APC during a practicum to effectively handle and know principles of leadership   * Analyzed FCAT data* Updated  Human Resource book using computer* Updated school calendar * Participated in interviewing (formed questions for interview and asked questions and gave   feedback with administrators) *Experienced textbook inventory (Adopted books vs. non adopted, scanning, organizing)* Collaborated with APC, and other educational leaders about Master Schedule* Set up interviews for hiring process and contacted references* Kept a reflection log of different experiences and how I could use the experience as an   administrator, and what I could do differently as a leader overall* Collaborated with main office staff and established healthy rapport with each  professional as a   team player"
            ],
            [
                "V.P. TSICAA",
                "Company Name",
                "TSIC",
                "Dates Employed",
                "2010 – 2012",
                "Employment Duration",
                "2 yrs",
                "Oversee tasks of Alumni within TSIC, with a goal to see students break the cycle and pay it foward"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "University of Florida",
                "Degree Name",
                "Master of Education (M.Ed.)",
                "Field Of Study",
                "Educational Leadership and Administration, General",
                "Grade",
                "3.8",
                "Dates attended or expected graduation",
                "2012 – 2013",
                "Activities and Societies:",
                "Pride of the Sunshine Marching Band (UF)",
                "Study education to become the best educational leader to benefit society in every capacity with a heart that bends towards the underserved."
            ],
            [
                "University of Florida",
                "Degree Name",
                "Master of Education (M.Ed.)",
                "Field Of Study",
                "Educational Leadership and Administration, General",
                "Grade",
                "3.8",
                "Dates attended or expected graduation",
                "2012 – 2013",
                "Activities and Societies:",
                "Pride of the Sunshine Marching Band (UF)",
                "Study education to become the best educational leader to benefit society in every capacity with a heart that bends towards the underserved."
            ],
            [
                "University of Florida",
                "Degree Name",
                "Bachelor of Science",
                "Field Of Study",
                "Mathematics",
                "Dates attended or expected graduation",
                "2003 – 2007",
                "Activities and Societies:",
                "UF Pride of the Sunshine Marching Band, NAPW, IWLA, Take Stock in Children Alumni Alliance, Gates Millennium Alumni Alliance, HEF.",
                "Doctorate- Ed. Leadership- Present...M. Ed. - Ed LeadershipB.S. - Mathematics"
            ],
            [
                "University of Florida",
                "Degree Name",
                "Bachelor of Science",
                "Field Of Study",
                "Mathematics",
                "Dates attended or expected graduation",
                "2003 – 2007",
                "Activities and Societies:",
                "UF Pride of the Sunshine Marching Band, NAPW, IWLA, Take Stock in Children Alumni Alliance, Gates Millennium Alumni Alliance, HEF.",
                "Doctorate- Ed. Leadership- Present...M. Ed. - Ed LeadershipB.S. - Mathematics"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Mentor",
                "Company Name",
                "Take Stock in Children",
                "Dates volunteered",
                "Aug 2012 – Aug 2012",
                "Volunteer duration",
                "1 mo",
                "Cause",
                "Education",
                "Mentoring students is a life-changing experience. You really do get more out of it than you put into it. Because of a mentor, education went from a hope to reality for me. Now, I am watching my mentoring abilities make hope turn into a reality for my mentee."
            ],
            "Recommendations",
            [
                "Jeff WeinerJeff Weiner is a LinkedIn Influencer",
                "CEO at LinkedIn",
                "7,152,768 followers"
            ],
            [
                "Galloway, Johnson, Tompkins, Burr & Smith, A PLC",
                "706 followers"
            ],
            [
                "University of Florida",
                "330,085 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,043,066 followers"
            ],
            [
                "Center for Teacher Effectiveness",
                "2,446 followers"
            ],
            [
                "Citi",
                "1,364,504 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Jeff WeinerJeff Weiner is a LinkedIn Influencer",
                "CEO at LinkedIn",
                "7,152,768 followers"
            ],
            [
                "Jeff WeinerJeff Weiner is a LinkedIn Influencer",
                "CEO at LinkedIn",
                "7,152,768 followers"
            ],
            [
                "Jeff Weiner is a LinkedIn Influencer"
            ],
            [
                "Galloway, Johnson, Tompkins, Burr & Smith, A PLC",
                "706 followers"
            ],
            [
                "Galloway, Johnson, Tompkins, Burr & Smith, A PLC",
                "706 followers"
            ],
            [
                "University of Florida",
                "330,085 followers"
            ],
            [
                "University of Florida",
                "330,085 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,043,066 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,043,066 followers"
            ],
            [
                "Richard Branson is a LinkedIn Influencer"
            ],
            [
                "Center for Teacher Effectiveness",
                "2,446 followers"
            ],
            [
                "Center for Teacher Effectiveness",
                "2,446 followers"
            ],
            [
                "Citi",
                "1,364,504 followers"
            ],
            [
                "Citi",
                "1,364,504 followers"
            ]
        ],
        "recommendations": [
            [
                "Matt Sperling",
                "Question the consensus at Retired Radlcal Community Activist",
                "September 6, 2013, Matt worked with India but at different companies",
                "India White is one of the rare people who have talent ,matched with street smarts,education, and total commitment."
            ],
            [
                "Matt Sperling",
                "Question the consensus at Retired Radlcal Community Activist",
                "September 6, 2013, Matt worked with India but at different companies"
            ],
            [
                "Matt Sperling",
                "Question the consensus at Retired Radlcal Community Activist",
                "September 6, 2013, Matt worked with India but at different companies"
            ],
            [
                "Matt Sperling",
                "Question the consensus at Retired Radlcal Community Activist",
                "September 6, 2013, Matt worked with India but at different companies"
            ],
            "Question the consensus at Retired Radlcal Community Activist",
            [
                "India White is one of the rare people who have talent ,matched with street smarts,education, and total commitment."
            ],
            [
                "India White is one of the rare people who have talent ,matched with street smarts,education, and total commitment."
            ]
        ],
        "skills": [],
        "summary": "    I've been enjoying paying it forward as a motivational speaker and author for many years! As the 1% that beat the odds, I am ready to join other leaders with helping provide a story that will impact others who might be at risk of becoming a statistic. As Marco Rubio mentioned in his book \"American Dreams\", my story is a story of inspiration for every American. Check out my website: www.india-white.com to see the great things that have transpired as I've joined forces with leaders across the nation to inspire others! If you need a speaker, I'm available!In addition, my experience as a math teacher in public schools in Florida for at least 10 years has allowed me to gain strong administrative skills that would be effectively utilized by any organization. After years of experience in the classroom and working for 15 years with various non-profit organizations in which I am zealous for, I am more than prepared to lead as an administrator.With a B.S. in mathematics and an M.Ed in Educational Leadership, I will offer:Proficiency in working cross-functionally with stakeholdersUnderstanding of data and statistical information to help guide the district visionMastery of public representation with ability to generate salesEffective networking skills with connections throughout societyAs I study for my doctorate in Ed. Leadership at the University of Florida, I continue to pay it forward with great leaders in my community through different non profit organizations of which have been a great part of my life.  As the Vice President HABSE, and TSICAA, I enjoy working with other world changers while managing and overseeing  activities and commitments of Alumni across the state. As a part of the Gates Millennium Scholars Alumni Association, I plan to make an impact on a greater scale within my GMS family and the world for the sake of education. As a team player, I will do everything in my power to assure higher education to future generations!\n  \n  \n",
        "name": "India White",
        "title": "National Education Advocate/Trainer, Motivational Speaker, Author, Educator",
        "url": "linkedin.com/in/india-white-03837346",
        "phone": "",
        "email": "India.White.123@gmail.com"
    }
]