[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "49 Mutual Connections",
                "You and Jay both know Boyan Josic, Steven Aldrich, and 47 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Business Consultant",
                "Company Name",
                "GoDaddy",
                "Dates Employed",
                "Apr 2017 – Present",
                "Employment Duration",
                "9 mos",
                "Location",
                "Gilbert, Arizona",
                "At GoDaddy, we’re working to radically shift the global economy toward small businesses by empowering people to easily start, confidently grow and successfully run their own ventures. With more than 13 million business customers worldwide and more than 60 million domain names under management, GoDaddy gives small business owners the tools to name their idea, build a beautiful online presence, attract customers and manage their business.Mission: We are here to help our customers kick ass. We do that by living our strategy and ruthlessly prioritizing our work to create simple, elegant technology that delights our customers. All while delivering service that is second to none. Every single day, we break down barriers, build new markets and stare down the impossible until the impossible blinks.As a member of the Business Consulting Team, my goal is to ensure our Customers have the right information and products needed to be Successful. I do this by consulting and advising with Individuals and Businesses in the USA and Canada to ensure they have the right tools and solutions and are fully utilizing the tools and solutions they have available to successfully market, organize and grow their business. I assist businesses small and large in various industries with the sole goal of helping them be more successful.I can honestly say I am proud of the Company I work for and I couldn't imagine working anywhere else!"
            ],
            [
                "Director Of Operations",
                "Company Name",
                "All Interstate Towing, INC",
                "Dates Employed",
                "Sep 2014 – Feb 2017",
                "Employment Duration",
                "2 yrs 6 mos",
                "Location",
                "Phoenix, Arizona Area",
                "All Interstate Towing Inc. is a Towing and Road Service Holdings Company operating several Towing Companies within Arizona and California. All Interstate Towing operated equipment within the Phoenix and San Diego areas.As the Director of Operations, I oversaw day to day operations along with a list of daily duties. My goal was to ensure that the business was running at its highest potential and I accomplished this by actively participating within several departments ensuring all operations essential to this business's success were running flawlessly. My duties ranged from Contract Procurement, Employee Management and Acquisition, Contract Negotiations, Fleet Maintenance and Management and Book keeping/Accounting for the company.As of February of 2017, All Interstate Towing, INC has been sold."
            ],
            [
                "Executive Director Of Operations",
                "Company Name",
                "RepoKings, INC",
                "Dates Employed",
                "Oct 2012 – Sep 2014",
                "Employment Duration",
                "2 yrs",
                "Location",
                "Fair Haven, Michigan",
                "RepoKings.com was established in 2012 as a leading Online Auction provider servicing the South Eastern Michigan region. RepoKings.com offered a completely unique auction experience with weekly auctions including hundreds of items at a time consisting of Antiques, Construction Equipment, Bar and Restaurant Equipment, Sporting Goods, Building Materials, Cars, Trucks, SUVs, Semi Trucks and more. RepoKings offered a unique and secure auction platform open to the public with bidders coming from around Michigan and surrounding States. RepoKings.com successfully auctioned millions in inventory exclusively through our in-house designed and developed auction platform. As the Executive Director of Operations, I managed the daily operations of the company consisting of overseeing all departments and staff, planning and executing of current/upcoming auctions, overseeing the development and maintenance of the in-house Auction management software as well as maintaining the inventory of items provided for consignment through our auction platform. At any given time, we controlled and stored over $5 million in inventory on site and it was my responsibility to ensure that all items were properly inventoried, categorized and listed in auction. Additionally, I oversaw the delivery of items won at auction and the disbursement of funds to the original consigner for items sold.Additional duties included overseeing all accounting/bookkeeping, marketing for current and future auctions, software development of internal and external auction resources and the management and maintenance for over 150,000 sq ft of warehouse and office space along with 3 acres in 2 locations of outdoor storage for auction inventory.As of September of 2014, RepoKings.com was sold as the owner pursued other business opportunities."
            ],
            [
                "Linux System Administrator",
                "Company Name",
                "World Wide Web Hosting, LLC",
                "Dates Employed",
                "Mar 2013 – Jun 2013",
                "Employment Duration",
                "4 mos",
                "Location",
                "United States",
                "World Wide Web Hosting is the parent company of Site5.com Web Hosting. While working for WWWH, I worked with some of the best minds in the web hosting industry. My duties at WWWH consisted of the resolution of Escalated Customer Support issues as well as assisting with the management of  hundreds of Linux based systems world wide."
            ],
            [
                "Linux Administrator",
                "Company Name",
                "Hostgator.com",
                "Dates Employed",
                "Jul 2011 – Oct 2011",
                "Employment Duration",
                "4 mos",
                "Location",
                "Austin, Texas Area",
                "While at HostGator, I had the privilege of working with some of the brightest and best within the Hosting Industry. During my stay, I fine tuned my Linux and Web Hosting related skills as well as expanded my customer service skills. Hostgator is one of the largest web hosting companies in the world with one of the most diverse client bases around and I had the privilege of working with customers on a daily basis during my stay.After several months in Texas, I returned back to Michigan to continue towards my degree in Business."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Walsh College",
                "Degree Name",
                "Bachelor's degree",
                "Field Of Study",
                "Business Administration and Management, General",
                "Grade",
                "3.9 GPA",
                "Dates attended or expected graduation",
                "2010 – 2014"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "Harvard Business School",
                "372,519 followers"
            ],
            [
                "Ian BremmerIan Bremmer is a LinkedIn Influencer",
                "President at Eurasia Group",
                "2,391,965 followers"
            ],
            [
                "Harvard University",
                "674,284 followers"
            ],
            [
                "Samsung Mobile",
                "505,617 followers"
            ],
            [
                "cPanel",
                "4,222 followers"
            ],
            [
                "Walsh College",
                "25,083 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Harvard Business School",
                "372,519 followers"
            ],
            [
                "Harvard Business School",
                "372,519 followers"
            ],
            [
                "Ian BremmerIan Bremmer is a LinkedIn Influencer",
                "President at Eurasia Group",
                "2,391,965 followers"
            ],
            [
                "Ian BremmerIan Bremmer is a LinkedIn Influencer",
                "President at Eurasia Group",
                "2,391,965 followers"
            ],
            [
                "Ian Bremmer is a LinkedIn Influencer"
            ],
            [
                "Harvard University",
                "674,284 followers"
            ],
            [
                "Harvard University",
                "674,284 followers"
            ],
            [
                "Samsung Mobile",
                "505,617 followers"
            ],
            [
                "Samsung Mobile",
                "505,617 followers"
            ],
            [
                "cPanel",
                "4,222 followers"
            ],
            [
                "cPanel",
                "4,222 followers"
            ],
            [
                "Walsh College",
                "25,083 followers"
            ],
            [
                "Walsh College",
                "25,083 followers"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Business Operations",
                "See 2 endorsements for Business Operations",
                "2",
                "Business Operations",
                "Endorse",
                "Klemen Stibilj ☕️ and 1 connection have given endorsements for this skill"
            ],
            [
                "Business Operations",
                "See 2 endorsements for Business Operations",
                "2"
            ],
            [
                "Business Intelligence",
                "See 2 endorsements for Business Intelligence",
                "2",
                "Business Intelligence",
                "Endorse",
                "Klemen Stibilj ☕️ and 1 connection have given endorsements for this skill"
            ],
            [
                "Business Intelligence",
                "See 2 endorsements for Business Intelligence",
                "2"
            ],
            [
                "Product Management",
                "See 3 endorsements for Product Management",
                "3",
                "Product Management",
                "Endorse",
                "Klemen Stibilj ☕️ and 2 connections have given endorsements for this skill"
            ],
            [
                "Product Management",
                "See 3 endorsements for Product Management",
                "3"
            ],
            [
                "Product Marketing",
                "See 1 endorsement for Product Marketing",
                "1",
                "Product Marketing",
                "Endorse"
            ],
            [
                "Product Marketing",
                "See 1 endorsement for Product Marketing",
                "1"
            ],
            [
                "Project Management",
                "See 2 endorsements for Project Management",
                "2",
                "Project Management",
                "Endorse"
            ],
            [
                "Project Management",
                "See 2 endorsements for Project Management",
                "2"
            ],
            [
                "Product Development",
                "See 2 endorsements for Product Development",
                "2",
                "Product Development",
                "Endorse"
            ],
            [
                "Product Development",
                "See 2 endorsements for Product Development",
                "2"
            ],
            [
                "Management",
                "Management",
                "Endorse"
            ],
            [
                "Management"
            ],
            [
                "Leadership",
                "Leadership",
                "Endorse"
            ],
            [
                "Leadership"
            ],
            [
                "Business Development",
                "Business Development",
                "Endorse"
            ],
            [
                "Business Development"
            ],
            [
                "Business Strategy",
                "Business Strategy",
                "Endorse"
            ],
            [
                "Business Strategy"
            ],
            [
                "Business Analysis",
                "Business Analysis",
                "Endorse"
            ],
            [
                "Business Analysis"
            ],
            [
                "Marketing",
                "Marketing",
                "Endorse"
            ],
            [
                "Marketing"
            ],
            [
                "Sales",
                "Sales",
                "Endorse"
            ],
            [
                "Sales"
            ],
            [
                "Retail Sales",
                "Retail Sales",
                "Endorse"
            ],
            [
                "Retail Sales"
            ],
            [
                "Retail Marketing",
                "Retail Marketing",
                "Endorse"
            ],
            [
                "Retail Marketing"
            ],
            [
                "International Business",
                "International Business",
                "Endorse"
            ],
            [
                "International Business"
            ],
            [
                "International Business Development",
                "International Business Development",
                "Endorse"
            ],
            [
                "International Business Development"
            ],
            [
                "International Business Strategy",
                "International Business Strategy",
                "Endorse"
            ],
            [
                "International Business Strategy"
            ],
            [
                "International Sales",
                "International Sales",
                "Endorse"
            ],
            [
                "International Sales"
            ],
            [
                "Start-ups",
                "Start-ups",
                "Endorse"
            ],
            [
                "Start-ups"
            ],
            [
                "Financial Analysis",
                "Financial Analysis",
                "Endorse"
            ],
            [
                "Financial Analysis"
            ],
            [
                "Web Hosting",
                "Web Hosting",
                "Endorse"
            ],
            [
                "Web Hosting"
            ],
            [
                "Linux",
                "Linux",
                "Endorse"
            ],
            [
                "Linux"
            ]
        ],
        "summary": "    Highly motivated and experienced Operations Leader with an extensive Management background within the Information Technology and Automotive Industries.Through past experiences, I have gained a strong knowledge and understanding of several major aspects of business which has helped me become a more productive and efficient business operations leader. Over time, I have expanded my unique skill set which has allowed me to transition into new areas of business within new industries.These skills range from Business Management and Operations, Business Intelligence, Business Planning and Structuring, IT Infrastructure Management, Product Management, Product Marketing, Product Development, B2B and B2C Product Strategy, Accounting, Bookkeeping, Investment and Divestment Strategy, International Business Management and Strategy and Retail Sales and Fulfillment.By fully utilizing my current skills and continuously adding to my skillset, I have successfully operated several businesses with teams ranging from 10 to 75+ employees within multiple industries. In addition to my past experience listed in my resume, I have also started, grown, operated and sold a few businesses of my own primarily within the Information Technology and Retail sales industries.Specialties: 10+ Years of Web Hosting related experience, 5+ years of Management experience, 4+ years of Product Management, 3+ years of Business Intelligence, 3+ years of Retail Sales and Product Logistics.\n  \n  \n",
        "name": "Jay (Joshua) Dubinsky",
        "title": "Business Consultant at GoDaddy",
        "url": "linkedin.com/in/jddubinsky",
        "phone": "480-999-6063 (Work)",
        "email": "j@jddmail.com"
    }
]