[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "65 Mutual Connections",
                "You and Robert Christian both know Kimberlie Cerrone, Ryan Scott, and 63 others"
            ],
            [
                "Jonathan’s photo",
                "Robert Christian liked"
            ],
            [
                "Need to get your #CMDB ready for an audit but don’t know where to start? Ask me how to get your #ServiceNow instance ready for your audit!",
                "Michael Lombardo , Lloyd Godson , Stephen Light , Mark Higgins",
                "Robert Christian liked"
            ],
            [
                "So close: St. Mary's Food Bank just 1,500 turkeys away from Thanksgiving meal goal",
                "Robert Christian liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Chairman",
                "Company Name",
                "Speir Holdings Inc.",
                "Dates Employed",
                "Sep 2015 – Present",
                "Employment Duration",
                "2 yrs 3 mos",
                "Location",
                "Phoenix, Arizona"
            ],
            [
                "Chief Executive Officer",
                "Company Name",
                "Speir Holdings Inc.",
                "Dates Employed",
                "Sep 2015 – Present",
                "Employment Duration",
                "2 yrs 3 mos",
                "Location",
                "Gilbert Arizona",
                "Speir Holdings is a holding company with its HQ in Phoenix, Arizona. The company is broken down into five divisions: Entertainment, Insurance, Consumer Healthcare, Digital Marketing and a Foundation."
            ],
            [
                "Executive Producer",
                "Company Name",
                "The TmI Phoenix Adventure TV Show",
                "Dates Employed",
                "Jun 2017 – Present",
                "Employment Duration",
                "6 mos",
                "Location",
                "Gilbert Arizona",
                "Film rightsPrepare and then supervise the making of a film before presenting the product to a financing entity or a film distributor. During the \"discovery stage\" I have to find and acknowledge promising material, retrieve the film rights or an option. If the rights owner is worried about preserving the integrity, voice and vision of his work, I might have to comply with a variety of demands concerning the screenplay, the film director, the casts or other topics.Pre-productionUnless the film is supposed to be based on an original script, I have to find an appropriate screenwriter. If an existing script is considered flawed, I have to order a new version and sometimes decide to hire a script doctor. I also have the final say on which film director gets hired or I direct it myself, I also have the last word when it comes to casting questions.ProductionI appoint executive producers, line producers or unit production managers who represent my interests, I have the last word on whether sounds or music have to be changed or scenes have to be looped. Post-productionEven if the shooting has officially been finished, I can still demand that additional scenes are filmed after all. In case of a negative test screening I might even demand and get an alternative film ending."
            ],
            [
                "Speir.TV DJ/VJ Remixer Producer",
                "Company Name",
                "DJ Speir",
                "Dates Employed",
                "Jan 1980 – Present",
                "Employment Duration",
                "37 yrs 11 mos",
                "Location",
                "Gilbert Arizona USA",
                "Top 100 Dubstep DJ and Top 300 Progressive House DJ in the World from 2012 – 2016.  Out of 10 Million ranked DJ’s Worldwide, ranks 1,670 Mixing it up for Over Twenty Years! I was borne into the Club World in 1980, the first club I went to I was taken by a friend to First Avenue in downtown Minneapolis, MN.I asked her what the club was like she told me it used to be a Greyhound bus depot and had a great sound and light show. I thought to myself how great could this place be if it is in a Greyhound bus depot, the depot in my hometown was a little bigger than a bus.After we got there the outside looked small as I expected but had a line blocks long and it was like 20 below zero, I thought I would freeze to death before I would get in but the girl I went with had us on the guest list so we got in right away. I was in shock it was two stories with a huge balcony and 10 guys in the DJ booth, I thought this was normal since it was the first club I had been to. I had always loved music and I only thought DJ's where on the radio, I had never seen a real DJ until that night. On that cold winter night in downtown Minneapolis I knew I was going to be a DJ.First Avenue and The Seventh Street Entry are still in operation and breaking new artist and music every night, this is where Prince filmed Purple Rain. First Avenue has been open since 1970A never ending trail of events and club datesI have mixed at just about every type of event out there, I worked at every size club from 80 to 2000 people, the worst sound and light shows and the best.The thing I like most about being a DJ is I never have a night like the one before. I get to play new music every week and great people to spin for. I also loved working with artists from all over the world. Every artist has their own vibe and energy that keeps the world dancing."
            ],
            [
                "Founder",
                "Company Name",
                "The Speir Foundation",
                "Dates Employed",
                "Oct 2010 – Present",
                "Employment Duration",
                "7 yrs 2 mos",
                "Location",
                "Gilbert, Arizona USA",
                "The Speir Foundation Has been formed and is operated by Speir  to carry out our companies mission to promote HIV/AIDS awareness by using our media assets and studios to create promo videos to spread the word of our HIV/AIDS mission. Speir works with DJ’S all over the world to help them host events at their clubs and include posters and printed educational material and work with local HIV/AIDS Organizations to raise funds for their community For information on how to host a Dance To The Beat Of The Drums Campaign Promoting HIV/AIDS Awareness One Life, One Beat At A Time event, email info@speir.TV"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Northmont",
                "Dates attended or expected graduation",
                "1974 – 1978"
            ],
            "Recommendations",
            [
                "Randi ZuckerbergRandi Zuckerberg is a LinkedIn Influencer",
                "Founder & CEO at Zuckerberg Media",
                "787,112 followers"
            ],
            [
                "Dancefoundation",
                "48 followers"
            ],
            [
                "Matt BarrieMatt Barrie is a LinkedIn Influencer",
                "Chief Executive at Freelancer.com",
                "354,125 followers"
            ],
            [
                "Propellerhead Software",
                "5,775 followers"
            ],
            [
                "Eagle Communications",
                "1,310 followers"
            ],
            [
                "US Army",
                "560,109 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Randi ZuckerbergRandi Zuckerberg is a LinkedIn Influencer",
                "Founder & CEO at Zuckerberg Media",
                "787,112 followers"
            ],
            [
                "Randi ZuckerbergRandi Zuckerberg is a LinkedIn Influencer",
                "Founder & CEO at Zuckerberg Media",
                "787,112 followers"
            ],
            [
                "Randi Zuckerberg is a LinkedIn Influencer"
            ],
            [
                "Dancefoundation",
                "48 followers"
            ],
            [
                "Dancefoundation",
                "48 followers"
            ],
            [
                "Matt BarrieMatt Barrie is a LinkedIn Influencer",
                "Chief Executive at Freelancer.com",
                "354,125 followers"
            ],
            [
                "Matt BarrieMatt Barrie is a LinkedIn Influencer",
                "Chief Executive at Freelancer.com",
                "354,125 followers"
            ],
            [
                "Matt Barrie is a LinkedIn Influencer"
            ],
            [
                "Propellerhead Software",
                "5,775 followers"
            ],
            [
                "Propellerhead Software",
                "5,775 followers"
            ],
            [
                "Eagle Communications",
                "1,310 followers"
            ],
            [
                "Eagle Communications",
                "1,310 followers"
            ],
            [
                "US Army",
                "560,109 followers"
            ],
            [
                "US Army",
                "560,109 followers"
            ]
        ],
        "recommendations": [
            [
                "Sarah Atereth",
                "Fashion, Arts, Media, Entertainment",
                "February 23, 2013, Robert Christian worked with Sarah but at different companies",
                "Sarah Atereth is without a doubt one of the most creative people I have ever met. We started working together doing charity work which lead to us performing together Live in New York City an Fundraising Event For Until.org for World Aids Day 2012. Sara and I are now partners in a major new project that will be launching soon. I would recommend Sara for to many reasons to list.Thank You Robert Christian Sussman aka Speir"
            ],
            [
                "Sarah Atereth",
                "Fashion, Arts, Media, Entertainment",
                "February 23, 2013, Robert Christian worked with Sarah but at different companies"
            ],
            [
                "Sarah Atereth",
                "Fashion, Arts, Media, Entertainment",
                "February 23, 2013, Robert Christian worked with Sarah but at different companies"
            ],
            [
                "Sarah Atereth",
                "Fashion, Arts, Media, Entertainment",
                "February 23, 2013, Robert Christian worked with Sarah but at different companies"
            ],
            "Fashion, Arts, Media, Entertainment",
            [
                "Sarah Atereth is without a doubt one of the most creative people I have ever met. We started working together doing charity work which lead to us performing together Live in New York City an Fundraising Event For Until.org for World Aids Day 2012. Sara and I are now partners in a major new project that will be launching soon. I would recommend Sara for to many reasons to list.Thank You Robert Christian Sussman aka Speir"
            ],
            [
                "Sarah Atereth is without a doubt one of the most creative people I have ever met. We started working together doing charity work which lead to us performing together Live in New York City an Fundraising Event For Until.org for World Aids Day 2012. Sara and I are now partners in a major new project that will be launching soon. I would recommend Sara for to many reasons to list.Thank You Robert Christian Sussman aka Speir"
            ]
        ],
        "skills": [],
        "summary": "    Speir Holdings is a holding company with its HQ in Phoenix, Arizona. The company is broken down into five divisions: Entertainment, Insurance, Consumer Healthcare, Digital Marketing and a Foundation.\n  \n  \n",
        "name": "Robert Christian Sussman",
        "title": "Chairman at Speir Holdings Inc.",
        "url": "linkedin.com/in/speir",
        "phone": "",
        "email": "robert@speirdigital.com"
    }
]