[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "41 Mutual Connections",
                "You and Catrina both know Max Hansen, Dan Nienhauser, and 39 others"
            ],
            [
                "Flying westbound!! #aviation #pilotlife #nascar #HappyThanksgiving",
                "Catrina liked"
            ],
            [
                "6 days until #GivingTuesday. On November 28, Facebook and the Bill & Melinda Gates Foundation are matching donations made on Facebook. Your donations to TGen next Tuesday could be matched up to $50,000! Mark your calendar and look for the DONATE button on TGen's Facebook posts throughout the day!",
                "Catrina liked"
            ],
            [
                "It’s been a year of hurricanes, fires, violence, racism, sexism, terrorism, and something new to fear almost every day. AND, at the exact same time, beautiful babies were born, we fell in love, we created amazing new things, we helped each other, we laughed, and we recommitted to making this world a braver and more loving place.",
                "While there is still so much work to do, there are countless reasons to give thanks.",
                "Peace be with you this Thanksgiving season.",
                "Catrina liked"
            ],
            [
                "“I want every girl to know that her voice can change the world.” - Malala",
                "The 2 little girls in denim polka dots below are my sweet girls. This pic with their friend and the incredible Noah Coughlan from a couple years ago melts my heart every time I see it. These girls who spent 30 days getting juggled around while their brother was in the hospital, and still get juggled every 2 weeks while I take him to infusions are some of the bravest and kindest girls I know. They have grown up being around patients of all rare diseases. They have had to miss dance, school and parties while I've rushed their brother to the ER or a Dr. appointment. They are compassionate, service oriented and have big plans for futures in science. Their experiences are preparing them to make a difference to even just one person in the world. Rare Disease Day is about more than patients. It includes supporting those who sit on the sidelines, who don’t always understand the situation and who are often overlooked. For every 1 in 10 patients, there are many more fighting strong along with them! #rarediseaseday #rare",
                "Catrina liked"
            ],
            [
                "Being a role-model...",
                "Catrina liked"
            ],
            [
                "GIVE THANKS this Thanksgiving, but remember others less blessed...",
                "Catrina liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Director Of Development",
                "Company Name",
                "United Food Bank",
                "Dates Employed",
                "Jun 2017 – Present",
                "Employment Duration",
                "6 mos"
            ],
            [
                "Owner",
                "Company Name",
                "Cailee's Corner",
                "Dates Employed",
                "Jan 2012 – Present",
                "Employment Duration",
                "5 yrs 11 mos",
                "Location",
                "https://www.facebook.com/cailees.corner",
                "Support, resources, fun, products and advocacy for the visually impaired and special needs community through social media."
            ],
            [
                "Director Of Development",
                "Company Name",
                "VisionQuest 20/20",
                "Dates Employed",
                "May 2015 – May 2017",
                "Employment Duration",
                "2 yrs 1 mo",
                "Location",
                "Phoenix, Arizona"
            ],
            [
                "Director of Education and Community Outreach",
                "Company Name",
                "VisionQuest 20/20",
                "Dates Employed",
                "Jun 2015 – Oct 2016",
                "Employment Duration",
                "1 yr 5 mos",
                "Location",
                "Phoenix, Arizona",
                "Non-profit organization dedicated to protecting children's vision through updated technology."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Phoenix College",
                "Degree Name",
                "Associate’s Degree",
                "Field Of Study",
                "Administration of Justice",
                "Dates attended or expected graduation",
                "2002 – 2004",
                "Activities and Societies:",
                "Phi Theta Kappa",
                "Deans List",
                "Graduated with Honors in Administration of Justice, 2004.  Crime Scene Technology and Photography Certificate, 2004. Finger Print Technology Certificate, 2004. Phi Theta Kappa Society, 2002. National Deans List recipiant 2002, 2003, 2004."
            ],
            "Recommendations",
            [
                "One Step Beyond, Inc.",
                "65 followers"
            ],
            [
                "Child Crisis Arizona",
                "339 followers"
            ],
            [
                "VSP Global",
                "8,293 followers"
            ],
            [
                "Phoenix Suns",
                "6,847 followers"
            ],
            [
                "Genetic Alliance",
                "2,026 followers"
            ],
            [
                "VSP Vision Care",
                "16,543 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "One Step Beyond, Inc.",
                "65 followers"
            ],
            [
                "One Step Beyond, Inc.",
                "65 followers"
            ],
            [
                "Child Crisis Arizona",
                "339 followers"
            ],
            [
                "Child Crisis Arizona",
                "339 followers"
            ],
            [
                "VSP Global",
                "8,293 followers"
            ],
            [
                "VSP Global",
                "8,293 followers"
            ],
            [
                "Phoenix Suns",
                "6,847 followers"
            ],
            [
                "Phoenix Suns",
                "6,847 followers"
            ],
            [
                "Genetic Alliance",
                "2,026 followers"
            ],
            [
                "Genetic Alliance",
                "2,026 followers"
            ],
            [
                "VSP Vision Care",
                "16,543 followers"
            ],
            [
                "VSP Vision Care",
                "16,543 followers"
            ]
        ],
        "recommendations": [
            [
                "Artem Zykovich",
                "CEO at DNAcheckup",
                "January 18, 2017, Catrina was a client of Artem’s",
                "I met Catrina online as Familial exudative vitreoretinopathy (FEVR) advocate, while reaching out recessive disorder advocacy groups to learn whether there is a need in DNAcheckup's service. Catrina was the first one who responded and was very helpful in shaping our program. Catrina is a very passionate advocate and truly cares about patients and their families. I am looking forward to working with Catrina to provide support for families of patients with FEVR."
            ],
            [
                "Artem Zykovich",
                "CEO at DNAcheckup",
                "January 18, 2017, Catrina was a client of Artem’s"
            ],
            [
                "Artem Zykovich",
                "CEO at DNAcheckup",
                "January 18, 2017, Catrina was a client of Artem’s"
            ],
            [
                "Artem Zykovich",
                "CEO at DNAcheckup",
                "January 18, 2017, Catrina was a client of Artem’s"
            ],
            "CEO at DNAcheckup",
            [
                "I met Catrina online as Familial exudative vitreoretinopathy (FEVR) advocate, while reaching out recessive disorder advocacy groups to learn whether there is a need in DNAcheckup's service. Catrina was the first one who responded and was very helpful in shaping our program. Catrina is a very passionate advocate and truly cares about patients and their families. I am looking forward to working with Catrina to provide support for families of patients with FEVR."
            ],
            [
                "I met Catrina online as Familial exudative vitreoretinopathy (FEVR) advocate, while reaching out recessive disorder advocacy groups to learn whether there is a need in DNAcheckup's service. Catrina was the first one who responded and was very helpful in shaping our program. Catrina is a very passionate advocate and truly cares about patients and their families. I am looking forward to working with Catrina to provide support for families of patients with FEVR."
            ]
        ],
        "skills": [],
        "summary": "    Catrina Frost is a dedicated vision advocate with strong roots in community awareness and education. As a parent of a child with a rare genetic eye disease known as Familial exudative vitreoretinopathy (FEVR), as well as a child with Amblyopia, Ms. Frost understands the critical role of vision to a child’s quality of life. Ms. Frost has built successful online information and support networks for individuals and parents of children with vision impairment, in hopes that not one more person or family would feel alone in finding resources or support in coping with vision impairment. Bringing people together, raising awareness and building the self-confidence of children and young people struggling with vision impairment issues are some of the talents Ms. Frost encompasses.Currently, Ms. Frost sits on the Board of the AZ Chapter for Foundation Fighting Blindness and serves as Chair of the AZ VisionWalk and is a member of the Lions Club. Ms Frost and her daughter travel the country giving support and hosting speaking engagements to parents of the vision impairment community. Ms. Frost holds an Associates Degree in Administration of Justice with a certificate in Crime Scene Evidence and Police Photography.  In addition to her work in the vision community, Ms. Frost has volunteered and held special events for numerous charities including the Thunderbird NICU, Arrowhead NICU and UCP of Central Arizona.\n  \n  \n",
        "name": "Catrina Frost",
        "title": "Director Of Development at United Food Bank",
        "url": "linkedin.com/in/catrina-frost-89b599121",
        "phone": "",
        "email": "cfrost@visionquest2020.org"
    }
]