[
    {
        "experience": [
            "Highlights",
            [
                "2 Mutual Connections",
                "You and Charmaine both know David Lenertz and Kellen Reid"
            ],
            [
                "I'm looking for talented folks in the field of Software Engineering. If you are into Full Stack Engineering, Mobile and Web Development, UI/UX, send me a note and I would love to chat with you about these opportunities!",
                "Charmaine shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Business Development Specialist",
                "Company Name",
                "Code Ninja",
                "Dates Employed",
                "Oct 2016 – Present",
                "Employment Duration",
                "1 yr 1 mo",
                "I build valuable partnerships across different levels of organizations. My goal is to develop social capital by fostering person-to-person and people-to-place relationships turning these into formidable company assets for Code Ninja. I take care of Recruitment and HR Strategy, Branding and Marketing, Business Development, and Community Engagement."
            ],
            [
                "Talent Acquisition Specialist",
                "Company Name",
                "Code Ninja",
                "Dates Employed",
                "Jan 2016 – Present",
                "Employment Duration",
                "1 yr 10 mos",
                "Location",
                "Quezon City",
                "Full life-cycle recruiting and hiring for junior and senior IT positions for SwayChat (https://swaychat.com/) and ImportGenius (https://www.importgenius.com/).Designs various recruitment strategies for all internship and employment candidates. Collates all competitive data, manages all communication with team and develops effective relationships with hiring manager to implement various strategies.Sourcing of candidates through efficient internet technology, social media, e-mail campaign, job fairs and screening all candidates for interviews.Development and maintenance of networks and relationships with various universities, recruitment firms and talent pipelines.Collaborates with hiring managers to understand technical job duties, responsibilities, staffing needs and business requirements. Development of job descriptions and use of multiple sources to attract quality candidates.Competency based interviewing, facilitation of discussion with managers over candidate's skills sets, and providing recommendations for shortlisted candidates.Performs offers and handles all pre-employment background checks prior to onboarding.Provides HR strategy on employee engagement, performance management, and remuneration reviews."
            ],
            [
                "Recruitment Services Advisor",
                "Company Name",
                "Shell",
                "Dates Employed",
                "Aug 2013 – Oct 2015",
                "Employment Duration",
                "2 yrs 3 mos",
                "Location",
                "Makati City",
                "Planning and organization of three graduate recruitment processes – Interviews, Final Assessments, and Assessed Internship conducted across different locations in Nigeria and Gabon. Scope includes candidate scheduling, and assessor and interviewer sourcing. Final Assessment coordination for Commercial and Technical graduate candidates across Europe. Responsible for ensuring timely processing of candidates for 3 Talent Delivery recruiters.Dinner host sourcing and coordination for Shell Recruitment Day events in Europe and Africa. Coordination with Single Focal Points and third party vendor in initiating post offer reference check for graduate and experienced candidates across Europe.Training and assessment facilitation for Recruitment Services New Joiners.Investigates process and systems issues and works with Global team to resolve issues.Collaborates with Process Architects to ensure process consistency and design; ensures calibration and alignment in process and documentations.Collaborates with the Global Assessor Pool Advisor in preparing and analyzing data and reports for future rounds of assessor nominations. Amalgamates Global Assessor training reports with over 4000+ data entries. Designs the Global Graduate Assessor Participation Reporting Tool. Leads the team in achieving target results by studying trends, forecasting work in progress volumes, and proposing strategies to achieve team goal.Reports performance progress and strategies to leadership team.Drives continuous improvement initiatives and supports overall agenda of the team and centre. Facilitates calibration and team learning session on continuous improvement topics. Spearheaded a programme for embedding Continuous Improvement culture, consistent tracking of projects, and rewarding top participating teams and individuals across HR Services Manila."
            ],
            [
                "Psychology Research Assistant",
                "Company Name",
                "University of the Philippines",
                "Dates Employed",
                "Aug 2012 – May 2013",
                "Employment Duration",
                "10 mos",
                "Location",
                "Diliman, Quezon City",
                "Filipino Glossary of Psychology – research and analysis of content and project documentation.Examined various reference materials suitable for the project.Pooled and organized relevant data content in the past 10 years.Reviewed different lexical domain studies for referencing."
            ],
            [
                "Organization Development Intern",
                "Company Name",
                "St. Luke's Medical Center - Quezon City",
                "Dates Employed",
                "May 2012 – Jun 2012",
                "Employment Duration",
                "2 mos",
                "Location",
                "Quezon City",
                "Responsible for reviewing and drafting of job descriptions and table of organizations.Managing an inventory of employee records.Contributed in designing and updating of qualifications for current and novel positions.Conducted analysis of various departments’ quarterly key performance indicators.Supported in preparation of corporate presentations."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "University of the Philippines",
                "Degree Name",
                "Bachelor of Science (BS)",
                "Field Of Study",
                "Psychology",
                "Grade",
                "Magna Cum Laude",
                "Dates attended or expected graduation",
                "2009 – 2013",
                "Activities and Societies:",
                "Honor Graduate Eligibility from Civil Service Commission of the Philippines",
                "Member, Phi Gamma Mu Honor Society in Social Sciences",
                "2012: Paper presented in PSYnergy 6: The Sixth All Psychology Students' Congress on the topic of Cohabitation in the Philippines"
            ],
            "Recommendations",
            [
                "Open Source",
                "183,307 members"
            ],
            [
                "Okada Manila",
                "36,724 followers"
            ],
            [
                "Justin TrudeauJustin Trudeau is a LinkedIn Influencer",
                "Prime Minister of Canada | Premier ministre du Canada",
                "1,584,058 followers"
            ],
            [
                "Fortune Magazine",
                "1,388,085 followers"
            ],
            [
                "IdeaSpace Foundation, Inc.",
                "399 followers"
            ],
            [
                "Canva",
                "17,642 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Open Source",
                "183,307 members"
            ],
            [
                "Open Source",
                "183,307 members"
            ],
            [
                "Okada Manila",
                "36,724 followers"
            ],
            [
                "Okada Manila",
                "36,724 followers"
            ],
            [
                "Justin TrudeauJustin Trudeau is a LinkedIn Influencer",
                "Prime Minister of Canada | Premier ministre du Canada",
                "1,584,058 followers"
            ],
            [
                "Justin TrudeauJustin Trudeau is a LinkedIn Influencer",
                "Prime Minister of Canada | Premier ministre du Canada",
                "1,584,058 followers"
            ],
            [
                "Justin Trudeau is a LinkedIn Influencer"
            ],
            [
                "Fortune Magazine",
                "1,388,085 followers"
            ],
            [
                "Fortune Magazine",
                "1,388,085 followers"
            ],
            [
                "IdeaSpace Foundation, Inc.",
                "399 followers"
            ],
            [
                "IdeaSpace Foundation, Inc.",
                "399 followers"
            ],
            [
                "Canva",
                "17,642 followers"
            ],
            [
                "Canva",
                "17,642 followers"
            ]
        ],
        "recommendations": [
            [
                "Steven Uwajeh",
                "HR Account Manager, Shallow offshore and Pipelines",
                "July 1, 2016, Steven was a client of Charmaine’s",
                "Charmaine was pivotal to my team achieving the best Graduate recruitment delivery in the Shell group. As RSA she was responsible assessors/ candidate logistics and relationship management. She often extended herself beyond the call of duty, was a fast learner and highly adaptive; quickly understanding the cultural peculiarities in Nigeria and Gabon and altering her communication style to influence various stakeholders. Her attention to detail and collaborative nature was key in managing logistics seamlessly across Europe and Africa and in developing a real friendship with the teams even though she worked virtually. Charm received my highest commendation at her year end review. I recommend Charm to anyone looking for a hardworking and passionate team player."
            ],
            [
                "Steven Uwajeh",
                "HR Account Manager, Shallow offshore and Pipelines",
                "July 1, 2016, Steven was a client of Charmaine’s"
            ],
            [
                "Steven Uwajeh",
                "HR Account Manager, Shallow offshore and Pipelines",
                "July 1, 2016, Steven was a client of Charmaine’s"
            ],
            [
                "Steven Uwajeh",
                "HR Account Manager, Shallow offshore and Pipelines",
                "July 1, 2016, Steven was a client of Charmaine’s"
            ],
            "HR Account Manager, Shallow offshore and Pipelines",
            [
                "Charmaine was pivotal to my team achieving the best Graduate recruitment delivery in the Shell group. As RSA she was responsible assessors/ candidate logistics and relationship management. She often extended herself beyond the call of duty, was a fast learner and highly adaptive; quickly understanding the cultural peculiarities in Nigeria and Gabon and altering her communication style to influence various stakeholders. Her attention to detail and collaborative nature was key in managing logistics seamlessly across Europe and Africa and in developing a real friendship with the teams even though she worked virtually. Charm received my highest commendation at her year end review. I recommend Charm to anyone looking for a hardworking and passionate team player."
            ],
            [
                "Charmaine was pivotal to my team achieving the best Graduate recruitment delivery in the Shell group. As RSA she was responsible assessors/ candidate logistics and relationship management. She often extended herself beyond the call of duty, was a fast learner and highly adaptive; quickly understanding the cultural peculiarities in Nigeria and Gabon and altering her communication style to influence various stakeholders. Her attention to detail and collaborative nature was key in managing logistics seamlessly across Europe and Africa and in developing a real friendship with the teams even though she worked virtually. Charm received my highest commendation at her year end review. I recommend Charm to anyone looking for a hardworking and passionate team player."
            ]
        ],
        "skills": [],
        "summary": "    Charmaine is a natural game-changer who enjoys working on challenging projects where she gets to collaborate with diverse groups across the globe and gain knowledge on various businesses.She has worked on multi-functional and multi-cultural organizations. She started her career as a Recruitment Advisor doing graduate recruitment for Europe and Africa markets where she delivered top-quality outcomes by challenging the status quo and innovating recruitment strategies. Having a strong continuous improvement mindset, she spearheaded projects on data driven recruitment across various regions and businesses.In her current role, she works on bringing the best talents in Code Ninja. Her dynamic role enables her to focus on creating business opportunities by strengthening the organization's branding, community engagement, and business partnering.\n  \n  \n",
        "name": "Charmaine Ulay",
        "title": "Business Development in Tech Startups",
        "url": "linkedin.com/in/charmaineulay",
        "phone": "+63 998 557 2313 (Home)",
        "email": "ulaycharmaine@gmail.com"
    }
]