[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "32 Mutual Connections",
                "You and Marissa both know Duke Merhavy, MBA, Ph.D., Ben Smith, and 30 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Client Support Analyst",
                "Company Name",
                "Meltwater",
                "Dates Employed",
                "Mar 2016 – Present",
                "Employment Duration",
                "1 yr 9 mos",
                "Location",
                "Charlotte, North Carolina Area"
            ],
            [
                "Sales and Marketing Assistant",
                "Company Name",
                "vestique",
                "Dates Employed",
                "Sep 2015 – Mar 2016",
                "Employment Duration",
                "7 mos",
                "Location",
                "Charlotte, North Carolina Area",
                "Responsible for ensuring high levels of customer satisfaction through excellent sales serviceCreate and maintain visual merchandising and in-store displays.Identify and recommend items that confidently match customer needs.Manage Point-of-Sale processes. Generate customers needs by providing assistance and accurate information on company's products.Assist in warehouse needs by successful filling and packaging costumer's online and phone orders.Create,build and maintain trusting relationships with costumers."
            ],
            [
                "Production Manager",
                "Company Name",
                "Encore Creative",
                "Dates Employed",
                "Oct 2014 – Sep 2015",
                "Employment Duration",
                "1 yr",
                "Location",
                "Tempe",
                "Responsible for all logistics on flawless planning and execution of events and productions. Required to successfully follow through on aspects of design, contracting, execution, layouts, renderings, and billing.Internal office and external on-site coordination.Efficiently  coordinate with contractors and clients to insure event success. Responsible for time-management with multiple files and events at one time. Work with vendors to ensure successfully  timing and event execution.Point person for onsite event production between venues, clients, vendors, talent, entertainment and sales managers."
            ],
            [
                "Special Events Coordinator",
                "Company Name",
                "Bob Bondurant School of High Performance Driving",
                "Dates Employed",
                "Jul 2013 – Oct 2014",
                "Employment Duration",
                "1 yr 4 mos",
                "Location",
                "phoenix, arizona area",
                "Coordinate Corporate, Group and special sporting events at the racetrack, while providing an organized proactive level of service that exceeds the client’s expectations.Act as Bob Bondurant's representative during an event to coordinate all logistics with both Bondurant and catering staff for a smooth, enjoyable and memorable experience.Assist in Group Sales revenue for larger track productivity while promoting Bondurant to Corporate/Agency level demographics."
            ],
            [
                "Marketing and Public Relations Assistant",
                "Company Name",
                "Mesa Arizona Convention and Visitors Bureau",
                "Dates Employed",
                "Dec 2012 – Jun 2013",
                "Employment Duration",
                "7 mos",
                "Location",
                "mesa",
                "Plan and create itineraries to host and entertain individual FAM, journalist, and visiting clients while promoting city's attractions.Communicating via phone and email to potential clients, and partners.Assist with Social Media Efforts including Facebook, Twitter, Instagram, VisitMesa Website.Attend industry associations to network and promote Mesa.Worked closely with the MLB Cubs organizations to help promote and market Spring Training games."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Arizona State University, W. P. Carey School of Business",
                "Degree Name",
                "Bachelor of Science (B.S.)",
                "Field Of Study",
                "Business/Corporate Communications",
                "Dates attended or expected graduation",
                "2009 – 2013",
                "Activities and Societies:",
                "Kappa Alpha Theta, Member of ASU Medallion Scholarship Program",
                "-Minor In Tourism Development and Management with an emphasis on Event Planning. -Participant and philanthropist with Court Appointed Special Advocates (CASA)."
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Fundraising Volunteer",
                "Company Name",
                "Court Appointed Special Advocates for Children",
                "Dates volunteered",
                "Oct 2010 – May 2013",
                "Volunteer duration",
                "2 yrs 8 mos",
                "Cause",
                "Children",
                "I Volunteered and raised money for the local Maricopa county C.A.S.A organization through philanthropic efforts. This is the nationally recognized sponsored organization by the Kappa Alpha Theta Foundation."
            ],
            "Recommendations",
            [
                "Octagon",
                "47,040 followers"
            ],
            [
                "MKTG",
                "62,972 followers"
            ],
            [
                "DIVERSANT, LLC",
                "8,937 followers"
            ],
            [
                "Travel, Tourism & Hospitality Group",
                "188,508 members"
            ],
            [
                "Whole Body Relationship",
                "31 members"
            ],
            [
                "Encore Creative",
                "1,216 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Octagon",
                "47,040 followers"
            ],
            [
                "Octagon",
                "47,040 followers"
            ],
            [
                "MKTG",
                "62,972 followers"
            ],
            [
                "MKTG",
                "62,972 followers"
            ],
            [
                "DIVERSANT, LLC",
                "8,937 followers"
            ],
            [
                "DIVERSANT, LLC",
                "8,937 followers"
            ],
            [
                "Travel, Tourism & Hospitality Group",
                "188,508 members"
            ],
            [
                "Travel, Tourism & Hospitality Group",
                "188,508 members"
            ],
            [
                "Whole Body Relationship",
                "31 members"
            ],
            [
                "Whole Body Relationship",
                "31 members"
            ],
            [
                "Encore Creative",
                "1,216 followers"
            ],
            [
                "Encore Creative",
                "1,216 followers"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "    A natural born leader whose focus has been on public relations, communications, special events, client services and social networking. Vivacious drive with a high level of creativity and innovation. Able to thrive both independently or in a group environment. Reputation for quality service while eliciting trust and confidence amongst employees and clients.\n  \n  \n",
        "name": "Marissa Piasecki",
        "title": "Client Support Specialist at Meltwater",
        "url": "linkedin.com/in/marissa-piasecki-0a06224a",
        "phone": "",
        "email": "mnpiasec@asu.edu"
    }
]