[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "16 Mutual Connections",
                "You and Amit both know Jason Patino, Jeff Lin, and 14 others"
            ],
            [
                "I gave a lecture at Cornell Tech.",
                "The room went dead silent.",
                "This is a two billion dollar campus funded by the greatest wealth in the world.",
                "It looks like a setting out of a SciFi movie.",
                "A typical speaker is Eric Schmidt or Michael Bloomberg.",
                "I’m just Ben Lee.",
                "But I could offer something different.",
                "I talked about growth hacking.",
                "After I showed them my LinkedIn stats, one finance student asked,",
                "“Why is our advanced marketing professor not teaching us this?”",
                "It hit me.",
                "Growth hacking is still a foreign concept to most.",
                "And it’s often used in the wrong context.",
                "Another student asked, “Is building an MVP with traction the best way to know if you have product/market fit?”",
                "I replied, “There’s never been a better time to validate ideas.”",
                "“What do you mean?”",
                "“I got four phrases for you:",
                "Facebook Group.",
                "Landing page.",
                "Fifty dollars on Facebook ads.",
                "You’ll validate the idea within 72 hours.”",
                "You could hear a pin drop.",
                "Pure shock.",
                "The next day the students would attend a career day.",
                "They’d talk to companies like Microsoft, Amazon, and McKinsey.",
                "All because they want more experience to start a company and not fail.",
                "Starting up and failure cost less than ever before.",
                "And when you live in a time where technology evolves faster than education.",
                "Execution is everything.",
                "Amit liked"
            ],
            [
                "Urgent need for Senior Level Fullstack Java Developers with our client in the consulting business in Dallas. Long term project with bleeding edge technology. Must be local to Dallas and able to meet in person for consideration. Able to offer a $500 referral fee. Who do you know?",
                "Amit liked"
            ],
            [
                "Offer accepted!  I am happy to announce that after nearly the longest seven months of my life I have accepted a phenomenal position.  It was tough turning down a couple positions since my layoff because they were not the right fit but it was well worth the wait.  Thank you to all that supported me and a special thank you to my awesome wife for being there for me.  Start date 11/6, bring on this new challenge!",
                "Amit liked"
            ],
            [
                "Role: QA Analyst",
                "Duration: FTE",
                "Location: Philadelphia, PA",
                "share profile at pragya@urbanmanpower.com",
                "Amit liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Client Relationship Manager",
                "Company Name",
                "Sage Group Consulting",
                "Dates Employed",
                "Mar 2017 – Present",
                "Employment Duration",
                "9 mos",
                "Location",
                "Hazlet, NJ",
                "My Responsibilities are: Business Development, Relationship Building, Client relationship management, Account Management, Screening the candidates and Scheduling the Interview.Taking care of the complete Sales Cycle starting from Cold Calling to identifying & qualifying the clients, qualifying the Consultants to match the requirement of the Client, Coordinating Interviews with Clients and Consultants to the point of negotiating and closing the deal in minimum turnaround timeActively involved in Contract, Contract to hire and full time Technical Recruitment as well involving sourcing, identifying and screening consultants and facilitate H1-B visa transfer queries. Source candidates and fill job orders using Internet postings, job sites, third party suppliers and referrals.Interact with clients on a daily basis, reviewing & interpreting the market trends to attune the business strategies.Candidates available on Major technologies: Programming Languages: C, C++, Java, .Net, Cobol …RDBMS: SQL Server, Oracle, Db2 ...ERP: SAP , Oracle Applications, PeopleSoft …Data warehousing: ETL/BI Tools like Informatica, Datastage, Abinitio, Congnos, BO, SAS, Crystal Reports …Administration: System Admins, Network Admins, Security Analysts …Other technologies like Cloud Infrastructure, BIG Data - Hadoop, Cassandra, NoSql, MongoDB, Web Technologies - PHP, MySql, Adobe, UI Design...Etc...Thanks and Regards:Amit Kumar| Client Relationship ManagerSage Group Technologies Inc., www.sagegroupinc.com 3400 Highway 35, Suite # 9, Hazlet, NJ 07730Direct: 732-730-7646 Ext. 710 | Fax: 732-837-2452 | Email: amkumar@sagetl.comSTAY IN TOUCH: https://www.linkedin.com/in/amit-kumar-760bbb47"
            ],
            [
                "Account Manager- Sales",
                "Company Name",
                "IDC Technologies, Inc.",
                "Dates Employed",
                "Jun 2016 – Mar 2017",
                "Employment Duration",
                "10 mos",
                "Location",
                "Milpitas, CA 95035 United States",
                "IDC provides consulting and IT services to clients globally - as partners to conceptualize and realize technology driven business transformation initiatives. With a world-class infrastructure and a global network, IDC offers a wide array of solutions for a range of key verticals and horizontals; starting from the strategy consulting right through to implementing IT solutions for clients.My Responsibilities are: Business Development, Relationship Building, Client relationship management, Account Management.Taking care of the complete Sales Cycle starting from Cold Calling to identifying & qualifying the clients, Qualifying the Consultants to match the requirement of the Client, Coordinating Interviews with Clients and Consultants to the point of negotiating and closing the deal in minimum turnaround time.Actively involved in Contract and Contract to hire Technical Recruitment as well involving sourcing, identifying and screening consultants and facilitate H1-B visa transfer queries.Source candidates and fill job orders using Internet postings, job sites, third party suppliers and referrals.Specialties:Business Development, Relationship Building, Client relationship management, Account Management. Screening the candidates, Follow up, Interview Scheduled, Getting new requirements on daily basis, Communicate with client and Business Development Activities."
            ],
            [
                "Sr. Business Development Manager",
                "Company Name",
                "ACE Technologies Inc.",
                "Dates Employed",
                "Oct 2013 – Feb 2016",
                "Employment Duration",
                "2 yrs 5 mos",
                "Location",
                "San Jose, California Area",
                "ACE Technologies, Inc. is a software solutions and an IT staffing company with over 500 full-time software professionals working across the US. We have been providing onsite-consulting services on a corp-to-corp basis for the last fourteen years years.Ace Technologies Inc., helps clients significantly improve their ability to bring new business into their companies. At Ace we understand that timelines are tight. Results are significant, quick and measurable.WHAT’S IN IT FOR YOU:Personalized service from an ACE Accounts Manager exclusively assigned to work with you. Access to 150 to 200 consultants covering spectrum of in demand hot skills at any point of time. Quick turnaround time from initial contact to the start date of the project. We carefully assess a client's current requirements and deliver perfect fit consultant through an intelligently crafted process that produce increased results in minimal time.We are willing to embrace newer ways of doing business and will constantly reinvent ourselves, if it adds more value to your business. This stems from a strong and defining belief that, ‘ we grow only when our customers do ’."
            ],
            [
                "Business Development Executive",
                "Company Name",
                "Okaya Inc.",
                "Dates Employed",
                "Sep 2012 – Sep 2013",
                "Employment Duration",
                "1 yr 1 mo",
                "Location",
                "Centereach NY 11720",
                "work with Okaya Inc, an IT consulting company based out of New York. It’s a part of 500 million dollar Microtek group. The company specializes in Staffing and Placements for all IT needs.skills worked on : oracle and Data Warehouse, java and .net,c,c++, Visual Basic."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Indira Gandhi National Open University",
                "Degree Name",
                "Master of Computer Applications (MCA)",
                "Field Of Study",
                "Computer Science",
                "Grade",
                "A",
                "Dates attended or expected graduation",
                "2007 – 2013",
                "Activities and Societies:",
                "Playing cricket..."
            ],
            "Recommendations",
            [
                "Modis",
                "167,222 followers"
            ],
            [
                "Raven Creative, Inc.",
                "15 followers"
            ],
            [
                "Quality Assurance Testing",
                "16,967 members"
            ],
            [
                "Experts PHP  Programmer",
                "19,976 members"
            ],
            [
                "SilverSearch, Inc.",
                "13,766 followers"
            ],
            [
                "WordPress Experts",
                "61,786 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Modis",
                "167,222 followers"
            ],
            [
                "Modis",
                "167,222 followers"
            ],
            [
                "Raven Creative, Inc.",
                "15 followers"
            ],
            [
                "Raven Creative, Inc.",
                "15 followers"
            ],
            [
                "Quality Assurance Testing",
                "16,967 members"
            ],
            [
                "Quality Assurance Testing",
                "16,967 members"
            ],
            [
                "Experts PHP  Programmer",
                "19,976 members"
            ],
            [
                "Experts PHP  Programmer",
                "19,976 members"
            ],
            [
                "SilverSearch, Inc.",
                "13,766 followers"
            ],
            [
                "SilverSearch, Inc.",
                "13,766 followers"
            ],
            [
                "WordPress Experts",
                "61,786 members"
            ],
            [
                "WordPress Experts",
                "61,786 members"
            ]
        ],
        "recommendations": [
            [
                "Abhishek Kumar",
                "Lead/Senior Technical Recruiter at Sage Group Technologies, Inc",
                "October 9, 2017, Amit was senior to Abhishek but didn’t manage directly",
                "Abhishek is very cool, hard working and pleasant person. He believes in building a good relationship and maintaining it too. He is very organized in his work and has the talent to connect with people. He is a great Recruiter, understands technology well and can hire any skill across any level. His sincerity towards work makes him a Favourite among everyone. I endorse him wholeheartedly and wish him success in future..."
            ],
            [
                "Abhishek Kumar",
                "Lead/Senior Technical Recruiter at Sage Group Technologies, Inc",
                "October 9, 2017, Amit was senior to Abhishek but didn’t manage directly"
            ],
            [
                "Abhishek Kumar",
                "Lead/Senior Technical Recruiter at Sage Group Technologies, Inc",
                "October 9, 2017, Amit was senior to Abhishek but didn’t manage directly"
            ],
            [
                "Abhishek Kumar",
                "Lead/Senior Technical Recruiter at Sage Group Technologies, Inc",
                "October 9, 2017, Amit was senior to Abhishek but didn’t manage directly"
            ],
            "Lead/Senior Technical Recruiter at Sage Group Technologies, Inc",
            [
                "Abhishek is very cool, hard working and pleasant person. He believes in building a good relationship and maintaining it too. He is very organized in his work and has the talent to connect with people. He is a great Recruiter, understands technology well and can hire any skill across any level. His sincerity towards work makes him a Favourite among everyone. I endorse him wholeheartedly and wish him success in future..."
            ],
            [
                "Abhishek is very cool, hard working and pleasant person. He believes in building a good relationship and maintaining it too. He is very organized in his work and has the talent to connect with people. He is a great Recruiter, understands technology well and can hire any skill across any level. His sincerity towards work makes him a Favourite among everyone. I endorse him wholeheartedly and wish him success in future..."
            ]
        ],
        "skills": [],
        "summary": "    Professional IT Experience and a background that includes Extensive experience in Requirements Gathering, Analysis of Business Processes, Use Case Analysis, User Support, Problem Solving and Documentation.• Experience in Client Relation, Client serving, Business operations. • Expertise in writing and implementing Test plans, Test scenarios, Test cases.• Thrives on driving targets, and enjoys leading teams and achieving results through People Management.• Strong analytical and organizational abilities and possesses & detailed oriented activities.• Team player and strong analytical & organizational activities.• Proficient at analysing market trends to provide critical puts for business development initiatives and formulation of selling & marketing strategies.• Responsible for developing revenue streams in line with Company strategy, focusing on site specific sales and margin growth, and critical cost control.• Assisting the Management team in pricing and preparing tender submissions and Written proposals to clients.• As effective communicator with excellent relationship & team management skills.• Adaptable and quick learner with skills to work under pressure.\n  \n  \n",
        "name": "Amit Kumar",
        "title": "Client Relationship Manager",
        "url": "linkedin.com/in/amit-kumar-760bbb47",
        "phone": "732-730-7646  (Work)",
        "email": "amithclsprint@gmail.com"
    }
]