[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "18 Mutual Connections",
                "You and Tara M both know Matt Greene, Monte Cahn, and 16 others"
            ],
            [
                "At AEON, teachers and students appreciate the chance to socialize outside of the classroom. It is a great opportunity for students to use English in a natural, less structured environment. Teachers and students also share their cultural and learn more about traditions and events.",
                "Tara M liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Travel Counselor",
                "Company Name",
                "American Express",
                "Dates Employed",
                "Mar 2017 – Present",
                "Employment Duration",
                "9 mos",
                "Location",
                "Phoenix, Arizona Area",
                "• Build professional relationships with Premium Card members through consultation and engagement in order to deliver personalized travel experiences.• Work closely with suppliers and vendors to fulfill customer needs.• Preserve high card-retention and card-spend by resolving all customer inquiries. • Achieved 200% of Q3 sales goal, 100% compliance rating, and 97% annual customer satisfaction.• First person in company history to earn 64 consecutive promoter scores with no detractors."
            ],
            [
                "Shelter Support Services Case Manager I PRN",
                "Company Name",
                "Sojourner Center",
                "Dates Employed",
                "Jul 2016 – Mar 2017",
                "Employment Duration",
                "9 mos",
                "• Transforming lives and creating a world free from domestic violence.• Provide support services to residents of domestic violence shelter, including childcare, employment resources, self-administration of medication, conflict resolution, and emotional support.• First-Aid and CPR certified, current food handler’s card and FBI fingerprint clearance card  on file. • Helping to create and maintain a resident-centric culture of service, positivity, loyalty and hard work."
            ],
            [
                "Operations Manager",
                "Company Name",
                "Dermarché Labs / Skinbetter Science",
                "Dates Employed",
                "Aug 2016 – Jan 2017",
                "Employment Duration",
                "6 mos",
                "Location",
                "Phoenix, Arizona Area",
                "• Established and documented standard operating procedures for two skincare companies.• Collaborated with upper management and front-line sales to achieve marketing, production, delivery, and growth goals. • Processed POs, return authorizations, invoices, special orders, marketing programs, promotions, and all other sales transactions for retail, wholesale, and physician accounts. • Provided superior customer service and sales rep support as a member of the Account Concierge team.• Provided office management services, including, but not limited to, scheduling meetings, ordering office supplies, organizing and documenting in-house inventory, and coordinating philanthropic quarterly donations and activities."
            ],
            [
                "Patient Care Operations Manager",
                "Company Name",
                "Philidor Rx Services",
                "Dates Employed",
                "Aug 2015 – Jan 2016",
                "Employment Duration",
                "6 mos",
                "Location",
                "Phoenix, Arizona Area",
                "• Oversaw 10 Supervisors and 10 Senior Agents in the Arizona branch of the Philidor Patient Care Center.• Developed and implemented coaching strategies focused on interpersonal relationships and team performance, ensuring the front line was wholly empowered to resolve member issues.• Worked with cross-site management to ensure compliance in all legal areas, as well as consistency amongst leadership.• Participated in practices related to the winding-down of business operations, including employee downsizing and voluntary resignation, document retention, and employee engagement."
            ],
            [
                "Patient Care Specialist Supervisor",
                "Company Name",
                "Philidor Rx Services",
                "Dates Employed",
                "May 2014 – Aug 2015",
                "Employment Duration",
                "1 yr 4 mos",
                "Location",
                "Phoenix, Arizona Area",
                "• Played a key role in building the call center from under 20 employees to over 180 in less than 2 years by evaluating candidates through interviews, planning logistics, and coaching numerous agents into positions of leadership and training.• Managed a team of up to 30 Patient Care Specialists, which included training new employees and improving performance through in-depth coaching and call monitoring, as well as administrative and disciplinary tasks in conjunction with Human Resources and Executive Leadership.• Heavily involved in developing standard operating procedures, strategic messaging, project management and day-to-day interaction with employees, partners, and customers to promote and encourage growth.• Composed written documents detailing new processes and procedures, which were distributed to both patient care centers; ensured execution of new processes and procedures by all employees.• De-escalated tense customer situations by empathizing, taking ownership of all issues, and following up with the proper departments to ensure satisfactory resolutions.• Collaborated with cross-site departments to research, develop, pilot, and launch an outbound campaign, as well as a streamlined new-hire on-boarding process.• Designed outbound training curricula, and implemented peer-training protocol, resulting in over 75% of call center agents being fully cross-trained.• Developed a standard Quality Assurance Program and other tools to measure service levels and member satisfaction. • Promoted to Manager after one year due to ability to learn quickly and successfully manage people and operations simultaneously."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor's degree",
                "Field Of Study",
                "English Language and Literature, General",
                "Dates attended or expected graduation",
                "2009 – 2011"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor's degree",
                "Field Of Study",
                "English Language and Literature, General",
                "Dates attended or expected graduation",
                "2009 – 2011"
            ],
            [
                "University of Arizona",
                "Dates attended or expected graduation",
                "2002 – 2004",
                "Activities and Societies:",
                "Alpha Phi Omega Co-Ed Service Fraternity"
            ],
            [
                "University of Arizona",
                "Dates attended or expected graduation",
                "2002 – 2004",
                "Activities and Societies:",
                "Alpha Phi Omega Co-Ed Service Fraternity"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Generation United Member",
                "Company Name",
                "Valley of the Sun United Way",
                "Dates volunteered",
                "Nov 2015 – Present",
                "Volunteer duration",
                "2 yrs 1 mo",
                "Cause",
                "Economic Empowerment",
                "Working with other young professionals in the Valley of the Sun to ensure children and youth succeed, end hunger and homelessness, and increase the financial stability of families and individuals."
            ],
            [
                "Generation United Member",
                "Company Name",
                "Valley of the Sun United Way",
                "Dates volunteered",
                "Nov 2015 – Present",
                "Volunteer duration",
                "2 yrs 1 mo",
                "Cause",
                "Economic Empowerment",
                "Working with other young professionals in the Valley of the Sun to ensure children and youth succeed, end hunger and homelessness, and increase the financial stability of families and individuals."
            ],
            [
                "Usher",
                "Company Name",
                "Herberger Theater Center",
                "Dates volunteered",
                "May 2015 – Present",
                "Volunteer duration",
                "2 yrs 7 mos",
                "Cause",
                "Arts and Culture",
                "As a volunteer usher, I provide service to patrons as well as execute any necessary emergency procedures."
            ],
            [
                "Usher",
                "Company Name",
                "Herberger Theater Center",
                "Dates volunteered",
                "May 2015 – Present",
                "Volunteer duration",
                "2 yrs 7 mos",
                "Cause",
                "Arts and Culture",
                "As a volunteer usher, I provide service to patrons as well as execute any necessary emergency procedures."
            ],
            [
                "Usher",
                "Company Name",
                "Orpheum Theater",
                "Dates volunteered",
                "May 2015 – Present",
                "Volunteer duration",
                "2 yrs 7 mos",
                "Cause",
                "Arts and Culture",
                "As a volunteer usher, I provide service to patrons as well as execute any necessary emergency procedures."
            ],
            [
                "Usher",
                "Company Name",
                "Orpheum Theater",
                "Dates volunteered",
                "May 2015 – Present",
                "Volunteer duration",
                "2 yrs 7 mos",
                "Cause",
                "Arts and Culture",
                "As a volunteer usher, I provide service to patrons as well as execute any necessary emergency procedures."
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 25 more skills"
            ],
            "Recommendations",
            [
                "American Express",
                "599,173 followers"
            ],
            [
                "University of Arizona",
                "214,005 followers"
            ],
            [
                "skinbetter science",
                "755 followers"
            ],
            [
                "AEON Corporation",
                "2,597 followers"
            ],
            [
                "Dermarché Labs",
                "188 followers"
            ],
            [
                "Philidor Rx Services",
                "934 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (301)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "American Express",
                "599,173 followers"
            ],
            [
                "American Express",
                "599,173 followers"
            ],
            [
                "University of Arizona",
                "214,005 followers"
            ],
            [
                "University of Arizona",
                "214,005 followers"
            ],
            [
                "skinbetter science",
                "755 followers"
            ],
            [
                "skinbetter science",
                "755 followers"
            ],
            [
                "AEON Corporation",
                "2,597 followers"
            ],
            [
                "AEON Corporation",
                "2,597 followers"
            ],
            [
                "Dermarché Labs",
                "188 followers"
            ],
            [
                "Dermarché Labs",
                "188 followers"
            ],
            [
                "Philidor Rx Services",
                "934 followers"
            ],
            [
                "Philidor Rx Services",
                "934 followers"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Management",
                "See 15 endorsements for Management",
                "15",
                "Management",
                "Endorse",
                "Endorsed by Kristi Howard (mutual connection)",
                "Endorsed by 10 of Tara M’S colleagues at Philidor Rx Services"
            ],
            [
                "Management",
                "See 15 endorsements for Management",
                "15"
            ],
            [
                "Leadership",
                "See 14 endorsements for Leadership",
                "14",
                "Leadership",
                "Endorse",
                "Endorsed by Kristi Howard and 1 other who is highly skilled at this",
                "Endorsed by Kristi Howard (mutual connection)"
            ],
            [
                "Leadership",
                "See 14 endorsements for Leadership",
                "14"
            ],
            [
                "Team Leadership",
                "See 13 endorsements for Team Leadership",
                "13",
                "Team Leadership",
                "Endorse",
                "Endorsed by Justin Huemiller, who is highly skilled at this",
                "Endorsed by Kristi Howard (mutual connection)"
            ],
            [
                "Team Leadership",
                "See 13 endorsements for Team Leadership",
                "13"
            ]
        ],
        "summary": "    I am an adaptable individual with dynamic leadership skills and a proven track record of successfully engaging individuals. I have talent for building collaborative relationships, coaching and developing others, improving efficiency, and enhancing customer experience. I am skilled at identifying and implementing cross-functional improvements, crafting strategic messaging, and executing innovative programs. I am a goal oriented self-starter who works effectively with a team or as an individual with internal and external customers. I am highly motivated, intelligent, and always up for a challenge.\n  \n  \n",
        "name": "Tara M Anderson",
        "title": "Dynamic leader who inspires others to shoot for the moon, creating a culture of stars.",
        "url": "linkedin.com/in/taramanderson",
        "phone": "",
        "email": "tara@iamnottara.com"
    }
]