[
    {
        "experience": [
            "Highlights",
            [
                "92 Mutual Connections",
                "You and Michael both know Dan Nienhauser, Dimitri Ponomareff, and 90 others"
            ],
            [
                "Indeed Academy | Indeed.com",
                "Michael liked"
            ],
            [
                "End of an Era !!! After almost 12 years I am no longer with Netflix. It has been a wonderful experience working for Netflix. Without any doubt Netflix is one of the greatest companies to work for. I’ll miss the great colleagues and the incredible work culture.",
                "Nothing great lasts forever. It has to make way for something greater. Netflix",
                "Michael liked"
            ],
            [
                "Right Now ! Everyone Should Be Looking For A New Job !",
                "Over the last few weeks I have been very lucky to be working with some amazing new candidates. There has been a common theme about most of them, and I think it is important for me to share this advice with you.",
                "Even if you are perfectly happy in your current role, you should be looking for something better, something new, something that challenges you more.",
                "The best time to look for a new role is when you are happy in the your current one.",
                "- There is no pressure to take what is offered.",
                "- Less pressure during the interview process.",
                "- More confidence to negotiate.",
                "- More confidence to ask for things you might not normal ask for.",
                "Make a plan, every month apply for one or two roles that catch your eye, enjoy the process, connect with recruiters, slowly build a better business network, meet new people at companies that interest you.",
                "Let's call this Career Planning! Enjoy!",
                "Michael liked"
            ],
            [
                "!!Latest Job Openings!!",
                "We have 747 job openings as of today in the Phoenix Market, so visit roberthalf.com for a full overview...",
                "Embedded Developer | Scottsdale | Software | $75-$85k",
                "Executive Assistant | Scottsdale | Technology | $65k-$75k",
                "Senior Accountant | Tempe | Oil&Gas | $32 p/h",
                "Paralegal | Phoenix | $27-$30 p/h",
                "Cerfitifed Medical Coder $26-$32 p/h",
                "Call Center Manager | Glendale | Healthcare | $55k-$65k",
                "Staff Accountant | Phoenix | Healthcare | $25-$27 p/h",
                "Project Coordinator | Phoenix | Construction | $16-$18 p/h",
                "Help Desk Rep | Chandler | Logistics | $21.50 p/h",
                "A/R Specialist | Tolleson | HVAC | $18 p/h",
                "Client Account Coordinator | Tempe | Benefits | $16 p/h",
                "Receptionist | Scottsdale | Engineering | $14.50 p/h",
                "travis.laird@roberthalf.com or 602.524.7202",
                "Michael shared this"
            ],
            [
                "I called a candidate about a new opportunity.  It was a promotion from his current role, and he had the right skills and qualifications.",
                "\"Sorry but I'm not interested,\" he politely said.",
                "I pressed him on it until he said something that really confused me.  He told me that he \"already made it to the top\".",
                "I was familiar with his current company and looked at his CV again.",
                "He wasn't anywhere near the top.  He would have needed binoculars to see the top.  He wasn't even a manager yet.",
                "He explained to me that \"making it to the top\" for him meant he loved the exact work he did each day, he loved his company, he was treated fairly and with respect, he made enough money to be comfortable, he had excellent benefits, he had flexibility, and most importantly to him, he's never missed a single football game, school play, parent-teacher conference, anniversary, birthday, or any family event.",
                "He knew what taking the next step in his career meant.  More time, travel, and sacrifice.  \"Not worth it,\" he said.",
                "Your definition of \"making it to the top\" doesn't have to be society's or anyone else's definition.  You Do You.",
                "Michael shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Lead Desktop Support Analyst",
                "Company Name",
                "Upgrade, Inc.",
                "Dates Employed",
                "Dec 2016 – Present",
                "Employment Duration",
                "11 mos",
                "Location",
                "Phoenix, Arizona Area"
            ],
            [
                "Desktop Engineer",
                "Company Name",
                "FATHOM (Global Water Management, LLC)",
                "Dates Employed",
                "May 2016 – Dec 2016",
                "Employment Duration",
                "8 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Single point of contact for end user to receive support and maintenance for computers and network system.Installing, diagnosing, repairing, maintaining, and upgrading all hardware and equipment (including but not limited to PC, terminals, printers and scanners) to ensure optimal workstation performance.Diagnose and quickly resolve a wide range of Windows applications and networking problems to help minimize downtime.Troubleshooting network connectivity in a LAN/WAN environment.Works with vendor support contacts to resolve technical problems withDesktop computing equipment and software.Ensure desktop computers interconnect seamlessly with diverse systems including associated validation systems, file servers, email servers, computer conferencing systems, application servers and administrative systems.Works to purchase hardware and software.Assesses functional needs to determine specifications for purchases.Orders computer supplies.Maintain telephone system."
            ],
            [
                "CRM System Administrator",
                "Company Name",
                "Prosper Marketplace",
                "Dates Employed",
                "Dec 2015 – Mar 2016",
                "Employment Duration",
                "4 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Configure Zendesk for Prosper customer service and third party integrations.Manage and create ongoing and custom reports using Zendesk, Good Data, and RedShift.Create and maintain meaningful dashboards for management and agents.Maintain and develop Help Center integration.Organize and prioritize feature implementation and team requests.Respond quickly to administrative requests such as on-boarding and off-boarding users, agents, and addressing Zendesk related issues.Manage other agent roles to their schedules, queues, and other responsibilities.Scale to a global level across multiple regions, languages, and time zones."
            ],
            [
                "Desktop Support Engineer",
                "Company Name",
                "Prosper Marketplace",
                "Dates Employed",
                "Oct 2014 – Dec 2015",
                "Employment Duration",
                "1 yr 3 mos",
                "Location",
                "Phoenix, Arizona Area",
                "IT equipment procurement, maintain IT/AV equipment inventory, repair of IT/AV equipment, maintain VDI environment, manage hosted VOIP system, manage contractors, develop and maintain on boarding and off boarding policies and procedures, develop and coach teammates and employees, work with department leadership to determine technology needs and opportunities, develop company wide hardware standards, setup employee work stations, and resolve break / fix situations."
            ],
            [
                "MIS Help Desk Technician",
                "Company Name",
                "Knight Transportation",
                "Dates Employed",
                "Sep 2013 – Aug 2014",
                "Employment Duration",
                "1 yr",
                "Location",
                "Phoenix, Arizona",
                "Trouble shoot and fix Windows 7 OS, Lenovo laptop/desktop computers, VOIP phones, MS Office 2010/2013 and Office 365, LAN/WAN networking issues, Adobe creative suite, virus/spyware removal and repair, and proprietary and AS400 software application issues."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "University of Phoenix",
                "Degree Name",
                "Bachelor of Applied Science (BASc)",
                "Field Of Study",
                "Advanced Networking",
                "Dates attended or expected graduation",
                "2012 – 2013",
                "The Bachelor of Science in Information Technology (BSIT) program provides the knowledge to successfully apply information technology theory and principles to address real world business opportunities and challenges. The program covered fundamental and advanced knowledge in core technologies such as systems integration, web systems, network architecture, database design, information security, programming and other supporting IT principles."
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 42 more skills"
            ],
            "Recommendations",
            [
                "Bitdefender",
                "40,078 followers"
            ],
            [
                "Zendesk Evangelists",
                "2,965 members"
            ],
            [
                "Shea Homes",
                "8,369 followers"
            ],
            [
                "Barrett-Jackson Auction Company",
                "6,768 followers"
            ],
            [
                "Gary VaynerchukGary Vaynerchuk is a LinkedIn Influencer",
                "Chairman of VaynerX, CEO of VaynerMedia, 4-Time NYT Bestselling Author",
                "1,313,407 followers"
            ],
            [
                "TECHNOLOGY JOBS NETWORK - #1 IT Careers Group",
                "137,921 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Bitdefender",
                "40,078 followers"
            ],
            [
                "Bitdefender",
                "40,078 followers"
            ],
            [
                "Zendesk Evangelists",
                "2,965 members"
            ],
            [
                "Zendesk Evangelists",
                "2,965 members"
            ],
            [
                "Shea Homes",
                "8,369 followers"
            ],
            [
                "Shea Homes",
                "8,369 followers"
            ],
            [
                "Barrett-Jackson Auction Company",
                "6,768 followers"
            ],
            [
                "Barrett-Jackson Auction Company",
                "6,768 followers"
            ],
            [
                "Gary VaynerchukGary Vaynerchuk is a LinkedIn Influencer",
                "Chairman of VaynerX, CEO of VaynerMedia, 4-Time NYT Bestselling Author",
                "1,313,407 followers"
            ],
            [
                "Gary VaynerchukGary Vaynerchuk is a LinkedIn Influencer",
                "Chairman of VaynerX, CEO of VaynerMedia, 4-Time NYT Bestselling Author",
                "1,313,407 followers"
            ],
            [
                "Gary Vaynerchuk is a LinkedIn Influencer"
            ],
            [
                "TECHNOLOGY JOBS NETWORK - #1 IT Careers Group",
                "137,921 members"
            ],
            [
                "TECHNOLOGY JOBS NETWORK - #1 IT Careers Group",
                "137,921 members"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Networking",
                "See 32 endorsements for Networking",
                "32",
                "Networking",
                "Endorse",
                "Endorsed by Raymond Zawacki and 5 others who are highly skilled at this",
                "Endorsed by 4 of Michael’s colleagues at Prosper Marketplace"
            ],
            [
                "Networking",
                "See 32 endorsements for Networking",
                "32"
            ],
            [
                "Help Desk Support",
                "See 23 endorsements for Help Desk Support",
                "23",
                "Help Desk Support",
                "Endorse",
                "Endorsed by Mark Walt and 1 other who is highly skilled at this",
                "Endorsed by 3 of Michael’s colleagues at Prosper Marketplace"
            ],
            [
                "Help Desk Support",
                "See 23 endorsements for Help Desk Support",
                "23"
            ],
            [
                "Windows 7",
                "See 25 endorsements for Windows 7",
                "25",
                "Windows 7",
                "Endorse",
                "Endorsed by Carson Babbitt and 3 others who are highly skilled at this"
            ],
            [
                "Windows 7",
                "See 25 endorsements for Windows 7",
                "25"
            ]
        ],
        "summary": "    If you are seeking an IT professional who has excellent people and problem solving skills and can easily provide optimum support to your IT operations, then please consider what I have to offer.Thank you for your time and consideration.\n  \n  \n",
        "name": "Michael Hayden",
        "title": "Lead Desktop Engineer - Upgrade Inc",
        "url": "linkedin.com/in/michael-hayden-41682654",
        "phone": "",
        "email": "azunderg@me.com"
    }
]