[
    {
        "experience": [
            "Highlights",
            [
                "4 Mutual Connections",
                "You and Sanchan S both know Josh Stomel, Trent Humbert, and 2 others"
            ],
            [
                "Next up...Six figure deals.",
                "And we are just getting started.",
                "The opportunity for you on the SwarmSales, Inc marketplace is absolutely ridiculous. Imagine jumping on, connecting with your target accounts, and closing a deal within a few days. Well, you don't have to imagine, because we are already doing it. For less than a quarter of the cost of a single SDR, we can give you the entire country.",
                "I want to invite you to experience our strength, our ability to blast you past cold emails or calls. I want you to experience the high-quality transactions our sales professionals bring to the table.",
                "So, to all companies interested in experiencing SwarmSales, Inc I invite you to experience the power of the gig economy. And to limit any risk for you...I will give you a full 30-day money back guarantee.",
                "All you have to do is have an amazing product. ;)",
                "#FutureofSales",
                "Sanchan S liked"
            ],
            [
                "As an employee of a CTA member company, you get free registration to CES before Oct. 17. Create your account today. https://lnkd.in/dg_p5US",
                "Sanchan S liked"
            ],
            [
                "Are you a #salesrep who would like to monetize your existing contacts by selling them more solutions? Here are just a few of the solutions you can sell on SwarmSales, Inc!! Visit www.swarmsales.com today to get started and see all of the companies who trust Swarmsales Sales Professionals to close more deals!",
                "Sanchan S liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Manager, Product Management",
                "Company Name",
                "Instagram",
                "Dates Employed",
                "Aug 2014 – Present",
                "Employment Duration",
                "3 yrs 3 mos",
                "Location",
                "Menlo Park",
                "Managing a team of Product Managers who are experimenting with bold new ideas that push the boundary of what's possible @ Instagram. The team's charter is to help Instagram's 600M consumers discover, engage and transact with businesses they love on Instagram. On 11/1, we announced the start of our journey for shopping on Instagram- http://www.recode.net/2016/11/1/13478838/instagram-shopping-commerce-brands-discovering- https://www.bloomberg.com/news/articles/2016-11-01/instagram-wants-to-ease-its-users-into-shoppingSome of the stuff that is already live includes - brand new user experiences that connect Instagram's 600M MAUs to the businesses they love. Previously, lead the monetization efforts (carousel ads, direct response ads etc.)I am hiring - so reach out if you are interested in working at Instagram!"
            ],
            [
                "Manager, Product Management - New Experiences @ Instagram",
                "Company Name",
                "Facebook",
                "Dates Employed",
                "Aug 2014 – Present",
                "Employment Duration",
                "3 yrs 3 mos",
                "Location",
                "Menlo Park, CA"
            ],
            [
                "Director of Product Management, Mobile",
                "Company Name",
                "Yahoo",
                "Dates Employed",
                "Oct 2011 – Jul 2014",
                "Employment Duration",
                "2 yrs 10 mos",
                "During my stay at Yahoo, I lead the efforts for two products:1) Yahoo Today - an intelligent personal assistance designed for your mobile phoneIn the world of mobile, the user's context \"is the query\". By taking user's location, habits and past history, we can build a personal assistant that provides the right information at the right time based on the context.Yahoo Today allows you to track real time weather, be notified about your favorite team games, track your stock portfolio, be notified about flight statuses, receive updates on Amazon packages - and much more. See attached screenshots for more details.I conceived, designed and prototyped a brand new product idea and got the leadership excited about pursuing my vision. I grew this product from just an idea to a well established product line with several engineers/PMs/designers working full time on making it the best personal assistance in town.Here is some press coverage:-  http://www.theverge.com/2014/4/29/5665308/yahoo-mail-app-for-iphone-updated-with-news-and-a-google-now-rival-  http://mashable.com/2014/04/29/yahoo-mail-app-redesign/?utm_cid=mash-com-Tw-tech-link2) Mobile MonetizationI lead the team responsible for building out the mobile monetization strategy, product and operations for Yahoo's mobile apps. Ideated, designed and built the marketplace for mobile app install ads for Yahoo - see screenshots attached here.These products generate revenue in excess of a billion dollars and are responsible for setting the stage for continued revenue growth on mobile.Previously, a Lead Product Manager on the same team."
            ],
            [
                "PM, Growth for Hotmail Mobile (now Outlook.com)",
                "Company Name",
                "Microsoft Corporation",
                "Dates Employed",
                "May 2007 – Oct 2011",
                "Employment Duration",
                "4 yrs 6 mos",
                "Location",
                "Mountain View, CA",
                "Worked as a Growth PM for Hotmail (now Outlook.com), the world's largest email service with 350 Million+ users. As part of this role, I lead:1) Grew mobile user base by 100% YoYMy philosophy has been that growth comes not from the top 10% of users, but from those less engaged users who are churning or becoming inactive every day.Reduced friction in mobile account sign up - went from 15 fields to just 6 and saw a spike in user registration by 60%. I worked hard to identify top reasons for churn - looked and analyzed customer support calls, comments on blogosphere etc. Executed strategies that helped reverse the tide.2) Grew international user base (in key markets like Japan) by 300% YoYI also managed a team of PMs in Japan responsible for a separate version of Hotmail for the Japanese markets (a top market for Microsoft) optimized for DoCoMo and other players. I was also responsible for managed relationships with mobile phone manufacturers (like RIM, Samsung, Nokia etc.) and mobile operators. I participated in partnership discussions, identified product customization for each carrier and partner for co-branding and white-labeling (wap-deck, back-linking).3)  Grew desktop revenue by 80% YoYI was responsible for leading a global roll out of Bing Product Ads in Hotmail’s Desktop Site. I designed the first A/B testing framework and approach for testing Ads in Hotmail. I piloted a brand new Ad product (Bing Product Search Ads) that targets ads based on what’s in the user’s email content. This product grew to be highly successful generating >US$500 million a year."
            ],
            [
                "Engineering Manager",
                "Company Name",
                "Microsoft Corporation",
                "Dates Employed",
                "Sep 2003 – May 2007",
                "Employment Duration",
                "3 yrs 9 mos",
                "Wore multiple hats and spent time in different organizations within Microsoft. One of the best experiences of my career traveling and working in different countries. ++ Spent time with the database team (SQL Server) as a Lead Engineer at Microsoft's Charlotte, NC office. Post-sales engineering implementation lead/manager for Microsoft SQL Server for enterprise customers (Bank Of America, Verizon etc.). This was from Sep 2005 to May 2007.++ Spent time in Microsoft Bangalore office as a Manager, Technology Consultancy. Led a team of 25+ employees who provided pre-sales technical consultation to Microsoft’s Independent Software Vendors. This was from September 2003 to 2005.++ Wrote several technical articles (see links in the publication section below)."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Punjab Engineering College",
                "Degree Name",
                "Bachelor's Degree",
                "Field Of Study",
                "Aerospace and Aeronautical Engineering"
            ],
            "Recommendations",
            [
                "Quora",
                "24,390 followers"
            ],
            [
                "PayPal",
                "263,599 followers"
            ],
            [
                "Thismoment",
                "2,061 followers"
            ],
            [
                "Crushpath",
                "3,959 followers"
            ],
            [
                "JPMorgan Chase & Co.",
                "1,002,544 followers"
            ],
            [
                "Kleiner Perkins Caufield & Byers",
                "31,054 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Quora",
                "24,390 followers"
            ],
            [
                "Quora",
                "24,390 followers"
            ],
            [
                "PayPal",
                "263,599 followers"
            ],
            [
                "PayPal",
                "263,599 followers"
            ],
            [
                "Thismoment",
                "2,061 followers"
            ],
            [
                "Thismoment",
                "2,061 followers"
            ],
            [
                "Crushpath",
                "3,959 followers"
            ],
            [
                "Crushpath",
                "3,959 followers"
            ],
            [
                "JPMorgan Chase & Co.",
                "1,002,544 followers"
            ],
            [
                "JPMorgan Chase & Co.",
                "1,002,544 followers"
            ],
            [
                "Kleiner Perkins Caufield & Byers",
                "31,054 followers"
            ],
            [
                "Kleiner Perkins Caufield & Byers",
                "31,054 followers"
            ]
        ],
        "recommendations": [
            [
                "Shiv Venkatraman",
                "Director, Mobile Engineering at Phunware, Inc.",
                "September 4, 2014, Sanchan S worked with Shiv in the same group",
                "I have had the pleasure of working with Sanchan at Yahoo in different components of the Mobile SDK. Sanchan is among the sharpest of the Product Managers I have worked with in my career. He has an exceptional ability to quickly grasp the complex issues; come up with creative solutions and articulate it very crisply. Sanchan is very focused and result oriented; and can always be counted upon to ‘make it happen’. He stamped his footprint (in a positive way) in almost every area he owned. Sanchan’s impact on Yahoo Mobile SDK was very huge and made a big difference to what the engineering team delivered. Sanchan is a tremendous asset to any organization and I recommend him very highly."
            ],
            [
                "Shiv Venkatraman",
                "Director, Mobile Engineering at Phunware, Inc.",
                "September 4, 2014, Sanchan S worked with Shiv in the same group"
            ],
            [
                "Shiv Venkatraman",
                "Director, Mobile Engineering at Phunware, Inc.",
                "September 4, 2014, Sanchan S worked with Shiv in the same group"
            ],
            [
                "Shiv Venkatraman",
                "Director, Mobile Engineering at Phunware, Inc.",
                "September 4, 2014, Sanchan S worked with Shiv in the same group"
            ],
            "Director, Mobile Engineering at Phunware, Inc.",
            [
                "I have had the pleasure of working with Sanchan at Yahoo in different components of the Mobile SDK. Sanchan is among the sharpest of the Product Managers I have worked with in my career. He has an exceptional ability to quickly grasp the complex issues; come up with creative solutions and articulate it very crisply. Sanchan is very focused and result oriented; and can always be counted upon to ‘make it happen’. He stamped his footprint (in a positive way) in almost every area he owned. Sanchan’s impact on Yahoo Mobile SDK was very huge and made a big difference to what the engineering team delivered. Sanchan is a tremendous asset to any organization and I recommend him very highly."
            ],
            [
                "I have had the pleasure of working with Sanchan at Yahoo in different components of the Mobile SDK. Sanchan is among the sharpest of the Product Managers I have worked with in my career. He has an exceptional ability to quickly grasp the complex issues; come up with creative solutions and articulate it very crisply. Sanchan is very focused and result oriented; and can always be counted upon to ‘make it happen’. He stamped his footprint (in a positive way) in almost every area he owned. Sanchan’s impact on Yahoo Mobile SDK was very huge and made a big difference to what the engineering team delivered. Sanchan is a tremendous asset to any organization and I recommend him very highly."
            ],
            [
                "Roberto Ortiz",
                "Design Leadership",
                "August 27, 2014, Sanchan S worked with Roberto in the same group",
                "Sanchan is the kind of person that any team would want to have on their corner. I've had the pleasure of working with Sanchan closely on key projects for mobile. Since I've met him I knew he was a sharp guy that not only understands product development, but goes beyond that to understand how products can align to meet user expectations while maximizing business objectives. His ability to balance user interests and business goals has always been very impressive.  Besides his genius in product development and monetization, he is also very entrepreneurial and isn't afraid to push the boundaries.If I wasn't clear, \"I fully recommend Sanchan.\" I'm hoping to work with him again in the future and look forward to following his continued success."
            ],
            [
                "Roberto Ortiz",
                "Design Leadership",
                "August 27, 2014, Sanchan S worked with Roberto in the same group"
            ],
            [
                "Roberto Ortiz",
                "Design Leadership",
                "August 27, 2014, Sanchan S worked with Roberto in the same group"
            ],
            [
                "Roberto Ortiz",
                "Design Leadership",
                "August 27, 2014, Sanchan S worked with Roberto in the same group"
            ],
            "Design Leadership",
            [
                "Sanchan is the kind of person that any team would want to have on their corner. I've had the pleasure of working with Sanchan closely on key projects for mobile. Since I've met him I knew he was a sharp guy that not only understands product development, but goes beyond that to understand how products can align to meet user expectations while maximizing business objectives. His ability to balance user interests and business goals has always been very impressive.  Besides his genius in product development and monetization, he is also very entrepreneurial and isn't afraid to push the boundaries.If I wasn't clear, \"I fully recommend Sanchan.\" I'm hoping to work with him again in the future and look forward to following his continued success."
            ],
            [
                "Sanchan is the kind of person that any team would want to have on their corner. I've had the pleasure of working with Sanchan closely on key projects for mobile. Since I've met him I knew he was a sharp guy that not only understands product development, but goes beyond that to understand how products can align to meet user expectations while maximizing business objectives. His ability to balance user interests and business goals has always been very impressive.  Besides his genius in product development and monetization, he is also very entrepreneurial and isn't afraid to push the boundaries.If I wasn't clear, \"I fully recommend Sanchan.\" I'm hoping to work with him again in the future and look forward to following his continued success."
            ],
            [
                "Jesse Chor",
                "Director, Software Development Engineering (Mobile) at Yahoo",
                "August 1, 2014, Sanchan S worked with Jesse in the same group",
                "Sanchan is a rock star.  He was instrumental in making the acquisition of my company a success for Yahoo and he is definitely a best in class PM to work with.  He has amazing insights, knowledge, and work ethics.  I really hope that I will have the opportunity to work with him again in the future."
            ],
            [
                "Jesse Chor",
                "Director, Software Development Engineering (Mobile) at Yahoo",
                "August 1, 2014, Sanchan S worked with Jesse in the same group"
            ],
            [
                "Jesse Chor",
                "Director, Software Development Engineering (Mobile) at Yahoo",
                "August 1, 2014, Sanchan S worked with Jesse in the same group"
            ],
            [
                "Jesse Chor",
                "Director, Software Development Engineering (Mobile) at Yahoo",
                "August 1, 2014, Sanchan S worked with Jesse in the same group"
            ],
            "Director, Software Development Engineering (Mobile) at Yahoo",
            [
                "Sanchan is a rock star.  He was instrumental in making the acquisition of my company a success for Yahoo and he is definitely a best in class PM to work with.  He has amazing insights, knowledge, and work ethics.  I really hope that I will have the opportunity to work with him again in the future."
            ],
            [
                "Sanchan is a rock star.  He was instrumental in making the acquisition of my company a success for Yahoo and he is definitely a best in class PM to work with.  He has amazing insights, knowledge, and work ethics.  I really hope that I will have the opportunity to work with him again in the future."
            ],
            [
                "Amy Kim",
                "Technical Program Manager at Lyft",
                "October 1, 2011, Sanchan S worked with Amy in the same group",
                "Sanchan is an exceptional PM, who not only was my colleague, but an unofficial mentor while working on the same team.One of his many strengths is his drive and vision; he is always enthusiastic in creating and improving features for any product he works on, which includes both creative thinking, as well as extensive research and insight into the current trends. In addition, his technical knowledge is vast, ranging from SQL Server to various mobile platforms and everything inbetween.I have truly enjoyed working with Sanchan and highly recommend him for any position requiring creativity, technical knowledge, drive and enthusiasm."
            ],
            [
                "Amy Kim",
                "Technical Program Manager at Lyft",
                "October 1, 2011, Sanchan S worked with Amy in the same group"
            ],
            [
                "Amy Kim",
                "Technical Program Manager at Lyft",
                "October 1, 2011, Sanchan S worked with Amy in the same group"
            ],
            [
                "Amy Kim",
                "Technical Program Manager at Lyft",
                "October 1, 2011, Sanchan S worked with Amy in the same group"
            ],
            "Technical Program Manager at Lyft",
            [
                "Sanchan is an exceptional PM, who not only was my colleague, but an unofficial mentor while working on the same team.One of his many strengths is his drive and vision; he is always enthusiastic in creating and improving features for any product he works on, which includes both creative thinking, as well as extensive research and insight into the current trends. In addition, his technical knowledge is vast, ranging from SQL Server to various mobile platforms and everything inbetween.I have truly enjoyed working with Sanchan and highly recommend him for any position requiring creativity, technical knowledge, drive and enthusiasm."
            ],
            [
                "Sanchan is an exceptional PM, who not only was my colleague, but an unofficial mentor while working on the same team.One of his many strengths is his drive and vision; he is always enthusiastic in creating and improving features for any product he works on, which includes both creative thinking, as well as extensive research and insight into the current trends. In addition, his technical knowledge is vast, ranging from SQL Server to various mobile platforms and everything inbetween.I have truly enjoyed working with Sanchan and highly recommend him for any position requiring creativity, technical knowledge, drive and enthusiasm."
            ],
            [
                "Samuel Cheung",
                "Program Manager at Google",
                "September 29, 2011, Sanchan S worked with Samuel in the same group",
                "Sanchan and I worked on shipping multiple releases of Hotmail together.Sanchan is a very creative forward thinking PM - his ability to anticipate future customer needs in a changing market landscape and effectively communicate his vision on how to address them was highly respected within the team. He is extremely passionate in what he believes in and is a brilliant evangelist. He has an infectious positive energy and a charismatic personality. He is always very logical in his reasoning and very articulate and persuasive in his communications. He is also very inclusive in his work style, adopts a win-win strategy and is very effective in shipping products that span multiple teams across a big organization like Microsoft. I hope that our paths cross again in the future."
            ],
            [
                "Samuel Cheung",
                "Program Manager at Google",
                "September 29, 2011, Sanchan S worked with Samuel in the same group"
            ],
            [
                "Samuel Cheung",
                "Program Manager at Google",
                "September 29, 2011, Sanchan S worked with Samuel in the same group"
            ],
            [
                "Samuel Cheung",
                "Program Manager at Google",
                "September 29, 2011, Sanchan S worked with Samuel in the same group"
            ],
            "Program Manager at Google",
            [
                "Sanchan and I worked on shipping multiple releases of Hotmail together.Sanchan is a very creative forward thinking PM - his ability to anticipate future customer needs in a changing market landscape and effectively communicate his vision on how to address them was highly respected within the team. He is extremely passionate in what he believes in and is a brilliant evangelist. He has an infectious positive energy and a charismatic personality. He is always very logical in his reasoning and very articulate and persuasive in his communications. He is also very inclusive in his work style, adopts a win-win strategy and is very effective in shipping products that span multiple teams across a big organization like Microsoft. I hope that our paths cross again in the future."
            ],
            [
                "Sanchan and I worked on shipping multiple releases of Hotmail together.Sanchan is a very creative forward thinking PM - his ability to anticipate future customer needs in a changing market landscape and effectively communicate his vision on how to address them was highly respected within the team. He is extremely passionate in what he believes in and is a brilliant evangelist. He has an infectious positive energy and a charismatic personality. He is always very logical in his reasoning and very articulate and persuasive in his communications. He is also very inclusive in his work style, adopts a win-win strategy and is very effective in shipping products that span multiple teams across a big organization like Microsoft. I hope that our paths cross again in the future."
            ],
            [
                "Melissa Lim",
                "Program Manager II at Microsoft France",
                "September 27, 2011, Melissa reported directly to Sanchan S",
                "Sanchan was my mentor during my summer internship at Microsoft. He is everything I could have asked for in a mentor- extremely knowledgeable about the PM role, supportive, charismatic, and passionate about his work. Aside from that, Sanchan is just a really fun person to be around. Every morning he'd have something interesting to show me about photography, the latest in technology, or a new product release from Microsoft. From just a few months as an intern, Sanchan helped me learn and grow a tremendous amount. He is definitely someone I aspire to be like as I continue in the PM role."
            ],
            [
                "Melissa Lim",
                "Program Manager II at Microsoft France",
                "September 27, 2011, Melissa reported directly to Sanchan S"
            ],
            [
                "Melissa Lim",
                "Program Manager II at Microsoft France",
                "September 27, 2011, Melissa reported directly to Sanchan S"
            ],
            [
                "Melissa Lim",
                "Program Manager II at Microsoft France",
                "September 27, 2011, Melissa reported directly to Sanchan S"
            ],
            "Program Manager II at Microsoft France",
            [
                "Sanchan was my mentor during my summer internship at Microsoft. He is everything I could have asked for in a mentor- extremely knowledgeable about the PM role, supportive, charismatic, and passionate about his work. Aside from that, Sanchan is just a really fun person to be around. Every morning he'd have something interesting to show me about photography, the latest in technology, or a new product release from Microsoft. From just a few months as an intern, Sanchan helped me learn and grow a tremendous amount. He is definitely someone I aspire to be like as I continue in the PM role."
            ],
            [
                "Sanchan was my mentor during my summer internship at Microsoft. He is everything I could have asked for in a mentor- extremely knowledgeable about the PM role, supportive, charismatic, and passionate about his work. Aside from that, Sanchan is just a really fun person to be around. Every morning he'd have something interesting to show me about photography, the latest in technology, or a new product release from Microsoft. From just a few months as an intern, Sanchan helped me learn and grow a tremendous amount. He is definitely someone I aspire to be like as I continue in the PM role."
            ],
            [
                "Matt Papes",
                "Escalation Manager at Microsoft",
                "July 26, 2011, Matt managed Sanchan S directly",
                "Sanchan is a high-energy visionary with a unique set of skills that include technical, program management, and business acumen that will surely lead him to an executive position. He was a trusted advisor when he was on my team several years ago and I continue to value his advice and ideas. If I was building a business from scratch, he would be one of the first people I would recruit to my team. His charisma is contagious, and his passion for technology and business results make him an invaluable employee. I was fortunate to manage him for awhile, but I would be the first to say I would go to work for him on any team he was leading or a part of. He's that good."
            ],
            [
                "Matt Papes",
                "Escalation Manager at Microsoft",
                "July 26, 2011, Matt managed Sanchan S directly"
            ],
            [
                "Matt Papes",
                "Escalation Manager at Microsoft",
                "July 26, 2011, Matt managed Sanchan S directly"
            ],
            [
                "Matt Papes",
                "Escalation Manager at Microsoft",
                "July 26, 2011, Matt managed Sanchan S directly"
            ],
            "Escalation Manager at Microsoft",
            [
                "Sanchan is a high-energy visionary with a unique set of skills that include technical, program management, and business acumen that will surely lead him to an executive position. He was a trusted advisor when he was on my team several years ago and I continue to value his advice and ideas. If I was building a business from scratch, he would be one of the first people I would recruit to my team. His charisma is contagious, and his passion for technology and business results make him an invaluable employee. I was fortunate to manage him for awhile, but I would be the first to say I would go to work for him on any team he was leading or a part of. He's that good."
            ],
            [
                "Sanchan is a high-energy visionary with a unique set of skills that include technical, program management, and business acumen that will surely lead him to an executive position. He was a trusted advisor when he was on my team several years ago and I continue to value his advice and ideas. If I was building a business from scratch, he would be one of the first people I would recruit to my team. His charisma is contagious, and his passion for technology and business results make him an invaluable employee. I was fortunate to manage him for awhile, but I would be the first to say I would go to work for him on any team he was leading or a part of. He's that good."
            ],
            [
                "Jesse Chor",
                "Director, Software Development Engineering (Mobile) at Yahoo",
                "January 6, 2015, Jesse worked with Sanchan S in the same group",
                "Jesse and I work together at Yahoo - he was my counterpart on engineering where we built the foundation of Yahoo's mobile ad tech. I was involved in identification, due diligence and post acquisition integration of Jesse startup into Yahoo's overall vision and technology space. Since the day I met him, I was amazed at Jesse's unique traits and abilities - a super compelling vision of the mobile ad tech space (years ahead of what others in the industry were talking about), an entrepreneurial grit to push through obstacles and the technical chops to make that vision a reality. He is very well respected by his team and his peers - and is a super networker/recruiter. His rolodex helped us expand the team very quickly and deliver on ambitious goals. I hope that our paths cross again in the future - and I wish him great success in his endeavors."
            ],
            [
                "Jesse Chor",
                "Director, Software Development Engineering (Mobile) at Yahoo",
                "January 6, 2015, Jesse worked with Sanchan S in the same group"
            ],
            [
                "Jesse Chor",
                "Director, Software Development Engineering (Mobile) at Yahoo",
                "January 6, 2015, Jesse worked with Sanchan S in the same group"
            ],
            [
                "Jesse Chor",
                "Director, Software Development Engineering (Mobile) at Yahoo",
                "January 6, 2015, Jesse worked with Sanchan S in the same group"
            ],
            "Director, Software Development Engineering (Mobile) at Yahoo",
            [
                "Jesse and I work together at Yahoo - he was my counterpart on engineering where we built the foundation of Yahoo's mobile ad tech. I was involved in identification, due diligence and post acquisition integration of Jesse startup into Yahoo's overall vision and technology space. Since the day I met him, I was amazed at Jesse's unique traits and abilities - a super compelling vision of the mobile ad tech space (years ahead of what others in the industry were talking about), an entrepreneurial grit to push through obstacles and the technical chops to make that vision a reality. He is very well respected by his team and his peers - and is a super networker/recruiter. His rolodex helped us expand the team very quickly and deliver on ambitious goals. I hope that our paths cross again in the future - and I wish him great success in his endeavors."
            ],
            [
                "Jesse and I work together at Yahoo - he was my counterpart on engineering where we built the foundation of Yahoo's mobile ad tech. I was involved in identification, due diligence and post acquisition integration of Jesse startup into Yahoo's overall vision and technology space. Since the day I met him, I was amazed at Jesse's unique traits and abilities - a super compelling vision of the mobile ad tech space (years ahead of what others in the industry were talking about), an entrepreneurial grit to push through obstacles and the technical chops to make that vision a reality. He is very well respected by his team and his peers - and is a super networker/recruiter. His rolodex helped us expand the team very quickly and deliver on ambitious goals. I hope that our paths cross again in the future - and I wish him great success in his endeavors."
            ],
            [
                "Drew Geishecker",
                "Sr. Director of Product Management at Yahoo!",
                "September 5, 2013, Sanchan S reported directly to Drew",
                "Drew exemplifies \"leadership by action\" rather than \"by title\".  He is a true team leader who motivates his team and his peers to constantly think outside the box and deliver outstanding business results. Over the years, he has tackled several big business challenges for the company and has shipped several innovative products that span the breadth of the company and deliver a \"OneYahoo\" experience for our users. Drew is very passionate about what he does.  One of the things that Drew epitomizes is a learning mindset. He is constantly on the lookout for new things to learn and improve on. He is very data driven (rather than opinion driven). He creates a culture where everybody on the team can voice their own ideas and challenge existing ideas. Everybody loves to work with and for him. I hope our paths cross again sometime in the near future."
            ],
            [
                "Drew Geishecker",
                "Sr. Director of Product Management at Yahoo!",
                "September 5, 2013, Sanchan S reported directly to Drew"
            ],
            [
                "Drew Geishecker",
                "Sr. Director of Product Management at Yahoo!",
                "September 5, 2013, Sanchan S reported directly to Drew"
            ],
            [
                "Drew Geishecker",
                "Sr. Director of Product Management at Yahoo!",
                "September 5, 2013, Sanchan S reported directly to Drew"
            ],
            "Sr. Director of Product Management at Yahoo!",
            [
                "Drew exemplifies \"leadership by action\" rather than \"by title\".  He is a true team leader who motivates his team and his peers to constantly think outside the box and deliver outstanding business results. Over the years, he has tackled several big business challenges for the company and has shipped several innovative products that span the breadth of the company and deliver a \"OneYahoo\" experience for our users. Drew is very passionate about what he does.  One of the things that Drew epitomizes is a learning mindset. He is constantly on the lookout for new things to learn and improve on. He is very data driven (rather than opinion driven). He creates a culture where everybody on the team can voice their own ideas and challenge existing ideas. Everybody loves to work with and for him. I hope our paths cross again sometime in the near future."
            ],
            [
                "Drew exemplifies \"leadership by action\" rather than \"by title\".  He is a true team leader who motivates his team and his peers to constantly think outside the box and deliver outstanding business results. Over the years, he has tackled several big business challenges for the company and has shipped several innovative products that span the breadth of the company and deliver a \"OneYahoo\" experience for our users. Drew is very passionate about what he does.  One of the things that Drew epitomizes is a learning mindset. He is constantly on the lookout for new things to learn and improve on. He is very data driven (rather than opinion driven). He creates a culture where everybody on the team can voice their own ideas and challenge existing ideas. Everybody loves to work with and for him. I hope our paths cross again sometime in the near future."
            ]
        ],
        "skills": [],
        "summary": "    I am passionate about bringing ideas to life and building innovative products. I am obsessed with user focused design and strongly believe that \"easier is better than better\". I enjoy prototyping new ideas and securing funding to turn them into strategic products for the company - have successfully taken ideas to v1 launches within multi-national corporations. I have a proven track record of taking startups from ideation to funding to launch. Leading and motivating teams to produce extraordinary results - that's my forte. Everyone gives in their 100% but the key to success is to have them give that 1% more.I am passionate about product management and everything tech. If you have questions on product management, I have opinions to share. I am active on several forums - follow me:- Twitter - https://twitter.com/sanchans- Quora - http://www.quora.com/Sanchan-Saxena- Slideshare - http://www.slideshare.net/sanchan_saxena\n  \n  \n",
        "name": "Sanchan S Saxena",
        "title": "Manager, Product Management - Shopping on Instagram",
        "url": "linkedin.com/in/sanchans",
        "phone": "408-759-2989 (Mobile)",
        "email": "sanchan_saxena@hotmail.com"
    }
]