[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "125 Mutual Connections",
                "You and Ryan David both know Eric Keosky-Smith, Mike Hawksworth, and 123 others"
            ],
            [
                "You both worked at Northern Arizona University",
                "Ryan David worked at Northern Arizona University after you started"
            ],
            [
                "Do you love data and public service?? My team is hiring an Economic Development Analyst! Gilbert, Arizona is an exciting place to work right now and I must say my team is super awesome :) bit.ly/2j5Mez0",
                "Ryan David commented"
            ],
            [
                "REMINDER:  2017 CSA & AMC Annual Meeting in Rocky Point, Sonora",
                "Ryan David liked"
            ],
            [
                "Cool shot! Thanks Yuko! I was on the big screen at the Phoenix Suns! Thank you to my Abaka Foundation kids for letting me ride on your coattails. 😉 thanks to the Arizona Asian Chamber of Commerce for putting us on.",
                "#abakafoundation #phoenixsuns #filipino",
                "Ryan David liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Corridor Economic Development Consultant",
                "Company Name",
                "Local First Arizona",
                "Dates Employed",
                "Sep 2016 – Present",
                "Employment Duration",
                "1 yr 3 mos",
                "Location",
                "Phoenix, Arizona Area",
                "•\tSmall Business Technical Assistance & Branding•\tLocal Organization Support and building - Camelback Business Coalition•\tTargeted Support for Immigrant, Refugee & Micro Enterprises within half mile of transit•\tCorridor Clean Up Efforts - Visibility Improvements•\tSupport Local First - LISC - IRC objectives for small business and economic Development"
            ],
            [
                "Adjunct Professor",
                "Company Name",
                "Northern Arizona University",
                "Dates Employed",
                "Sep 2016 – Present",
                "Employment Duration",
                "1 yr 3 mos",
                "Adjunct Professor | Administration DepartmentI teach ADM-510 Small Business Finance and Economics. I develop and manage syllabus materials. I am responsible for lesson plans, selecting and compiling tests, assignments, online discussion exercises and other online material that help facilitate student instruction. I am responsible for teaching the assigned class in accordance with learning objectives.2016 | Fall Semester•\tADM-510 Small Business Financing & Economics\t2017 | Spring Semester•\tADM-510 Small Business Financing & Economics"
            ],
            [
                "Councilmember | District 3",
                "Company Name",
                "City of Mesa",
                "Dates Employed",
                "May 2016 – Aug 2017",
                "Employment Duration",
                "1 yr 4 mos",
                "Location",
                "Mesa, Arizona",
                "Mesa operates under a charter form of government with citizens electing a mayor and six councilmembers to set policy for the City. Mesa's councilmembers serve terms of four-years, with three members being elected every two years. The council is elected on a nonpartisan basis. As a member of the Mesa City Council, I believe that its people, not leaders, are what make a city great. I actively work to encourage citizen participation in the decision-making process. Whether it is through neighborhood meetings, advisory boards and committees, telephone calls and letters, email programs, or informational forums, the other members and I on the Mesa City Council set policies based on the input and needs of its citizens.Accomplishments:•\tRepresent District 3 (includes Fiesta District, Little Mekong Asian Business District and the surrounding residential neighborhoods)•\tSupervisor of the City Manager, City Auditor, City Attorney, City Clerk and Chief Magistrate •\tDirect the city’s policies and future priorities•\tSet the City of Mesa’s budget and oversee the expense of it•\tLobby and monitor legislation, engage in constituency services •\tDeveloped cohesive, cooperative working relationships within the community•\tFinding sponsorships for community events and fundraising for various boards http://www.mesaaz.gov/city-hall/mayor-council/councilmember-ryan-winkle"
            ],
            [
                "Community Economic Development Consultant",
                "Company Name",
                "Honorhealth Desert Mission Neighborhood Renewal",
                "Dates Employed",
                "Jun 2015 – Oct 2016",
                "Employment Duration",
                "1 yr 5 mos",
                "Location",
                "Sunnyslope, Arizona",
                "•\tInterface with small businesses community, community stakeholders, sunnyslope village alliance, city departments and councilmember regarding an annual community economic development summit and related working groups.•\tEngaged roughly 250 businesses in a survey regarding current conditions for small businesses in Sunnyslope ending in three community driven work groups.•\tContinually engage Sunnyslope businesses and stakeholders to further the goals of working groups, facilitate meetings with leadership and monitor accountability with community-based results in mind.•\tSeek out new opportunities for business and property owners to enrich the neighborhoods of sunnyslope •\tSupport DMNR approved objectives"
            ],
            [
                "Corridor Economic Development Consultant",
                "Company Name",
                "Neighborhood Economic Development Corporation",
                "Dates Employed",
                "Nov 2012 – Aug 2015",
                "Employment Duration",
                "2 yrs 10 mos",
                "Location",
                "Mesa, Arizona",
                "•\tDevelopment, management and implementation of programs that identify and address economic, technological and social needs of existing businesses on the light rail corridor. •\tBuild lasting relationships with neighborhood groups in Mesa, Tempe and Phoenix to further the reach of our Technical Assistance in LMI areas and expand access to capitol.•\tDevelop leadership along Mesa corridor through art driven, placemaking activities.  •\tDevelop a working model that supports local community engagement initiatives such as community action plans, program organization and generate support lines with key collaborators and leadership development.•\tWork directly and efficiently with city council members, community reinvestment officers, technology experts, marketing managers, executive directors, chairmen of non-profit organizations and implementation directors.•\tBuild relationships with local community groups (including schools, the Chamber of Commerce, local chapters of charitable organizations, small businesses, funders, neighborhood & community groups etc.) •\tConsolidated and reported on participation and overall efficacy of community outreach initiatives.•\tKeep current on funding opportunities and construct and submit applications. (CDBG, CRA, misc grant opportunities)•\tEngage, educate and empower potential and existing collaborators with passion and commitmentSpecific projects: Google Inside View, #finditinmesa, finditinmesa.com, partnership with Localfirstaz.com, R.A.I.L.mesa Community Organization -(Retail, Arts, Innovation, Livability), www.RAILmesa.org, City of Mesa General Plan 2040 Community Engagement, City of Mesa 2015-2019 Consolidated Plan Community Engagement, City of Tempe 2015-2019 Consolidate Plan Community Engagement, \"Investing in What Works\" Community Workshop Series. NEDCO Phoenix Loan & TA expansion, NEDCO Light Rail Business Assistance Program, NEDCO corridor capacity building."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Wilkes University",
                "Degree Name",
                "Master of Business Administration (MBA)",
                "Field Of Study",
                "currently enrolled",
                "Dates attended or expected graduation",
                "2014 – 2016",
                "Business Management and Administration"
            ],
            [
                "Wilkes University",
                "Degree Name",
                "Master of Business Administration (MBA)",
                "Field Of Study",
                "currently enrolled",
                "Dates attended or expected graduation",
                "2014 – 2016",
                "Business Management and Administration"
            ],
            [
                "University of New Hampshire",
                "Degree Name",
                "Certificate in Community Development Finance",
                "Field Of Study",
                "Non-Profit/Public/Organizational Management",
                "Dates attended or expected graduation",
                "2014 – 2014",
                "Certificate in Community Development Finance and Non-Profit Management"
            ],
            [
                "University of New Hampshire",
                "Degree Name",
                "Certificate in Community Development Finance",
                "Field Of Study",
                "Non-Profit/Public/Organizational Management",
                "Dates attended or expected graduation",
                "2014 – 2014",
                "Certificate in Community Development Finance and Non-Profit Management"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor of Science (B.S.)",
                "Field Of Study",
                "Urban Planning",
                "Dates attended or expected graduation",
                "2009 – 2012"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor of Science (B.S.)",
                "Field Of Study",
                "Urban Planning",
                "Dates attended or expected graduation",
                "2009 – 2012"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor of Arts (B.A.)",
                "Field Of Study",
                "Sustainability Studies",
                "Dates attended or expected graduation",
                "2009 – 2012"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor of Arts (B.A.)",
                "Field Of Study",
                "Sustainability Studies",
                "Dates attended or expected graduation",
                "2009 – 2012"
            ],
            [
                "Mesa Community College",
                "Degree Name",
                "Associate of Arts (A.A.)",
                "Field Of Study",
                "Political Science and Government",
                "Dates attended or expected graduation",
                "2008 – 2010"
            ],
            [
                "Mesa Community College",
                "Degree Name",
                "Associate of Arts (A.A.)",
                "Field Of Study",
                "Political Science and Government",
                "Dates attended or expected graduation",
                "2008 – 2010"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer",
                "Company Name",
                "Habitat for Humanity Central Arizona",
                "Dates volunteered",
                "Aug 2010 – Aug 2011",
                "Volunteer duration",
                "1 yr 1 mo",
                "Cause",
                "Poverty Alleviation",
                "Over 500+ volunteer service hours logged."
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 35 more skills"
            ],
            "Recommendations",
            [
                "Arizona-Mexico Commission",
                "854 followers"
            ],
            [
                "APMG International",
                "11,053 followers"
            ],
            [
                "Experience Matters Arizona",
                "157 followers"
            ],
            [
                "Global Supply Chain Council (GSCC)",
                "27,057 members"
            ],
            [
                "Jim KimJim Kim is a LinkedIn Influencer",
                "President at The World Bank",
                "1,778,386 followers"
            ],
            [
                "OnSiteOffice",
                "14 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Arizona-Mexico Commission",
                "854 followers"
            ],
            [
                "Arizona-Mexico Commission",
                "854 followers"
            ],
            [
                "APMG International",
                "11,053 followers"
            ],
            [
                "APMG International",
                "11,053 followers"
            ],
            [
                "Experience Matters Arizona",
                "157 followers"
            ],
            [
                "Experience Matters Arizona",
                "157 followers"
            ],
            [
                "Global Supply Chain Council (GSCC)",
                "27,057 members"
            ],
            [
                "Global Supply Chain Council (GSCC)",
                "27,057 members"
            ],
            [
                "Jim KimJim Kim is a LinkedIn Influencer",
                "President at The World Bank",
                "1,778,386 followers"
            ],
            [
                "Jim KimJim Kim is a LinkedIn Influencer",
                "President at The World Bank",
                "1,778,386 followers"
            ],
            [
                "Jim Kim is a LinkedIn Influencer"
            ],
            [
                "OnSiteOffice",
                "14 followers"
            ],
            [
                "OnSiteOffice",
                "14 followers"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Leadership",
                "See 134 endorsements for Leadership",
                "99+",
                "Leadership",
                "Endorse",
                "Endorsed by Stephen Viramontes and 6 others who are highly skilled at this",
                "Endorsed by Jennifer Cole and 1 other mutual connection"
            ],
            [
                "Leadership",
                "See 134 endorsements for Leadership",
                "99+"
            ],
            [
                "Nonprofits",
                "See 97 endorsements for Nonprofits",
                "97",
                "Nonprofits",
                "Endorse",
                "Endorsed by Joel Bookman and 3 others who are highly skilled at this",
                "Endorsed by Jennifer Cole and 1 other mutual connection"
            ],
            [
                "Nonprofits",
                "See 97 endorsements for Nonprofits",
                "97"
            ],
            [
                "Community Development",
                "See 93 endorsements for Community Development",
                "93",
                "Community Development",
                "Endorse",
                "Endorsed by Joel Bookman and 4 others who are highly skilled at this",
                "Endorsed by Jennifer Cole (mutual connection)"
            ],
            [
                "Community Development",
                "See 93 endorsements for Community Development",
                "93"
            ]
        ],
        "summary": "    Throughout my career in community economic development & project management I have been able to implement projects efficiently. I am a natural leader. I am analytical, insightful, a highly-disciplined problem solver with a demonstrated ability to identify with involved parties and create an outcome that everyone can support. Because I excel at building mutually respectful relationships, I have developed and sustained exceptional industry contacts and networks and have earned the respect of a wide variety of constituents. Attention to detail, inspiring team accomplishment, and delivering quality, on-time project execution is what I am good at. •\tSuccessful track record in community outreach efforts focused on developing community, economic and neighbor-hood revitalization programs.•\tExpert in working with diverse communities; including working with local businesses, partner organizations and community leaders to support and develop participation in community resources, programs and activities.•\tExcellent ability to identify and steward philanthropic opportunities that support community and neighborhood revitalization efforts.•\tExcellent verbal and written communication skills; ability to write grants, present and discuss information in a way that establishes rapport, persuades others, and gains understanding and facilitates positive discourse leading to outcomes. •\tOver 10 years experience in relationship management at all levels ranging from executives to staff, exercising teamwork in a matrixed work environment. •\tOver 5 years experience in community organizing, area revitalization, comprehensive community development, neighborhood stabilization with knowledge of federal funding programs.•\tOver 5 year experience in supervising professional level staff.•\tProfessionally skilled in organizing, planning and executing small to large-scale programs and projects through implementation life cycle involving internal personnel, contractors and clients.\n  \n  \n",
        "name": "Ryan David Winkle",
        "title": "Corridor Economic Development Consultant",
        "url": "linkedin.com/in/ryan-david-winkle-28b33968",
        "phone": "",
        "email": "ryan.d.winkle@gmail.com"
    }
]