[
    {
        "experience": [
            "Highlights",
            [
                "28 Mutual Connections",
                "You and Joshua both know Fred Yu, Gelie Akhenblit, and 26 others"
            ],
            [
                "You both work in the same area",
                "You and Joshua both currently work in Scottsdale, Arizona"
            ],
            [
                "Stuart Scott had an inspiring career in television before cancer took his life. This speech is one of the most famous in US history. He teaches the following:",
                "- What it means to have a fighting spirit",
                "- You can't do it by yourself",
                "- Don't ever give up",
                "Just like Stuarts battle with cancer, you can't be successful in business alone. Stuart show's us that just like in life, it's how you do business and why you do business that matters.",
                "Don't lose the battle. Remember what matters.",
                "Joshua liked"
            ],
            [
                "Best resume that I've ever seen.",
                "Call me crazy but I'm a sucker for a straight shooter.",
                "Hired on the spot!",
                "Twitter: Hervbird21",
                "Joshua liked"
            ],
            [
                "Virtual Interview Day",
                "Joshua liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "IT Technical Recruiter",
                "Company Name",
                "The Judge Group",
                "Dates Employed",
                "Aug 2015 – Present",
                "Employment Duration",
                "2 yrs 3 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Make 60+ outbound calls a day to potential candidatesResponsible for applicant tracking/candidate sourcing (placing employment ads, attending job fairs, networking events)Utilize creative sourcing for hard-to-fill positionsIdentify and use unique sources for locating potential candidates, such as specific job boards (free and paid), LinkedIn networking groups and referralsDetailed resume analysis and screening of applicationsGenerate and distribute reports on recruiting activity and status reports as requested"
            ],
            [
                "Senior Travel Nursing Recruiter",
                "Company Name",
                "Concentric Healthcare Staffing",
                "Dates Employed",
                "Oct 2013 – Aug 2015",
                "Employment Duration",
                "1 yr 11 mos",
                "Location",
                "Scottsdale, AZ",
                "Make 60+ outbound calls a day to potential candidatesResponsible for applicant tracking/candidate sourcing (placing employment ads, attending job fairs, networking events)Utilize creative sourcing for hard-to-fill positionsIdentify and use unique sources for locating potential candidates, such as specific job boards (free and paid), LinkedIn networking groups and referralsDetailed resume analysis and screening of applicationsGenerate and distribute reports on recruiting activity and status reports as requested"
            ],
            [
                "Contract Corporate Recruiter",
                "Company Name",
                "Northcentral University",
                "Dates Employed",
                "Sep 2013 – Oct 2013",
                "Employment Duration",
                "2 mos",
                "Location",
                "Scottsdale",
                "•Partners with hiring managers, senior leadership and Human Resources Business Partners to establish sourcing and recruiting strategies to create and foster strong active and passive candidate pipelines.•Develops an external network of vendors and talent sources that facilitates the development of a passive candidate pool, with focus on diversity and long term talent needs.•Provide periodic business metrics and reporting to communicate staffing efficiency and effectiveness to senior leadership.•Conducts actual recruiting for openings in all areas of the organization to include: Operations, IT, Finance and executive leadership roles.•Develops a sourcing strategy for these openings with the hiring manager, identifies candidates and presents a diverse candidate pool.•Understand market conditions for targeted sources and prepare distinct and effective recruiting approaches to those markets.•Develop an effective diversity recruiting plan.•Responsible for ensuring that the execution of the talent acquisition strategy follows legal and regulatory guidelines.•Partners with other HR team members on talent acquisition tasks, projects, and other HR priorities•Behavioral interviewing certification/experience a plus.•Demonstrated ability to define process gaps and make recommendations for improvement.•Pre-employment assessments experience a plus.•Demonstrated ability to influence, communicate and build relationships at all levels and to link business objectives with Talent Acquisition Strategy. •Must be extremely detail oriented.•Effective time management skills a must.•Ability to effectively multi-task.•Strong interpersonal skills and problem solving ability; capable and experienced user of data to drive decisions and influence stakeholders.•Proficiency in Microsoft Office Suite to include Word, Excel, PowerPoint and Outlook.•Demonstrated applicant tracking system (ATS) knowledge; MyStaffingPro preferred."
            ],
            [
                "Contract Corporate Recruiter",
                "Company Name",
                "WageWorks",
                "Dates Employed",
                "Jul 2013 – Aug 2013",
                "Employment Duration",
                "2 mos",
                "Primary Responsibilities:1.  Performs searches for qualified candidates according to relevant job criteria using computer databases, networking, Internet recruiting resources, cold calls, media, recruiting firms, employee referrals and job fairs. This includes contacting applicants to inform them of employment possibilities, consideration and selection. Incumbents may also relay information about the job, facilities, operations, benefits and related information. 2.  Reviews applications and resumes and performs routine reference checks and pre-employment activities. Forwards applicable resumes to hiring managers. May conduct reference and background checks on applicants. May also facilitate candidate drug screens and background investigations following Company standard operating procedures. 3.  Develops a flow of applicants for clerical, professional and managerial positions by placing advertisements in appropriate newspapers, online job boards, trade journals and other publications. Interacts with and manages relationships with search firms and employment agencies. Establishes relationships with hiring managers to stay abreast of current and future hiring and business needs. 4.  Interviews applicants for open clerical, professional and managerial level positions to obtain information on work history, training, education and preparation for job. 5.  Maintains applicant files, appropriate records and statistics. Generates and distributes reports on recruiting activity and status reports as requested. 6.  May provide support to hiring managers by scheduling and coordinating interviews, distributing interviewing schedules, and ensuring that all parties have the appropriate information. 7.  Maintains current knowledge of Equal Employment Opportunity (EEO) and affirmative action guidelines and laws, such as the Americans with Disabilities Act by attending training, reading trade periodicals, etc"
            ],
            [
                "Human Resources Recruiter",
                "Company Name",
                "TCH - The Centers for Habilitation",
                "Dates Employed",
                "Sep 2012 – Jun 2013",
                "Employment Duration",
                "10 mos",
                "Location",
                "Tempe AZ",
                "Primary Responsibilities:1. Initiates recruitment activities for TCH positions which may include applicant tracking, screening of applications, writes and reviews interview questions, mailings, internal and external ads, interviewing, reference checks, hiring recommendations, making job offers, and conducting New Employee Orientation (NEO) while ensuring compliance with all equal employment opportunity laws and TCH Affirmative Action Plan.2. Manages TCH advertising for open positions by creating and writing ads.  Represents TCH in advertising contracts with vendors.  Determines when and where to advertise in newspapers, on the internet and at various other locations, as appropriate.3. Attends job fairs and networking activities. Represents TCH at job opportunities in various community settings on an as-needed basis.  Continuously establishes effective recruiting sources, analyzes recruiting source effectiveness and makes recommendations.  4. Educates supervisors and managers on interviewing skills and ensures integrity of the recruitment and selection process.5. Continuously creates and maintains position requisitions within the Cyber Recruiter applicant database.  Tracks transfers, promotions and new hires within the applicant database.  Assists applicants and employees with the online application process as needed.6. Monitor and maintain I-9 recordkeeping and Social Security verifications through E-Verify in cooperation with the INS/DHS, which includes tracking, notification, follow up and distribution of expiring employment authorization documents.7. Collaborates with management to implement a recruitment/retention plan.  Initiates tracking and maintains data to determine the success of various projects relating to recruitment and retention ideas.8. Works with departments to ensure company-wide employment law compliance including Title VII of the Civil Rights Act, ADA, HIPPA, FLSA, FMLA and ADEA."
            ],
            [
                "Personnel Tech II",
                "Company Name",
                "The State of Arizona",
                "Dates Employed",
                "Apr 2012 – Aug 2012",
                "Employment Duration",
                "5 mos",
                "Location",
                "Phoenix, Arizona Area",
                "• Provide professional human resources services to state agencies, boards and commissions, human resources professionals, management and employees• Provided information regarding: federal and state employment laws, personnel rules, statewide HR policies, procedures relating to employment/staffing, classification and compensation, employee relations, discipline, training, grievances, reorganizations, reductions-in-force and agency policies."
            ],
            [
                "Human Resources Intern",
                "Company Name",
                "Arizona Department of Administration",
                "Dates Employed",
                "Jan 2012 – Apr 2012",
                "Employment Duration",
                "4 mos",
                "Interview candidates and make recommendations for selection for State-wide Intern program for undergraduate and graduate level students.  Check references for executive-level positions such as agency and deputy directors.  Attend and participate in Human Resources training, Update portions of the Human Resources website and post updates on social media sites for the State. Post jobs on external websites for recruiting purposes."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "DeVry University's Keller Graduate School of Management-Arizona",
                "Degree Name",
                "MBA",
                "Field Of Study",
                "Human Resources",
                "Dates attended or expected graduation",
                "2010 – 2012",
                "Graduate courses towards earning an MBA with an emphasis in Human Resources"
            ],
            [
                "DeVry University's Keller Graduate School of Management-Arizona",
                "Degree Name",
                "MBA",
                "Field Of Study",
                "Human Resources",
                "Dates attended or expected graduation",
                "2010 – 2012",
                "Graduate courses towards earning an MBA with an emphasis in Human Resources"
            ],
            [
                "Cuny College of Staten Island",
                "Degree Name",
                "B.A",
                "Field Of Study",
                "Liberal Arts",
                "Dates attended or expected graduation",
                "2001 – 2006"
            ],
            [
                "Cuny College of Staten Island",
                "Degree Name",
                "B.A",
                "Field Of Study",
                "Liberal Arts",
                "Dates attended or expected graduation",
                "2001 – 2006"
            ],
            "Recommendations",
            [
                "Scottsdale Networking Professionals",
                "11 members"
            ],
            [
                "C# Developers / Architects",
                "217,554 members"
            ],
            [
                "Arizona Occupational Therapy Association",
                "161 members"
            ],
            [
                "PMI Phoenix Chapter",
                "1,703 followers"
            ],
            [
                "Traveling RN Jobs",
                "16,663 members"
            ],
            [
                "AORN: The official member-led discussion group of AORN",
                "16,894 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Scottsdale Networking Professionals",
                "11 members"
            ],
            [
                "Scottsdale Networking Professionals",
                "11 members"
            ],
            [
                "C# Developers / Architects",
                "217,554 members"
            ],
            [
                "C# Developers / Architects",
                "217,554 members"
            ],
            [
                "Arizona Occupational Therapy Association",
                "161 members"
            ],
            [
                "Arizona Occupational Therapy Association",
                "161 members"
            ],
            [
                "PMI Phoenix Chapter",
                "1,703 followers"
            ],
            [
                "PMI Phoenix Chapter",
                "1,703 followers"
            ],
            [
                "Traveling RN Jobs",
                "16,663 members"
            ],
            [
                "Traveling RN Jobs",
                "16,663 members"
            ],
            [
                "AORN: The official member-led discussion group of AORN",
                "16,894 members"
            ],
            [
                "AORN: The official member-led discussion group of AORN",
                "16,894 members"
            ]
        ],
        "recommendations": [
            [
                "Julie Jones",
                "Experienced & Skilled  Recruiter - Recruiting top talent to give our clients top results!",
                "February 8, 2016, Julie was senior to Joshua but didn’t manage directly",
                "When I worked with Joshua in the Travel Nursing Division, I watch him hit the ground running. Joshua took the time to learn the steps he needed to better himself as a recruiter. He became a strong and then moved into the Senior Recruiter role and in turn was able to help lead and develop other recruiters to thrive as well. I feel Joshua was successful at this role and will continue to be successful at anything he puts his mind too. I am excited to see where his future takes him."
            ],
            [
                "Julie Jones",
                "Experienced & Skilled  Recruiter - Recruiting top talent to give our clients top results!",
                "February 8, 2016, Julie was senior to Joshua but didn’t manage directly"
            ],
            [
                "Julie Jones",
                "Experienced & Skilled  Recruiter - Recruiting top talent to give our clients top results!",
                "February 8, 2016, Julie was senior to Joshua but didn’t manage directly"
            ],
            [
                "Julie Jones",
                "Experienced & Skilled  Recruiter - Recruiting top talent to give our clients top results!",
                "February 8, 2016, Julie was senior to Joshua but didn’t manage directly"
            ],
            "Experienced & Skilled  Recruiter - Recruiting top talent to give our clients top results!",
            [
                "When I worked with Joshua in the Travel Nursing Division, I watch him hit the ground running. Joshua took the time to learn the steps he needed to better himself as a recruiter. He became a strong and then moved into the Senior Recruiter role and in turn was able to help lead and develop other recruiters to thrive as well. I feel Joshua was successful at this role and will continue to be successful at anything he puts his mind too. I am excited to see where his future takes him."
            ],
            [
                "When I worked with Joshua in the Travel Nursing Division, I watch him hit the ground running. Joshua took the time to learn the steps he needed to better himself as a recruiter. He became a strong and then moved into the Senior Recruiter role and in turn was able to help lead and develop other recruiters to thrive as well. I feel Joshua was successful at this role and will continue to be successful at anything he puts his mind too. I am excited to see where his future takes him."
            ],
            [
                "Susan Laurence, SPHR",
                "Human Resources Recruiter",
                "January 6, 2012, Susan managed Joshua directly",
                "I have the distinct pleasure to support Josh as he serves the State of Arizona as a Human Resources Intern.  Josh is extremely bright and enthusiastic with a focus on getting the job done and excellence in customer service!!  Josh is very talented when it comes to managing multiple priorities as he is pursuing his MBA, working at the UPS Store in addition to serving State Government.  I highly recommend Josh for a Human Resources position where his talents and winning personality can contribute to business objectives!!"
            ],
            [
                "Susan Laurence, SPHR",
                "Human Resources Recruiter",
                "January 6, 2012, Susan managed Joshua directly"
            ],
            [
                "Susan Laurence, SPHR",
                "Human Resources Recruiter",
                "January 6, 2012, Susan managed Joshua directly"
            ],
            [
                "Susan Laurence, SPHR",
                "Human Resources Recruiter",
                "January 6, 2012, Susan managed Joshua directly"
            ],
            "Human Resources Recruiter",
            [
                "I have the distinct pleasure to support Josh as he serves the State of Arizona as a Human Resources Intern.  Josh is extremely bright and enthusiastic with a focus on getting the job done and excellence in customer service!!  Josh is very talented when it comes to managing multiple priorities as he is pursuing his MBA, working at the UPS Store in addition to serving State Government.  I highly recommend Josh for a Human Resources position where his talents and winning personality can contribute to business objectives!!"
            ],
            [
                "I have the distinct pleasure to support Josh as he serves the State of Arizona as a Human Resources Intern.  Josh is extremely bright and enthusiastic with a focus on getting the job done and excellence in customer service!!  Josh is very talented when it comes to managing multiple priorities as he is pursuing his MBA, working at the UPS Store in addition to serving State Government.  I highly recommend Josh for a Human Resources position where his talents and winning personality can contribute to business objectives!!"
            ],
            [
                "Julie Jones",
                "Experienced & Skilled  Recruiter - Recruiting top talent to give our clients top results!",
                "November 30, 2015, Julie worked with Joshua in the same group",
                "When I came to the Travel Nursing Division, Julie took the time to teach me how to be a better recruiter. She gave me structure and was always available to help me when needed. Because of Julie's support, I was successful at this role."
            ],
            [
                "Julie Jones",
                "Experienced & Skilled  Recruiter - Recruiting top talent to give our clients top results!",
                "November 30, 2015, Julie worked with Joshua in the same group"
            ],
            [
                "Julie Jones",
                "Experienced & Skilled  Recruiter - Recruiting top talent to give our clients top results!",
                "November 30, 2015, Julie worked with Joshua in the same group"
            ],
            [
                "Julie Jones",
                "Experienced & Skilled  Recruiter - Recruiting top talent to give our clients top results!",
                "November 30, 2015, Julie worked with Joshua in the same group"
            ],
            "Experienced & Skilled  Recruiter - Recruiting top talent to give our clients top results!",
            [
                "When I came to the Travel Nursing Division, Julie took the time to teach me how to be a better recruiter. She gave me structure and was always available to help me when needed. Because of Julie's support, I was successful at this role."
            ],
            [
                "When I came to the Travel Nursing Division, Julie took the time to teach me how to be a better recruiter. She gave me structure and was always available to help me when needed. Because of Julie's support, I was successful at this role."
            ],
            [
                "C. Rachel Baucham",
                "Amazon-Area Operations Manager",
                "September 4, 2013, Joshua worked with C. Rachel in different groups",
                "Rachel is one of those outstanding individuals who puts alot on her plate and is able to do it all. I consider her to be one of the best applicants to be hired that i've worked with. Any company that hires Rachel is lucky to have such a dependable employee."
            ],
            [
                "C. Rachel Baucham",
                "Amazon-Area Operations Manager",
                "September 4, 2013, Joshua worked with C. Rachel in different groups"
            ],
            [
                "C. Rachel Baucham",
                "Amazon-Area Operations Manager",
                "September 4, 2013, Joshua worked with C. Rachel in different groups"
            ],
            [
                "C. Rachel Baucham",
                "Amazon-Area Operations Manager",
                "September 4, 2013, Joshua worked with C. Rachel in different groups"
            ],
            "Amazon-Area Operations Manager",
            [
                "Rachel is one of those outstanding individuals who puts alot on her plate and is able to do it all. I consider her to be one of the best applicants to be hired that i've worked with. Any company that hires Rachel is lucky to have such a dependable employee."
            ],
            [
                "Rachel is one of those outstanding individuals who puts alot on her plate and is able to do it all. I consider her to be one of the best applicants to be hired that i've worked with. Any company that hires Rachel is lucky to have such a dependable employee."
            ]
        ],
        "skills": [],
        "summary": "  I am your recruiter. It takes the best to help the best.\n  \n  \n",
        "name": "Joshua Freidus, MBA",
        "title": "National Recruiter specializing in the IT Industry with Contract and Perm Staffing Needs.",
        "url": "linkedin.com/in/joshua-freidus-mba-472a4432",
        "phone": "917-362-7089 (Mobile)",
        "email": "joshua.freidus@gmail.com"
    }
]