[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "1 Mutual Connection",
                "You and Melinda both know Neha Prajapat"
            ],
            [
                "1 Mutual Group",
                "You and Melinda are both in the Kforce Professional Network group"
            ],
            [
                "GNARVEMBER III: $10K CAMERA GIVEAWAY",
                "Melinda shared this"
            ],
            [
                "WIN YOUR CHOICE: Nikon D810 OR Canon 5DS R!",
                "Melinda shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Owner - Freelance Web Designer/Developer (off and on)",
                "Company Name",
                "Bashen Web Design",
                "Dates Employed",
                "Aug 2001 – Present",
                "Employment Duration",
                "16 yrs 4 mos",
                "Location",
                "Reston, VA",
                "Worked with client to highlight benefits of having website. Researched security industry, analyzed competition, and developed ways to attract new clients. Designed and created website to fit client's needs.•\tDesigned and built 3 different primarily informational mock up website(s), enabling client to have selection before final draft into domain.•\tPerformed web maintenance on existing sites, testing and ensuring correct appearance on monitor and checking for errors.•\tCreated wireframes on processing book, allowing client to see what website would look like."
            ],
            [
                "Web Associate",
                "Company Name",
                "The American Institute of Architects (AIA)",
                "Dates Employed",
                "Apr 2012 – Dec 2015",
                "Employment Duration",
                "3 yrs 9 mos",
                "Location",
                "Washington D.C. Metro Area",
                "Provided general web and web-based graphic design support for Director, Brand & Strategic Marketing Creative. Created and edited web graphics and images, maintained HTML web pages, and supplied general web support for Brand & Strategic Marketing team.•\tExecuted design concepts for print and digital projects, allowing for people without tablets to use iOS/Android and also AIA Convention handbook.•\tSupported design consistency through all print and digital marketing efforts, focusing on positioning AIA as modem, relevant, and bold leader.•\tCollaborated with supervisor on design concepts, visuals, and graphics before project began, voting on best visual and design concept.•\tConferred and interfaced with Brand and Strategic Marketing team throughout design / production process, preparing for Grassroots and National Annual Convention.•\tProvided general web support to Brand and Strategic Marketing Team in managing AIA.org and other web properties and digital products, utilizing HTML5 / HTML or Dreamweaver, testing appearance prior to final draft.•\tResized and altered web graphics and images from thumbnails to regular sizes, for posting to AlA.org and related web properties, enabling automatic display of regular size in slideshow.•\tDeveloped and maintained HTML web pages, fixing bugs and reducing problems.•\tProvided print-based graphic support, enabling good-quality pantone color of pantone requiring high-resolution of at least 300 dpi."
            ],
            [
                "Z Associate - Part time",
                "Company Name",
                "The Z (ZVRS)",
                "Dates Employed",
                "Apr 2011 – May 2012",
                "Employment Duration",
                "1 yr 2 mos",
                "Location",
                "DC Metro",
                "Specialized in making sales on Z Videophones equipment and benefits. Tasks included demonstrating benefits and products to customers to ensure accurate information and promote customers to produce educated decisions.•\tWorked with customers by installing relay-related products such as Z-340 / Zojo / Z-20 / Z5 in homes, allowing hearing-impaired people to communicate with hearing people via included interpreter relay person."
            ],
            [
                "Bookseller - Part time",
                "Company Name",
                "Barnes & Noble Bookstore",
                "Dates Employed",
                "Oct 2000 – Aug 2002",
                "Employment Duration",
                "1 yr 11 mos",
                "Location",
                "Plantation, FL",
                "To put the new books on the table or shelf. To use PDT to scan the book to see if it is “DO” due out to pull the book (hardcover) out of the shelf and send it back to publishing companies or paperback book/magazines need to tear the front and dumped in the trash.  To re-organize the alphabet authors or categories. The book is not belong on the shelf category and have to use PDT will tell me where to put other category. To help the customers what they are looking for and special order thru on the computer to hold the book for customer need/want."
            ],
            [
                "Payroll Representative",
                "Company Name",
                "Gehl Group/Xentel Co",
                "Dates Employed",
                "Jan 1998 – Jul 1999",
                "Employment Duration",
                "1 yr 7 mos",
                "Location",
                "Fort Lauderdale, FL",
                "Responsible for accurately paying over 700 employees in approx. 32 states on a weekly basis.  Enter hours worked, sick and vacation time, and bonuses/commissions.  Enter new hires and terminations.  Comply with over 30 child support payments, liens and payroll garnishments each week.  Assist the payroll manager with weekly, monthly and quarterly audits and reports."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "The Art Institute of Washington",
                "Degree Name",
                "BFA",
                "Field Of Study",
                "Web Design/Interactive Media Design",
                "Dates attended or expected graduation",
                "2006 – 2011"
            ],
            "Recommendations",
            [
                "The Art Institute of Washington",
                "18,408 followers"
            ],
            [
                "Leidos",
                "107,981 followers"
            ],
            [
                "WS_FTP users",
                "258 members"
            ],
            [
                "Flash Coders",
                "16,989 members"
            ],
            [
                "Uncubed",
                "3,296 followers"
            ],
            [
                "Kforce Professional Network",
                "31,339 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "The Art Institute of Washington",
                "18,408 followers"
            ],
            [
                "The Art Institute of Washington",
                "18,408 followers"
            ],
            [
                "Leidos",
                "107,981 followers"
            ],
            [
                "Leidos",
                "107,981 followers"
            ],
            [
                "WS_FTP users",
                "258 members"
            ],
            [
                "WS_FTP users",
                "258 members"
            ],
            [
                "Flash Coders",
                "16,989 members"
            ],
            [
                "Flash Coders",
                "16,989 members"
            ],
            [
                "Uncubed",
                "3,296 followers"
            ],
            [
                "Uncubed",
                "3,296 followers"
            ],
            [
                "Kforce Professional Network",
                "31,339 members"
            ],
            [
                "Kforce Professional Network",
                "31,339 members"
            ]
        ],
        "recommendations": [
            [
                "Ginger Kumnick",
                "Payroll/Billing Manager at Arnold-Hanafin Corporation",
                "July 6, 2011, Ginger managed Melinda directly",
                "When Melinda worked on my team, she was a high-energy, detailed individual, always eager to go the extra mile.  Her technical skills were superb, and she was a pleasure to work with.  I always knew Melinda would be successful at anything she wanted to do."
            ],
            [
                "Ginger Kumnick",
                "Payroll/Billing Manager at Arnold-Hanafin Corporation",
                "July 6, 2011, Ginger managed Melinda directly"
            ],
            [
                "Ginger Kumnick",
                "Payroll/Billing Manager at Arnold-Hanafin Corporation",
                "July 6, 2011, Ginger managed Melinda directly"
            ],
            [
                "Ginger Kumnick",
                "Payroll/Billing Manager at Arnold-Hanafin Corporation",
                "July 6, 2011, Ginger managed Melinda directly"
            ],
            "Payroll/Billing Manager at Arnold-Hanafin Corporation",
            [
                "When Melinda worked on my team, she was a high-energy, detailed individual, always eager to go the extra mile.  Her technical skills were superb, and she was a pleasure to work with.  I always knew Melinda would be successful at anything she wanted to do."
            ],
            [
                "When Melinda worked on my team, she was a high-energy, detailed individual, always eager to go the extra mile.  Her technical skills were superb, and she was a pleasure to work with.  I always knew Melinda would be successful at anything she wanted to do."
            ]
        ],
        "skills": [],
        "summary": "    BRINGING CLIENT FROM IDEALITY TO REALITYConfident and outgoing, driven by strong work ethic. Extremely organized and detail-oriented, managing multiple projects simultaneously. Skilled in design and concepts, creating websites, print, and digital marketing materials and mockups. Collaborate effectively with teams, ensuring message is conveyed clearly. Eagerly learn new software and proficient in both PC and Mac. Superior customer service, understanding needs and creating from scratch to build.\n  \n  \n",
        "name": "Melinda Bashen",
        "title": "Web Designer/Developer",
        "url": "linkedin.com/in/melindabashen",
        "phone": "571-313-5132 (Home)",
        "email": "mbashen@me.com"
    }
]