[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "50 Mutual Connections",
                "You and Thomas both know Curtis Gunn, Thomas Blondi, and 48 others"
            ],
            [
                "Thomas can introduce you to 11 people at Everest University Online",
                "Thomas worked at Everest University Online"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Chief Executive Officer & Founder",
                "Company Name",
                "Roth Learning, Inc.",
                "Dates Employed",
                "Feb 2016 – Present",
                "Employment Duration",
                "1 yr 10 mos",
                "Location",
                "6991 East Camelback Road,  Suite D-300  Scottsdale, Arizona 85251",
                "“I represent a new generation of education Tech leaders steeped in design, analysis, and evaluation of technology to achieve academic and financial success, and to bolster student retention. Humility and stewardship is my foundation for excellence.” Roth Learning is disrupting the education technology industry by developing a solution that reduces transactional distance – the psychological and geographical gap between students and learning. Driven by a leadership team that has been together for 14 years across multiple projects, Roth has built a methodology that encompasses proprietary software systems, instructional design methodologies, and student retention initiatives that uniquely position the company to meet the market needs of 10,000+ US and international colleges. With an industry expanding at a 17% CAGR with revenue of $252B by 2020, Roth Learning is primed to capture considerable market share and experience substantial growth. Student retention has a direct impact on the bottom line – lower revenue and high cost of student turnover - and should be considered in an evaluation of college financial performance.  Program structure, academic investment per student, and student support processes must also be considered. Roth Learning has demonstrated expertise in improving student retention; restructuring to improve performance, removing bureaucracy and lowering costs; and improving student outcomes through blended learning, accelerated courses, and academic metrics.   We offer proven Retention Interventions tailored to each's institutions size budget and technology demands.Would you like to have a conversation about Roth Learning, or just connect? I’m always happy to expand my network. Please add me as a connection and contact me at:➞ thomas@rothlearning.com"
            ],
            [
                "Provost & Chief Academic Officer",
                "Company Name",
                "Zenith Education Group, (not-for-profit) Chief Academic Officer, Online Division",
                "Dates Employed",
                "May 2015 – Feb 2016",
                "Employment Duration",
                "10 mos",
                "Location",
                "Tampa, Florida & remote office in Tempe, Arizona",
                "Chief Academic Officer and Chief Student Affairs Officer recruited to lead a turnaround of the 8,000-student online university. Led a team of 150 staff and 250 faculty with complete oversight for long-term strategic planning, program development, and for authoring an innovative retention plan. Provided executive leadership that incorporated instructional design technologies to improve student learning. Prepared Board of Director briefings on academic plans and retention initiatives.KEY HIGHLIGHTS ✔ Saved $2M annually while simultaneously increasing deliverables in all academic areas.✔ Orchestrated a complete, ground-up redevelopment of 120 courses within four months, including the conversion from 12-week to 6-week courses.✔ Strategic oversight for advanced training for 1,000+ employees within the first 140 days.✔ Established a faculty management model, a first for the institution, and created the first-ever academic dashboard by course, faculty, and program."
            ],
            [
                "Provost & Chief Academic Officer",
                "Company Name",
                "Everest College Phoenix",
                "Dates Employed",
                "Dec 2012 – May 2015",
                "Employment Duration",
                "2 yrs 6 mos",
                "Location",
                "Phoenix, Mesa, Tempe & Online",
                "Provost for all Arizona campuses and multi-regional online, in addition to Chief Academic Officer, Chief Student Affairs Officer, and Officer in the absence of the President.Worked alongside the CFO to prepare the academic budget, and took ownership of preparing an operating plan for academic and student affairs. Senior decision-maker with accountability for ensuring compliance with local, state, and national regional accrediting bodies. Took swift action to achieve the immediate turnaround of the institution. KEY HIGHLIGHTS✔ Led a restructuring that included 54% turnover in the first six months.✔ Authored the 5-year academic strategic plan that received favorable approval from ownership, staff, and the Board of Trustees.✔ Implemented Comprehensive Retention Review with favorable results across courses, faculty, management, programs, and campuses.✔ Built the academic plan, comprehensive retention initiative, new program planning, and program reviews that resulted in overwhelming success of delivering the college from Show-Cause status – a near unprecedented feat."
            ],
            [
                "National Associate Dean",
                "Company Name",
                "DeVry University",
                "Dates Employed",
                "2010 – 2012",
                "Employment Duration",
                "2 yrs",
                "Location",
                "Corporate Downers Grove, IL. Office in Tempe, Arizona",
                "National Associate Dean for the College of Business and Management, guiding strategic planning and communication with every university department for metrics, training, and general program management.End-to-end accountability for the development, evaluation, and management of Managers, Faculty Manages, Program Deans, Program Architects, Adjunct Faculty, and Full-Time Faculty.  Drove performance through the development, maintenance, and evaluation of 22 programs, 164 courses, 1,016 sections, 785 faculty, and 26,855 course takers.KEY HIGHLIGHTS✔ Maximized profitability while managing a $1.6M annual operating budget that generated $30M per session.✔ Expert in preparing and presenting accreditation compliance programs to accrediting bodies, such as HLC, CCNE, NLN, and State boards.✔ Converted a long-standing 4-week faculty training to 2 weeks, increasing pass rates while delivering substantial cost savings.✔ Led successful quality audits on all programs, including developing metrics and dashboards to support findings.✔ Developed new programs in undergraduate and graduate levels, as well as a significant number of new courses throughout a 10-year tenure with DeVry, Inc."
            ],
            [
                "Director of Faculty & Programs -- national scope",
                "Company Name",
                "Keller Graduate School of Management",
                "Dates Employed",
                "2008 – 2010",
                "Employment Duration",
                "2 yrs",
                "Location",
                "Wood Dale, IL.  Office in Tempe, Arizona",
                "Drove strategic planning, process improvement, and systems development for all online operations of DeVry University. Developed and implemented the annual and term cycle initiatives for course and faculty scheduling of course sections to meet staffing needs while maximizing efficiency. Ensured adherence to State licensing and accreditation requirements, including preparing to HLC, CCNE, and NLN.KEY HIGHLIGHTS✔ Grew online operations from 400 to 8,000+ students in less than four years, represented to growing from $128K to $67M in annual revenue.✔ Created the Integrated Model for training ground and online faculty from recruitment, assessment, training, and continued development.✔ Developed and launched the first-ever National Nurses Week for DeVry, Inc.✔ Instituted the methodology of capturing, analyzing, and leveraging significant metrics to address course fixes and teaching assessment.✔ Utilized an integrated model to create new scheduling, forecasting, and prediction algorithms"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Northcentral University",
                "Degree Name",
                "Doctor of Philosophy (PhD)",
                "Field Of Study",
                "Higher Education/Higher Education Administration",
                "Grade",
                "Honors",
                "Dates attended or expected graduation",
                "2010 – 2016",
                "Activities and Societies:",
                "•\tKappa Delta Pi, International Honor Society in Education, recognized for Honors in PhD program",
                "A Hermeneutic Phenomenological Exploration of Students' and Instructors' Lived Experiences with Transactional Distance and its Influence on Student Retention."
            ],
            [
                "Northcentral University",
                "Degree Name",
                "Doctor of Philosophy (PhD)",
                "Field Of Study",
                "Higher Education/Higher Education Administration",
                "Grade",
                "Honors",
                "Dates attended or expected graduation",
                "2010 – 2016",
                "Activities and Societies:",
                "•\tKappa Delta Pi, International Honor Society in Education, recognized for Honors in PhD program",
                "A Hermeneutic Phenomenological Exploration of Students' and Instructors' Lived Experiences with Transactional Distance and its Influence on Student Retention."
            ],
            [
                "University of Phoenix",
                "Degree Name",
                "Master of Organizational Behavior",
                "Field Of Study",
                "Business Administration and Management, General",
                "Dates attended or expected graduation",
                "2000 – 2002"
            ],
            [
                "University of Phoenix",
                "Degree Name",
                "Master of Organizational Behavior",
                "Field Of Study",
                "Business Administration and Management, General",
                "Dates attended or expected graduation",
                "2000 – 2002"
            ],
            [
                "University of Phoenix",
                "Degree Name",
                "Bachelor's degree",
                "Field Of Study",
                "Business Administration and Management, General",
                "Dates attended or expected graduation",
                "1998 – 1999",
                "Initial two years with honors at Scottsdale Community College, offered Full Ride at Arizona State University in Figurative Sculpture, which I turned down to pursue a tennis career.  After tennis I took my undergraduate credit hours and  finished undergraduate work at ground based University of Phoenix.  Then carried this immediately into ground based master's level work."
            ],
            [
                "University of Phoenix",
                "Degree Name",
                "Bachelor's degree",
                "Field Of Study",
                "Business Administration and Management, General",
                "Dates attended or expected graduation",
                "1998 – 1999",
                "Initial two years with honors at Scottsdale Community College, offered Full Ride at Arizona State University in Figurative Sculpture, which I turned down to pursue a tennis career.  After tennis I took my undergraduate credit hours and  finished undergraduate work at ground based University of Phoenix.  Then carried this immediately into ground based master's level work."
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "Betsy (Elizabeth) CorcoranBetsy (Elizabeth) Corcoran is a LinkedIn Influencer",
                "CoFounder & CEO, EdSurge",
                "68,818 followers"
            ],
            [
                "Guy KawasakiGuy Kawasaki is a LinkedIn Influencer",
                "Chief evangelist + keynote speaker",
                "2,668,387 followers"
            ],
            [
                "ASCD",
                "22,182 members"
            ],
            [
                "Greenleaf Center for Servant Leadership",
                "5,402 members"
            ],
            [
                "Tony HsiehTony Hsieh is a LinkedIn Influencer",
                "CEO at Zappos.com",
                "310,257 followers"
            ],
            [
                "Teach For America",
                "96,769 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Betsy (Elizabeth) CorcoranBetsy (Elizabeth) Corcoran is a LinkedIn Influencer",
                "CoFounder & CEO, EdSurge",
                "68,818 followers"
            ],
            [
                "Betsy (Elizabeth) CorcoranBetsy (Elizabeth) Corcoran is a LinkedIn Influencer",
                "CoFounder & CEO, EdSurge",
                "68,818 followers"
            ],
            [
                "Betsy (Elizabeth) Corcoran is a LinkedIn Influencer"
            ],
            [
                "Guy KawasakiGuy Kawasaki is a LinkedIn Influencer",
                "Chief evangelist + keynote speaker",
                "2,668,387 followers"
            ],
            [
                "Guy KawasakiGuy Kawasaki is a LinkedIn Influencer",
                "Chief evangelist + keynote speaker",
                "2,668,387 followers"
            ],
            [
                "Guy Kawasaki is a LinkedIn Influencer"
            ],
            [
                "ASCD",
                "22,182 members"
            ],
            [
                "ASCD",
                "22,182 members"
            ],
            [
                "Greenleaf Center for Servant Leadership",
                "5,402 members"
            ],
            [
                "Greenleaf Center for Servant Leadership",
                "5,402 members"
            ],
            [
                "Tony HsiehTony Hsieh is a LinkedIn Influencer",
                "CEO at Zappos.com",
                "310,257 followers"
            ],
            [
                "Tony HsiehTony Hsieh is a LinkedIn Influencer",
                "CEO at Zappos.com",
                "310,257 followers"
            ],
            [
                "Tony Hsieh is a LinkedIn Influencer"
            ],
            [
                "Teach For America",
                "96,769 followers"
            ],
            [
                "Teach For America",
                "96,769 followers"
            ]
        ],
        "recommendations": [
            [
                "Scott Torgerson",
                "Associate Vice President",
                "May 9, 2016, Thomas was senior to Scott but didn’t manage directly",
                "Throughout my 14 years of higher education leadership, and 27 years of management leadership there are a handful of stars who stand out. I define a star as someone capable of and in fact exceeding performance, and this is Scott.  I find a star to be someone who is balanced and never rattled in challenging times or even in great times, and this is Scott.  I promise any reader of this endorsement Scott is chief among the stars I have worked with for 27 years, and I have been a part of and also built some exceptional teams in higher education.  Enrollment management (admissions) is a challenging facet of higher education, whether you find yourself in a for-profit or not-for-profit institution.  Scott stands out among his peers in both realms.  He is a highly educated enrollment leader.  He works with logic and data, but also with an intelligent heart, empathy, tough love and consideration, all in the best interest of the student, the student experience, and of course the institution.  We live in a time where accountability and goodness are fleeting.  Scott is always accountable and he is simply a good man and great in higher education enrollment.  This endorsement can be quantifiably supported with data for any interested party who wishes to speak with me.   Thomas Waite, 480-231-6643, higher education executive professional."
            ],
            [
                "Scott Torgerson",
                "Associate Vice President",
                "May 9, 2016, Thomas was senior to Scott but didn’t manage directly"
            ],
            [
                "Scott Torgerson",
                "Associate Vice President",
                "May 9, 2016, Thomas was senior to Scott but didn’t manage directly"
            ],
            [
                "Scott Torgerson",
                "Associate Vice President",
                "May 9, 2016, Thomas was senior to Scott but didn’t manage directly"
            ],
            "Associate Vice President",
            [
                "Throughout my 14 years of higher education leadership, and 27 years of management leadership there are a handful of stars who stand out. I define a star as someone capable of and in fact exceeding performance, and this is Scott.  I find a star to be someone who is balanced and never rattled in challenging times or even in great times, and this is Scott.  I promise any reader of this endorsement Scott is chief among the stars I have worked with for 27 years, and I have been a part of and also built some exceptional teams in higher education.  Enrollment management (admissions) is a challenging facet of higher education, whether you find yourself in a for-profit or not-for-profit institution.  Scott stands out among his peers in both realms.  He is a highly educated enrollment leader.  He works with logic and data, but also with an intelligent heart, empathy, tough love and consideration, all in the best interest of the student, the student experience, and of course the institution.  We live in a time where accountability and goodness are fleeting.  Scott is always accountable and he is simply a good man and great in higher education enrollment.  This endorsement can be quantifiably supported with data for any interested party who wishes to speak with me.   Thomas Waite, 480-231-6643, higher education executive professional."
            ],
            [
                "Throughout my 14 years of higher education leadership, and 27 years of management leadership there are a handful of stars who stand out. I define a star as someone capable of and in fact exceeding performance, and this is Scott.  I find a star to be someone who is balanced and never rattled in challenging times or even in great times, and this is Scott.  I promise any reader of this endorsement Scott is chief among the stars I have worked with for 27 years, and I have been a part of and also built some exceptional teams in higher education.  Enrollment management (admissions) is a challenging facet of higher education, whether you find yourself in a for-profit or not-for-profit institution.  Scott stands out among his peers in both realms.  He is a highly educated enrollment leader.  He works with logic and data, but also with an intelligent heart, empathy, tough love and consideration, all in the best interest of the student, the student experience, and of course the institution.  We live in a time where accountability and goodness are fleeting.  Scott is always accountable and he is simply a good man and great in higher education enrollment.  This endorsement can be quantifiably supported with data for any interested party who wishes to speak with me.   Thomas Waite, 480-231-6643, higher education executive professional."
            ]
        ],
        "skills": [
            [
                "Higher Education",
                "See 111 endorsements for Higher Education",
                "99+",
                "Higher Education",
                "Endorse",
                "Endorsed by Jon Persavich, Ph.D. and 16 others who are highly skilled at this",
                "Endorsed by 11 of Thomas’ colleagues at Everest University Online"
            ],
            [
                "Higher Education",
                "See 111 endorsements for Higher Education",
                "99+"
            ],
            [
                "Leadership",
                "See 96 endorsements for Leadership",
                "96",
                "Leadership",
                "Endorse",
                "Endorsed by Deborah Hayes and 4 others who are highly skilled at this",
                "Endorsed by 8 of Thomas’ colleagues at Everest University Online"
            ],
            [
                "Leadership",
                "See 96 endorsements for Leadership",
                "96"
            ],
            [
                "Adult Education",
                "See 88 endorsements for Adult Education",
                "88",
                "Adult Education",
                "Endorse",
                "Endorsed by Annise Mabry, Ph.D and 12 others who are highly skilled at this",
                "Endorsed by 8 of Thomas’ colleagues at Everest University Online"
            ],
            [
                "Adult Education",
                "See 88 endorsements for Adult Education",
                "88"
            ],
            [
                "Staff Development",
                "See 86 endorsements for Staff Development",
                "86",
                "Staff Development",
                "Endorse"
            ],
            [
                "Staff Development",
                "See 86 endorsements for Staff Development",
                "86"
            ],
            [
                "Leadership Development",
                "See 77 endorsements for Leadership Development",
                "77",
                "Leadership Development",
                "Endorse"
            ],
            [
                "Leadership Development",
                "See 77 endorsements for Leadership Development",
                "77"
            ],
            [
                "Strategic Planning",
                "See 65 endorsements for Strategic Planning",
                "65",
                "Strategic Planning",
                "Endorse"
            ],
            [
                "Strategic Planning",
                "See 65 endorsements for Strategic Planning",
                "65"
            ],
            [
                "Training",
                "See 58 endorsements for Training",
                "58",
                "Training",
                "Endorse"
            ],
            [
                "Training",
                "See 58 endorsements for Training",
                "58"
            ],
            [
                "Public Speaking",
                "See 56 endorsements for Public Speaking",
                "56",
                "Public Speaking",
                "Endorse"
            ],
            [
                "Public Speaking",
                "See 56 endorsements for Public Speaking",
                "56"
            ],
            [
                "Educational Leadership",
                "See 53 endorsements for Educational Leadership",
                "53",
                "Educational Leadership",
                "Endorse"
            ],
            [
                "Educational Leadership",
                "See 53 endorsements for Educational Leadership",
                "53"
            ],
            [
                "Educational Technology",
                "See 41 endorsements for Educational Technology",
                "41",
                "Educational Technology",
                "Endorse"
            ],
            [
                "Educational Technology",
                "See 41 endorsements for Educational Technology",
                "41"
            ],
            [
                "Curriculum Development",
                "See 36 endorsements for Curriculum Development",
                "36",
                "Curriculum Development",
                "Endorse"
            ],
            [
                "Curriculum Development",
                "See 36 endorsements for Curriculum Development",
                "36"
            ]
        ],
        "summary": "    ☆ EDUCATION TECHNOLOGY LEADER & INDUSTRY PIONEER ☆As CEO and Founder of Roth Learning, my team and I are disrupting the education technology industry. Our solution reduces transactional distance between students, faculty, and universities to decrease attrition, increase cost savings, and deliver substantial gains to retention and revenue growth.I have built my career on developing groundbreaking solutions that solve complex challenges for online colleges and universities, and have held senior leadership roles that include Program Dean, Director of Faculty and Programs, National Associate Dean, and Provost. I understand the value educational effectiveness can have on the student experience, and how to translate a positive student outcome into long-term, sustained growth for online colleges.☆ CORE AREAS OF EXPERTISE ☆☑ Reducing Transactional Distance☑ Long-Term Strategic Planning☑ Online education & e-Learning Pioneer☑ Education Technology Innovation☑ Expert Pioneering in Blended Learning☑ C-Level Decision-Making☑ Board of Directors Leadership☑ Teaching and Learning Effectiveness☑ Driving YOY Revenue GrowthSELECTED CAREER ACHIEVEMENTS✔ Generated tens of millions in revenue by contributing to an online learning software for an early adopter, setting the stage to capture hundreds of millions in future revenue over the next decade.✔ Reduced attrition from 14% to 6.7% within five months by conceptualizing and driving a comprehensive retention program as part of a multi-year turnaround initiative.✔ Mapped out and executed a restructuring event that included 54% turnover in the first six months as part of a successful turnaround of a major online college. ✔ Pioneered analytics to drive innovation for online software learning, revolutionizing the education technology industry.Would you like to have a conversation about Roth Learning or my expertise in Ed-Tech? Please add me as a connection and contact me at: ➞ thomas@rothlearning.com\n  \n  \n",
        "name": "Thomas Waite, PhD",
        "title": "CEO of Roth Learning ★ Innovator for e-Learning Software ★ Ed-Tech Industry Expert, Entrepreneur and Visionary Leader",
        "url": "linkedin.com/in/thomaspwaite",
        "phone": "",
        "email": "tpatrickw@gmail.com"
    }
]