[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "22 Mutual Connections",
                "You and Robin both know Judith McRae, Denise Gudzikowski, and 20 others"
            ],
            [
                "You both worked at Charles Schwab",
                "Robin worked at Charles Schwab before you started"
            ],
            [
                "Humble leaders provoke levels of loyalty, commitment and performance that more ego-centric leaders can't quite elicit or understand.",
                "Robin liked"
            ],
            [
                "Office 365 LinkedIn integration - modern profile cards and resume assistant",
                "Robin liked"
            ],
            [
                "Delhi doctors declare pollution emergency as smog chokes city",
                "Robin liked"
            ],
            [
                "What You Can Learn From a Bad Job Interview",
                "Robin liked"
            ],
            [
                "10 tips for crafting highly effective job descriptions",
                "Robin commented"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Validation Analyst",
                "Company Name",
                "University of Washington",
                "Dates Employed",
                "Jan 2016 – Aug 2016",
                "Employment Duration",
                "8 mos",
                "Location",
                "Greater Seattle Area",
                "Organized a monthly implementation process flow-\tDocumented process flow features and details-\tOrganized TFS dataflow-\tActed as Release Lead-\tTested various system/website enhancements"
            ],
            [
                "Enterprise Business Analyst",
                "Company Name",
                "Boise State University",
                "Dates Employed",
                "Jun 2013 – Jun 2014",
                "Employment Duration",
                "1 yr 1 mo",
                "Location",
                "Boise, Idaho Area",
                "PeopleSoft Finance upgrade:Key Accomplishment:  Making a significant contribution to BSU’s readiness to upgrade to the most current version of PeopleSoft Finance, where they could begin to utilize the software to their best advantage.-\tDocumented current business processes and flows-\tElicited functional requirements from SMEs-\tResearched new version capabilities to find potential solutions to existing issues-\tGuided SMEs through new version functionality and sandbox testing-\tCompleted targeted solution request documents-\tCompleted targeted user/functional requirements (BRDs)-\tDocumented bugs and issues to be delivered to PeopleSoft"
            ],
            [
                "Sr. Staff - Business Analyst",
                "Company Name",
                "Charles Schwab",
                "Dates Employed",
                "Jan 2001 – Sep 2011",
                "Employment Duration",
                "10 yrs 9 mos",
                "Location",
                "San Francisco Bay Area",
                "Cost Basis Analysis and Tracking System:Key Accomplishment:  Being a key driver and expert contributor to the delivery of cost basis data to all Schwab customers before the data was mandated by TARP.  Delivering cost basis data to customers via real-time online access, on account statements, and on 1099’s.  Designing a cost basis system and processes that are robust, accurate, able to support future enhancements, and mandated modifications.-\tCompleted iterative data analysis (transaction processing, historical transactions, law and regulation compliance, common/support data history and accuracy, etc.) -\tElicited and completed use cases, BRDs, and functional requirements -\tContributed SME expertise to system and integration design with 3rd-party vendor software -\tCreated detailed data map and validation plan for iterative conversions-\tPlanned and participated in iterative QA execution and provided functional QA oversight -\tMonitored and resolved bugs, assessed risk, and completed detailed root cause analysis -\tCompleted iterative user training and user documentation -\tDesigned and performed offshore business and systems training -\tProvided industry standards, IRS regulations (TARP), and user requirements; negotiated many 3rd-party vendor system enhancements  -\tActive leader, SME, and participant in all aspects of SDLC-\tProvided project management documentation and maintained project “history narrative”-\tProvided source information and context for quarterly and overall project budget-       Completed vendor gap analysis, proof of concept testing, and detailed BRDs for several cost basis analysis, tracking, and IRS reporting systems."
            ],
            [
                "IT Consultant",
                "Company Name",
                "Various",
                "Dates Employed",
                "Jun 1997 – Dec 2000",
                "Employment Duration",
                "3 yrs 7 mos",
                "Location",
                "San Francisco Bay Area",
                "Schwab FAST 2000:  Completed multiple vendor gap analysis and system comparisons for core brokerage operating systems (books & records, security master, stock record, general ledger, transaction processing/posting, dividend payments, proxy processing, etc.)Schwab Y2k 1998 – 2000:  Executed Y2k QA validation of 401k/Retirement Plans and Trust Operations processes; prepared detailed disaster plan, and contingency & recovery guides.  Performed production data and systems validation on Y2k and was in place to act as “disaster coordinator” for 401k and Trust Operations.Wells Y2k 1997 – 1998:  Y2k System Analyst and QA Validation in Bankwide Testing Y2k.  Created and executed test cases and scripts, and did problem and risk analysis as part of the Y2k integrated system testing and resolution program."
            ],
            [
                "System/Site Designer – Photographer – Trainer",
                "Company Name",
                "Sitewright",
                "Dates Employed",
                "Mar 1996 – Aug 1997",
                "Employment Duration",
                "1 yr 6 mos",
                "Location",
                "Alameda, CA",
                "-\tCreated a small company to do web design, training, and photography:  Sitewright -\tProvided computer training and built a custom tracking system in MS Access for the health and safety officer at Westar Marine Services, San Francisco CA.-\tProvided extensive digital photography and web design (partner/husband built the commercial website) http://www.theringman.com (no longer online, owner retired)."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "San Francisco State University",
                "Degree Name",
                "Bachelor’s Degree",
                "Field Of Study",
                "English Language and Literature, General",
                "Dates attended or expected graduation",
                "1982 – 1984"
            ],
            [
                "San Francisco State University",
                "Degree Name",
                "Bachelor’s Degree",
                "Field Of Study",
                "English Language and Literature, General",
                "Dates attended or expected graduation",
                "1982 – 1984"
            ],
            [
                "Saint Mary's College of California",
                "Field Of Study",
                "English Language and Literature/Letters",
                "Dates attended or expected graduation",
                "1980 – 1982"
            ],
            [
                "Saint Mary's College of California",
                "Field Of Study",
                "English Language and Literature/Letters",
                "Dates attended or expected graduation",
                "1980 – 1982"
            ],
            [
                "See connections (254)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [],
        "recommendations": [],
        "skills": [],
        "summary": "    I am a senior business analyst; I have successfully and creatively executed all aspects of SDLC for many projects, utilizing a variety of project development methodologies.  I am often the key liaison between the technology groups and the business/customers, helping them all to agree to and understand the project objectives, risks and rewards, and process. I am a comfortable communicator. I am also the project “memory”, producing and storing exceptional project documentation, and remembering and utilizing the details I hear, read, and see within and across projects. I'm both a big picture person and a down and dirty details gal -- I know where the pennies are, and I don’t let them round randomly.I am looking for full-time or consulting work doing detailed problem and data analysis, writing requirements, creating data mapping for a system conversion/upgrade.  I'm also interested in QA, third-party system gap analysis, and small-team project and process management.  I want to be challenged; I want to utilize and share my skills and  experiences  while learning new systems, industries, and  technologies.  I want latitude and support within the company/organization for interdisciplinary excursions.  I work best in a flexible team environment with a group of professionals transparently sharing knowledge, excitement, determination, responsibility, and success.\n  \n  \n",
        "name": "Robin Combs",
        "title": "Business Analyst, PM, QA",
        "url": "linkedin.com/in/robin-combs-9a8878128",
        "phone": "360-499-4052 (Mobile)",
        "email": "rec@dedicto.com"
    }
]