[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "49 Mutual Connections",
                "You and Raul both know David Richardson, Aric Zion, and 47 others"
            ],
            [
                "You both studied at Northern Arizona University",
                "You both studied at Northern Arizona University from 2006 to 2010"
            ],
            [
                "Show more highlights"
            ],
            [
                "Zion & Zion is proud to be recognized as one of the 2017 Best Places to Work by the Phoenix Business Journal! We had a wonderful time celebrating with other great Phoenix companies at their awards luncheon today. #PBJBest",
                "Raul liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Web Developer",
                "Company Name",
                "Zion & Zion",
                "Dates Employed",
                "Aug 2012 – Present",
                "Employment Duration",
                "5 yrs 5 mos",
                "Location",
                "Tempe, Arizona",
                "As a Web Developer, Raul materializes strategy-driven concepts, wireframes and mockups into ambitious websites. He has led multiple projects and worked with many clients, both local and global. Raul is involved in all the stages of a build in a consulting role and eventually is tasked with the development responsabilities. His communication skills and background also allow him to work effectively with technical and non-technical individuals. His time often involves:• Conceptualizing solutions based on the strategy of internal/external stakeholders• Estimating builds, taking into consideration multiple variables (i.e. risk, requirements, integrations, budget, etc.)• Gathering requirements from stakeholders and translating them into actionable tasks for development• Consulting internal departments in order to build experiences that are both efficient and attractive• Creating build plans, splitting available hours into features and assigning responsibilities• Exploring languages/frameworks that are more compatible with the needs of a build• Architecting features and custom CMS back-ends• Developing front and back end solutions for small and large scale projects• Implementing third-party features or services and working closely together with external teams• Custom integrations and creation of API's• Implementation of analytics (traffic tracking, event and goal tracking, third-party integration into GA, etc.)• Quality Assurance testing and cross-browser/cross-device testing• Educating stakeholders in the use of custom CMS solutions• Working closely with other internal team members including Account Managers, Designers, Art Directors, Researchers, Strategists, Developers, as well as SEO, PR, and Social Media experts"
            ],
            [
                "Graphic Designer",
                "Company Name",
                "Zion & Zion",
                "Dates Employed",
                "Aug 2011 – Aug 2012",
                "Employment Duration",
                "1 yr 1 mo",
                "Location",
                "Tempe, Arizona",
                "After a successful internship, Raul was hired as a full-time Graphic Designer. He tackled multiple projects (both small and large scope) for traditional and digital media. His responsibilities involved concept and production of logos, website mockups, email marketing mockups, packaging design, etc. This position allowed him to flex his creative skills greatly. Raul grew fond of designing for interactive and subsequently became interested in learning to code. This pushed him into evolving his career towards Web Development."
            ],
            [
                "Graphic Design Intern",
                "Company Name",
                "Zion & Zion",
                "Dates Employed",
                "Jun 2011 – Aug 2011",
                "Employment Duration",
                "3 mos",
                "Raul spent two months assisting current Graphic Designers, primarily focusing on production. He developed a solid grasp of design concepts and execution for traditional and digital media. Raul gained experience through the guidance of his superiors and his eagerness to learn. His commitment, talents and hard work allowed him to quickly evolve the internship into a full-time position."
            ],
            [
                "Student Creative Designer",
                "Company Name",
                "Northern Arizona University",
                "Dates Employed",
                "Aug 2008 – Dec 2010",
                "Employment Duration",
                "2 yrs 5 mos",
                "Raul focused on multi-media designs for e-learning portals. He was tasked with conceptualizing and executing a branded theme for classes that provided online courses. He worked part-time while attending the NAU Advertising/Visual Communication program. This position allowed him to grow his Graphic Design and professional skills greatly as it involved deadlines and constant feedback from stakeholders."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Northern Arizona University",
                "Degree Name",
                "Advertising",
                "Field Of Study",
                "Visual Communication",
                "Dates attended or expected graduation",
                "2006 – 2010"
            ],
            "Recommendations",
            [
                "Acquia",
                "21,356 followers"
            ],
            [
                "Mashable",
                "827,104 followers"
            ],
            [
                "FFW",
                "1,994 followers"
            ],
            [
                "Manifest LLC",
                "8,086 followers"
            ],
            [
                "RIESTER",
                "4,373 followers"
            ],
            [
                "Kitchen Sink Studios, Inc.",
                "1,063 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Acquia",
                "21,356 followers"
            ],
            [
                "Acquia",
                "21,356 followers"
            ],
            [
                "Mashable",
                "827,104 followers"
            ],
            [
                "Mashable",
                "827,104 followers"
            ],
            [
                "FFW",
                "1,994 followers"
            ],
            [
                "FFW",
                "1,994 followers"
            ],
            [
                "Manifest LLC",
                "8,086 followers"
            ],
            [
                "Manifest LLC",
                "8,086 followers"
            ],
            [
                "RIESTER",
                "4,373 followers"
            ],
            [
                "RIESTER",
                "4,373 followers"
            ],
            [
                "Kitchen Sink Studios, Inc.",
                "1,063 followers"
            ],
            [
                "Kitchen Sink Studios, Inc.",
                "1,063 followers"
            ]
        ],
        "recommendations": [
            [
                "Aric Zion",
                "CEO @ Zion & Zion",
                "December 30, 2016, Aric managed Raul directly",
                "Raul not only has some serious skills when it comes to front end web development, but he also has a sensitivity to the needs of the agency and a business acumen that is uncommon amongst developers. Combine that with his exceptional personality--always willing to help and anxious to make a difference, and you'll begin to understand what makes Raul so special and so valuable to our team."
            ],
            [
                "Aric Zion",
                "CEO @ Zion & Zion",
                "December 30, 2016, Aric managed Raul directly"
            ],
            [
                "Aric Zion",
                "CEO @ Zion & Zion",
                "December 30, 2016, Aric managed Raul directly"
            ],
            [
                "Aric Zion",
                "CEO @ Zion & Zion",
                "December 30, 2016, Aric managed Raul directly"
            ],
            "CEO @ Zion & Zion",
            [
                "Raul not only has some serious skills when it comes to front end web development, but he also has a sensitivity to the needs of the agency and a business acumen that is uncommon amongst developers. Combine that with his exceptional personality--always willing to help and anxious to make a difference, and you'll begin to understand what makes Raul so special and so valuable to our team."
            ],
            [
                "Raul not only has some serious skills when it comes to front end web development, but he also has a sensitivity to the needs of the agency and a business acumen that is uncommon amongst developers. Combine that with his exceptional personality--always willing to help and anxious to make a difference, and you'll begin to understand what makes Raul so special and so valuable to our team."
            ]
        ],
        "skills": [],
        "summary": "  Passionately focusing on responsive web solutions with an emphasis in aesthetics, user experience, performance and content management.\n  \n  \n",
        "name": "Raul Salido",
        "title": "Web Developer at Zion & Zion",
        "url": "linkedin.com/in/raul-salido-2694122a",
        "phone": "",
        "email": "salidoraul@gmail.com"
    }
]