[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "66 Mutual Connections",
                "You and Clifford both know Sergey Zaytsev, Colleen Perrone, and 64 others"
            ],
            [
                "Thank You is Not Enough",
                "Clifford liked"
            ],
            [
                "Linked In Friends:",
                "I could have LOST my wife and my oldest daughter last night.",
                "By the grace of God, they survived this horrific accident on the 91 freeway.",
                "They are hurt pretty badly, but will get through it. They were coming home on the 91 East in the fast track and someone ran over the pylon to cut into the fast track lanes, and going very slow when they cut over right in front of my wife.",
                "Such a dangerous and unnecessary risk.",
                "I’m grateful to the Corona Firefighters, many of whom are personal friends, who immediately recognized my wife and daughter and took great care of them.",
                "The 91 freeway shut down for a very long time.",
                "The police estimated that my wife and daughter spun about 200 feet from the impact and were hit by at least 5 different cars. All because someone wanted to cut over and sneak in the fast track. I'm also very grateful for TESLA building such a safe and strong car.",
                "Life is fragile. God is good. Love my wife and daughter and I’m glad that are only injured and will be okay. Daughter has broken collar bone and my wife injured her foot. We also pray for others who were hurt in this accident.",
                "Though they are injured and shaken up, it could’ve been much much worse.",
                "Squeeze your loved ones tight today.",
                "Clifford commented"
            ],
            [
                "RESA Wearables Debuts its Custom Insoles at Costco and Commissions CTS/Mighty Touch to Produce Kiosks",
                "Clifford liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Senior Product Manager",
                "Company Name",
                "Infusionsoft",
                "Dates Employed",
                "Sep 2017 – Present",
                "Employment Duration",
                "3 mos",
                "Location",
                "Phoenix, Arizona Area",
                "In short...  Make magic happen. :)"
            ],
            [
                "Founder now Absentee Business Owner",
                "Company Name",
                "MobileHID.com",
                "Dates Employed",
                "Nov 2006 – Present",
                "Employment Duration",
                "11 yrs 1 mo",
                "Created, branded, and marketed MobileHID as a source for the best value on industrial-grade lighting products for the construction, agriculture, logging, and excavation industries.+ Created and increased brand recognition through viral marketing and strategic online marketing through social media and online community relations.+ Continually analyze web traffic to adjust site content based on visitor interest and browsing behavior and improve SEO.+ Strategically generated web traffic by establishing an effective web presence resulting in “top 10” search engine rankings with Google and Yahoo.+ Coordinate importation and fulfillment of orders to and from a warehouse in Arizona to ensure products are in stock for customers.+ Forecast inventory based on buying behavior and industry needs."
            ],
            [
                "Founder now Absentee Business Owner",
                "Company Name",
                "ClearBraFilms.com",
                "Dates Employed",
                "Jan 2007 – Present",
                "Employment Duration",
                "10 yrs 11 mos",
                "ClearBraFilms.com serves as a nationwide directory for the paint protection service industry.  It directly connects customers and service providers to save consumers money and generate retail revenue for the service providers. It ranks on page 1 of Google / Bing / Yahoo for the intuitive keywords \"clear bra\" and other location oriented searches. * Envisioned then created an online directory to organize and scale offline agreements between brick and mortar lead generators and service providers.* Researched and gathered data on over 800 service providers to build database.* Successfully marketed and organically search engine optimized the directory service to the top of the search engines."
            ],
            [
                "Product Manager",
                "Company Name",
                "Coplex",
                "Dates Employed",
                "Jul 2015 – Sep 2017",
                "Employment Duration",
                "2 yrs 3 mos",
                "Location",
                "Phoenix",
                "In short, I made magic happen.Coplex helps subject matter experts build software businesses so they can take advantage of opportunities they've recognized in their respective industries.  I like to practice \"Immersive Product Management\" where I put myself in the end users' shoes to understand the problems first hand.  By doing so, I've helped our ventures create better products and have done things I normally wouldn't have ever done like attend AA meetings, drive for Uber and Lyft, smoke vaporizers, etc... Things I did almost every day: + Host workshops to help ventures ideate and plan their product direction.+ Discover new 3rd party tools to help our ventures build their startups.+ Guide the product shaping process and SCRUM development efforts on time and within budget.+ Maintain a Build Measure Learn loop by creating test cards and tests to validate assumptions in the lean product development process.+ Create User Stories in the Icebox and test completed tasks before delivering to the Product Owner in Pivotal Tracker.+ Review UI/UX best practices to help the team gain context for a specific industry.+ Understand and evaluate goals to set the technical direction for development.+ Send weekly progress/budget reports on product development with sprint burndown charts and completed tasks in and out of sprint."
            ],
            [
                "Overall Problem Solver and Manager, Site-Building Software Development",
                "Company Name",
                "Go Daddy Inc.",
                "Dates Employed",
                "Mar 2002 – Aug 2007",
                "Employment Duration",
                "5 yrs 6 mos",
                "* Spearheaded the Executive Accounts department to handle GoDaddy’s biggest customers and data mined purchase behavior to discover new revenue opportunities making it the most profitable customer service sales team.* Restructured and trained GoDaddy's Billing Department to convert customers demanding refunds into customers spending more on the right products that fit their needs.  After years of operating as a cost center, the department now competes with the Executive Accounts department as the highest revenue generating business unit.* Continuously monitored consumer behavior on three site building applications and identified opportunities to increase user engagement and feature adoption across several hundred thousand customers that brought in $20M+ in annual revenue* Improved and drove product innovation, leveraging consumer insights collected via customer service staff, feedback submissions, usability testing, and a product Blog.* Managed product road map and planned small but frequent product enhancements in an agile development environment to ensure product stability and an incremental learning curve for customers."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "General Assembly",
                "Field Of Study",
                "Ruby on Rails Back-End Development",
                "Dates attended or expected graduation",
                "2014 – 2014"
            ],
            [
                "General Assembly",
                "Field Of Study",
                "Ruby on Rails Back-End Development",
                "Dates attended or expected graduation",
                "2014 – 2014"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "BS",
                "Field Of Study",
                "Marketing and Minored in Communication",
                "Dates attended or expected graduation",
                "1996 – 2000",
                "Activities and Societies:",
                "Alpha Kappa Psi, Phi Alpha Delta, START.",
                "Co-founded online community for Tempe/Scottsdale night life in 1999  - ClubAZ.com"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "BS",
                "Field Of Study",
                "Marketing and Minored in Communication",
                "Dates attended or expected graduation",
                "1996 – 2000",
                "Activities and Societies:",
                "Alpha Kappa Psi, Phi Alpha Delta, START.",
                "Co-founded online community for Tempe/Scottsdale night life in 1999  - ClubAZ.com"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Mentor",
                "Company Name",
                "Greater Phoenix Youth at Risk",
                "Dates volunteered",
                "Jan 2004 – May 2004",
                "Volunteer duration",
                "5 mos",
                "Cause",
                "Children",
                "The phrase \"it takes a village to raise a child\" is true.  One of the biggest responsibilities that we have as custodians of today is to help children be responsible contributors tomorrow.  Working with underprivileged youth not only helped me see the wider spectrum of life but also allowed me to help broaden their horizons.  Often times parents are too busy to raise children properly or don't have the desire or ability to give their children insight on how they can work harder/smarter to get themselves out of their current situation.  Unfortunately, sometimes the parents aren't even around.  One time I took my youth to lunch at PF Changs and he looked up in confusion and asked \"Clifford, where are the pictures?\".  That question spoke volumes in what kind of environment he lived in and inspired me to data dump as much useful career/life advice that I could to him so he could help himself in the future.  I'm so proud of him today.  He's a football coach at a school and does pre-paid legal sales on the side.  I know selling pre-paid legal in a multi-level marketing scheme isn't ideal but I'm just glad he's not selling cocaine or getting shot at nowadays."
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 32 more skills"
            ],
            "Recommendations",
            [
                "AGCO Corporation",
                "112,193 followers"
            ],
            [
                "Asian Corporate & Entrepreneur Leaders - ACEL",
                "440 members"
            ],
            [
                "Arizona State University - the official page of the ASU community",
                "45,392 members"
            ],
            [
                "YP, The Real Yellow Pages®",
                "32,438 followers"
            ],
            [
                "HANYU.CO by Spiffy Ventures",
                "16 followers"
            ],
            [
                "Land Brokers Network",
                "650 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "AGCO Corporation",
                "112,193 followers"
            ],
            [
                "AGCO Corporation",
                "112,193 followers"
            ],
            [
                "Asian Corporate & Entrepreneur Leaders - ACEL",
                "440 members"
            ],
            [
                "Asian Corporate & Entrepreneur Leaders - ACEL",
                "440 members"
            ],
            [
                "Arizona State University - the official page of the ASU community",
                "45,392 members"
            ],
            [
                "Arizona State University - the official page of the ASU community",
                "45,392 members"
            ],
            [
                "YP, The Real Yellow Pages®",
                "32,438 followers"
            ],
            [
                "YP, The Real Yellow Pages®",
                "32,438 followers"
            ],
            [
                "HANYU.CO by Spiffy Ventures",
                "16 followers"
            ],
            [
                "HANYU.CO by Spiffy Ventures",
                "16 followers"
            ],
            [
                "Land Brokers Network",
                "650 members"
            ],
            [
                "Land Brokers Network",
                "650 members"
            ]
        ],
        "recommendations": [
            [
                "Dan Withrow",
                "Senior Information Executive with Consulting experience",
                "March 18, 2010, Dan was a client of Clifford’s",
                "Clifford has been a fantastic resource with respect to the number of domains that we currently control.  We moved all of our domains over to Godaddy from a variety of different registrar's and Clifford was there to answer all of our questions and help us with any problems that we had."
            ],
            [
                "Dan Withrow",
                "Senior Information Executive with Consulting experience",
                "March 18, 2010, Dan was a client of Clifford’s"
            ],
            [
                "Dan Withrow",
                "Senior Information Executive with Consulting experience",
                "March 18, 2010, Dan was a client of Clifford’s"
            ],
            [
                "Dan Withrow",
                "Senior Information Executive with Consulting experience",
                "March 18, 2010, Dan was a client of Clifford’s"
            ],
            "Senior Information Executive with Consulting experience",
            [
                "Clifford has been a fantastic resource with respect to the number of domains that we currently control.  We moved all of our domains over to Godaddy from a variety of different registrar's and Clifford was there to answer all of our questions and help us with any problems that we had."
            ],
            [
                "Clifford has been a fantastic resource with respect to the number of domains that we currently control.  We moved all of our domains over to Godaddy from a variety of different registrar's and Clifford was there to answer all of our questions and help us with any problems that we had."
            ],
            [
                "Kim C.",
                "***Aspiring Real Estate Agent*** Licensed Property & Casualty Agent",
                "August 30, 2008, Clifford was a client of Kim’s",
                "It has been a pleasure working with Clifford and having the opportunity to assist him with his marketing campaigns during my time at Internet Brands, Clifford is a very knowledgable and business savey individual who is easy to work with and understands how important it is to havve a solid marketing strategy to grow his business.He has great communication skills and made it very easy to work with him to achievethe goals of his company.I look forward to continuing our business relationship and to be a part of his Companies success ."
            ],
            [
                "Kim C.",
                "***Aspiring Real Estate Agent*** Licensed Property & Casualty Agent",
                "August 30, 2008, Clifford was a client of Kim’s"
            ],
            [
                "Kim C.",
                "***Aspiring Real Estate Agent*** Licensed Property & Casualty Agent",
                "August 30, 2008, Clifford was a client of Kim’s"
            ],
            [
                "Kim C.",
                "***Aspiring Real Estate Agent*** Licensed Property & Casualty Agent",
                "August 30, 2008, Clifford was a client of Kim’s"
            ],
            "***Aspiring Real Estate Agent*** Licensed Property & Casualty Agent",
            [
                "It has been a pleasure working with Clifford and having the opportunity to assist him with his marketing campaigns during my time at Internet Brands, Clifford is a very knowledgable and business savey individual who is easy to work with and understands how important it is to havve a solid marketing strategy to grow his business.He has great communication skills and made it very easy to work with him to achievethe goals of his company.I look forward to continuing our business relationship and to be a part of his Companies success ."
            ],
            [
                "It has been a pleasure working with Clifford and having the opportunity to assist him with his marketing campaigns during my time at Internet Brands, Clifford is a very knowledgable and business savey individual who is easy to work with and understands how important it is to havve a solid marketing strategy to grow his business.He has great communication skills and made it very easy to work with him to achievethe goals of his company.I look forward to continuing our business relationship and to be a part of his Companies success ."
            ],
            [
                "Daniel Mullen",
                "Musician, Consultant, Tech Geek, Vacuum Tube Enthusiast",
                "July 30, 2008, Daniel reported directly to Clifford",
                "Clifford is one of the smartest, most honest and respected people I have ever worked with. He proudly wore many hats in his time at GoDaddy.com. He always had a positive comment and a workable solution for most any problem. Clifford was adored by his peers, clients, coworkers, and customers. I cannot say enough about Clifford. He is a talented mentor and is destined for great things."
            ],
            [
                "Daniel Mullen",
                "Musician, Consultant, Tech Geek, Vacuum Tube Enthusiast",
                "July 30, 2008, Daniel reported directly to Clifford"
            ],
            [
                "Daniel Mullen",
                "Musician, Consultant, Tech Geek, Vacuum Tube Enthusiast",
                "July 30, 2008, Daniel reported directly to Clifford"
            ],
            [
                "Daniel Mullen",
                "Musician, Consultant, Tech Geek, Vacuum Tube Enthusiast",
                "July 30, 2008, Daniel reported directly to Clifford"
            ],
            "Musician, Consultant, Tech Geek, Vacuum Tube Enthusiast",
            [
                "Clifford is one of the smartest, most honest and respected people I have ever worked with. He proudly wore many hats in his time at GoDaddy.com. He always had a positive comment and a workable solution for most any problem. Clifford was adored by his peers, clients, coworkers, and customers. I cannot say enough about Clifford. He is a talented mentor and is destined for great things."
            ],
            [
                "Clifford is one of the smartest, most honest and respected people I have ever worked with. He proudly wore many hats in his time at GoDaddy.com. He always had a positive comment and a workable solution for most any problem. Clifford was adored by his peers, clients, coworkers, and customers. I cannot say enough about Clifford. He is a talented mentor and is destined for great things."
            ],
            [
                "Scott Green",
                "22 years in technology sales and telecommunications. Put my experience to work for you.",
                "April 21, 2008, Scott worked with Clifford in different groups",
                "Clifford is the epitome of business ethics and a true scholar. He's the most reliable and faithful person, boss or colleague that I have had the pleasure to work with. Clifford is a natural leader and extremely devoted to company, customer and peer. I highly recommend Clifford for any business endeavor he chooses. He is someone that I have held the highest regard for. It'd be an honor to work with Clifford Wong in the future and I am sure that time will come."
            ],
            [
                "Scott Green",
                "22 years in technology sales and telecommunications. Put my experience to work for you.",
                "April 21, 2008, Scott worked with Clifford in different groups"
            ],
            [
                "Scott Green",
                "22 years in technology sales and telecommunications. Put my experience to work for you.",
                "April 21, 2008, Scott worked with Clifford in different groups"
            ],
            [
                "Scott Green",
                "22 years in technology sales and telecommunications. Put my experience to work for you.",
                "April 21, 2008, Scott worked with Clifford in different groups"
            ],
            "22 years in technology sales and telecommunications. Put my experience to work for you.",
            [
                "Clifford is the epitome of business ethics and a true scholar. He's the most reliable and faithful person, boss or colleague that I have had the pleasure to work with. Clifford is a natural leader and extremely devoted to company, customer and peer. I highly recommend Clifford for any business endeavor he chooses. He is someone that I have held the highest regard for. It'd be an honor to work with Clifford Wong in the future and I am sure that time will come."
            ],
            [
                "Clifford is the epitome of business ethics and a true scholar. He's the most reliable and faithful person, boss or colleague that I have had the pleasure to work with. Clifford is a natural leader and extremely devoted to company, customer and peer. I highly recommend Clifford for any business endeavor he chooses. He is someone that I have held the highest regard for. It'd be an honor to work with Clifford Wong in the future and I am sure that time will come."
            ],
            [
                "Ivy Shum",
                "Manager at The Farm House",
                "November 18, 2013, Clifford worked with Ivy but at different companies",
                "Four words:  IVY GETS THINGS DONE.I first met Ivy in 2011 when she was helping Hong Kong host a TEDx event.  Over the past couple of years, I've seen Ivy consistently, diligently, and professionally help the Hong Kong start-up community by running the entire operations for the SCC (Small to Medium Enterprise Creative Center) by herself.  She routinely plans, organizes, and facilitates events for SCC and collaborates with others to help Hong Kong host TEDx events.  All this while she's getting her master's degree at PolyU!If I needed an overall Manager or Operations person on my team, I'd hire her in a second.Thanks for all your hard work for the Hong Kong startup community.  We need more people like you.Clifford"
            ],
            [
                "Ivy Shum",
                "Manager at The Farm House",
                "November 18, 2013, Clifford worked with Ivy but at different companies"
            ],
            [
                "Ivy Shum",
                "Manager at The Farm House",
                "November 18, 2013, Clifford worked with Ivy but at different companies"
            ],
            [
                "Ivy Shum",
                "Manager at The Farm House",
                "November 18, 2013, Clifford worked with Ivy but at different companies"
            ],
            "Manager at The Farm House",
            [
                "Four words:  IVY GETS THINGS DONE.I first met Ivy in 2011 when she was helping Hong Kong host a TEDx event.  Over the past couple of years, I've seen Ivy consistently, diligently, and professionally help the Hong Kong start-up community by running the entire operations for the SCC (Small to Medium Enterprise Creative Center) by herself.  She routinely plans, organizes, and facilitates events for SCC and collaborates with others to help Hong Kong host TEDx events.  All this while she's getting her master's degree at PolyU!If I needed an overall Manager or Operations person on my team, I'd hire her in a second.Thanks for all your hard work for the Hong Kong startup community.  We need more people like you.Clifford"
            ],
            [
                "Four words:  IVY GETS THINGS DONE.I first met Ivy in 2011 when she was helping Hong Kong host a TEDx event.  Over the past couple of years, I've seen Ivy consistently, diligently, and professionally help the Hong Kong start-up community by running the entire operations for the SCC (Small to Medium Enterprise Creative Center) by herself.  She routinely plans, organizes, and facilitates events for SCC and collaborates with others to help Hong Kong host TEDx events.  All this while she's getting her master's degree at PolyU!If I needed an overall Manager or Operations person on my team, I'd hire her in a second.Thanks for all your hard work for the Hong Kong startup community.  We need more people like you.Clifford"
            ],
            [
                "Mike Jackson",
                "Manager, Strategic Accounts Support at Powerschool",
                "June 27, 2013, Clifford managed Mike directly",
                "I had the opportunity to have Mike Jackson on my team at GoDaddy.com while he worked as an Account Manager to GoDaddy's large domain customers.  He was a steady performer on the team and could always be trusted to contact his customers in a timely manner and keep them on board with GoDaddy domain services.  If I had another sales / account management team to manage, I would gladly have him aboard again.  Keep up the good work Mike!"
            ],
            [
                "Mike Jackson",
                "Manager, Strategic Accounts Support at Powerschool",
                "June 27, 2013, Clifford managed Mike directly"
            ],
            [
                "Mike Jackson",
                "Manager, Strategic Accounts Support at Powerschool",
                "June 27, 2013, Clifford managed Mike directly"
            ],
            [
                "Mike Jackson",
                "Manager, Strategic Accounts Support at Powerschool",
                "June 27, 2013, Clifford managed Mike directly"
            ],
            "Manager, Strategic Accounts Support at Powerschool",
            [
                "I had the opportunity to have Mike Jackson on my team at GoDaddy.com while he worked as an Account Manager to GoDaddy's large domain customers.  He was a steady performer on the team and could always be trusted to contact his customers in a timely manner and keep them on board with GoDaddy domain services.  If I had another sales / account management team to manage, I would gladly have him aboard again.  Keep up the good work Mike!"
            ],
            [
                "I had the opportunity to have Mike Jackson on my team at GoDaddy.com while he worked as an Account Manager to GoDaddy's large domain customers.  He was a steady performer on the team and could always be trusted to contact his customers in a timely manner and keep them on board with GoDaddy domain services.  If I had another sales / account management team to manage, I would gladly have him aboard again.  Keep up the good work Mike!"
            ]
        ],
        "skills": [
            [
                "E-commerce",
                "See 83 endorsements for E-commerce",
                "83",
                "E-commerce",
                "Endorse",
                "Endorsed by Raj Nijjer, who is highly skilled at this",
                "Endorsed by Jennifer Davis and 4 other mutual connections"
            ],
            [
                "E-commerce",
                "See 83 endorsements for E-commerce",
                "83"
            ],
            [
                "Management",
                "See 37 endorsements for Management",
                "37",
                "Management",
                "Endorse",
                "Endorsed by Clark Ishihara, who is highly skilled at this",
                "Endorsed by Steven Templeman (mutual connection)"
            ],
            [
                "Management",
                "See 37 endorsements for Management",
                "37"
            ],
            [
                "SEO",
                "See 36 endorsements for SEO",
                "36",
                "SEO",
                "Endorse",
                "Endorsed by Zach Ferres, who is highly skilled at this",
                "Endorsed by Zach Ferres (mutual connection)"
            ],
            [
                "SEO",
                "See 36 endorsements for SEO",
                "36"
            ]
        ],
        "summary": "    I enjoy fixing problems and implementing processes to ensure long term sustainability.10+ years running an eCommerce lighting business with customers around the world and creating a lead generation service for 300+ business across the country in the automotive industry.  The lighting business is in autopilot mode with customer service handled on the East Coast and order fulfillment done by a West Coast company while the lead generation service runs automatically.5+ years at GoDaddy.com building revenue by starting their Retention team, turning their Billing department into a profit center, training sales teams, and managing software development road maps for products in an agile environment with frequent releases to fit the needs of internal and external customers.Specialties: Inspiring teams to accomplish great things, eCommerce implementation, organic SEO, guerrilla marketing and branding, overseas sourcing, end-to-end CEM, and product management.\n  \n  \n",
        "name": "Clifford Wong",
        "title": "Senior Product Manager at Infusionsoft",
        "url": "linkedin.com/in/cliffordw",
        "phone": "+1 602.300.7153 (Mobile)",
        "email": "cliffordjwong@gmail.com"
    }
]