[
    {
        "experience": [
            "Highlights",
            [
                "60 Mutual Connections",
                "You and Shane both know Ed Nusbaum, Cliff Schertz, and 58 others"
            ],
            [
                "UP announced as Elite WMA Award Winners for 2017",
                "Shane liked"
            ],
            [
                "I get a lot of responses to my sales emails saying \"i'm working with a freelancer who's 1/4 the price of you, so no thanks\".",
                "This is always a shock to me. The fact that they value the creative art of writing so little that they will pay a writer pennies per word to write for them is remarkable.",
                "They are working with human beings, yet they are paying rates that can be compared to a sweatshop. Those aren't the type of people we want to work with anyway.",
                "Shane commented"
            ],
            [
                "Arizona Start-Up & Entrepreneur Network",
                "1,795 members"
            ],
            [
                "Business Insider",
                "3,232,105 followers"
            ],
            [
                "UXPA - User Experience Professionals Association International",
                "28,562 members"
            ],
            [
                "Hotel Industry Professionals Worldwide",
                "321,900 members"
            ],
            [
                "Entrepreneur Media",
                "1,702,010 followers"
            ],
            [
                "Inc. Magazine",
                "1,812,271 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Arizona Start-Up & Entrepreneur Network",
                "1,795 members"
            ],
            [
                "Arizona Start-Up & Entrepreneur Network",
                "1,795 members"
            ],
            [
                "Business Insider",
                "3,232,105 followers"
            ],
            [
                "Business Insider",
                "3,232,105 followers"
            ],
            [
                "UXPA - User Experience Professionals Association International",
                "28,562 members"
            ],
            [
                "UXPA - User Experience Professionals Association International",
                "28,562 members"
            ],
            [
                "Hotel Industry Professionals Worldwide",
                "321,900 members"
            ],
            [
                "Hotel Industry Professionals Worldwide",
                "321,900 members"
            ],
            [
                "Entrepreneur Media",
                "1,702,010 followers"
            ],
            [
                "Entrepreneur Media",
                "1,702,010 followers"
            ],
            [
                "Inc. Magazine",
                "1,812,271 followers"
            ],
            [
                "Inc. Magazine",
                "1,812,271 followers"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "    Volo Digital (volodigital.com) is a team of technology visionaries, interactive design pioneers and internet marketing strategists who design, build, and launch groundbreaking digital products. Our digital design solutions give you an edge over your competition and strengthen your customer base. We achieve this by providing apps and websites that feature intuitive UI/UX and can scale as your business grows..Shane's extensive enterprise-level website and product experience—beginning with business strategy, UX and UI design and continuing through development, deployment and support—have made him a sought-after resource in the digital space.Having successfully launched several companies along with having expertise in raising capital and navigating mergers and acquisitions, Shane has been featured as a guest speaker and panelist at numerous tech and travel industry events. His work has received high acclaim and numerous awards. Beyond conceiving and developing new products, Shane is an avid car enthusiast and cyclist, and values time spent with his family and serving others.\n  \n  \n",
        "name": "Shane Ettestad",
        "title": "CEO of Volo Digital, Creator of Digital Products & Platforms",
        "url": "linkedin.com/in/shaneettestad",
        "phone": "480-620-9333 (Mobile)",
        "email": "shane@volodigital.com"
    }
]