[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "46 Mutual Connections",
                "You and Wing both know Jim Skidmore, Luma Dahlbacka, and 44 others"
            ],
            [
                "You both worked at Charles Schwab",
                "You both worked at Charles Schwab from Nov 2016 to Feb 2017"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Technical Director",
                "Company Name",
                "Charles Schwab",
                "Dates Employed",
                "Mar 2011 – Present",
                "Employment Duration",
                "6 yrs 9 mos",
                "●\tSolution architect to Schwab.com Client Center, one of the highly-rate brokerage sites in the industry.  The sites include big web, mobile web with responsive design, and micro-ui and multiple hosting environments.  Am passionate in providing software solutions to end clients and product owners.   ●\tOne of 4 directors that provide technical leadership to an organization with 200+ onshore and offshore resources.  Define development standards and practices, TDD and ATDD, and CI/CD.  And define development cycle and release processes and schedule.●\tExtensive knowledge and effectively leading development teams onshore, offshore, multi-sites and colocation.  Foster team efficiency and effectiveness in traditional web pages, single page application with JavaScript, mid-tier web services and API.●\tExtensive experience working with product owners and business leaders, ability to effect changes across organizations and teams.●\tLocal governance and architectural reviews, ability to evaluate project design quickly and provide constructive feedback while enforcing standards.  Ability to evaluate 3rd party software and open source and deciding on adoption path and make proper recommendations.●\tBroad and in-depth experience in Agile development and SCRUM process, also in traditional SDLC mini waterfall processes, and familiar with lean management practices.●\tThe organization is mainly Windows environment with C# being the main language with SQL Server, AppFabric, Oracle DB, IIS, MongoDB, Redis, and good experience in a variety of tools and packages:  JQuery, Angular, RabbitMQ, NodeJs, NPM, Gulp/Grunt, Visual Studio, Visual Code, Atlassian’s toolsets (Jira, Bitbucket, Confluence, Hipchat, Bamboo), in-house CMS system and Acquia’s Drupal, Akamai hosting, PCF (Pivotal Cloud Foundry, internal cloud), IBM AppScan security, Resharper code analysis, Visio, Splunk, Fiddler, and others."
            ],
            [
                "Technical Lead",
                "Company Name",
                "Charles Schwab",
                "Dates Employed",
                "Jun 2006 – Mar 2012",
                "Employment Duration",
                "5 yrs 10 mos",
                "Location",
                "San Francisco Bay Area",
                "●\tLed teams to develop Schwab.com client center applications, this included design, coding, guidance to development members and others.  Applications included accounts summary, positions, gain/loss, history, balances, message center, retirement assessment, and many others.●\tLine of business technical owner (LTO) of a portion of Schwab.com client center applications, technical ownership of applications, provided guideline, overall design, and made sure teams adhere to standards and framework.  Reviewed design and code, including security, performance and availability, and other implementation quality measurements. Main contact to product owners and management.●\tLed development team to create CRUD services to provide preferences ability to clients, and flexibility to product owners for features toggling, decision flow, and measurement.●\tPart of team that created the development and release life cycle, the desire to do CI (continuous integration) and quick to market were met with 2-week release cycle. ●\tTGO reviews, local governance review of all projects and initiatives.  Proactive in taking the reviews seriously, that meant took the time to listen and understand a project team approach, reviewed documentations, before advice and constraint were given.●\tThe main language was Java but was transitioning to C# as an organization and also firm wide.  C# Web Forms, MVC, JavaScript, with IIS hosting in Windows Servers."
            ],
            [
                "Web Developer",
                "Company Name",
                "Charles Schwab",
                "Dates Employed",
                "Dec 2000 – Jun 2006",
                "Employment Duration",
                "5 yrs 7 mos",
                "Location",
                "San Francisco Bay Area",
                "●\tPart of several teams that developed complex web applications: Balances, Options Trading, Google IPO, AIP, Fixed Income, and Message Inbox on Schwab.com client center.●\tEnhanced, maintained and developed Schwab.com client center online trading applications, and part of the team as the first-line call support for the online trading system.  Maintained and enhanced stocks, options, mutual funds, IPO, bonds, and CDs trading pages.  Maintained and enhanced position, history, performance, transaction status, and many other pages within the main trading system.  ●\tDeveloped new options trading pages.●\tSupported, maintained, and developed offshore online trading systems.  Supported multi-language and multi-segmented trading systems.●\tDeveloped online internal leads system.●\tThe main development language were in C and Java, with XML, XSL, JSP, HTML, Perl and JavaScript in UNIX."
            ],
            [
                "Independent Web Developer/Consultant",
                "Company Name",
                "Self-Employed",
                "Dates Employed",
                "Apr 2000 – Dec 2000",
                "Employment Duration",
                "9 mos",
                "Location",
                "San Francisco Bay Area",
                "Developed and integrated web applications for startups and corporations.  Consulted on web application design, development, technical strategy, and multi-tiers integration."
            ],
            [
                "Senior System Analyst, Web Applications Development",
                "Company Name",
                "First Health",
                "Dates Employed",
                "Apr 1998 – Jul 2000",
                "Employment Duration",
                "2 yrs 4 mos",
                "Location",
                "West Sacramento, CA",
                "●\tAnalyzed, designed, and developed web applications.  Included roles of project lead, system analyst, and programmer.●\tResponsible for building a web application to deliver claims processing justifications to external clients and internal colleagues.  The project replaced an outside vendor’s product and had a cost saving of approximately $20 million annually to our clients.  Led the design, development, and implementation of the project—in charge of specifying and scheduling of project tasks; and also ended up doing most of the programming work with the shortage of staff.  Majority of the development was in C, embedded SQL in Oracle and Ingres, JavaScript, and HTML.●\tPart of a team that built and maintained corporate intranet and intranet applications:  phone list, stock quotes, timesheet, HR forms, job listing, and others with a mixture of development environments in UNIX, NT, and VMS running IISs on NT and Netscape servers on UNIX. ●\tActed as the main analyst for extending corporate applications to external clients and field personnel via web applications and VPN.  Projects included applications to display demographic information to network physicians and allowing them to make changes, customary fee querying tool deploying to clients, and querying tool for network physicians to validate contract status.●\tPart of a team that built and maintained global application routines in C to support web development, maintained external corporate site, specified web development standards for the company, reviewed and recommended web development tools and technologies."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "California State University-Sacramento",
                "Degree Name",
                "Bachelor of Science (BS)",
                "Field Of Study",
                "Computer/Information Technology Administration and Management",
                "Dates attended or expected graduation",
                "1989 – 1992"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            "Recommendations",
            [
                "Couture-Search LLC",
                "937 followers"
            ],
            [
                "Walt BettingerWalt Bettinger is a LinkedIn Influencer",
                "President & CEO at Charles Schwab",
                "152,847 followers"
            ],
            [
                "Charles Schwab",
                "104,635 followers"
            ],
            [
                "California State University-Sacramento",
                "128,356 followers"
            ],
            [
                "Adobe",
                "769,198 followers"
            ],
            [
                "California State University-Sacramento",
                "135,829 followers"
            ],
            [
                "See connections (277)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Couture-Search LLC",
                "937 followers"
            ],
            [
                "Couture-Search LLC",
                "937 followers"
            ],
            [
                "Walt BettingerWalt Bettinger is a LinkedIn Influencer",
                "President & CEO at Charles Schwab",
                "152,847 followers"
            ],
            [
                "Walt BettingerWalt Bettinger is a LinkedIn Influencer",
                "President & CEO at Charles Schwab",
                "152,847 followers"
            ],
            [
                "Walt Bettinger is a LinkedIn Influencer"
            ],
            [
                "Charles Schwab",
                "104,635 followers"
            ],
            [
                "Charles Schwab",
                "104,635 followers"
            ],
            [
                "California State University-Sacramento",
                "128,356 followers"
            ],
            [
                "California State University-Sacramento",
                "128,356 followers"
            ],
            [
                "Adobe",
                "769,198 followers"
            ],
            [
                "Adobe",
                "769,198 followers"
            ],
            [
                "California State University-Sacramento",
                "135,829 followers"
            ],
            [
                "California State University-Sacramento",
                "135,829 followers"
            ]
        ],
        "recommendations": [
            [
                "David Wang",
                "Business Quality Analyst | Testing Project Manager",
                "February 21, 2017, David worked with Wing in different groups",
                "I was a QA lead as Wing's counterpart on numerous projects at Charles Schwab.  Wing is an extremely experienced tech lead. He takes great pride in his work, and always works tirelessly in finding the best solutions to produce high profile customer-facing applications.  Every time I log in to the Schwab.com trading site, I marvel at the applications that Wing had worked on over the years. These products are so intuitive to use, yet I know they involved a great amount of cross-organizational coordination and effort. Wing is the ultimate team player. He shares knowledge with a group of junior level software developers, and engages them in the best software development process. He's very approachable, and can explain technically complicated software architecture to a non-technical audience.  I feel very lucky to have worked with Wing during my tenure at Schwab."
            ],
            [
                "David Wang",
                "Business Quality Analyst | Testing Project Manager",
                "February 21, 2017, David worked with Wing in different groups"
            ],
            [
                "David Wang",
                "Business Quality Analyst | Testing Project Manager",
                "February 21, 2017, David worked with Wing in different groups"
            ],
            [
                "David Wang",
                "Business Quality Analyst | Testing Project Manager",
                "February 21, 2017, David worked with Wing in different groups"
            ],
            "Business Quality Analyst | Testing Project Manager",
            [
                "I was a QA lead as Wing's counterpart on numerous projects at Charles Schwab.  Wing is an extremely experienced tech lead. He takes great pride in his work, and always works tirelessly in finding the best solutions to produce high profile customer-facing applications.  Every time I log in to the Schwab.com trading site, I marvel at the applications that Wing had worked on over the years. These products are so intuitive to use, yet I know they involved a great amount of cross-organizational coordination and effort. Wing is the ultimate team player. He shares knowledge with a group of junior level software developers, and engages them in the best software development process. He's very approachable, and can explain technically complicated software architecture to a non-technical audience.  I feel very lucky to have worked with Wing during my tenure at Schwab."
            ],
            [
                "I was a QA lead as Wing's counterpart on numerous projects at Charles Schwab.  Wing is an extremely experienced tech lead. He takes great pride in his work, and always works tirelessly in finding the best solutions to produce high profile customer-facing applications.  Every time I log in to the Schwab.com trading site, I marvel at the applications that Wing had worked on over the years. These products are so intuitive to use, yet I know they involved a great amount of cross-organizational coordination and effort. Wing is the ultimate team player. He shares knowledge with a group of junior level software developers, and engages them in the best software development process. He's very approachable, and can explain technically complicated software architecture to a non-technical audience.  I feel very lucky to have worked with Wing during my tenure at Schwab."
            ],
            [
                "Gina Lange",
                "Director, Application Software Development at Workday",
                "February 20, 2017, Gina managed Wing directly",
                "Wing is a talented and extremely strong technical leader. He is capable of motivating and directing teams of developers.  He quickly earns the respect of management and his peers. He is committed to delivery, works amazingly well with the business, and is customer focused.  When I worked with him he always went above and beyond to deliver for our business.  I would work with him again in a heartbeat."
            ],
            [
                "Gina Lange",
                "Director, Application Software Development at Workday",
                "February 20, 2017, Gina managed Wing directly"
            ],
            [
                "Gina Lange",
                "Director, Application Software Development at Workday",
                "February 20, 2017, Gina managed Wing directly"
            ],
            [
                "Gina Lange",
                "Director, Application Software Development at Workday",
                "February 20, 2017, Gina managed Wing directly"
            ],
            "Director, Application Software Development at Workday",
            [
                "Wing is a talented and extremely strong technical leader. He is capable of motivating and directing teams of developers.  He quickly earns the respect of management and his peers. He is committed to delivery, works amazingly well with the business, and is customer focused.  When I worked with him he always went above and beyond to deliver for our business.  I would work with him again in a heartbeat."
            ],
            [
                "Wing is a talented and extremely strong technical leader. He is capable of motivating and directing teams of developers.  He quickly earns the respect of management and his peers. He is committed to delivery, works amazingly well with the business, and is customer focused.  When I worked with him he always went above and beyond to deliver for our business.  I would work with him again in a heartbeat."
            ],
            [
                "Debasmita Lahari",
                "Actively seeking for Lead QA / Business Analyst opportunities",
                "June 20, 2017, Wing was a client of Debasmita’s",
                "Debasmita is a strong QA lead who is especially skillful in Agile process.  She is engaging, thoughtful, and a leader in software development.  She was always helpful to others and friendly to other team members.  I really appreciated her boldness and engaging manner in stories boarding and discussions."
            ],
            [
                "Debasmita Lahari",
                "Actively seeking for Lead QA / Business Analyst opportunities",
                "June 20, 2017, Wing was a client of Debasmita’s"
            ],
            [
                "Debasmita Lahari",
                "Actively seeking for Lead QA / Business Analyst opportunities",
                "June 20, 2017, Wing was a client of Debasmita’s"
            ],
            [
                "Debasmita Lahari",
                "Actively seeking for Lead QA / Business Analyst opportunities",
                "June 20, 2017, Wing was a client of Debasmita’s"
            ],
            "Actively seeking for Lead QA / Business Analyst opportunities",
            [
                "Debasmita is a strong QA lead who is especially skillful in Agile process.  She is engaging, thoughtful, and a leader in software development.  She was always helpful to others and friendly to other team members.  I really appreciated her boldness and engaging manner in stories boarding and discussions."
            ],
            [
                "Debasmita is a strong QA lead who is especially skillful in Agile process.  She is engaging, thoughtful, and a leader in software development.  She was always helpful to others and friendly to other team members.  I really appreciated her boldness and engaging manner in stories boarding and discussions."
            ],
            [
                "Joseph C. Lin, PMP, CSPO",
                "Seasoned Agile Online Product/Project Management Professional | Web Development/Digital User Experience Expert",
                "February 16, 2016, Wing worked with Joseph in different groups",
                "Joseph is a great product owner.  He works very hard to prepare himself to lead the team from a product owner perspective.  He spends many, many hours before formal project kickoff.  He'd talk to designers, to get their feel for the overall design, and make his inputs known to them.  Then he'd spend many hours with tech lead/architects to understand the constraints on a system.  And obviously he works hard to understand management perspective of the product.  When he has all of those down, then would he prepare his documentations and draft user stories to present to entire team.Joseph is very hard working individual, very smart and can understand technology challenges--which as a technologist I really appreciate."
            ],
            [
                "Joseph C. Lin, PMP, CSPO",
                "Seasoned Agile Online Product/Project Management Professional | Web Development/Digital User Experience Expert",
                "February 16, 2016, Wing worked with Joseph in different groups"
            ],
            [
                "Joseph C. Lin, PMP, CSPO",
                "Seasoned Agile Online Product/Project Management Professional | Web Development/Digital User Experience Expert",
                "February 16, 2016, Wing worked with Joseph in different groups"
            ],
            [
                "Joseph C. Lin, PMP, CSPO",
                "Seasoned Agile Online Product/Project Management Professional | Web Development/Digital User Experience Expert",
                "February 16, 2016, Wing worked with Joseph in different groups"
            ],
            "Seasoned Agile Online Product/Project Management Professional | Web Development/Digital User Experience Expert",
            [
                "Joseph is a great product owner.  He works very hard to prepare himself to lead the team from a product owner perspective.  He spends many, many hours before formal project kickoff.  He'd talk to designers, to get their feel for the overall design, and make his inputs known to them.  Then he'd spend many hours with tech lead/architects to understand the constraints on a system.  And obviously he works hard to understand management perspective of the product.  When he has all of those down, then would he prepare his documentations and draft user stories to present to entire team.Joseph is very hard working individual, very smart and can understand technology challenges--which as a technologist I really appreciate."
            ],
            [
                "Joseph is a great product owner.  He works very hard to prepare himself to lead the team from a product owner perspective.  He spends many, many hours before formal project kickoff.  He'd talk to designers, to get their feel for the overall design, and make his inputs known to them.  Then he'd spend many hours with tech lead/architects to understand the constraints on a system.  And obviously he works hard to understand management perspective of the product.  When he has all of those down, then would he prepare his documentations and draft user stories to present to entire team.Joseph is very hard working individual, very smart and can understand technology challenges--which as a technologist I really appreciate."
            ]
        ],
        "skills": [
            [
                "SDLC",
                "See 26 endorsements for SDLC",
                "26",
                "SDLC",
                "Endorse",
                "Endorsed by Gina Lange and 1 other who is highly skilled at this",
                "Endorsed by David Wang and 2 other mutual connections"
            ],
            [
                "SDLC",
                "See 26 endorsements for SDLC",
                "26"
            ]
        ],
        "summary": "    Passionate in providing software solutions.Lead and guide development teams in co-located, multi-sites located, and offshore.Establish standards, process for the SDLC.Interact with business and product owners.Evaluate technology platforms, solutions, and software packages.\n  \n  \n",
        "name": "Wing Hoang",
        "title": "Technical Director at Charles Schwab",
        "url": "linkedin.com/in/wing-hoang-25a0462",
        "phone": "",
        "email": "whoang6688@gmail.com"
    }
]