[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "148 Mutual Connections",
                "You and Tejas both know Armando Viteri, Lance Klem, and 146 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Senior Business Analyst / Market Research",
                "Company Name",
                "Collabera",
                "Dates Employed",
                "Oct 2011 – Present",
                "Employment Duration",
                "6 yrs 5 mos",
                "Location",
                "Morristown, NJ",
                "About CollaberaCollabera is ranked amongst the top 10 Information Technology (IT) staffing firms in the U.S., with more than $550 million in sales revenue and a global presence that represents approximately 12,000+ professionals across North America (U.S., Canada), Asia Pacific (India, Philippines, Singapore, Malaysia) and the United Kingdom.  We support our clients with a strong recruitment model and a sincere commitment to their success, which is why more than 75% of our clients rank us amongst their top three staffing suppliers. Not only are we committed to meeting and exceeding our customer’s needs, but also are committed to our employees’ satisfaction as well.  We believe our employees are the cornerstone of our success and we make every effort to ensure their satisfaction throughout their tenure with Collabera.  As a result of these efforts, we have been recognized by Staffing Industry Analysts (SIA) as the “Best Staffing Firm to Work For” for five consecutive years since 2012. Collabera has over 40 offices across the globe with a presence in seven countries and provides staff augmentation, managed services and direct placement services to global 2000 corporations. For consultants and employees, Collabera offers an enriching experience that promotes career growth and lifelong learning.  Visit www.collabera.com to learn more about our latest job openings. Awards and Recognitions--Staffing Industry Analysts: Best Staffing Firm to Work For (2016, 2015, 2014, 2013, 2012)--Staffing Industry Analysts: Largest U.S. Staffing Firms (2016, 2015, 2014, 2013)--Staffing Industry Analysts: Largest Minority Owned IT Staffing Firm in the US."
            ],
            [
                "Senior Business Analyst / Market Research",
                "Company Name",
                "Collabera",
                "Dates Employed",
                "Oct 2011 – Present",
                "Employment Duration",
                "6 yrs 5 mos",
                "Roles and Responsibilities:\t•\tResponsible for conducting business research both secondary and primary research •\tResearching on business feasibility in new areas•\tResearching legal and administrative requirements for delivery•\tPreparing research documents, analysis reports & prepare presentations•\tWorking for Executive Leadership Team Doing Research, Analysis, Automated report for them.•\tWorking on Datazen, PowerBI Tool (Business Intelligence dashbaord and data analytics)•\tPreparing Analytical Dashboard for top management by using PowerBI tool & SQL query.•\tWorking closely with MIS / Devloper to prepare/customize report , database related changes etc.•\tAnalyzing latest market trends and tracking competitors•\tI have multitasking experience in market research, recruitment, data analysis & business analysis•\tContinuous research for competitive products/services/vendors•\tConducting various marketing activities like blog marketing, email marketing, classifieds•\tPublishing industry happenings.•\tReport Generation•\tA part from these I am also good at sourcing (resume screening) candidate where challenge found to fill the requirement for clients & our corporate location.•                Project framing - the ability to clearly define the internal client issue that leads to the appropriate project scope and planning•                Understanding customer wants and needs•                Analyzing the competitive landscape•                Assessing the marketplace•                Identifying emerging growth trends and opportunities across various dimensions including: economic, technological, financial, cultural and other market segments, competitive, partnerships and alliances, and customer value attributesAchievement:Got Qtrly & Yearly Best Performance Award"
            ],
            [
                "Assistant Unit Manager",
                "Company Name",
                "Mphasis",
                "Dates Employed",
                "May 2009 – Oct 2011",
                "Employment Duration",
                "2 yrs 6 mos",
                "Location",
                "Vadodara Area, India",
                "Managed team of 26 people (CSO) Preparation of daily, weekly, monthly reports of agent performance Report pulling from different software & analysis for the sameGood Analytical ability To allocate roles and responsibilities to team members based on their ability and experience To nominate team members for training for time to time To perform analysis to identify root causes. Recommend & execute suitable actions. Made process improvement to ensure delivery on all performance. Gathered best practices from other team. Set goals for team and communicate goals. Conducted one on one meeting with team members and give feedback. Conducted annual performance review.Achievement- Got Summit Awared for Best Performance- Received Quarterly cross functional Award for best performance for ramp up new tele media process in Feb 2011."
            ],
            [
                "Senior Research Analyst",
                "Company Name",
                "Sterling hoffman software consultant service pvt. Ltd",
                "Dates Employed",
                "Mar 2005 – Apr 2009",
                "Employment Duration",
                "4 yrs 2 mos",
                "Location",
                "Vadodara",
                "Senior Research Analyst\tI had Worked on Canadian engineering company accounts to identify quality executives in sales, marketing, quality, Six Sigma, operations, IT, business development, general management and various roles\tResearched current market trends as well as get new business by searching new companies\tGenerated new leads and business opportunities and brought them to fruition through a combination of strategic analysis, marketing campaigns, information management\tCompiled data through national market research to gain business intelligence within the staffing industry & maintain quality of work\tI have Prepared of weekly, monthly and quarterly reports for recruitment\tAnalysis of Market, Processes, positions\tSearching new companies for new business development, Research on Companies Strategies\tParticipated in e-mail campaigns to candidates and companies to get active candidates and generate leads resulting in new accounts and business development\tMeasurement and analysis of online marketing campaigns\tMaintained database by new data entry, updation, searched by query\tMaintain Candidate, Companies and its executives Database for execution of monthly campaigns\tWork on priority job orders where its hard to find right candidates\tDo extensive resume sourcing and client development.\tPreparing scripts for marketing candidates.\tWorked on wide range of online data mining projects on portals like monster, hotjobs, careerbuilder, workopolis, hoovers, scottsinfoResearch Associate / Analyst\tIdentifying sources of potential candidates in Canadian market and designing of strategy to meet the targets in different skill categories on time\tConduct Internet search using Yahoo, Google, MSN and others\tPosting Job orders in various job sites\tFinding and delivering Internet Leads\tManaged and drived candidate and client email campaignAchievement:  Winner of best employee awards"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "The Maharaja Sayajirao University of Baroda"
            ],
            [
                "The Maharaja Sayajirao University of Baroda"
            ],
            [
                "utkarsh vidhyalaya"
            ],
            [
                "utkarsh vidhyalaya"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "Show more"
            ],
            "Recommendations",
            [
                "Java Developers",
                "442,289 members"
            ],
            [
                "Market Research Field Directors/Field Management Pros/Data Collection Vets/On-line & Off-line",
                "24,345 members"
            ],
            [
                "IAAI (I Accept All Invites)",
                "389 members"
            ],
            [
                "Java/JEE Enthusiasts",
                "66,114 members"
            ],
            [
                "The Recruiter.com Network -#1 Recruiting, Career, Jobs, HR Social Media & Recruitment Business Group",
                "1,036,229 members"
            ],
            [
                "LUXURYRECRUIT for Fashion & Luxury Professionals",
                "101,367 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Java Developers",
                "442,289 members"
            ],
            [
                "Java Developers",
                "442,289 members"
            ],
            [
                "Market Research Field Directors/Field Management Pros/Data Collection Vets/On-line & Off-line",
                "24,345 members"
            ],
            [
                "Market Research Field Directors/Field Management Pros/Data Collection Vets/On-line & Off-line",
                "24,345 members"
            ],
            [
                "IAAI (I Accept All Invites)",
                "389 members"
            ],
            [
                "IAAI (I Accept All Invites)",
                "389 members"
            ],
            [
                "Java/JEE Enthusiasts",
                "66,114 members"
            ],
            [
                "Java/JEE Enthusiasts",
                "66,114 members"
            ],
            [
                "The Recruiter.com Network -#1 Recruiting, Career, Jobs, HR Social Media & Recruitment Business Group",
                "1,036,229 members"
            ],
            [
                "The Recruiter.com Network -#1 Recruiting, Career, Jobs, HR Social Media & Recruitment Business Group",
                "1,036,229 members"
            ],
            [
                "LUXURYRECRUIT for Fashion & Luxury Professionals",
                "101,367 members"
            ],
            [
                "LUXURYRECRUIT for Fashion & Luxury Professionals",
                "101,367 members"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Recruiting",
                "See 194 endorsements for Recruiting",
                "99+",
                "Recruiting",
                "Endorse",
                "Endorsed by Michele Field and 4 others who are highly skilled at this",
                "Endorsed by Anil Reddy and 1 other mutual connection"
            ],
            [
                "Recruiting",
                "See 194 endorsements for Recruiting",
                "99+"
            ],
            [
                "Sourcing",
                "See 144 endorsements for Sourcing",
                "99+",
                "Sourcing",
                "Endorse",
                "Endorsed by Kranthi Bheemanadam and 4 others who are highly skilled at this",
                "Endorsed by Jay Witherspoon (mutual connection)"
            ],
            [
                "Sourcing",
                "See 144 endorsements for Sourcing",
                "99+"
            ],
            [
                "Market Research",
                "See 140 endorsements for Market Research",
                "99+",
                "Market Research",
                "Endorse",
                "Endorsed by Nelson Davis and 1 other who is highly skilled at this",
                "Endorsed by Srinivas SP (mutual connection)"
            ],
            [
                "Market Research",
                "See 140 endorsements for Market Research",
                "99+"
            ]
        ],
        "summary": "    Solution driven, result oriented professional with over 16 years of focused extensive\n      \n      experience in Market Research & Data/Business Analysis,QA,Management. Worked with to...\n        \n\n...",
        "name": "Tejas Patel",
        "title": "Senior Business Analyst / Market Research",
        "url": "",
        "phone": "",
        "email": ""
    }
]