[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "33 Mutual Connections",
                "You and Travis both know Eric Keosky-Smith, Mark Goldstein, and 31 others"
            ],
            [
                "10 Commandments of Successfully Managing a Business Crisis",
                "Travis shared this"
            ],
            [
                "Don’t tax options and RSUs upon vesting! (I just talked to my senators office)",
                "Travis shared this"
            ],
            [
                "The (Only) Three Roles You Should Expect Your Career Mentor To Play",
                "Travis shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Senior Strategic Enterprise Value Advisor",
                "Company Name",
                "Marketo",
                "Dates Employed",
                "Sep 2015 – Present",
                "Employment Duration",
                "2 yrs 3 mos",
                "Location",
                "Charlotte, North Carolina Area",
                "Part of a strategic team serving global enterprises with education and tailored engagements which reveal digital transformation's potential to their business.🔥IMPACT: Led business transformation engagements with top enterprises, influencing opportunities which led to $8M IN REVENUE.Key contributor in a strategic team focused on: 🎯 [Externally]» LOGO ACQUISITION- Positioning for multi-year contracts of key global 2000 logos.» OPPORTUNITY INFLUENCE- Subject Matter Expertise and genuine care results in expanding and accelerating opportunities. Team revenue influence contribution of $70M+ (2016).» ART OF POSSIBLE- Providing customized talking points of prospective customers (Point of View documents) and customer examples of how engagement marketing serves as a strategic lever in achieving their business objectives.» BRANDING- Sharing expertise externally as presenter at conferences, workshops, and social media. 🎯 [Internally]» LEADERSHIP- Guiding Sales Executives through a proven process to penetrate and lead prospective customers through a value engagement designed to discover their digital transformation story and economic potential.» COLLABORATION- Working cross-departmentally to facilitate one voice to the customer (C-Suite/Sales/PM/PMM/CS/PS). » SELF-SERVICE- Providing self-service enablement content available to all sales organizations in the company.⚙️ Serving the following industries:» High-tech » Telecom » Automotive » Manufacturing » Non-Profit » Healthcare (provider/payer) » CPG » Financial Services » Education » Media and Entertainment"
            ],
            [
                "VP of Marketing for Hire, Technology Evangelist, and Strategic Digital Advisor",
                "Company Name",
                "MarketingProfessor.com",
                "Dates Employed",
                "Oct 2008 – Sep 2015",
                "Employment Duration",
                "7 yrs",
                "Location",
                "Greater Denver Area",
                "🔥IMPACT: Zero revenue to six-figure income in nine months. Applied proven strategies powered by marketing automation technology.Published digital marketing tips and strategies which converted traffic, grew sales, built a brand, created products and numerous speaking opportunities.» STARTUP TO PROFIT: Zero revenue to six-figure income in nine months. Applied proven strategies powered by marketing automation software.» LEAD QUALIFICATION: Successful campaign of driving qualified prospects to partner sales teams, averaging $500 to $2000 per sale.» MARKETING AUTOMATION: Implemented comprehensive automation software & optimized making website an autopilot passive revenue generator.» CONTENT STRATEGY & COURSE CREATION: Created multiple online courses, and developed a strategic content publishing plan to maximize success of the launch. » PUBLIC SPEAKING: Presented at 40+ workshops and several regional and national conferences/events with audiences of 20 to 2000 attendees.» SOCIAL MEDIA: Took personal public figure Facebook page to 100+K likes in 45 days, grew other social profiles to over 50,000 followers."
            ],
            [
                "VP of Marketing - SaaS Company",
                "Company Name",
                "Alt10",
                "Dates Employed",
                "Jun 2014 – Mar 2015",
                "Employment Duration",
                "10 mos",
                "Location",
                "Greater Denver Area",
                "🔥IMPACT: 20.2% conversion and internal momentum going into the next phase, created buzz with investors, and springboard for angel investor discussions.Leading product launch and strategic initiatives, leveraging technology and marketing automation to attract, & convert web visitors to lifetime customers.» LAUNCH EXECUTION: \"Roll up sleeves\" mentality in executing strategy with team over several weeks. Leveraged marketing automation to inform appropriate launch activities. » STRATEGIC GO-TO-MARKET PLAN: Developed plan bringing product to market through a beta user group. Including traffic conversion strategy (coordinating with Dev team), email marketing strategy, and a technical support strategy designed to \"fascinate\" customers.» METRICS DEVELOPMENT/NPS: Created SaaS metrics dashboard for launch and post launch business activities. Introduced Net Promoter Score (NPS) as key business metric, created strategy for deploying in user environment, complete with follow up campaigns based on NPS ratings.» BRAND CREATION AND DEVELOPMENT: From concept to logo, worked with executive team to brand product for commercial launch. Tied to company mission, vision, and values. Included negotiation and acquisition of premium domain names."
            ],
            [
                "Regional Development Director, Sales/Marketing Executive to Small Businesses, & Professional Speaker",
                "Company Name",
                "Infusionsoft",
                "Dates Employed",
                "Dec 2011 – Apr 2014",
                "Employment Duration",
                "2 yrs 5 mos",
                "Location",
                "Greater Denver Area",
                "🔥IMPACT: 413% growth of customer footprint in 2 yrs. Acted as regional CEO, launching companies first ever GoLocal initiative in Colorado. » MARKETING EDUCATOR: Developed & delivered curriculum to local businesses, partnered with influencers, delivered content to their audiences.» RECRUITING ENGAGED PARTNERS: Built a base of 70+ local advocates and partners to support customer ecosystem and promote upcoming workshops and events.» MEASURING IMPACT: Understanding sales cycle duration, customer acquisition cost (CAC), and other metrics associated with those touched by local marketing initiatives vs. those who weren’t. Reduced avg CAC by 5x. » PR/THOUGHT LEADERSHIP: Established Infusionsoft as the regional thought leader for strategies and tactics for small businesses growth. On radio numerous times, online TV shows, and engaged with local influencer organizations (Denver Metro and other chambers).» SCALING: As the first regional market to come online, common lessons learned were applied to 4 other regions, shortening ramp time."
            ],
            [
                "Senior Solutions Sales Consultant and CRM Coach",
                "Company Name",
                "Database Hero Group, LLC",
                "Dates Employed",
                "2001 – 2011",
                "Employment Duration",
                "10 yrs",
                "Location",
                "Internet",
                "🔥IMPACT: Ignited a ‘brochure’ website with marketing automation & e-commerce, growing from $0 to $500,000 in two years.Provided technical and marketing consulting and training services for customers of Infusionsoft marketing automation (SaaS) software and Sage ACT!.» OPTIMIZED MARKETING CAMPAIGNS: Ignited a ‘brochure’ website with marketing automation & e-commerce, growing from $0 to $500,000 in two years.» CONSULTING REVENUE GROWTH: Successfully converted a consulting business from hourly model to package model, doubling revenue.» SELLING, COACHING, & CONSULTING: Became an outside partner to businesses who wanted to expand through marketing automation. Sold high-ticket, high-value consulting services. Served clients by developing growth strategies which leveraged technology and marketing automation to drive revenue.» DATA MAPPING & CONVERSION: Supported clients data technical needs for reporting, data conversion and analysis.» PUBLIC SPEAKING & TRAINING: Trained entire organizations on the software, spoke to sales organizations on the merits of tech to close deals.» CERTIFIED PARTNER: First certification class of Infusionsoft Certified Consultants (ICC), Sage ACT! Certified Consultant (ACC)."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor of Arts (B.A.)",
                "Field Of Study",
                "Germanic Languages, Literatures, and Linguistics",
                "Activities and Societies:",
                "Exchange program University of Regensburg, Germany. Mountain biking, German club, hiking, travel, adventure, cross-cultural experiences."
            ],
            "Recommendations",
            [
                "BlueKai",
                "7,539 followers"
            ],
            [
                "Non-Profit Marketo Users",
                "86 members"
            ],
            [
                "Digital Marketing",
                "1,209,964 members"
            ],
            [
                "Twitter",
                "527,382 followers"
            ],
            [
                "Brazilian Job-Hunters",
                "27,104 members"
            ],
            [
                "The Economist",
                "4,959,222 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "BlueKai",
                "7,539 followers"
            ],
            [
                "BlueKai",
                "7,539 followers"
            ],
            [
                "Non-Profit Marketo Users",
                "86 members"
            ],
            [
                "Non-Profit Marketo Users",
                "86 members"
            ],
            [
                "Digital Marketing",
                "1,209,964 members"
            ],
            [
                "Digital Marketing",
                "1,209,964 members"
            ],
            [
                "Twitter",
                "527,382 followers"
            ],
            [
                "Twitter",
                "527,382 followers"
            ],
            [
                "Brazilian Job-Hunters",
                "27,104 members"
            ],
            [
                "Brazilian Job-Hunters",
                "27,104 members"
            ],
            [
                "The Economist",
                "4,959,222 followers"
            ],
            [
                "The Economist",
                "4,959,222 followers"
            ]
        ],
        "recommendations": [
            [
                "Frank Rudy",
                "VP of Bus Development at Integrity Air Quality",
                "December 16, 2013, Frank worked with Travis but at different companies",
                "I like everything about Travis! He's intelligent, hardworking and humble, always learning, high energy and works with utmost integrity. His people skills are second to none and his high emotional intelligence allows him to be productive in most any circumstance. He has keen business insight and understands how to convert that into high productivity.  I would gladly work with or for him anywhere...he's a top shelf individual !!"
            ],
            [
                "Frank Rudy",
                "VP of Bus Development at Integrity Air Quality",
                "December 16, 2013, Frank worked with Travis but at different companies"
            ],
            [
                "Frank Rudy",
                "VP of Bus Development at Integrity Air Quality",
                "December 16, 2013, Frank worked with Travis but at different companies"
            ],
            [
                "Frank Rudy",
                "VP of Bus Development at Integrity Air Quality",
                "December 16, 2013, Frank worked with Travis but at different companies"
            ],
            "VP of Bus Development at Integrity Air Quality",
            [
                "I like everything about Travis! He's intelligent, hardworking and humble, always learning, high energy and works with utmost integrity. His people skills are second to none and his high emotional intelligence allows him to be productive in most any circumstance. He has keen business insight and understands how to convert that into high productivity.  I would gladly work with or for him anywhere...he's a top shelf individual !!"
            ],
            [
                "I like everything about Travis! He's intelligent, hardworking and humble, always learning, high energy and works with utmost integrity. His people skills are second to none and his high emotional intelligence allows him to be productive in most any circumstance. He has keen business insight and understands how to convert that into high productivity.  I would gladly work with or for him anywhere...he's a top shelf individual !!"
            ],
            [
                "Tracie Rollins",
                "You don't have time for social media and content marketing. Message me when you're ready to focus on your business.",
                "December 11, 2013, Tracie worked with Travis in different groups",
                "Travis is one of the most authentic and caring individuals I have had the pleasure of working with. He truly cares about his work and seeks to deliver the best experience in each and every interaction.  He is willing to help others, whether it be to discuss marketing, social strategies or provide networking tips. Thought leaders have a compelling and influential story to tell, they also compel listeners to act. Travis influence and marketing smarts helped to grow Infusionsoft's brand and customer base. If you have the chance to work with Travis, I highly recommend you do so.Travis has a passion for helping others find and create their own success."
            ],
            [
                "Tracie Rollins",
                "You don't have time for social media and content marketing. Message me when you're ready to focus on your business.",
                "December 11, 2013, Tracie worked with Travis in different groups"
            ],
            [
                "Tracie Rollins",
                "You don't have time for social media and content marketing. Message me when you're ready to focus on your business.",
                "December 11, 2013, Tracie worked with Travis in different groups"
            ],
            [
                "Tracie Rollins",
                "You don't have time for social media and content marketing. Message me when you're ready to focus on your business.",
                "December 11, 2013, Tracie worked with Travis in different groups"
            ],
            "You don't have time for social media and content marketing. Message me when you're ready to focus on your business.",
            [
                "Travis is one of the most authentic and caring individuals I have had the pleasure of working with. He truly cares about his work and seeks to deliver the best experience in each and every interaction.  He is willing to help others, whether it be to discuss marketing, social strategies or provide networking tips. Thought leaders have a compelling and influential story to tell, they also compel listeners to act. Travis influence and marketing smarts helped to grow Infusionsoft's brand and customer base. If you have the chance to work with Travis, I highly recommend you do so.Travis has a passion for helping others find and create their own success."
            ],
            [
                "Travis is one of the most authentic and caring individuals I have had the pleasure of working with. He truly cares about his work and seeks to deliver the best experience in each and every interaction.  He is willing to help others, whether it be to discuss marketing, social strategies or provide networking tips. Thought leaders have a compelling and influential story to tell, they also compel listeners to act. Travis influence and marketing smarts helped to grow Infusionsoft's brand and customer base. If you have the chance to work with Travis, I highly recommend you do so.Travis has a passion for helping others find and create their own success."
            ],
            [
                "Chris L. Pittman",
                "Looking For A New Venture",
                "October 19, 2016, Travis was a client of Chris L.’s",
                "Chris is a guy you want in your corner. In all my dealings with him, specifically with my car repairs, I found him to have good judgement and to be fair in his recommendations. His leadership, coupled with years of experience is a precious asset more companies need. I gladly and highly recommend Chris!"
            ],
            [
                "Chris L. Pittman",
                "Looking For A New Venture",
                "October 19, 2016, Travis was a client of Chris L.’s"
            ],
            [
                "Chris L. Pittman",
                "Looking For A New Venture",
                "October 19, 2016, Travis was a client of Chris L.’s"
            ],
            [
                "Chris L. Pittman",
                "Looking For A New Venture",
                "October 19, 2016, Travis was a client of Chris L.’s"
            ],
            "Looking For A New Venture",
            [
                "Chris is a guy you want in your corner. In all my dealings with him, specifically with my car repairs, I found him to have good judgement and to be fair in his recommendations. His leadership, coupled with years of experience is a precious asset more companies need. I gladly and highly recommend Chris!"
            ],
            [
                "Chris is a guy you want in your corner. In all my dealings with him, specifically with my car repairs, I found him to have good judgement and to be fair in his recommendations. His leadership, coupled with years of experience is a precious asset more companies need. I gladly and highly recommend Chris!"
            ],
            [
                "Bill Curtis",
                "Vice President, Operations at Gadget Guard",
                "February 6, 2014, Travis reported directly to Bill",
                "Working with Bill Curtis has been a delight! He had the challenge of not only leading a team of pioneers, but the team was also remote. He found a way to strike a balance of allowing team members operate in and develop personal strengths while keeping them \"at home\" with regular team meetings and 1-on-1 conversations. With each and every challenge, Bill always maintained a positive outlook, and I found he had a way to draw the good out of any circumstance. More than that, Bill's diverse professional background served us well. He was regularly coming up with new ideas and strategies that enabled the team to \"do more with less.\" I cannot recommend Bill enough. If you have any questions about my experience with Bill, feel free to call me at 720-722-2761. Warm Regards,Travis Campbell"
            ],
            [
                "Bill Curtis",
                "Vice President, Operations at Gadget Guard",
                "February 6, 2014, Travis reported directly to Bill"
            ],
            [
                "Bill Curtis",
                "Vice President, Operations at Gadget Guard",
                "February 6, 2014, Travis reported directly to Bill"
            ],
            [
                "Bill Curtis",
                "Vice President, Operations at Gadget Guard",
                "February 6, 2014, Travis reported directly to Bill"
            ],
            "Vice President, Operations at Gadget Guard",
            [
                "Working with Bill Curtis has been a delight! He had the challenge of not only leading a team of pioneers, but the team was also remote. He found a way to strike a balance of allowing team members operate in and develop personal strengths while keeping them \"at home\" with regular team meetings and 1-on-1 conversations. With each and every challenge, Bill always maintained a positive outlook, and I found he had a way to draw the good out of any circumstance. More than that, Bill's diverse professional background served us well. He was regularly coming up with new ideas and strategies that enabled the team to \"do more with less.\" I cannot recommend Bill enough. If you have any questions about my experience with Bill, feel free to call me at 720-722-2761. Warm Regards,Travis Campbell"
            ],
            [
                "Working with Bill Curtis has been a delight! He had the challenge of not only leading a team of pioneers, but the team was also remote. He found a way to strike a balance of allowing team members operate in and develop personal strengths while keeping them \"at home\" with regular team meetings and 1-on-1 conversations. With each and every challenge, Bill always maintained a positive outlook, and I found he had a way to draw the good out of any circumstance. More than that, Bill's diverse professional background served us well. He was regularly coming up with new ideas and strategies that enabled the team to \"do more with less.\" I cannot recommend Bill enough. If you have any questions about my experience with Bill, feel free to call me at 720-722-2761. Warm Regards,Travis Campbell"
            ]
        ],
        "skills": [],
        "summary": "    *Partnering with Enterprise Leaders to Craft Winning Engagement Marketing Blueprints*With 20 years of technology, sales, and digital marketing experience Travis is a relational leader with a track record of results in software and consultative sales. A natural talent discovering new ways to use tech to connect and convert, while operating at the “speed of startup”. A data-driven, technology, and relationship-oriented professional, Travis is passionate about helping companies apply technology to solve businesses challenges, grow revenue, and increase market share. ⭐️ ALL-STAR MOMENTS:⭐️  » Led business transformation engagements with top enterprises, influencing opportunities which led to $8M IN REVENUE.    » Created regional awareness of nearly unknown All-In-One Sales and Marketing SaaS brand, developed and implemented engagement and education strategies resulting CUSTOMER FOOTPRINT GROWTH OF 413% in two years.  » Identified top local influencers and influencer organizations to the (Infusionsoft) target market, building a GROUNDSWELL OF 70+ RESELLER PARTNERS.  » Executed key thought leadership strategy by spearheading development of educational workshop which was SHARED WITH 15,000+ BUSINESSES.  » Powered a solopreneur 'brochure' website with marketing automation, to connect and convert, taking it from $0 revenue to ~$500,000 IN TWO YEARS.[ [ Questions or inquiries: Please message Travis here, or reach him directly at 602-741-6787. ] ]\n  \n  \n",
        "name": "Travis Campbell ☁️",
        "title": "Engagement Marketing Business Consultant to Enterprise Executives | Marketo - Value Consulting",
        "url": "linkedin.com/in/travisnow",
        "phone": "602-741-6787 (Mobile)",
        "email": "marketprofessor@gmail.com"
    }
]