[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "32 Mutual Connections",
                "You and Trish both know Mark Goldstein, Amanda Vega, and 30 others"
            ],
            [
                "Trish can introduce you to 6 people at Arizona Department of Education",
                "You are following Arizona Department of Education"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Founder/ President",
                "Company Name",
                "STARSHINE ACADEMY SCHOOLS",
                "Dates Employed",
                "Aug 2002 – Present",
                "Employment Duration",
                "15 yrs 3 mos",
                "Vision; Strategy...Find Incredible People and Keep them Happy"
            ],
            [
                "Author",
                "Company Name",
                "Soul of Success, the StarShine Effect Books",
                "Dates Employed",
                "Nov 2011 – Present",
                "Employment Duration",
                "6 yrs",
                "Location",
                "Phoenix, Arizona Area",
                "The Soul of Success, a collaborative book with Jack Canfield and Trish McCarty, hit the national and international Amazon best seller in several categories on Sept 11, 2015. Currently Mrs. McCarty, while running her companies, is speaking throughout the world about the Science and Soul of Success. She was recently featured on NPR and PBSThe StarShine Effect is a book written by Patricia (Trish) McCarty describing her experience in opening StarShine Academy Schools and discovering what should be taught for students to become successful and responsible at life and school. \"The StarShine Effect\"​ became a term used by those touched to tears because of \"Realizing Dreams Through Education.\"​ We only know what we know and we don't know what we don't know, making us all seekers of truth."
            ],
            [
                "Founder & CEO",
                "Company Name",
                "StarShine Planet/ Education Resources",
                "Dates Employed",
                "2008 – Present",
                "Employment Duration",
                "9 yrs",
                "Location",
                "3535 E McDowell Road, Phoenix, AZ 85008",
                "STARSHINE PLANET is a licensing and network organization providing a world-class system of strategies and tools that support the complex business of K-12 schools and educating children. StarShine Planet supports the dedication of education leaders to do what they do best: educate our children. We wanted to take the pain away from the leaders that matter so much to our children. We take the guesswork out of what works best, when, and we provide sophisticated technology to track the results needed for accreditation. StarShine Planet links together an international network of serious, college preparatory, accredited schools and processes dedicated to preparing students for real success in college and in life, as leaders of their communities and the world.StarShine Planet is working on its BOLDEST ever adventure: to bring literacy to the entire world. We believe, along with Peter Diamandis, Founder of XPRIZE, that some of the worst crime is done in the dark. We believe that as we bring more light in, especially enabling people to learn how to make empowering, responsible decisions, the world will greatly improve. We must deliver a technology software solution for free, to enable 7-9 year olds to teach themselves reading, writing and arithmetic by 2016. You can join our collaboration team. We need you and your ideas!",
                "Media (1)",
                "This position has 1 media",
                "StarShine Academy Accepts The X-Prize Global Learning Master Challenge",
                "StarShine Academy Accepts The X-Prize Global Learning Master Challenge",
                "This media is a video"
            ],
            [
                "President & CEO",
                "Company Name",
                "STARSHINE PLANET",
                "Dates Employed",
                "2004 – Present",
                "Employment Duration",
                "13 yrs",
                "Location",
                "Phoenix, Arizona",
                "\"Teaching is the only profession that creates all others.\"​STARSHINE PLANET is an education management and software organization providing a world-class system of strategies and tools that support the complex business of K-12 schools and educating children. StarShine Planet supports the dedication of education leaders to do what they do best: educate our children. Taking the pain away from the leaders that matter so much to our children, is our primary purpose. We take the guesswork out of what works best, when, and we provide sophisticated technology to track the results needed for accreditation. StarShine Planet links together an international network of serious, college preparatory, accredited schools and processes dedicated to preparing students for success in college and in life, as leaders of their communities and the world.McCarty's book, The StarShine Effect was published in proof at Harvard in Nov.2011. There is scientific proof of what causes success for individuals, teachers, schools and communities. There should be no guesswork for how to develop success in our schools. To ignore these basic principles is a crime to humanity.Barriers  are removed by providing STARSHINE SCHOOL IN A BOX®, making school success easier, more cost effective, and less time consuming. Research is designed to easily share knowledge to help save time with the children.Everyone recognizes dollars wasted that could put dollars back into the classroom. Basically, StarShine Planet has researched best practices with K-12 schools, streamlined them for easier implementation and created a systemic way that helps to reach all Learning Leaders, teachers, Learning Leaders, parents, children, teachers, and communities are assisted to save themselves as fast as possible. Economic development and sustainability are the result."
            ],
            [
                "Founder & President",
                "Company Name",
                "StarShine Academy International Schools/ Education Resources, LLC",
                "Dates Employed",
                "Jul 2002 – Present",
                "Employment Duration",
                "15 yrs 4 mos",
                "Location",
                "Phoenix, AZ",
                "StarShine School in a Box--building a global network of STARSHINE ACADEMY SCHOOLS, including charter schools, dedicated to helping every child find their talent and grow into a peaceful, productive, and successful person. Honored by the United Nations, the Vatican's Boys Towns and Girls Towns and accreditation agencies, technology companies and educational leaders—STARSHINE is a model for the future of community schools. StarShine Charter Schools is a collection of highly accredited schools (both N.C.A. U.S. and CITA International Accreditations) implementing a blended model of learning to completely redefining K-12 education. We developed a systematic approach to K-12 learning, and captured it in our \"School In a Box\". We filtered WHAT a student must know to get into college, and captured it in one manual. We help kids to learn more easily using technology, teachers and mentors. We teach people how to live the American Dream and to become great Americans helping others.STARSHINE ACADEMY combines rigorous standards, community building, and sophisticated technology into a uniquely effective program. STARSHINE staff are trained to develop inspiring relationships with students and build effective partnerships with parents, communities, and business leaders. The curriculum is designed to grow with the needs of the children and aspirations of the community.With the help of the whole community our schools provide the richest of educations. We are spreading this approach throughout the world."
            ],
            [
                "Founder/ President",
                "Company Name",
                "StarShine Charter Schools",
                "Dates Employed",
                "Jul 2002 – Present",
                "Employment Duration",
                "15 yrs 4 mos",
                "StarShine Charter Schools is a blended model of highly accredited schools (both N.C.A. U.S. and CITA International Accreditations). We have developed a systematic approach to k-12learning in our \"School In a Box\" and we have filtered WHAT a student must know to get into college into one manual. How to learn easier using technology, teachers and mentors. We teach people how to live the American Dream and to become great American helping others."
            ],
            [
                "Project Coordinator",
                "Company Name",
                "XPRIZE",
                "Dates Employed",
                "2014 – Present",
                "Employment Duration",
                "3 yrs"
            ],
            [
                "Participating Company",
                "Company Name",
                "XPRIZE",
                "Dates Employed",
                "2014 – Present",
                "Employment Duration",
                "3 yrs",
                "StarShine is the leading team for XPRIZE for Global and Adult Literacy to be delivered in Oct. 2016"
            ],
            [
                "President StarShine Academy International Schools",
                "Company Name",
                "Skysong ASU",
                "Dates Employed",
                "2002 – Present",
                "Employment Duration",
                "15 yrs",
                "Revolutionizing education: changing what and how students learn to create real sustainability."
            ],
            [
                "Team @XQAmerica",
                "Company Name",
                "@XQPhoenixRising Team ReInvent High School",
                "Dates Employed",
                "Mar 2016 – Sep 2016",
                "Employment Duration",
                "7 mos",
                "Location",
                "StarShine Academy Schools",
                "Steve Job's wife launched a contest to reinvent high schools into Super Schools! Our team @XQPhoenixRising has made it into the semi-final round!"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Fort Lewis College",
                "Field Of Study",
                "Business, Neuroscience, Human Physiology & Biology"
            ],
            [
                "Fort Lewis College",
                "Field Of Study",
                "Business, Neuroscience, Human Physiology & Biology"
            ],
            [
                "San Diego, Coronado Community College",
                "Field Of Study",
                "Business, Healthcare"
            ],
            [
                "San Diego, Coronado Community College",
                "Field Of Study",
                "Business, Healthcare"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "Gretchen RubinGretchen Rubin is a LinkedIn Influencer",
                "Bestselling writer about habits and happiness at gretchenrubin.com",
                "2,419,022 followers"
            ],
            [
                "Clickjab",
                "5 followers"
            ],
            [
                "Higher Education Teaching and Learning",
                "103,930 members"
            ],
            [
                "YouthSpark Connections",
                "2,330 members"
            ],
            [
                "Phoenix Business Journal",
                "6,826 followers"
            ],
            [
                "Vision Comptech",
                "126 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Gretchen RubinGretchen Rubin is a LinkedIn Influencer",
                "Bestselling writer about habits and happiness at gretchenrubin.com",
                "2,419,022 followers"
            ],
            [
                "Gretchen RubinGretchen Rubin is a LinkedIn Influencer",
                "Bestselling writer about habits and happiness at gretchenrubin.com",
                "2,419,022 followers"
            ],
            [
                "Gretchen Rubin is a LinkedIn Influencer"
            ],
            [
                "Clickjab",
                "5 followers"
            ],
            [
                "Clickjab",
                "5 followers"
            ],
            [
                "Higher Education Teaching and Learning",
                "103,930 members"
            ],
            [
                "Higher Education Teaching and Learning",
                "103,930 members"
            ],
            [
                "YouthSpark Connections",
                "2,330 members"
            ],
            [
                "YouthSpark Connections",
                "2,330 members"
            ],
            [
                "Phoenix Business Journal",
                "6,826 followers"
            ],
            [
                "Phoenix Business Journal",
                "6,826 followers"
            ],
            [
                "Vision Comptech",
                "126 followers"
            ],
            [
                "Vision Comptech",
                "126 followers"
            ]
        ],
        "recommendations": [
            [
                "Dr. Brenda R Combs, Ed. D",
                "Instructor  at Grand Canyon University",
                "June 12, 2008, Dr. Brenda R was a client of Trish’s",
                "Trish has a heart for humanity.  She has the ability to see the good in all people and works very diligently to save the planet, educate children and she is a wonderful role model."
            ],
            [
                "Dr. Brenda R Combs, Ed. D",
                "Instructor  at Grand Canyon University",
                "June 12, 2008, Dr. Brenda R was a client of Trish’s"
            ],
            [
                "Dr. Brenda R Combs, Ed. D",
                "Instructor  at Grand Canyon University",
                "June 12, 2008, Dr. Brenda R was a client of Trish’s"
            ],
            [
                "Dr. Brenda R Combs, Ed. D",
                "Instructor  at Grand Canyon University",
                "June 12, 2008, Dr. Brenda R was a client of Trish’s"
            ],
            "Instructor  at Grand Canyon University",
            [
                "Trish has a heart for humanity.  She has the ability to see the good in all people and works very diligently to save the planet, educate children and she is a wonderful role model."
            ],
            [
                "Trish has a heart for humanity.  She has the ability to see the good in all people and works very diligently to save the planet, educate children and she is a wonderful role model."
            ],
            [
                "Colleen O'Donnell",
                "Public Relations & Social Media Manager at Breaking Gravity LLC",
                "November 21, 2007, Colleen worked with Trish but at different companies",
                "Trish is a true visionary -- and her ability to make the seemingly impossible become not only possible, but actual reality is inspirational.  Her work and that of her wonderful staff is a huge asset to education in our state.  And with the work of our state legislature, it may soon become the standard for excellence in education within our state and beyond."
            ],
            [
                "Colleen O'Donnell",
                "Public Relations & Social Media Manager at Breaking Gravity LLC",
                "November 21, 2007, Colleen worked with Trish but at different companies"
            ],
            [
                "Colleen O'Donnell",
                "Public Relations & Social Media Manager at Breaking Gravity LLC",
                "November 21, 2007, Colleen worked with Trish but at different companies"
            ],
            [
                "Colleen O'Donnell",
                "Public Relations & Social Media Manager at Breaking Gravity LLC",
                "November 21, 2007, Colleen worked with Trish but at different companies"
            ],
            "Public Relations & Social Media Manager at Breaking Gravity LLC",
            [
                "Trish is a true visionary -- and her ability to make the seemingly impossible become not only possible, but actual reality is inspirational.  Her work and that of her wonderful staff is a huge asset to education in our state.  And with the work of our state legislature, it may soon become the standard for excellence in education within our state and beyond."
            ],
            [
                "Trish is a true visionary -- and her ability to make the seemingly impossible become not only possible, but actual reality is inspirational.  Her work and that of her wonderful staff is a huge asset to education in our state.  And with the work of our state legislature, it may soon become the standard for excellence in education within our state and beyond."
            ],
            [
                "LaRae Wright",
                "Entrepreneur, Mentor & Educator",
                "June 29, 2016, Trish worked with LaRae but at different companies",
                "I have known LaRae for twenty years and she is doing amazing work to help elevate consciousness in all leadership through educating us on The Sunflower Circle among so many other endeavors! It is an honor to recommend her for anything! Trish McCarty"
            ],
            [
                "LaRae Wright",
                "Entrepreneur, Mentor & Educator",
                "June 29, 2016, Trish worked with LaRae but at different companies"
            ],
            [
                "LaRae Wright",
                "Entrepreneur, Mentor & Educator",
                "June 29, 2016, Trish worked with LaRae but at different companies"
            ],
            [
                "LaRae Wright",
                "Entrepreneur, Mentor & Educator",
                "June 29, 2016, Trish worked with LaRae but at different companies"
            ],
            "Entrepreneur, Mentor & Educator",
            [
                "I have known LaRae for twenty years and she is doing amazing work to help elevate consciousness in all leadership through educating us on The Sunflower Circle among so many other endeavors! It is an honor to recommend her for anything! Trish McCarty"
            ],
            [
                "I have known LaRae for twenty years and she is doing amazing work to help elevate consciousness in all leadership through educating us on The Sunflower Circle among so many other endeavors! It is an honor to recommend her for anything! Trish McCarty"
            ],
            [
                "Scott Wright",
                "Photographer  l  Educator  l  Mentor",
                "June 29, 2016, Trish worked with Scott but at different companies",
                "Scott is doing amazing work to help elevate consciousness in all leadership through educating us on The Sunflower Circle. It is an honor to recommend him for anything! Trish McCarty"
            ],
            [
                "Scott Wright",
                "Photographer  l  Educator  l  Mentor",
                "June 29, 2016, Trish worked with Scott but at different companies"
            ],
            [
                "Scott Wright",
                "Photographer  l  Educator  l  Mentor",
                "June 29, 2016, Trish worked with Scott but at different companies"
            ],
            [
                "Scott Wright",
                "Photographer  l  Educator  l  Mentor",
                "June 29, 2016, Trish worked with Scott but at different companies"
            ],
            "Photographer  l  Educator  l  Mentor",
            [
                "Scott is doing amazing work to help elevate consciousness in all leadership through educating us on The Sunflower Circle. It is an honor to recommend him for anything! Trish McCarty"
            ],
            [
                "Scott is doing amazing work to help elevate consciousness in all leadership through educating us on The Sunflower Circle. It is an honor to recommend him for anything! Trish McCarty"
            ]
        ],
        "skills": [
            [
                "Leadership",
                "See 135 endorsements for Leadership",
                "99+",
                "Leadership",
                "Endorse",
                "Endorsed by Kyle Winn and 1 other who is highly skilled at this",
                "Endorsed by Dan Nienhauser and 2 other mutual connections"
            ],
            [
                "Leadership",
                "See 135 endorsements for Leadership",
                "99+"
            ],
            [
                "Public Speaking",
                "See 107 endorsements for Public Speaking",
                "99+",
                "Public Speaking",
                "Endorse",
                "Endorsed by John L. Liffiton and 6 others who are highly skilled at this",
                "Endorsed by Richard Filley and 3 other mutual connections"
            ],
            [
                "Public Speaking",
                "See 107 endorsements for Public Speaking",
                "99+"
            ],
            [
                "Strategic Planning",
                "See 87 endorsements for Strategic Planning",
                "87",
                "Strategic Planning",
                "Endorse",
                "Endorsed by Dan Nienhauser and 2 other mutual connections",
                "Endorsed by 4 of Trish’s colleagues at STARSHINE"
            ],
            [
                "Strategic Planning",
                "See 87 endorsements for Strategic Planning",
                "87"
            ],
            [
                "Teaching",
                "See 83 endorsements for Teaching",
                "83",
                "Teaching",
                "Endorse"
            ],
            [
                "Teaching",
                "See 83 endorsements for Teaching",
                "83"
            ],
            [
                "Leadership Development",
                "See 57 endorsements for Leadership Development",
                "57",
                "Leadership Development",
                "Endorse"
            ],
            [
                "Leadership Development",
                "See 57 endorsements for Leadership Development",
                "57"
            ],
            [
                "Curriculum Design",
                "See 56 endorsements for Curriculum Design",
                "56",
                "Curriculum Design",
                "Endorse"
            ],
            [
                "Curriculum Design",
                "See 56 endorsements for Curriculum Design",
                "56"
            ],
            [
                "Marketing",
                "See 44 endorsements for Marketing",
                "44",
                "Marketing",
                "Endorse"
            ],
            [
                "Marketing",
                "See 44 endorsements for Marketing",
                "44"
            ],
            [
                "Nonprofits",
                "See 40 endorsements for Nonprofits",
                "40",
                "Nonprofits",
                "Endorse"
            ],
            [
                "Nonprofits",
                "See 40 endorsements for Nonprofits",
                "40"
            ],
            [
                "Grants",
                "See 39 endorsements for Grants",
                "39",
                "Grants",
                "Endorse"
            ],
            [
                "Grants",
                "See 39 endorsements for Grants",
                "39"
            ],
            [
                "Entrepreneurship",
                "See 38 endorsements for Entrepreneurship",
                "38",
                "Entrepreneurship",
                "Endorse"
            ],
            [
                "Entrepreneurship",
                "See 38 endorsements for Entrepreneurship",
                "38"
            ],
            [
                "Staff Development",
                "See 32 endorsements for Staff Development",
                "32",
                "Staff Development",
                "Endorse"
            ],
            [
                "Staff Development",
                "See 32 endorsements for Staff Development",
                "32"
            ],
            [
                "Research",
                "See 30 endorsements for Research",
                "30",
                "Research",
                "Endorse"
            ],
            [
                "Research",
                "See 30 endorsements for Research",
                "30"
            ],
            [
                "Team Building",
                "See 30 endorsements for Team Building",
                "30",
                "Team Building",
                "Endorse"
            ],
            [
                "Team Building",
                "See 30 endorsements for Team Building",
                "30"
            ],
            [
                "Strategy",
                "See 30 endorsements for Strategy",
                "30",
                "Strategy",
                "Endorse"
            ],
            [
                "Strategy",
                "See 30 endorsements for Strategy",
                "30"
            ],
            [
                "Coaching",
                "See 29 endorsements for Coaching",
                "29",
                "Coaching",
                "Endorse"
            ],
            [
                "Coaching",
                "See 29 endorsements for Coaching",
                "29"
            ],
            [
                "Social Media",
                "See 21 endorsements for Social Media",
                "21",
                "Social Media",
                "Endorse"
            ],
            [
                "Social Media",
                "See 21 endorsements for Social Media",
                "21"
            ],
            [
                "Social Networking",
                "See 20 endorsements for Social Networking",
                "20",
                "Social Networking",
                "Endorse"
            ],
            [
                "Social Networking",
                "See 20 endorsements for Social Networking",
                "20"
            ],
            [
                "Social Media Marketing",
                "See 18 endorsements for Social Media Marketing",
                "18",
                "Social Media Marketing",
                "Endorse"
            ],
            [
                "Social Media Marketing",
                "See 18 endorsements for Social Media Marketing",
                "18"
            ],
            [
                "Adult Education",
                "See 18 endorsements for Adult Education",
                "18",
                "Adult Education",
                "Endorse"
            ],
            [
                "Adult Education",
                "See 18 endorsements for Adult Education",
                "18"
            ],
            [
                "Program Development",
                "See 16 endorsements for Program Development",
                "16",
                "Program Development",
                "Endorse"
            ],
            [
                "Program Development",
                "See 16 endorsements for Program Development",
                "16"
            ],
            [
                "Marketing Strategy",
                "See 16 endorsements for Marketing Strategy",
                "16",
                "Marketing Strategy",
                "Endorse"
            ],
            [
                "Marketing Strategy",
                "See 16 endorsements for Marketing Strategy",
                "16"
            ],
            [
                "Training",
                "See 15 endorsements for Training",
                "15",
                "Training",
                "Endorse"
            ],
            [
                "Training",
                "See 15 endorsements for Training",
                "15"
            ],
            [
                "Editing",
                "See 14 endorsements for Editing",
                "14",
                "Editing",
                "Endorse"
            ],
            [
                "Editing",
                "See 14 endorsements for Editing",
                "14"
            ],
            [
                "Public Relations",
                "See 14 endorsements for Public Relations",
                "14",
                "Public Relations",
                "Endorse"
            ],
            [
                "Public Relations",
                "See 14 endorsements for Public Relations",
                "14"
            ],
            [
                "Community Outreach",
                "See 12 endorsements for Community Outreach",
                "12",
                "Community Outreach",
                "Endorse"
            ],
            [
                "Community Outreach",
                "See 12 endorsements for Community Outreach",
                "12"
            ],
            [
                "Sales",
                "See 11 endorsements for Sales",
                "11",
                "Sales",
                "Endorse"
            ],
            [
                "Sales",
                "See 11 endorsements for Sales",
                "11"
            ],
            [
                "Fundraising",
                "See 10 endorsements for Fundraising",
                "10",
                "Fundraising",
                "Endorse"
            ],
            [
                "Fundraising",
                "See 10 endorsements for Fundraising",
                "10"
            ],
            [
                "Event Planning",
                "See 10 endorsements for Event Planning",
                "10",
                "Event Planning",
                "Endorse"
            ],
            [
                "Event Planning",
                "See 10 endorsements for Event Planning",
                "10"
            ],
            [
                "Small Business",
                "See 9 endorsements for Small Business",
                "9",
                "Small Business",
                "Endorse"
            ],
            [
                "Small Business",
                "See 9 endorsements for Small Business",
                "9"
            ],
            [
                "Executive Coaching",
                "See 8 endorsements for Executive Coaching",
                "8",
                "Executive Coaching",
                "Endorse"
            ],
            [
                "Executive Coaching",
                "See 8 endorsements for Executive Coaching",
                "8"
            ],
            [
                "Higher Education",
                "See 8 endorsements for Higher Education",
                "8",
                "Higher Education",
                "Endorse"
            ],
            [
                "Higher Education",
                "See 8 endorsements for Higher Education",
                "8"
            ],
            [
                "Organizational Development",
                "See 8 endorsements for Organizational Development",
                "8",
                "Organizational Development",
                "Endorse"
            ],
            [
                "Organizational Development",
                "See 8 endorsements for Organizational Development",
                "8"
            ],
            [
                "Marketing Communications",
                "See 7 endorsements for Marketing Communications",
                "7",
                "Marketing Communications",
                "Endorse"
            ],
            [
                "Marketing Communications",
                "See 7 endorsements for Marketing Communications",
                "7"
            ],
            [
                "Motivational Speaking",
                "See 7 endorsements for Motivational Speaking",
                "7",
                "Motivational Speaking",
                "Endorse"
            ],
            [
                "Motivational Speaking",
                "See 7 endorsements for Motivational Speaking",
                "7"
            ],
            [
                "Writing",
                "See 5 endorsements for Writing",
                "5",
                "Writing",
                "Endorse"
            ],
            [
                "Writing",
                "See 5 endorsements for Writing",
                "5"
            ],
            [
                "Instructional Design",
                "See 5 endorsements for Instructional Design",
                "5",
                "Instructional Design",
                "Endorse"
            ],
            [
                "Instructional Design",
                "See 5 endorsements for Instructional Design",
                "5"
            ],
            [
                "Workshop Facilitation",
                "See 5 endorsements for Workshop Facilitation",
                "5",
                "Workshop Facilitation",
                "Endorse"
            ],
            [
                "Workshop Facilitation",
                "See 5 endorsements for Workshop Facilitation",
                "5"
            ],
            [
                "Publishing",
                "See 4 endorsements for Publishing",
                "4",
                "Publishing",
                "Endorse"
            ],
            [
                "Publishing",
                "See 4 endorsements for Publishing",
                "4"
            ],
            [
                "Media Relations",
                "See 4 endorsements for Media Relations",
                "4",
                "Media Relations",
                "Endorse"
            ],
            [
                "Media Relations",
                "See 4 endorsements for Media Relations",
                "4"
            ],
            [
                "Volunteer Management",
                "See 4 endorsements for Volunteer Management",
                "4",
                "Volunteer Management",
                "Endorse"
            ],
            [
                "Volunteer Management",
                "See 4 endorsements for Volunteer Management",
                "4"
            ],
            [
                "Blogging",
                "See 4 endorsements for Blogging",
                "4",
                "Blogging",
                "Endorse"
            ],
            [
                "Blogging",
                "See 4 endorsements for Blogging",
                "4"
            ],
            [
                "Time Management",
                "See 4 endorsements for Time Management",
                "4",
                "Time Management",
                "Endorse"
            ],
            [
                "Time Management",
                "See 4 endorsements for Time Management",
                "4"
            ],
            [
                "Community Development",
                "See 4 endorsements for Community Development",
                "4",
                "Community Development",
                "Endorse"
            ],
            [
                "Community Development",
                "See 4 endorsements for Community Development",
                "4"
            ],
            [
                "Classroom",
                "See 3 endorsements for Classroom",
                "3",
                "Classroom",
                "Endorse"
            ],
            [
                "Classroom",
                "See 3 endorsements for Classroom",
                "3"
            ],
            [
                "E-Learning",
                "See 3 endorsements for E-Learning",
                "3",
                "E-Learning",
                "Endorse"
            ],
            [
                "E-Learning",
                "See 3 endorsements for E-Learning",
                "3"
            ],
            [
                "Nonprofit Organizations",
                "See 2 endorsements for Nonprofit Organizations",
                "2",
                "Nonprofit Organizations",
                "Endorse"
            ],
            [
                "Nonprofit Organizations",
                "See 2 endorsements for Nonprofit Organizations",
                "2"
            ]
        ],
        "summary": "",
        "name": "Trish (Sanders) McCarty",
        "title": "Founder & CEO at StarShine Quintessential Institute Learning Leaders Training/  StarShine Academy/ Education Resources",
        "url": "linkedin.com/in/trishmccarty",
        "phone": "",
        "email": "trish@eduresources.com"
    }
]