[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "31 Mutual Connections",
                "You and Ante both know Bernard Ong, Dimitri Ponomareff, and 29 others"
            ],
            [
                "You both worked at Charles Schwab",
                "You both worked at Charles Schwab from Nov 2016 to Feb 2017"
            ],
            [
                "Our Employee Engagement Committee put on an amazing event today for the MGMRI IT and Information Risk Management Teams to benefit the MGM Resorts Foundation. Having fun with some of my awesome team mates; Mary DiDonna, Michael Snee, Janice Morelli and Ramon Rivera. #VegasStrong #MGMCares",
                "Ante liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Managing Director Identity and Access Management",
                "Company Name",
                "Charles Schwab",
                "Dates Employed",
                "Aug 2016 – Present",
                "Employment Duration",
                "1 yr 4 mos",
                "Location",
                "Phoenix, Arizona Area"
            ],
            [
                "Director Identity and Access Management",
                "Company Name",
                "MGM Resorts International",
                "Dates Employed",
                "Oct 2014 – Aug 2016",
                "Employment Duration",
                "1 yr 11 mos"
            ],
            [
                "Director Technologies - IT Risk and Information Security - Identity and Access Management",
                "Company Name",
                "American Express",
                "Dates Employed",
                "Aug 2008 – Oct 2014",
                "Employment Duration",
                "6 yrs 3 mos",
                "Location",
                "Phoenix, Arizona",
                "Responsible for leading IT operational risk management for user access management for preserving the confidentiality, integrity, and availability of systems and processes across the enterprise.   Responsible for designing and implementing processes to understand measure and improve the organization’s ability to manage IT risk. Primary responsibilities include:1. Operational Management and Delivery of User Access Controls processes surrounding supporting the External, Regulatory and Internal requirements of ensuring that the appropriate level of access is provided to Amex systems for employee and contractors throughout the identity and access lifecycle.2. Coordinates requests for Regulatory and Compliance audits in relation to User Access Management (UAM) processes.  These include internal and external and regulatory audits, internal audits, support related IT audits and perform Process Risk Self-Assessments (PRSA).  Maintains and updates all compliance and audit-related documentation, reviews control deficiencies involving UAM processes and oversees remediation efforts aimed at correcting such deficiencies.3. Implement information policies, procedures and practices to safeguard corporate information in relation to regulatory obligations surrounding access management. 4. Lead identification and implementation of productivity and other key performance metrics and control and compliance scorecards across core UAM processes and information security procedures pertaining to access management.5. Experience leading a large team (30 people) of employees and contractors to create an atmosphere of trust; seeking diverse views to encourage improvement and innovation; and coaching staff including providing timely meaningful written and verbal feedback."
            ],
            [
                "Program / Financial Planning, Reporting and Analysis Manager",
                "Company Name",
                "American Express",
                "Dates Employed",
                "Feb 2004 – Jul 2008",
                "Employment Duration",
                "4 yrs 6 mos",
                "Location",
                "Phoenix, Arizona",
                "Program / Financial Planning, Reporting and Analysis Manager for the Card Acceptance Platform Program (CAPN) to re-engineer Amex’s front end Card Authorizations, Submissions and Capture Technology systems. Primary responsibilities include;1. Responsible for Managing the Financial Long Range Plan for both Business and Technologies ($300M in Total Costs, $800M+ in Benefits). This involves working with the CAPN Functional Owners, Tech Infrastructure/Finance and Business Finance in providing guidance and collaborating on the strategic plan, forecasting and re-engineering saves.2. Responsible for the Corporate Forecasting, Weekly and Monthly Variance Analysis for the Technologies Budget (Yearly budgets of approx. $55M/$46M). This involves providing project and people and strategic planning management at a team level to meet quality, schedule, milestone, forecasting & budget commitments, and ensuring appropriate systems are updated once the forecast/budget has been approved.3. Responsible for the creation and production of the CAPN Dashboard which provides the Amex Executive Team and  Steering Committee quarterly updates on the progress of the program as it relates to Financials, System Availability, Merchant Migrations and Program Delivery.4. Responsible for the development and roll out of the CAPN Reporting and Forecasting Tool to 200+ users within Technologies for use during the official Corporate Forecast and Long Range Planning exercises.5. Responsible for Strategic Planning in relation to the CAPN Long Range Plan / Forecast, special projects and improving the overall Tools / Processes within the program as it relates to Governance, Strategic Planning, Sizing Tools, and Risks, Issues and Change Control Management within EPIC.6. Responsible for Program wide communications on Program processes and timelines associated for ensuring the appropriate capture of program level risks, issues and changes in scope, schedule and cost."
            ],
            [
                "Project Manager - Global Re-engineering / Six Sigma",
                "Company Name",
                "American Express",
                "Dates Employed",
                "Mar 1999 – Feb 2004",
                "Employment Duration",
                "5 yrs",
                "Location",
                "Phoenix, Arizona Area",
                "Responsible for providing senior leadership of global operations, finance and other staff organizations with internal consulting services by formulating, recommending and deploying long term business transformation initiatives closely tied with their strategy and vision. 1. Applied continuous improvement methodology and business knowledge to develop a consistent approach to evaluating core processes, identifying opportunity for process improvement, building support for change and guiding project execution to achieve business goals and deliver financial benefit2. Translated business vision and strategy into operational tactics by building the business case, collaborating with leaders to define service delivery offerings and influence adoption of transformation objectives to attain organizational support and infrastructure necessary for execution3. Managed all aspects of operational efficiency initiatives by demonstrating large-scale program management expertise and partnering with senior leaders to execute and sustain key initiatives which seek to simplify workflow, eliminate redundancy and achieve efficiency4. Responsible for working with senior leadership in collecting data to support external benchmark comparisons and leveraging benchmarking data to identify business transformational opportunities.5. Responsible for the development and execution of reporting solutions that track re-engineering and transformation initiatives and ensure that business units / staff groups are achieving financial targets as planned."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor's of Science",
                "Field Of Study",
                "Finance",
                "Dates attended or expected graduation",
                "1987 – 1991"
            ],
            [
                "Arizona State University",
                "Degree Name",
                "Bachelor's of Science",
                "Field Of Study",
                "Finance",
                "Dates attended or expected graduation",
                "1987 – 1991"
            ],
            [
                "Shadow Mountain High School",
                "Degree Name",
                "General",
                "Dates attended or expected graduation",
                "1983 – 1987"
            ],
            [
                "Shadow Mountain High School",
                "Degree Name",
                "General",
                "Dates attended or expected graduation",
                "1983 – 1987"
            ],
            "Recommendations",
            [
                "Visa",
                "395,246 followers"
            ],
            [
                "BearingPoint",
                "78,223 followers"
            ],
            [
                "The Economist",
                "4,911,639 followers"
            ],
            [
                "Public Company Accounting Oversight Board (PCAOB)",
                "16,896 followers"
            ],
            [
                "Harvard Business Review",
                "1,469,537 members"
            ],
            [
                "Cinedigm",
                "6,967 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Visa",
                "395,246 followers"
            ],
            [
                "Visa",
                "395,246 followers"
            ],
            [
                "BearingPoint",
                "78,223 followers"
            ],
            [
                "BearingPoint",
                "78,223 followers"
            ],
            [
                "The Economist",
                "4,911,639 followers"
            ],
            [
                "The Economist",
                "4,911,639 followers"
            ],
            [
                "Public Company Accounting Oversight Board (PCAOB)",
                "16,896 followers"
            ],
            [
                "Public Company Accounting Oversight Board (PCAOB)",
                "16,896 followers"
            ],
            [
                "Harvard Business Review",
                "1,469,537 members"
            ],
            [
                "Harvard Business Review",
                "1,469,537 members"
            ],
            [
                "Cinedigm",
                "6,967 followers"
            ],
            [
                "Cinedigm",
                "6,967 followers"
            ]
        ],
        "recommendations": [
            [
                "Nathan Decker",
                "IT Management, CRM/ERP, Ecommerce, Microsoft Dynamics CRM, Microsoft Dynamics Great Plains, SQL, Reporting & Analysis",
                "February 5, 2016, Nathan worked with Ante in the same group",
                "I had the pleasure of working with Nathan early in his career at American Express. What makes Nathan standout is his ability to execute with a strategic mindset, ensuring that he delivers value to the customer and the company. Nathan is one of those individuals that loves a challenge, and is always looking for opportunities to transform and influence change through his strong relationship management and  communication skills. It's through these qualities that most individuals view Nathan as a trusted advisor whom they can leverage to help effect necessary change and is an asset to any leader, and works well with colleagues. I would enjoy the opportunity to work with Nathan again."
            ],
            [
                "Nathan Decker",
                "IT Management, CRM/ERP, Ecommerce, Microsoft Dynamics CRM, Microsoft Dynamics Great Plains, SQL, Reporting & Analysis",
                "February 5, 2016, Nathan worked with Ante in the same group"
            ],
            [
                "Nathan Decker",
                "IT Management, CRM/ERP, Ecommerce, Microsoft Dynamics CRM, Microsoft Dynamics Great Plains, SQL, Reporting & Analysis",
                "February 5, 2016, Nathan worked with Ante in the same group"
            ],
            [
                "Nathan Decker",
                "IT Management, CRM/ERP, Ecommerce, Microsoft Dynamics CRM, Microsoft Dynamics Great Plains, SQL, Reporting & Analysis",
                "February 5, 2016, Nathan worked with Ante in the same group"
            ],
            "IT Management, CRM/ERP, Ecommerce, Microsoft Dynamics CRM, Microsoft Dynamics Great Plains, SQL, Reporting & Analysis",
            [
                "I had the pleasure of working with Nathan early in his career at American Express. What makes Nathan standout is his ability to execute with a strategic mindset, ensuring that he delivers value to the customer and the company. Nathan is one of those individuals that loves a challenge, and is always looking for opportunities to transform and influence change through his strong relationship management and  communication skills. It's through these qualities that most individuals view Nathan as a trusted advisor whom they can leverage to help effect necessary change and is an asset to any leader, and works well with colleagues. I would enjoy the opportunity to work with Nathan again."
            ],
            [
                "I had the pleasure of working with Nathan early in his career at American Express. What makes Nathan standout is his ability to execute with a strategic mindset, ensuring that he delivers value to the customer and the company. Nathan is one of those individuals that loves a challenge, and is always looking for opportunities to transform and influence change through his strong relationship management and  communication skills. It's through these qualities that most individuals view Nathan as a trusted advisor whom they can leverage to help effect necessary change and is an asset to any leader, and works well with colleagues. I would enjoy the opportunity to work with Nathan again."
            ]
        ],
        "skills": [],
        "summary": "    An experienced leader with over 20 years of experience in the banking and financial services industry, leading enterprise wide transformational initiatives and processes that span across Finance, Program Financial Management and Identity and Access Management.\n  \n  \n",
        "name": "Ante Cajic",
        "title": "Managing Director",
        "url": "linkedin.com/in/ante-cajic-3166744",
        "phone": "",
        "email": "acajic@msn.com"
    }
]