[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "1 Mutual Connection",
                "You and Britton both know Eric Holmes"
            ],
            [
                "M-O-R-T-G-A-G-E... First comes love, then comes marry, then comes the  CRIB... now what about the baby in the baby carriage?",
                "...These two plan to wait a little while before bringing a little one on board.",
                "Congratulation's this beautiful couple with their first time purchase! It was a pleasure working together and providing the financing. What a year: Newly wed, and bought a home! Blessings to a future full of love, laughter, and a whole lot of joy!",
                "When one of your largest investments is handled with LOVE, the way we do it here, at Movement Mortgage, you can rest assure knowing that your home financing product(s) and process is in YOUR best interest. It is after all our mission- \"To love and value people...\"",
                "Be conscious about your financing options and choose a conscious lender.",
                "https://lnkd.in/gzMtpDr",
                "Britton shared this"
            ],
            [
                "Britton shared this"
            ],
            [
                "Britton shared this"
            ],
            "Recommendations",
            [
                "Diablo Valley College",
                "35,687 followers"
            ],
            [
                "Business Insider",
                "3,348,441 followers"
            ],
            [
                "Tony RobbinsTony Robbins is a LinkedIn Influencer",
                "#1 New York Times best-selling author, life and business strategist, philanthropist, entrepreneur",
                "3,373,224 followers"
            ],
            [
                "Bill GatesBill Gates is a LinkedIn Influencer",
                "Co-chair, Bill & Melinda Gates Foundation",
                "11,983,107 followers"
            ],
            [
                "Sierra Nevada College",
                "3,407 followers"
            ],
            [
                "David L. Katz, MD, MPH, FACPM, FACP, FACLMDavid L. Katz, MD, MPH, FACPM, FACP, FACLM is a LinkedIn Influencer",
                "Founder, True Health Initiative; CMO, FareWell; Senior Medical Advisor, Verywell.com",
                "890,675 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Diablo Valley College",
                "35,687 followers"
            ],
            [
                "Diablo Valley College",
                "35,687 followers"
            ],
            [
                "Business Insider",
                "3,348,441 followers"
            ],
            [
                "Business Insider",
                "3,348,441 followers"
            ],
            [
                "Tony RobbinsTony Robbins is a LinkedIn Influencer",
                "#1 New York Times best-selling author, life and business strategist, philanthropist, entrepreneur",
                "3,373,224 followers"
            ],
            [
                "Tony RobbinsTony Robbins is a LinkedIn Influencer",
                "#1 New York Times best-selling author, life and business strategist, philanthropist, entrepreneur",
                "3,373,224 followers"
            ],
            [
                "Tony Robbins is a LinkedIn Influencer"
            ],
            [
                "Bill GatesBill Gates is a LinkedIn Influencer",
                "Co-chair, Bill & Melinda Gates Foundation",
                "11,983,107 followers"
            ],
            [
                "Bill GatesBill Gates is a LinkedIn Influencer",
                "Co-chair, Bill & Melinda Gates Foundation",
                "11,983,107 followers"
            ],
            [
                "Bill Gates is a LinkedIn Influencer"
            ],
            [
                "Sierra Nevada College",
                "3,407 followers"
            ],
            [
                "Sierra Nevada College",
                "3,407 followers"
            ],
            [
                "David L. Katz, MD, MPH, FACPM, FACP, FACLMDavid L. Katz, MD, MPH, FACPM, FACP, FACLM is a LinkedIn Influencer",
                "Founder, True Health Initiative; CMO, FareWell; Senior Medical Advisor, Verywell.com",
                "890,675 followers"
            ],
            [
                "David L. Katz, MD, MPH, FACPM, FACP, FACLMDavid L. Katz, MD, MPH, FACPM, FACP, FACLM is a LinkedIn Influencer",
                "Founder, True Health Initiative; CMO, FareWell; Senior Medical Advisor, Verywell.com",
                "890,675 followers"
            ],
            [
                "David L. Katz, MD, MPH, FACPM, FACP, FACLM is a LinkedIn Influencer"
            ]
        ],
        "recommendations": [
            [
                "Shane Bohen",
                "Real Estate at Ruby Hill",
                "August 6, 2015, Shane was a client of Britton’s",
                "Integrity, Service and Rates.  Just a Pro!"
            ],
            [
                "Shane Bohen",
                "Real Estate at Ruby Hill",
                "August 6, 2015, Shane was a client of Britton’s"
            ],
            [
                "Shane Bohen",
                "Real Estate at Ruby Hill",
                "August 6, 2015, Shane was a client of Britton’s"
            ],
            [
                "Shane Bohen",
                "Real Estate at Ruby Hill",
                "August 6, 2015, Shane was a client of Britton’s"
            ],
            "Real Estate at Ruby Hill",
            [
                "Integrity, Service and Rates.  Just a Pro!"
            ],
            [
                "Integrity, Service and Rates.  Just a Pro!"
            ]
        ],
        "skills": [],
        "summary": "      I am on a mission to live powerfully, purposefully, and passionately and inspire you to do the same.  There is four fundamental areas of your life that when nurtured, leads to a healthy, happy, and abundant wellbeing: Creating a healthy environment, body, mind, as well as financial security leads to optimal wellbeing. For this reason I actively work within the financial, as well as, the health industry. As a conscious Mortgage Loan Officer I am dedicated to ensuring that the best interest of those I work with comes first. With over 7 years of experience within the financial industry it is always my priority to provide exceptional customer service, quick loan approval turnaround times, and an uncanny ability to generate new business, maintain customer satisfaction, and increase productivity. I am grateful to be working with a company that is alignment with my values. At Movement Mortgage “We exist to love and value people, by leading a movement of change within our industry, corporate cultures, and communities.”I am inspired to add value to those around me. My passion for healthy conscious living led me to pursue my entrepreneurial nature and in 2005 I founded Intuitive Touch which was later re-branded as Soulfully Free, a holistic health and wellness business. As a certified Life Coach, Mentor, Energy worker, and Yoga Teacher I am joyous about coaching and teaching mind, body, soul awareness, and the art of living a healthy, harmonious purpose driven life. I have successfully worked with hundreds of people from ranging from Doctors, Entrepreneurs, Servicemen, Athletes, to Artists, Mothers, and youth of all ages.With a BA in Environmental Science and Ecology, I am an advocate of supporting sustainable social, economic, and environmental growth. I believe that educating and empowering young minds is essential for the success of our future. I enjoy working with non-profits, as well as giving educational workshops and outreach programs committed to the same cause.\n  \n  \n",
        "name": "Britton Hudson",
        "title": "✦ Financial Industry✦ Mortgage Loan Officer✦ Real Estate ✦  Life Coach✦ Youth Mentor ✦ Yoga Teacher✦Massage Therapist",
        "url": "linkedin.com/in/brittonhudson",
        "phone": "",
        "email": "britton.hudson@yahoo.com"
    }
]