[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "22 Mutual Connections",
                "You and Tom both know Mark Botticelli, John Lemp, and 20 others"
            ],
            [
                "Infor Retail Again Named a Leader in 2017 Magic Quadrant for Retail Assortment Management Applications",
                "Tom liked"
            ],
            [
                "Want to Recruit the Best Data Science, Analytics, and Big Data Candidates? ...and for free?",
                "Tom liked"
            ],
            [
                "Local company making the internet accessible for all",
                "Tom liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Chief Executive Officer",
                "Company Name",
                "The Nerdery",
                "Dates Employed",
                "Jan 2016 – Present",
                "Employment Duration",
                "1 yr 11 mos",
                "Location",
                "Greater Minneapolis-St. Paul Area",
                "As the Chief Executive Officer my role is to lead our executive team, strategically working toward The Nerdery's vision to be the best place in the world for Nerds to work. In pursuit of this vision, we're blessed with hundreds of the best technologists in the world who believe that passionate Nerds are the driving force behind business breakthroughs. With capabilities in user experience design, software engineering, and enterprise systems integration our Nerds balance innovation with pragmatism creating real change in our customers' businesses. My goal is to continue to position our Nerds, my Co-Presidents, to apply their passions toward the most challenging and rewarding opportunities in the world today. We'll find passion for our customers' businesses that match that of our own. We'll learn, grow, and evolve our capabilities and offerings to create solutions that redefine what's possible through technology."
            ],
            [
                "President",
                "Company Name",
                "The Nerdery",
                "Dates Employed",
                "Dec 2013 – Jan 2016",
                "Employment Duration",
                "2 yrs 2 mos",
                "Location",
                "Greater Minneapolis-St. Paul Area",
                "In 2013 I was given the honor to be the first President at The Nerdery since founding-President Luke Bucklin passed away in 2011. I learned from Luke and then CEO Mike Derheim how to empower my fellow Nerds through distributed leadership, I shared the title of Co-President with almost 500 Nerds across the country.As President, I was able to position our Nerds to be the driving force behind business breakthroughs, and to find a passion for our customers' business that matches that of our own. I've been blessed with an exceptional executive team that leads a world-class group of technologists including Design and Development on enterprise-web, mobile, enterprise business system integration, and custom software development.I was challenged to balance growth in revenue and profit with our vision, to be the best place in the world for Nerds work. My proudest achievement was evolving the executive leadership team to a world-class group of Nerds capable of taking our business to the next level."
            ],
            [
                "Chief Operating Officer",
                "Company Name",
                "The Nerdery",
                "Dates Employed",
                "Oct 2011 – Dec 2013",
                "Employment Duration",
                "2 yrs 3 mos",
                "Location",
                "Bloomington, MN",
                "As the the Chief Operating Officer I was empowered with the opportunity to led our Sales, Marketing, and Software Development teams. Reporting directly to the CEO, I managed all aspects of the day to day operations and lead the ongoing strategic and operational planning processes. As the COO I was able to build experience across all aspects of the business and was challenged to build a leadership team that would take us to the next level. This experience helped me learn how to operate at the enterprise level, guided by the vision and values of our organization. Over this three year period, I was blessed with an incredible team that was able to grow the annual revenue almost 140%. We were also able to grow net income by over 300% in the same period of time. My proudest achievements as the COO including leading the launch of our Kansas City office, hiring hundreds of the smartest Nerds in the Midwest, and learning to empower a growing culture at large scale. The Nerdery was honored with several top workplace awards and recognized for growth."
            ],
            [
                "Vice President of Software Development",
                "Company Name",
                "The Nerdery",
                "Dates Employed",
                "Oct 2008 – Oct 2011",
                "Employment Duration",
                "3 yrs 1 mo",
                "Location",
                "Bloomington, MN",
                "In late 2008 I was promoted from Director to the Vice President of Software Development. This promotion gave me the opportunity to join the executive leadership team at The Nerdery where I was able to contribute to the organization at a more strategic level. As the VP of Software Development I established a strategic direction for the development team, partnered with sales and marketing to evaluate and capitalize on market opportunities, and helped led the organization through year over year revenue growth ranging from 33% to 85%.My proudest achievements as the VP of Software Development included building a development leadership team, expanding our service offering, and opening our Chicago office. In all aspects of my job I leveraged the incredible talents of my fellow Co-Presidents."
            ],
            [
                "The Nerdery, Sierra Bravo Corporation",
                "Company Name",
                "Software Engineer to Director of Software Development",
                "Dates Employed",
                "Sep 2004 – Oct 2008",
                "Employment Duration",
                "4 yrs 2 mos",
                "Location",
                "Bloomington, MN",
                "I joined The Nerdery (then Sierra Bravo Corporation) as a software engineer in late 2004. At the time the company was just a small start-up focused on building custom integrations to legacy business systems. When I joined my primary responsibilities were to design and develop custom web applications that augmented existing business systems with a modern interface and solving new business problems. Over the next four years I was empowered to help our founders grow the business by supporting sales, leading/managing projects, providing customer service, managing the recruiting process, expanding the service offering, and of course writing a ton of code. Over the years, as I took on new responsibilities, I was given the opportunity to learn and grow professionally and rewarded with leadership roles including Software Development Manager, Lead Development Manager, and finally the Director of Software Development. My proudest achievement during this four year period was building a software development team that was engaged, effective, and efficient. I learned that surrounding myself with Project Managers, Designers, and Engineers smarter than me was the secret to success. This team, and the culture it created, helped make The Nerdery a destination employer and a well respected leader in the technology community."
            ],
            [
                "Analyst/Interactive Developer",
                "Company Name",
                "PR Productions",
                "Dates Employed",
                "Sep 2003 – Sep 2004",
                "Employment Duration",
                "1 yr 1 mo",
                "Location",
                "Minneapolis, MN",
                "PR productions was a media company that owned and operated several web and media properties based out of Minneapolis from 2001 through 2009. I was hired as a software developer with the responsibility of maintaining and enhancing the software product behind their primary business, a now defunct dating website. At the time of my employment the website had over 1 million registered users and was growing in a very competitive market. My job responsibilities included managing the entire product life cycle from strategic planning to actual implementation and maintenance. I worked with stakeholders and business owners to define market requirements for current and future features. I did the majority of the actual software development and architecture for the product."
            ],
            [
                "Founder/Programmer/Analyst/Project Manager",
                "Company Name",
                "Imaginative Solutions",
                "Dates Employed",
                "Dec 2001 – Sep 2003",
                "Employment Duration",
                "1 yr 10 mos",
                "Location",
                "Winona, MN",
                "Imaginative Solutions was my first experience as an entrepreneur. Along with my business partner, I founded and led a small technical consultancy providing custom software development and supporting financial accounting and enterprise resource planning systems. Running Imaginative Solutions gave me great exposure to all aspects of running a small business as well as continued experience in consulting and software development. My experience included sales, small business accounting, human resources, and planning."
            ],
            [
                "Programmer/Analyst/Consultant",
                "Company Name",
                "Buroak Consulting",
                "Dates Employed",
                "Oct 1998 – Dec 2000",
                "Employment Duration",
                "2 yrs 3 mos",
                "Location",
                "Winona, MN",
                "At BurOak Consulting I worked as an analyst/consultant to implement and integrate financial accounting and enterprise resource planning software for small and medium sized businesses. Job duties included requirements analysis, planning, end-to-end system migration, custom application development, training, and project management. As the primary consultant and engineer on many implementations, upgrades, and system enhancements I had exposure to a variety of business problems and technologies. The solutions I was able to architect and implement for our clients included integration and custom development on warehouse management systems (WMS), mobile data capture applications, customer relationship management (CRM) system, electronic data interchange (EDI) software, and enterprise resource planning (ERP) software. My experience at BurOak Consulting provided a great foundation working in an a small business focused on customer service and pragmatic solutions to real business problems."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Winona State University",
                "Degree Name",
                "Computer Science",
                "Field Of Study",
                "Computer Science",
                "Dates attended or expected graduation",
                "1999 – 2003",
                "Activities and Societies:",
                "Computer Science, Founder of Snowboarding Club"
            ],
            [
                "Winona State University",
                "Degree Name",
                "Computer Science",
                "Field Of Study",
                "Computer Science",
                "Dates attended or expected graduation",
                "1999 – 2003",
                "Activities and Societies:",
                "Computer Science, Founder of Snowboarding Club"
            ],
            [
                "Colorado Mountain College",
                "Degree Name",
                "Associate of Arts (AA)",
                "Field Of Study",
                "Computer Science",
                "Dates attended or expected graduation",
                "1998 – 1999"
            ],
            [
                "Colorado Mountain College",
                "Degree Name",
                "Associate of Arts (AA)",
                "Field Of Study",
                "Computer Science",
                "Dates attended or expected graduation",
                "1998 – 1999"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "Infusionsoft",
                "16,689 followers"
            ],
            [
                "Python Web Developers",
                "35,739 members"
            ],
            [
                "Craft CMS",
                "251 members"
            ],
            [
                "Chicago Interactive Marketing Association (CIMA)",
                "15,936 members"
            ],
            [
                "Mobile Experts ★ Android ★ iPhone",
                "208,057 members"
            ],
            [
                "Codeigniter Developers Group",
                "10,897 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Infusionsoft",
                "16,689 followers"
            ],
            [
                "Infusionsoft",
                "16,689 followers"
            ],
            [
                "Python Web Developers",
                "35,739 members"
            ],
            [
                "Python Web Developers",
                "35,739 members"
            ],
            [
                "Craft CMS",
                "251 members"
            ],
            [
                "Craft CMS",
                "251 members"
            ],
            [
                "Chicago Interactive Marketing Association (CIMA)",
                "15,936 members"
            ],
            [
                "Chicago Interactive Marketing Association (CIMA)",
                "15,936 members"
            ],
            [
                "Mobile Experts ★ Android ★ iPhone",
                "208,057 members"
            ],
            [
                "Mobile Experts ★ Android ★ iPhone",
                "208,057 members"
            ],
            [
                "Codeigniter Developers Group",
                "10,897 members"
            ],
            [
                "Codeigniter Developers Group",
                "10,897 members"
            ]
        ],
        "recommendations": [
            [
                "Eric Gustafson",
                "Web Developer at R&D Systems",
                "November 26, 2007, Eric reported directly to Tom",
                "Tom is a straight shooter, who hasn't forgotten that software is more than just ones and zeros."
            ],
            [
                "Eric Gustafson",
                "Web Developer at R&D Systems",
                "November 26, 2007, Eric reported directly to Tom"
            ],
            [
                "Eric Gustafson",
                "Web Developer at R&D Systems",
                "November 26, 2007, Eric reported directly to Tom"
            ],
            [
                "Eric Gustafson",
                "Web Developer at R&D Systems",
                "November 26, 2007, Eric reported directly to Tom"
            ],
            "Web Developer at R&D Systems",
            [
                "Tom is a straight shooter, who hasn't forgotten that software is more than just ones and zeros."
            ],
            [
                "Tom is a straight shooter, who hasn't forgotten that software is more than just ones and zeros."
            ],
            [
                "Sarah Hoops",
                "Technology Consultant Engagements Tailored to your Needs and Goals",
                "September 21, 2016, Tom was senior to Sarah but didn’t manage directly",
                "Sarah has a great work ethic and is driven to meet or exceed expectations both for her team and her customers. In the five years I've worked with Sarah I've been impressed with her grit and commitment to excellent customer service."
            ],
            [
                "Sarah Hoops",
                "Technology Consultant Engagements Tailored to your Needs and Goals",
                "September 21, 2016, Tom was senior to Sarah but didn’t manage directly"
            ],
            [
                "Sarah Hoops",
                "Technology Consultant Engagements Tailored to your Needs and Goals",
                "September 21, 2016, Tom was senior to Sarah but didn’t manage directly"
            ],
            [
                "Sarah Hoops",
                "Technology Consultant Engagements Tailored to your Needs and Goals",
                "September 21, 2016, Tom was senior to Sarah but didn’t manage directly"
            ],
            "Technology Consultant Engagements Tailored to your Needs and Goals",
            [
                "Sarah has a great work ethic and is driven to meet or exceed expectations both for her team and her customers. In the five years I've worked with Sarah I've been impressed with her grit and commitment to excellent customer service."
            ],
            [
                "Sarah has a great work ethic and is driven to meet or exceed expectations both for her team and her customers. In the five years I've worked with Sarah I've been impressed with her grit and commitment to excellent customer service."
            ],
            [
                "Ryan Carlson",
                "Director of Digital Transformation Services at Exosite",
                "November 3, 2015, Tom was senior to Ryan but didn’t manage directly",
                "Ryan is a passionate and energetic driver of culture and innovation. He has a great attitude and strong work ethic. What I admire most about Ryan is his natural ability to engage an audience. I'd recommend Ryan for anyone looking for a technology evangelist, sales engineer, or an innovator of any kind."
            ],
            [
                "Ryan Carlson",
                "Director of Digital Transformation Services at Exosite",
                "November 3, 2015, Tom was senior to Ryan but didn’t manage directly"
            ],
            [
                "Ryan Carlson",
                "Director of Digital Transformation Services at Exosite",
                "November 3, 2015, Tom was senior to Ryan but didn’t manage directly"
            ],
            [
                "Ryan Carlson",
                "Director of Digital Transformation Services at Exosite",
                "November 3, 2015, Tom was senior to Ryan but didn’t manage directly"
            ],
            "Director of Digital Transformation Services at Exosite",
            [
                "Ryan is a passionate and energetic driver of culture and innovation. He has a great attitude and strong work ethic. What I admire most about Ryan is his natural ability to engage an audience. I'd recommend Ryan for anyone looking for a technology evangelist, sales engineer, or an innovator of any kind."
            ],
            [
                "Ryan is a passionate and energetic driver of culture and innovation. He has a great attitude and strong work ethic. What I admire most about Ryan is his natural ability to engage an audience. I'd recommend Ryan for anyone looking for a technology evangelist, sales engineer, or an innovator of any kind."
            ]
        ],
        "skills": [
            [
                "Leadership",
                "See 53 endorsements for Leadership",
                "53",
                "Leadership",
                "Endorse",
                "Endorsed by Jon Bauer, MBA and 1 other mutual connection",
                "Endorsed by 27 of Tom’s colleagues at The Nerdery"
            ],
            [
                "Leadership",
                "See 53 endorsements for Leadership",
                "53"
            ],
            [
                "Enterprise Architecture",
                "See 3 endorsements for Enterprise Architecture",
                "3",
                "Enterprise Architecture",
                "Endorse",
                "Mike Ramler, MBA and 2 connections have given endorsements for this skill"
            ],
            [
                "Enterprise Architecture",
                "See 3 endorsements for Enterprise Architecture",
                "3"
            ],
            [
                "Digital Strategy",
                "See 5 endorsements for Digital Strategy",
                "5",
                "Digital Strategy",
                "Endorse",
                "Mike Ramler, MBA and 4 connections have given endorsements for this skill"
            ],
            [
                "Digital Strategy",
                "See 5 endorsements for Digital Strategy",
                "5"
            ],
            [
                "Business Strategy",
                "See 4 endorsements for Business Strategy",
                "4",
                "Business Strategy",
                "Endorse"
            ],
            [
                "Business Strategy",
                "See 4 endorsements for Business Strategy",
                "4"
            ],
            [
                "Strategy",
                "See 2 endorsements for Strategy",
                "2",
                "Strategy",
                "Endorse"
            ],
            [
                "Strategy",
                "See 2 endorsements for Strategy",
                "2"
            ],
            [
                "Business Technology",
                "See 3 endorsements for Business Technology",
                "3",
                "Business Technology",
                "Endorse"
            ],
            [
                "Business Technology",
                "See 3 endorsements for Business Technology",
                "3"
            ],
            [
                "Enterprise Software",
                "See 3 endorsements for Enterprise Software",
                "3",
                "Enterprise Software",
                "Endorse"
            ],
            [
                "Enterprise Software",
                "See 3 endorsements for Enterprise Software",
                "3"
            ],
            [
                "Strategic Planning",
                "See 36 endorsements for Strategic Planning",
                "36",
                "Strategic Planning",
                "Endorse"
            ],
            [
                "Strategic Planning",
                "See 36 endorsements for Strategic Planning",
                "36"
            ],
            [
                "Software Product Management",
                "See 3 endorsements for Software Product Management",
                "3",
                "Software Product Management",
                "Endorse"
            ],
            [
                "Software Product Management",
                "See 3 endorsements for Software Product Management",
                "3"
            ],
            [
                "Mobile Technology",
                "See 1 endorsement for Mobile Technology",
                "1",
                "Mobile Technology",
                "Endorse"
            ],
            [
                "Mobile Technology",
                "See 1 endorsement for Mobile Technology",
                "1"
            ],
            [
                "Web Development",
                "See 144 endorsements for Web Development",
                "99+",
                "Web Development",
                "Endorse"
            ],
            [
                "Web Development",
                "See 144 endorsements for Web Development",
                "99+"
            ],
            [
                "Mobile Applications",
                "See 67 endorsements for Mobile Applications",
                "67",
                "Mobile Applications",
                "Endorse"
            ],
            [
                "Mobile Applications",
                "See 67 endorsements for Mobile Applications",
                "67"
            ],
            [
                "Management",
                "See 43 endorsements for Management",
                "43",
                "Management",
                "Endorse"
            ],
            [
                "Management",
                "See 43 endorsements for Management",
                "43"
            ],
            [
                "Software Development",
                "See 40 endorsements for Software Development",
                "40",
                "Software Development",
                "Endorse"
            ],
            [
                "Software Development",
                "See 40 endorsements for Software Development",
                "40"
            ],
            [
                "Information Architecture",
                "See 29 endorsements for Information Architecture",
                "29",
                "Information Architecture",
                "Endorse"
            ],
            [
                "Information Architecture",
                "See 29 endorsements for Information Architecture",
                "29"
            ],
            [
                "Software Project Management",
                "See 21 endorsements for Software Project Management",
                "21",
                "Software Project Management",
                "Endorse"
            ],
            [
                "Software Project Management",
                "See 21 endorsements for Software Project Management",
                "21"
            ],
            [
                "Interactive Strategy",
                "See 7 endorsements for Interactive Strategy",
                "7",
                "Interactive Strategy",
                "Endorse"
            ],
            [
                "Interactive Strategy",
                "See 7 endorsements for Interactive Strategy",
                "7"
            ],
            [
                "Web Applications",
                "See 7 endorsements for Web Applications",
                "7",
                "Web Applications",
                "Endorse"
            ],
            [
                "Web Applications",
                "See 7 endorsements for Web Applications",
                "7"
            ]
        ],
        "summary": "",
        "name": "Tom O'Neill",
        "title": "Chief Executive Officer at The Nerdery",
        "url": "linkedin.com/in/tomoneill",
        "phone": "",
        "email": "tomoneill@gmail.com"
    }
]