[
    {
        "experience": [
            "Highlights",
            [
                "66 Mutual Connections",
                "You and Juliann both know Fred Yu, Erika Flora PMP, PgMP, ITIL Expert,PRINCE2,CSP, and 64 others"
            ],
            [
                "Juliann can introduce you to 14 people at American Express",
                "You are following American Express"
            ],
            [
                "Kelli Vandagriff Looking for outstanding Nurses who go above and beyond when it comes to patient care. Are you a part of the top 10% of nurses in the US? Then I want to talk with you! Hiring for positions in Texas, California, Florida and Georgia.  Also traveling positions in California",
                "Know of a fantastic nurse? I pay referrals!",
                "Juliann shared this"
            ],
            [
                "Corporate Controller role with large, Billion dollar annual revenue company. Ideal industry is large distribution, healthcare, or Manufacturing. Salary is high six figures Base + Bonus. This position manages a team of 15 and is based in Phoenix, AZ. For immediate consideration, please email me at wspengler@teemagroup.com or call my cell phone at 410-913-7236.",
                "Juliann liked"
            ],
            [
                "I just had 3 offers turned down in the last week. Rough week right? Sure, not winning stinks, but this is a recruiters job:",
                "Wake up everyday to provide the best opportunities we can to our candidates, find the top notch candidates for our teams, walk them both through the process, prep them, listen to them, advise them.......and at the end of the day, you can't win them all but you CAN walk away knowing you did the best job that you could, you used all of the tools in your toolbox, and YOU change peoples lives. Whether they choose your team or not, you still were an outstanding advisor, and by god, you're going to stay that way.",
                "Juliann liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Sr. Associate - Talent Manager",
                "Company Name",
                "TEEMA Solutions Group Inc",
                "Dates Employed",
                "Nov 2014 – Present",
                "Employment Duration",
                "3 yrs",
                "Location",
                "Phoenix, Arizona Area",
                "TEEMA Solutions Group Inc. (TEEMA) has become one of the fastest growing Staffing Solutions company in North America.   Our focus is delivering full-cycle staffing solutions, whether that is short term, contract or long term, permanent. We love our clients and we support them by placing quality people in the right position at the right time.  TEEMA is governed by rock solid values, a mandate to empower our members and a commitment to excellence. Our Members are the most tenured in the staffing industry, with deep and wide networks of talented resources. We are passionate about what we do. Our clients have access to a wealth of experience unsurpassed in staffing. We believe the future is about ‘disrupting our industry‘ and our rapid growth is evident of that (cited by Profit 50, Red Herring, INC 5000 and Branham 300).   Come join the revolution.   Visit our company page: TEEMA on LinkedIn"
            ],
            [
                "VP Of Recruiting",
                "Company Name",
                "Samuel HR Services, Inc.",
                "Dates Employed",
                "Sep 2011 – Nov 2014",
                "Employment Duration",
                "3 yrs 3 mos",
                "Location",
                "Gilbert, AZ",
                "Samuel HR specializes in executive medical recruiting for hospitals and medical clinics nationwide. Director of Recruiting overseeing operations and supervision of 25 employees.\t[May 2012 – Nov 2014]•\tManaged entire operation on behalf of an absentee owner, hiring and training healthcare recruiters, reviewing contracts and requisitions, sourcing executive talent (physicians and hospital CEOs) and matching qualified candidates with client needs.•\tHired, coached, trained and managed recruiting staff, resolved employee differences, and encouraged an atmosphere of professionalism; leading to higher commissions and improved morale.•\tIntroduced a step-by-step training program that empowered recruiters to complete their first hire within 2 weeks, rather than the previous model of 3-4 months.•\tWorked with recruiters in helping to surpass metrics and attain goals.•\tIncreased client fee schedule by 125% without affecting the ability to bring in new business.•\tGrew annual revenues by 2500% (from 6 to 8 figures) during tenure and expanded staff from 8 to 25.Recruiter\t[Sep 2011 – May 2012]•\tLaunched career with zero clients, established relationships, sourced executive candidates, and negotiated contracts and salaries.•\tGenerated 250% more in fees than the average new hire.•\tManaged both clients and candidates in a full-desk."
            ],
            [
                "Lodge Director",
                "Company Name",
                "Evergreen Elks Lodge",
                "Dates Employed",
                "Mar 2007 – Feb 2011",
                "Employment Duration",
                "4 yrs",
                "Location",
                "Evergreen, CO",
                "The Elks Lodge is a private club with 6,000 square feet of meeting space for special events.Lodge Director managing daily operations and a staff of 5 bartenders and 2 janitors.•\tNegotiated event contracts, paid bills, maintained inventory, processed customer payments and employee payroll, hired and scheduled event staff.•\tGrew revenues and bookings significantly, from 2 main events annually to approximately 3 per month through customer referrals, guest experiences, and advertising in local wedding magazines. •\tAchieved annual savings on liquor costs by more than 25% with volume purchases and enforcing pour rules behind the bar.•\tTransformed losses into profits by re-evaluating contracts and adding customary charges.•\tSecured a fraternal organization gambling license and consistently passed state audits."
            ],
            [
                "Tradeshow Manager",
                "Company Name",
                "Melco Embroidery Systems",
                "Dates Employed",
                "Mar 2006 – Feb 2007",
                "Employment Duration",
                "1 yr",
                "Location",
                "Greater Denver Area",
                "Tradeshow Manager charged with on-site management of a 30x20 foot booth at 24 major conventions.•\tTraveled to tradeshows throughout the country, coordinated logistics of booth pieces and marketing materials; managed staff throughout the show, booked lodging, and reserved rental cars.  •\tHelped set up (and later tear down) an elaborate booth display over a 3-day period. •\tSelected gifts and advertising pieces to hand out to booth visitors."
            ],
            [
                "Director of Exhibitions and Marketing",
                "Company Name",
                "Evergreen Arts",
                "Dates Employed",
                "Feb 2005 – Dec 2005",
                "Employment Duration",
                "11 mos",
                "Location",
                "Evergreen, CO",
                "The Evergreen Center for the Arts is a unique gallery and gathering place for artists of all skill levels and disciplines to display and sell their works, and learn from others through workshops. Director of Exhibitions and Marketing\t•\tCreated and distributed all marketing materials, including press releases which resulted in free publicity every month in the calendar section of the Denver Post and Rocky Mountain News.•\tOrchestrated Summerfest and Winterfest, two prestigious festivals showcasing works by talented artists, attracting 5,000 people, and generating about $100,000 in revenue for each event. •\tCoordinated more than 100 volunteers for the entire operation to assist with incoming calls, direct mail, and gallery sales and inquiries.•\tChanged out the gallery every month with new exhibits, coordinating removal of previous month’s works and installation of new pieces. •\tContracted with artists and reserved space for classroom instruction. •\tRaised $10K by creating and administering 100 for $100, getting 100 artists to donate a piece of artwork for auction.•\tConceived a 6-week long event for artists to Paint, Sculpt and Shoot at the venues, which became the largest fundraiser event for the center..•\tHired musicians and purchased fruit, cheese, and wine for the Friday Art Walk."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "University of Phoenix",
                "Degree Name",
                "BS",
                "Field Of Study",
                "Business Administration and Management, General"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "Quad Cities PMI Chapter",
                "355 members"
            ],
            [
                "OnX Enterprise Solutions",
                "11,154 followers"
            ],
            [
                "TEEMA Solutions Group",
                "367 members"
            ],
            [
                "TEEMA Group",
                "25,453 followers"
            ],
            [
                "The Virtual recruiter",
                "2,196 members"
            ],
            [
                "University of Phoenix",
                "787,806 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Quad Cities PMI Chapter",
                "355 members"
            ],
            [
                "Quad Cities PMI Chapter",
                "355 members"
            ],
            [
                "OnX Enterprise Solutions",
                "11,154 followers"
            ],
            [
                "OnX Enterprise Solutions",
                "11,154 followers"
            ],
            [
                "TEEMA Solutions Group",
                "367 members"
            ],
            [
                "TEEMA Solutions Group",
                "367 members"
            ],
            [
                "TEEMA Group",
                "25,453 followers"
            ],
            [
                "TEEMA Group",
                "25,453 followers"
            ],
            [
                "The Virtual recruiter",
                "2,196 members"
            ],
            [
                "The Virtual recruiter",
                "2,196 members"
            ],
            [
                "University of Phoenix",
                "787,806 followers"
            ],
            [
                "University of Phoenix",
                "787,806 followers"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Leadership",
                "See 26 endorsements for Leadership",
                "26",
                "Leadership",
                "Endorse",
                "Endorsed by Eric Walker, who is highly skilled at this",
                "Endorsed by Gretchen Spain and 1 other mutual connection"
            ],
            [
                "Leadership",
                "See 26 endorsements for Leadership",
                "26"
            ],
            [
                "Recruiting",
                "See 23 endorsements for Recruiting",
                "23",
                "Recruiting",
                "Endorse",
                "Endorsed by Brendon Myles Carroll, CIR, CDR and 1 other who is highly skilled at this",
                "Endorsed by Glen Chamberlain and 1 other mutual connection"
            ],
            [
                "Recruiting",
                "See 23 endorsements for Recruiting",
                "23"
            ],
            [
                "Training",
                "See 22 endorsements for Training",
                "22",
                "Training",
                "Endorse",
                "Endorsed by Tim Bell, who is highly skilled at this",
                "Endorsed by Gretchen Spain (mutual connection)"
            ],
            [
                "Training",
                "See 22 endorsements for Training",
                "22"
            ],
            [
                "Management",
                "See 19 endorsements for Management",
                "19",
                "Management",
                "Endorse"
            ],
            [
                "Management",
                "See 19 endorsements for Management",
                "19"
            ],
            [
                "Sourcing",
                "See 11 endorsements for Sourcing",
                "11",
                "Sourcing",
                "Endorse"
            ],
            [
                "Sourcing",
                "See 11 endorsements for Sourcing",
                "11"
            ],
            [
                "Human Resources",
                "See 9 endorsements for Human Resources",
                "9",
                "Human Resources",
                "Endorse"
            ],
            [
                "Human Resources",
                "See 9 endorsements for Human Resources",
                "9"
            ],
            [
                "Hiring",
                "See 7 endorsements for Hiring",
                "7",
                "Hiring",
                "Endorse"
            ],
            [
                "Hiring",
                "See 7 endorsements for Hiring",
                "7"
            ],
            [
                "Temporary Placement",
                "See 6 endorsements for Temporary Placement",
                "6",
                "Temporary Placement",
                "Endorse"
            ],
            [
                "Temporary Placement",
                "See 6 endorsements for Temporary Placement",
                "6"
            ],
            [
                "Talent Acquisition",
                "See 5 endorsements for Talent Acquisition",
                "5",
                "Talent Acquisition",
                "Endorse"
            ],
            [
                "Talent Acquisition",
                "See 5 endorsements for Talent Acquisition",
                "5"
            ],
            [
                "Marketing",
                "See 4 endorsements for Marketing",
                "4",
                "Marketing",
                "Endorse"
            ],
            [
                "Marketing",
                "See 4 endorsements for Marketing",
                "4"
            ],
            [
                "Program Management",
                "See 4 endorsements for Program Management",
                "4",
                "Program Management",
                "Endorse"
            ],
            [
                "Program Management",
                "See 4 endorsements for Program Management",
                "4"
            ],
            [
                "Sales",
                "See 4 endorsements for Sales",
                "4",
                "Sales",
                "Endorse"
            ],
            [
                "Sales",
                "See 4 endorsements for Sales",
                "4"
            ],
            [
                "Internet Recruiting",
                "See 3 endorsements for Internet Recruiting",
                "3",
                "Internet Recruiting",
                "Endorse"
            ],
            [
                "Internet Recruiting",
                "See 3 endorsements for Internet Recruiting",
                "3"
            ],
            [
                "Applicant Tracking Systems",
                "See 3 endorsements for Applicant Tracking Systems",
                "3",
                "Applicant Tracking Systems",
                "Endorse"
            ],
            [
                "Applicant Tracking Systems",
                "See 3 endorsements for Applicant Tracking Systems",
                "3"
            ],
            [
                "Account Management",
                "See 3 endorsements for Account Management",
                "3",
                "Account Management",
                "Endorse"
            ],
            [
                "Account Management",
                "See 3 endorsements for Account Management",
                "3"
            ],
            [
                "Business Development",
                "See 2 endorsements for Business Development",
                "2",
                "Business Development",
                "Endorse"
            ],
            [
                "Business Development",
                "See 2 endorsements for Business Development",
                "2"
            ],
            [
                "Executive Search",
                "See 2 endorsements for Executive Search",
                "2",
                "Executive Search",
                "Endorse"
            ],
            [
                "Executive Search",
                "See 2 endorsements for Executive Search",
                "2"
            ],
            [
                "Fundraising",
                "See 1 endorsement for Fundraising",
                "1",
                "Fundraising",
                "Endorse"
            ],
            [
                "Fundraising",
                "See 1 endorsement for Fundraising",
                "1"
            ],
            [
                "Hospitals",
                "See 1 endorsement for Hospitals",
                "1",
                "Hospitals",
                "Endorse"
            ],
            [
                "Hospitals",
                "See 1 endorsement for Hospitals",
                "1"
            ]
        ],
        "summary": "    Offer more than 10 years of diverse leadership experience in recruiting, operations, and a business degree. Consistent track record for hiring and training top performing recruiters, sourcing qualified candidates, and managing client expectations. Tactful and diplomatic. Extremely organized and adaptable. Known for reversing losses, streamlining procedures, reducing costs, and achieving efficient operations. Strong negotiator.\n  \n  \n",
        "name": "Juliann Koehler",
        "title": "Sr. Associate at TEEMA Solutions Group",
        "url": "linkedin.com/in/juliann-koehler",
        "phone": "480-241-6508 (Work)",
        "email": "jkoehler@teemagroup.com"
    }
]