[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "3 Mutual Connections",
                "You and Rafail both know Joe Pierce, Dave Narania, and 1 other"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Software Engineer",
                "Company Name",
                "Adecco Technical",
                "Dates Employed",
                "Jun 2010 – Nov 2010",
                "Employment Duration",
                "6 mos",
                "Software development contractor working at Garmin AT."
            ],
            [
                "Software Engineer",
                "Company Name",
                "AZAD, Inc",
                "Dates Employed",
                "Oct 2008 – Feb 2009",
                "Employment Duration",
                "5 mos",
                "Developed, debugged and tested custom logical analyzer Windows XP based code for Tektronix, Inc.Designed and delivered utility for signal simulator programming file analysis.Researched and debugged customer's signal simulator code.Performed white box and black box testing and documented discovered deficiencies."
            ],
            [
                "Software Development Engineer in Test",
                "Company Name",
                "Volt Technical Resources",
                "Dates Employed",
                "May 2008 – Nov 2008",
                "Employment Duration",
                "7 mos",
                "Developed, coded and debugged tests, analyzed failures and documented deficiencies (bugs) in Windows Vista environment during assignment at Microsoft Corp.Developed automated verification tests of newly developed API.Automated regression test for a set of intrinsic compiler functions.Delivered applications for ad hoc testing of newly developed modules. Performed setup testing of elements of new version of Microsoft development tools."
            ],
            [
                "Firmware Engineer",
                "Company Name",
                "PECO, Inc",
                "Dates Employed",
                "Nov 2003 – Jan 2008",
                "Employment Duration",
                "4 yrs 3 mos",
                "Designed, developed, tested, and debugged Windows CE and .NET Compact Framework based embedded application for paper industry.Developed user interaction specifications; designed, coded in C# and debugged user interface components of the application.  Overcame a challenge of handling input device with restricted capabilities.Increased robustness of the whole application by making it more user-proof. Designed algorithms for safe operation of the electromechanical parts of the system.Developed firmware of the data acquisition board based on PIC18F4525 8-bit microcontroller. Modification that I made helped investigate and eliminate hardware related problem.Created requirements and directed work of outside consultants, which resulted in a set of meaningful test scripts and creation of flexible user-friendly error handling framework.Eliminated serial communication failures by optimizing code.Improved operation manual by making it more accurate.Performed research of the video subsystem and recommended changes in hardware to improve end user experience.Documented designs and research results in form of engineering reports and specifications"
            ],
            [
                "Software Engineer",
                "Company Name",
                "Inovec, Inc",
                "Dates Employed",
                "Jan 1995 – Jul 2006",
                "Employment Duration",
                "11 yrs 7 mos",
                "Designed, developed, tested, and debugged real time software for optimization and control systems for lumber industry. Provided training and support for customers and field service engineers. Installed and configured optimization software systems on site."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Kazan National Research Technical University named after A.N.Tupolev – KAI",
                "Degree Name",
                "Master",
                "Field Of Study",
                "Mechanical Engineering",
                "Dates attended or expected graduation",
                "1976 – 1982"
            ],
            [
                "Kazan National Research Technical University named after A.N.Tupolev – KAI",
                "Degree Name",
                "Master",
                "Field Of Study",
                "Mechanical Engineering",
                "Dates attended or expected graduation",
                "1976 – 1982"
            ],
            [
                "Lane Community College"
            ],
            [
                "Lane Community College"
            ],
            [
                "Znanie Association"
            ],
            [
                "Znanie Association"
            ],
            "Recommendations",
            [
                "Empower with Redhat Linux",
                "224 members"
            ],
            [
                "Firmware / Embedded Software",
                "24,505 members"
            ],
            [
                "Казанский национальный исследовательский технический университет им. А.Н.Туполева - КАИ",
                "4,424 followers"
            ],
            [
                "The Fountain Group",
                "3,085 followers"
            ],
            [
                "Python Professionals",
                "67,717 members"
            ],
            [
                "SQAUG - Software Quality Assurance User Group",
                "359 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (171)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Empower with Redhat Linux",
                "224 members"
            ],
            [
                "Empower with Redhat Linux",
                "224 members"
            ],
            [
                "Firmware / Embedded Software",
                "24,505 members"
            ],
            [
                "Firmware / Embedded Software",
                "24,505 members"
            ],
            [
                "Казанский национальный исследовательский технический университет им. А.Н.Туполева - КАИ",
                "4,424 followers"
            ],
            [
                "Казанский национальный исследовательский технический университет им. А.Н.Туполева - КАИ",
                "4,424 followers"
            ],
            [
                "The Fountain Group",
                "3,085 followers"
            ],
            [
                "The Fountain Group",
                "3,085 followers"
            ],
            [
                "Python Professionals",
                "67,717 members"
            ],
            [
                "Python Professionals",
                "67,717 members"
            ],
            [
                "SQAUG - Software Quality Assurance User Group",
                "359 members"
            ],
            [
                "SQAUG - Software Quality Assurance User Group",
                "359 members"
            ]
        ],
        "recommendations": [
            [
                "Jeff Franklin",
                "Sawmill Optimization Consultant",
                "January 16, 2013, Jeff worked with Rafail in different groups",
                "Rafail was a pleasure to work with, and was a very dependable member of our team.  He was very good at solving problems and worked long and hard to satisfy our customers with new features and capabilities in our real-time machine control applications."
            ],
            [
                "Jeff Franklin",
                "Sawmill Optimization Consultant",
                "January 16, 2013, Jeff worked with Rafail in different groups"
            ],
            [
                "Jeff Franklin",
                "Sawmill Optimization Consultant",
                "January 16, 2013, Jeff worked with Rafail in different groups"
            ],
            [
                "Jeff Franklin",
                "Sawmill Optimization Consultant",
                "January 16, 2013, Jeff worked with Rafail in different groups"
            ],
            "Sawmill Optimization Consultant",
            [
                "Rafail was a pleasure to work with, and was a very dependable member of our team.  He was very good at solving problems and worked long and hard to satisfy our customers with new features and capabilities in our real-time machine control applications."
            ],
            [
                "Rafail was a pleasure to work with, and was a very dependable member of our team.  He was very good at solving problems and worked long and hard to satisfy our customers with new features and capabilities in our real-time machine control applications."
            ]
        ],
        "skills": [],
        "summary": "    Summary of ExperienceA long term professional Software Engineer with expertise in real time and embedded systems programming. Extensive experience in all phases of the software development life cycle, encompassing requirements gathering, R&D, design, programming, debugging, testing and maintenance. Excellent problem solving skills. Well rounded in the engineering field, which allows me to learn new technical areas fast and in depth. Key CompetenciesWell versed in all stages of software development life cycle (SDLC) from requirements analysis to maintenanceProficient in C, C++, C#, x86 assemblyWorking knowledge of Java, HTML, XMLExtensive background in designing, coding and testing complex multithreaded applications for different industriesSignificant experience in design and development of multiprocessor systems Excellent debugging and problem solving skillsExtensive engineering background that lets me understand and learn quickly necessary business environments.Broad background in mathematics, control theory and optimizationSuccessful in multidisciplinary teams.Outstanding debugging skills.Demonstrated high performance under pressure.Broad experience designing and developing specialized user interface components of real time applicationsProven ability to present complex designs and product features for audiences of different levels\n  \n  \n",
        "name": "Rafail Levkovsky",
        "title": "Software Engineer",
        "url": "linkedin.com/in/rafail-levkovsky-23b2a72",
        "phone": "",
        "email": "rvlevk@netscape.net"
    }
]