[
    {
        "experience": [
            "Highlights",
            [
                "4 Mutual Connections",
                "You and Drew both know Nathan Erickson, CFA®, CAIA, Jennifer M. Sanders, IACCP®, CCEP®, and 2 others"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Investment Analyst",
                "Company Name",
                "MRA Associates",
                "Dates Employed",
                "Feb 2014 – Present",
                "Employment Duration",
                "3 yrs 9 mos",
                "Location",
                "Phoenix, Arizona",
                "MRA Associates is a boutique, registered investment advisor with large firm experience, headquartered in Phoenix, Arizona. We provide investment, wealth management and tax compliance and consulting services to individuals and families, corporate retirement plans, endowments and foundations, and sovereign nations throughout the Western United States. The firm currently has more than $2 billion in assets under management and employs more than 40 professionals and support staff. MRA Associates has earned the prestigious CEFEX certification, an independent assessment that recognizes that the firm adheres to the industry’s best fiduciary practices.Our firm’s differentiating attributes, the ones that matter most to our clients, prospects and employees, allow us to stand out in a field that is fiercely competitive. What sets us apart as an advisor is:     • Our team model, where synergistic solutions are brought together by a comprehensive strategic plan.     • Our independent, partner-owned structure that allows us the freedom to make decisions that are exclusively in your best interest.     • Our commitment to sustainability and stewardship by managing your family’s or institution’s wealth with individualized, proactive planning today and for generations to come.     • Our commanding belief in a fiduciary standard of care that is the cornerstone of everything we do."
            ],
            [
                "Portfolio Manager",
                "Company Name",
                "KeatsConnelly",
                "Dates Employed",
                "May 2008 – Feb 2014",
                "Employment Duration",
                "5 yrs 10 mos",
                "Location",
                "Phoenix, Arizona Area",
                "As a Portfolio Manager for KeatsConnelly I worked with assets north of $350M in regards to trading, rebalancing, and cash management. I was co-chairman of the investment committee and contributed to investment research and strategy for all client portfolios. On a daily basis I worked with clients to provide advice, analytics, and investment recommendations. I also worked with prospects to deliver the firm’s investment philosophy, strategy, and vision. Due to the unique niche of the firm I learned and helped establish cross-border financial plans, tax strategies, and investment planning for clients. I invested in US and Canadian stock markets while utilizing the US/Canada tax treaty to benefit clients. Additionally, I served as the investment department’s operations administrator. This included managing all investment software (Advent Axys, Morningstar Office, Tamarac, etc.), custodial websites, reporting, and data integrity. I handled all software research, transitions, and audits for management and compliance."
            ],
            [
                "Site Operations Manager",
                "Company Name",
                "Inpulse Response Group",
                "Dates Employed",
                "Dec 2003 – Oct 2007",
                "Employment Duration",
                "3 yrs 11 mos"
            ],
            [
                "Account Manager",
                "Company Name",
                "Discover Financial Services",
                "Dates Employed",
                "Mar 2001 – Oct 2003",
                "Employment Duration",
                "2 yrs 8 mos",
                "Discover Financial Services is a direct banking and payment services company with one of the most recognized brands in U.S. financial services. Since its inception in 1986, the company has become one of the largest card issuers in the United States. The company operates the Discover card, America's cash rewards pioneer, and offers personal and student loans, online savings products, certificates of deposit and money market accounts through its Discover Bank subsidiary. Its payment businesses consist of Discover Network, with millions of merchant and cash access locations; PULSE, one of the nation's leading ATM/debit networks; and Diners Club International, a global payments network with acceptance in more than 185 countries and territories."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Arizona State University West",
                "Degree Name",
                "BS",
                "Field Of Study",
                "Finance",
                "Dates attended or expected graduation",
                "2005 – 2008",
                "Placed 29th out of 100,000+ worldwide for the Business Strategy Project (BSP). The BSP is a competative program to learn the details of what it takes to run a successful business."
            ],
            [
                "Arizona State University West",
                "Degree Name",
                "BS",
                "Field Of Study",
                "Finance",
                "Dates attended or expected graduation",
                "2005 – 2008",
                "Placed 29th out of 100,000+ worldwide for the Business Strategy Project (BSP). The BSP is a competative program to learn the details of what it takes to run a successful business."
            ],
            [
                "Grand Canyon University",
                "Degree Name",
                "Master's of Business Administration",
                "Field Of Study",
                "Finance",
                "Grade",
                "3.9 GPA",
                "Dates attended or expected graduation",
                "2009 – 2011"
            ],
            [
                "Grand Canyon University",
                "Degree Name",
                "Master's of Business Administration",
                "Field Of Study",
                "Finance",
                "Grade",
                "3.9 GPA",
                "Dates attended or expected graduation",
                "2009 – 2011"
            ],
            [
                "Skills"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "Arizona State University West",
                "32,100 followers"
            ],
            [
                "Cross Border Tax & Accounting, LLC",
                "80 followers"
            ],
            [
                "CFA Program Candidates",
                "221,670 members"
            ],
            [
                "KeatsConnelly - Public",
                "124 members"
            ],
            [
                "Grand Canyon University",
                "101,757 followers"
            ],
            [
                "RIAmarketplace.xyz™",
                "21,366 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (128)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Arizona State University West",
                "32,100 followers"
            ],
            [
                "Arizona State University West",
                "32,100 followers"
            ],
            [
                "Cross Border Tax & Accounting, LLC",
                "80 followers"
            ],
            [
                "Cross Border Tax & Accounting, LLC",
                "80 followers"
            ],
            [
                "CFA Program Candidates",
                "221,670 members"
            ],
            [
                "CFA Program Candidates",
                "221,670 members"
            ],
            [
                "KeatsConnelly - Public",
                "124 members"
            ],
            [
                "KeatsConnelly - Public",
                "124 members"
            ],
            [
                "Grand Canyon University",
                "101,757 followers"
            ],
            [
                "Grand Canyon University",
                "101,757 followers"
            ],
            [
                "RIAmarketplace.xyz™",
                "21,366 members"
            ],
            [
                "RIAmarketplace.xyz™",
                "21,366 members"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Portfolio Management",
                "Portfolio Management"
            ],
            [
                "Portfolio Management"
            ],
            [
                "Investments",
                "Investments"
            ],
            [
                "Investments"
            ],
            [
                "Wealth Management",
                "Wealth Management"
            ],
            [
                "Wealth Management"
            ],
            [
                "Financial Services",
                "Financial Services"
            ],
            [
                "Financial Services"
            ],
            [
                "Management",
                "Management"
            ],
            [
                "Management"
            ],
            [
                "Trading",
                "Trading"
            ],
            [
                "Trading"
            ],
            [
                "Process Improvement",
                "Process Improvement"
            ],
            [
                "Process Improvement"
            ],
            [
                "Strategic Planning",
                "Strategic Planning"
            ],
            [
                "Strategic Planning"
            ],
            [
                "Business Strategy",
                "Business Strategy"
            ],
            [
                "Business Strategy"
            ],
            [
                "Asset Allocation",
                "Asset Allocation"
            ],
            [
                "Asset Allocation"
            ],
            [
                "Wealth",
                "Wealth"
            ],
            [
                "Wealth"
            ],
            [
                "Investment Advisory",
                "Investment Advisory"
            ],
            [
                "Investment Advisory"
            ],
            [
                "Personal Finance",
                "Personal Finance"
            ],
            [
                "Personal Finance"
            ],
            [
                "Investment Strategies",
                "Investment Strategies"
            ],
            [
                "Investment Strategies"
            ],
            [
                "Asset Management",
                "Asset Management"
            ],
            [
                "Asset Management"
            ]
        ],
        "summary": "    Drew Phillips serves as an Investment Analyst for MRA Associates. His primary focus is trading and investment research for client portfolios. Drew is also a member of MRA Associates’ Investment Policy Committee.Prior to joining the firm, Drew served as a Portfolio Manager with KeatsConnelly and Associates for six years. In that role, he focused on investment strategy, trading, performance reporting, and building client relationships. He invested in US and Canadian stock markets while helping establish cross-border financial plans, tax strategies, and investment planning for clients. Additionally, he served as the investment department’s operations administrator which entailed managing all investment software, reporting, and audits.Drew  is a CFA® Charterholder and holds a Master of Business Administration with an emphasis in Finance from Grand Canyon University. He also earned a Bachelor of Science degree in Finance from Arizona State University. CFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n  \n  \n",
        "name": "Drew Phillips, CFA®, MBA",
        "title": "Investment Analyst at MRA Associates",
        "url": "linkedin.com/in/drew-phillips-mba",
        "phone": null,
        "email": "daphillips11@yahoo.com"
    }
]