[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "18 Mutual Connections",
                "You and Victor both know Jason Patino, Joe Pierce, and 16 others"
            ],
            [
                "4 offers accepted last week!",
                "Victor liked"
            ],
            [
                "I had a phone interview last week where the interviewer said something like “So you’re the guy I am seeing on my LinkedIn news feed. It’s nice to meet you!”",
                "Job seekers: Get out there. Embrace social. Network. Share thoughts and ideas. Build your brand. Challenge the norm. Don’t rely on applications.",
                "Victor liked"
            ],
            [
                "Your services are no longer required.",
                "Boom, it is like someone punched you in the stomach and it is hard to stand.",
                "I have been talking to someone recently who messaged me for help, this happened to him after almost 5 years working at the same company which he loved.",
                "He always kept to finishing his projects on time and under budget, he maintained safety without extra cost to his clients, and many times he was ahead of schedule and delivered beyond expectations.",
                "Saurabh Bhardwaj is a Senior Instrumentation Engineer with extensive experience. Since he was laid off he has been looking for the right opportunity. He is open to relocation and currently lives in India.",
                "Please like and share this with as many people as you can to help Saurabh find his next career opportunity.",
                "You can reach him via email: bhardwaj.saurabh1985@gmail.com",
                "Or via Linkedin: https://lnkd.in/eJCg2ht",
                "-- Follow me Mark Sefaradi to get my future posts right away and help people like Saurabh --",
                "#ono #teamhuman",
                "Victor liked"
            ],
            [
                "It was a pleasure meeting with students at California State University,Chico!",
                "We are currently in town still and interviewing. If you are interested in meeting message me.  #GOcats #ChicoStateUniversity",
                "Victor liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Business Development Manager",
                "Company Name",
                "ArrGee Solutions",
                "Dates Employed",
                "Aug 2014 – Present",
                "Employment Duration",
                "3 yrs 4 mos",
                "Location",
                "16875 NW Joscelyn St,  Beaverton  OR - 97006",
                "• Results-producing Sales & Marketing professional with a proven record of accomplishment in business development, client relationship management, and team leadership; as well as, planning and leading comprehensive marketing and revenue strategies in support of business channel growth.• Develop new business opportunities through lead development, account penetration and relationship building. • Generate leads through prospecting and cold calling, both on phone and via Email. • Manage and Track the record of vendors and suppliers which helps in building strong network.• Research potential business and current customers with excellent networking and follow-up.• Ability to identify research and get to the decision maker and develop lasting business relationships.• Has handled staffing needs of Direct Clients and Tier 1 Vendors so as to receive ongoing requirements at the Client base and possess good rapport with them which helps in closing the positions and getting immediate feedbacks for the submissions.•\tResponsible for providing best of the candidates to the clients within the minimum turnaround time.•\tStrong experience in maintaining pipeline candidates and creating internal database.•\tResponsible for checking references, negotiating terms and rates for each project, coordinating the interview process, extending offers, and closing candidates. • Qualify job descriptions and requirements with client hiring managers."
            ],
            [
                "Sr. Talent Acquisition / Accounts Manager",
                "Company Name",
                "Vcarve, Inc",
                "Dates Employed",
                "Oct 2012 – Sep 2014",
                "Employment Duration",
                "2 yrs",
                "Location",
                "1832 Capital Circle NE  Suite 3, Tallahassee  FL 32308",
                "•\tResponsible for full-cycle recruiting conducting searching, prescreens, background checks, references and time management of all requisitions. •\tHandling the team of 5 recruiters to cater the requirements delivering high quality professionals.•\tIdentified, qualified, and closed candidates through the use of the Internet sites, portals, database and referrals. •\t Interacting with vendor management in getting the jobs, coordinating interviews, closures, on boarding process like background and drug screening, compliance and time management of the consultants.•\tExtensive experience with different tax terms W2- No benefits, W2- With benefits, 1099, Corp-to-Corp, H1B placements, and Green card/Permanent Resident placements.•\tFiltered through and reviewed completed candidate profile/resume and evaluated applicant’s work history, education and training, job skills, desired salary/hourly rate, and personal qualifications against open requirements.•\tResponsible for providing best of the candidates to the clients within the minimum turnaround time.•\tStrong experience in maintaining pipeline candidates and creating internal database.•\tResponsible for checking references, negotiating terms and rates for each project, coordinating the interview process, extending offers, and closing candidates. •\tBusiness development by identifying new clients, onsite prime vendors generating business opportunities from existing accounts & develop them to achieve account targets.•\tCoordinating with clients and scheduling the interviews for the short-listed candidates.•\tRecruited and hired candidates in state and out-of-state for contract, contract-to-hire and permanent placements for all IT positions for multiple client companies. •\tResponsible for mentoring and providing on-going training and support for new recruiters and serve as a resource for learning and navigating senior technical policies and procedures."
            ],
            [
                "Sr. Technical Recruiter",
                "Company Name",
                "Intellitek Inc",
                "Dates Employed",
                "Aug 2011 – Oct 2012",
                "Employment Duration",
                "1 yr 3 mos",
                "Location",
                "8, Collington St Chesterfield, NJ - 08515",
                "•\tResponsible for full cycle of recruitment and end to end recruitment and Sourcing, Screening profiles through various job sites and internal database, networking sites as per the requirement for recruiting.•\tRecruited for Financial Services, Pharmaceutical, Insurance, Distribution, Medical Health, Scientific, Software Development and Communications Industries. •\tDesigned, developed and implemented an innovative, aggressive recruiting strategy.•\tHave worked with W2- No benefits, W2- With benefits, 1099, Corp-to-Corp, H1B placements, and Green card/Permanent Resident placements.•\tSuccessfully place candidates on corp. to corp. (C2C), 1099 or W2 basis.•\tUnderstanding requirements as per client Need.•\tInvolving in resume searching from jobsites like dice.com, monster.com and Career Builder.com for various requirements.•\tSourced candidates through advertisements, Internet, candidate or employee referrals •\tManage applicant sourcing, screening, technical interviews, interview scheduling, coordination of feedback, and the entire offer and placement process.•\tResponsible for developing and maintaining relationships with search agencies and contract consulting firms. •\tAnalyzed a broad range of technical resumes for specific skill sets, matching resumes to current and future job requirements. Involved in departmental resource planning and needs assessment.•\tResponsible for implementing strategic staffing plans that support organizational goals. Sourced qualified candidates, screen applicants, schedule and conduct interviews, check references and backgrounds negotiate compensation, and hire exempt and non-exempt personnel in Information Technology area.•\tScreening and Mapping the Resumes based on requirement and required skills.•\tSubmitting the Profiles to the assigned Team Lead or Manager.•\tCommunicating to the candidates and following up with the candidates till their joining.•\tWorking knowledge on Billing and Payment terms like net 15 or net 30 etc."
            ],
            [
                "IT Recruiter",
                "Company Name",
                "dewsoftech",
                "Dates Employed",
                "May 2010 – Aug 2011",
                "Employment Duration",
                "1 yr 4 mos",
                "Location",
                "100 Biddle Ave Suite #104 Newark, DE 19702",
                "•\tResponsible for full cycle of recruitment and end to end recruitment and Sourcing, Screening profiles through various job sites and internal database, networking sites as per the requirement for recruiting.•\tGathering the requirements from Team Lead and validating them.•\tUnderstanding requirements as per client Need.•\tBlasting the Requirements to Different Vendors, Google and yahoo Groups.•\tInvolving in resume searching from jobsites like dice.com, monster.com and Carrer Builder.com for various requirements.•\tShortlisting the resumes as per Client Needs.•\tChecking the References for Back Ground Verification.•\tNegotiating Rates with the Employers and Consultants.•\tScreening and Mapping the Resumes based on requirement and required skills.•\tFormatting resumes according to the client specifications & the standards of the industry and Uploading CV's on Client Portals.•\tSubmitting the Profiles to the assigned Team Lead.•\tScheduling interviews with the Consultants and doing follow up. •\tConfirming availability of the candidates, and passing their details to the Team lead/Resource Manager.•\tCommunicating to the candidates and following up with the candidates till their joining.•\tInteracting with the candidates, giving them brief about the position, roles and responsibilities, technical requirement and checking their positional fitment based on this interaction.•\tPreparing Daily and Weekly Reports."
            ],
            [
                "Freelance Designer and Consultant",
                "Company Name",
                "VAZZ TEN D",
                "Dates Employed",
                "May 2009 – Aug 2011",
                "Employment Duration",
                "2 yrs 4 mos",
                "Location",
                "Hyderabad Area, India",
                "•Worked as a Fashion Consultant & a Free Lancer for Retail stores.•Undertaken individual orders for Western Couture, Bridal Trousseaus, Indian Outfits (including Lehenga Cholis, Salwaar Kurtas etc) ,Traditional Embroideries , Tailoring of Garments."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Andhra University",
                "Degree Name",
                "Bachelor's degree",
                "Dates attended or expected graduation",
                "2007 – 2011"
            ],
            [
                "Andhra University",
                "Degree Name",
                "Bachelor's degree",
                "Dates attended or expected graduation",
                "2007 – 2011"
            ],
            [
                "S.S.C Board",
                "Degree Name",
                "secondary school certificate",
                "Field Of Study",
                "High School/Secondary Certificate Programs",
                "Dates attended or expected graduation",
                "1999 – 2005"
            ],
            [
                "S.S.C Board",
                "Degree Name",
                "secondary school certificate",
                "Field Of Study",
                "High School/Secondary Certificate Programs",
                "Dates attended or expected graduation",
                "1999 – 2005"
            ],
            "Recommendations",
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,148,536 followers"
            ],
            [
                "Chandigarh IT Jobs",
                "4,658 members"
            ],
            [
                "Corus360",
                "12,460 followers"
            ],
            [
                "TIBCO Software Inc.",
                "82,801 followers"
            ],
            [
                ".NET Developers",
                "427,243 members"
            ],
            [
                "Kforce Inc",
                "114,383 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,148,536 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,148,536 followers"
            ],
            [
                "Richard Branson is a LinkedIn Influencer"
            ],
            [
                "Chandigarh IT Jobs",
                "4,658 members"
            ],
            [
                "Chandigarh IT Jobs",
                "4,658 members"
            ],
            [
                "Corus360",
                "12,460 followers"
            ],
            [
                "Corus360",
                "12,460 followers"
            ],
            [
                "TIBCO Software Inc.",
                "82,801 followers"
            ],
            [
                "TIBCO Software Inc.",
                "82,801 followers"
            ],
            [
                ".NET Developers",
                "427,243 members"
            ],
            [
                ".NET Developers",
                "427,243 members"
            ],
            [
                "Kforce Inc",
                "114,383 followers"
            ],
            [
                "Kforce Inc",
                "114,383 followers"
            ]
        ],
        "recommendations": [
            [
                "ricky deckard",
                "Sr,Recruiter  at Aita Consulting Services Inc.",
                "July 29, 2016, ricky reported directly to Victor",
                "I have known Vasu(Victor) for several years now and during this time he has progressed from an excellent Recruiter to a very dynamic, effective and efficient leader. He is a great team player with commendable managerial skills. He was one of the youngest managers in the company’s history and he performed that role to perfection. His team building and leadership skills are exceptional. He was responsible for building and nurturing a very successful Resourcing team @ arRGee which has been able to deliver quality resources all the times under very challenging conditions. He possesses outstanding communication skills, great inter personal skills and organization skills. He is a very focused, hard working, sincere and an honest individual and highly respected by colleagues, employees, candidates, Managers and the executive team. I would strongly recommend Victor for any role which involves challenges, leadership skills, building and nurturing successful teams.less"
            ],
            [
                "ricky deckard",
                "Sr,Recruiter  at Aita Consulting Services Inc.",
                "July 29, 2016, ricky reported directly to Victor"
            ],
            [
                "ricky deckard",
                "Sr,Recruiter  at Aita Consulting Services Inc.",
                "July 29, 2016, ricky reported directly to Victor"
            ],
            [
                "ricky deckard",
                "Sr,Recruiter  at Aita Consulting Services Inc.",
                "July 29, 2016, ricky reported directly to Victor"
            ],
            "Sr,Recruiter  at Aita Consulting Services Inc.",
            [
                "I have known Vasu(Victor) for several years now and during this time he has progressed from an excellent Recruiter to a very dynamic, effective and efficient leader. He is a great team player with commendable managerial skills. He was one of the youngest managers in the company’s history and he performed that role to perfection. His team building and leadership skills are exceptional. He was responsible for building and nurturing a very successful Resourcing team @ arRGee which has been able to deliver quality resources all the times under very challenging conditions. He possesses outstanding communication skills, great inter personal skills and organization skills. He is a very focused, hard working, sincere and an honest individual and highly respected by colleagues, employees, candidates, Managers and the executive team. I would strongly recommend Victor for any role which involves challenges, leadership skills, building and nurturing successful teams.less"
            ],
            [
                "I have known Vasu(Victor) for several years now and during this time he has progressed from an excellent Recruiter to a very dynamic, effective and efficient leader. He is a great team player with commendable managerial skills. He was one of the youngest managers in the company’s history and he performed that role to perfection. His team building and leadership skills are exceptional. He was responsible for building and nurturing a very successful Resourcing team @ arRGee which has been able to deliver quality resources all the times under very challenging conditions. He possesses outstanding communication skills, great inter personal skills and organization skills. He is a very focused, hard working, sincere and an honest individual and highly respected by colleagues, employees, candidates, Managers and the executive team. I would strongly recommend Victor for any role which involves challenges, leadership skills, building and nurturing successful teams.less"
            ],
            [
                "Kavitha Katkam",
                "Manager-HR at Synchrony Financial (Formerly known as GE Capital)",
                "March 2, 2015, Victor reported directly to Kavitha",
                "Kavitha Katkam profile speaks for itself. I remember checking her profile when I first joined LinkedIn and I was surprised how many recommendations she got, simply she is an expert in her field.Few people have the opportunity to report to a manager who is also a coach and mentor—but I did when I worked for Kavitha.\"I was particularly impressed by Kavitha’s ability to handle even the toughest clients effortlessly. That skill often takes years to develop, but it seemed to come perfectly naturally to her.”\"I was particularly impressed by Kavitha’s ability to handle even the toughest clients effortlessly. That skill often takes years to develop, but it seemed to come perfectly naturally to her.”"
            ],
            [
                "Kavitha Katkam",
                "Manager-HR at Synchrony Financial (Formerly known as GE Capital)",
                "March 2, 2015, Victor reported directly to Kavitha"
            ],
            [
                "Kavitha Katkam",
                "Manager-HR at Synchrony Financial (Formerly known as GE Capital)",
                "March 2, 2015, Victor reported directly to Kavitha"
            ],
            [
                "Kavitha Katkam",
                "Manager-HR at Synchrony Financial (Formerly known as GE Capital)",
                "March 2, 2015, Victor reported directly to Kavitha"
            ],
            "Manager-HR at Synchrony Financial (Formerly known as GE Capital)",
            [
                "Kavitha Katkam profile speaks for itself. I remember checking her profile when I first joined LinkedIn and I was surprised how many recommendations she got, simply she is an expert in her field.Few people have the opportunity to report to a manager who is also a coach and mentor—but I did when I worked for Kavitha.\"I was particularly impressed by Kavitha’s ability to handle even the toughest clients effortlessly. That skill often takes years to develop, but it seemed to come perfectly naturally to her.”\"I was particularly impressed by Kavitha’s ability to handle even the toughest clients effortlessly. That skill often takes years to develop, but it seemed to come perfectly naturally to her.”"
            ],
            [
                "Kavitha Katkam profile speaks for itself. I remember checking her profile when I first joined LinkedIn and I was surprised how many recommendations she got, simply she is an expert in her field.Few people have the opportunity to report to a manager who is also a coach and mentor—but I did when I worked for Kavitha.\"I was particularly impressed by Kavitha’s ability to handle even the toughest clients effortlessly. That skill often takes years to develop, but it seemed to come perfectly naturally to her.”\"I was particularly impressed by Kavitha’s ability to handle even the toughest clients effortlessly. That skill often takes years to develop, but it seemed to come perfectly naturally to her.”"
            ]
        ],
        "skills": [],
        "summary": "    Credibility built upon outstanding relationship management skills, performance management, career management and constant focus on company objectives and commitment to company's core values to improve overall quality.Add me to your professional network on LinkedIn.victor@arrgee.net \n  \n  \n",
        "name": "Victor Mendez",
        "title": "Business Development Manager at arRGee Solutions",
        "url": "linkedin.com/in/victor-mendez-164b9b55",
        "phone": "+91 953 336 2229 (Mobile)",
        "email": "victor.datagrp@gmail.com"
    }
]