[
    {
        "experience": [
            "Highlights",
            [
                "29 Mutual Connections",
                "You and Dr. Paul both know Anna Sokolova, Trent Broberg, and 27 others"
            ],
            [
                "If anyone knows any good interior designers in the Denver area, can you let me know? I need some help designing a commercial space that I am going to turn into a clinic",
                "Dr. Paul shared this"
            ],
            [
                "We have an immediate opening for a part-time massage therapy job at our clinic. Hours would be Friday 9am-5pm and Sat 9am-1pm. Feel free to share this with any massage therapist friends looking for a part-time job. Our number is 602-482-0994. Email resumes to pvazchiro@gmail.com",
                "Dr. Paul shared this"
            ],
            "Recommendations",
            [
                "Phoenix Children's Hospital",
                "19,116 followers"
            ],
            [
                "Corporate  Health and Wellness Association, Corporate Wellness, Worksite Wellness,",
                "66,410 members"
            ],
            [
                "Brigham Young University",
                "214,619 followers"
            ],
            [
                "Brigham Young University",
                "226,621 followers"
            ],
            [
                "Networking Phoenix - LI group",
                "9,899 members"
            ],
            [
                "Marketing & Networking for Business Professionals & Doctors",
                "108,335 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Phoenix Children's Hospital",
                "19,116 followers"
            ],
            [
                "Phoenix Children's Hospital",
                "19,116 followers"
            ],
            [
                "Corporate  Health and Wellness Association, Corporate Wellness, Worksite Wellness,",
                "66,410 members"
            ],
            [
                "Corporate  Health and Wellness Association, Corporate Wellness, Worksite Wellness,",
                "66,410 members"
            ],
            [
                "Brigham Young University",
                "214,619 followers"
            ],
            [
                "Brigham Young University",
                "214,619 followers"
            ],
            [
                "Brigham Young University",
                "226,621 followers"
            ],
            [
                "Brigham Young University",
                "226,621 followers"
            ],
            [
                "Networking Phoenix - LI group",
                "9,899 members"
            ],
            [
                "Networking Phoenix - LI group",
                "9,899 members"
            ],
            [
                "Marketing & Networking for Business Professionals & Doctors",
                "108,335 members"
            ],
            [
                "Marketing & Networking for Business Professionals & Doctors",
                "108,335 members"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "    Total Body Wellness for the Whole FamilyAZ Chiropractic and Physical Medicine of Arizona is your one stop for overall health in Paradise Valley, AZ. We have chiropractors, naturopathic doctors, nurse practitioners, and massage therapists available to treat your whole body.We offer chiropractic treatment, physiotherapy, massage therapy, digital X-ray, trigger point injections, allergy testing, and many other services right in our office. You will not receive the kind of “cookie cutter” treatment plan at AZ Chiropractic that other chiropractic offices offer. We will not try to sell you long term care plans and we never use scare tactics to get you to sign up for treatments you don’t need.Instead, we feel it is important to give you all the facts and let you decide which course of action you would like to take. We personalize all treatment plans to fit our patients’ needs and goals.Our goal as a Paradise Valley, AZ chiropractor is to effectively treat in a timely manner. We want to help you solve the problem—back or neck pain, allergies, gastrointestinal issues, hormones, weight loss, and many others—not just treat the symptoms.If we cannot help you, we can refer you to many types of physicians who will be able to address your particular issue. We are able to refer you out for an MRI or even lab work if needed. As we now include Physical Medicine of Arizona, we have a naturopathic doctor and nurse practitioner in our office. Having this group work closely with us is just one more way to get you the resources you need. At AZ Chiropractic, we strive to “think outside the box” and help you reach optimal health. Remember, it’s not about AZ Chiropractic, it’s about YOU!\n  \n  \n",
        "name": "Dr. Paul Jeffrey D.C",
        "title": "Doctor of Chiropractic at AZ Chiropractic",
        "url": "linkedin.com/in/dr-paul-jeffrey-d-c-7630a8113",
        "phone": "602-482-0994 (Work)",
        "email": "drpauljeffrey@yahoo.com"
    }
]