[
    {
        "experience": [
            "Highlights",
            [
                "20 Mutual Connections",
                "You and Jordan both know John Battelle, Amy Donohue, and 18 others"
            ],
            [
                "10 Things You’re Not Supposed to Know",
                "Jordan liked a comment"
            ],
            [
                "https://lnkd.in/e3bKbd6",
                "Wireless techs are a carcinogen pls do  your research",
                "Jordan shared this"
            ],
            [
                "Global Goodwill Ambassador @Robina Tower Spreading our Global Goodwill Ambassador  message as she travels the world",
                "Jordan liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Waking up Sheeple-Micro-Philanthropist",
                "Company Name",
                "* iMAGiNE HEALiNG",
                "Dates Employed",
                "Jan 2014 – Present",
                "Employment Duration",
                "3 yrs 10 mos",
                "Location",
                "Toronto, Ontario, Canada",
                "I  speak my Truth…I was prescribed 600$ a month of opiates /drugs and dealing with the effects, coping with 30+ years of horrible back pain, 4 surgeries, depression, anxiety, and WAS down the rabbit hole.I had Double Spinal Fusion, L45-S1 in 1996.I experienced 52 pieces of hardware installed and removed plus a 14 facet joint denervations. Dr. Induced addiction, I now receive no drugs!Mis-diagnosed from the ER, my MD’s that contributed to my overdosing  covered it up?I was overdosed by Oxycontin/Suboxone with no Narcan? And not reported?I did not know what year it was?My Addiction councillor witnessed and will not come forward?I experienced an NDE.I have been Blessed.My 2 families betrayed me over $$$ , motive is now been provenThis is how they treat a disabled person? they had me picked up by COAST, and taken against my will to psych ward where they wanted to put me back on drugs for being too HAPPY??? to be out of my opiate suit?Dr’s asked me if I hear voices? I told the Dr’s “ I AM WELL and 😊.“No Official Diagnosis” TY.I AM now OPIATE-DRUG FREE.I use organic CBD/MMJYou cannot THRIVE in a toxic, mentally, and physically abusive relationship, they stole $ and possessions for years and blamed my brain till they got caught…Terminated.My grand kids are withheld from me by my ATHEIST son over a large loan he didn’t want to repay?I am vindicated of all  false accusations in court TY I am genuinely honest have a hard time imagining why someone else could possibly lie and frame me. Law of Attraction, Manifesting, IntentionWe are Spiritual beings, we are all Energy, and in One with God/Universe and LIVE in the Heart.I am aligned with Christ Consciousness/God/Prime Creator.I AM Atomically, we are stardust made up of atomic matter held together by the influence of universal forces. I am in the Oxycontin the Class actionhttp://www.theglobeandmail.com/news/national/purdue-pharma-agrees-to-settle-oxycontin-class-action-suit/article34861736/"
            ],
            [
                "Physical and Spiritual Awakening",
                "Company Name",
                "Jordan C.  Grenier - iMAGiNE HEALiNG",
                "Dates Employed",
                "Jan 2014 – 2017",
                "Employment Duration",
                "3 yrs",
                "Location",
                "Toronto, Canada Area",
                "I AM healing myself with a little help from my friends who are geniuses in their crafts.My nervous system is very EMF sensitive because of quitting all drugs  and stress which has caused me 3 heart attacksI am drug free 2 + years nowI am Electrosensitive from the wireless techs all around me now, I share that info worldwide on Linkedin.I have enlightened my MP about EMF/EHS, not open to truth?Quote “It’s psychosomatic, there is no us and them and no Conspiracy Theories”Really?I have detoxed myself avoiding the typical withdrawal symptoms.I AM no longer attending ANY pain clinics, Graduated They are not interested how I became opiate free???I have withdrawn from the opiate program, now I am being treated like a criminal, my previous MD\"s are not interested in us being well, they just give out drugs?It’s about the $$$ and Big Pharma control.I guess my experience is a threat to their to their jobs.Why treat ME like a criminal for being clean finally?Threatening me with police? for speaking my truth? My police don’t support victims?I AM detoxing, as we all need too, and repairing my health at the cellular level with my experts of eastern medicine alternatively.Using plant extracts and Chinese medicine, with CBD  oil DNA matched for healing my cells.I keep rising like a Phoenix, I have a job to do.I AM still here to share knowledge to help wake up people to the consciousness of God, and the Universal Truth.Thrive is the drive for change.There is currently so much light and love flooding onto this planet from the beyond, that our darkest parts of the world are being Illuminated. The ET’S have been here for millions of years.Disclosure is in sight, BE READY!Secrets are being revealed, masks are dropping, and our shadows are now lit up to be seen clearly.It's not just about lights in the sky. It’s about lies on the ground.Mandela Effect???15,000 + L.I.O.N"
            ],
            [
                "Senior Professional Sales Representative",
                "Company Name",
                "Applewood Chevrolet Cadillac Buick GMC / Humberview Group",
                "Dates Employed",
                "Feb 1997 – Nov 2013",
                "Employment Duration",
                "16 yrs 10 mos",
                "Location",
                "Mississauga, ON",
                "I was consistently one of the top senior consultative salespersons at Applewood with my pain and meds throughout my career.The  opiate medications and my disability cost me everything.Many people die from this experience, I lived to share with all who will listen.I had to walk away from my career because too much pain, drugs, anxiety and depression.I AM back after a NDE and am on my healing journey.Traveling to Costa Rica to detox naturally in the hot springs, in the Earth’s Magnetic Field. The Blue Zone with Waterfalls, Ocean, healthy food and being close to Nature healing us way we were meant to…Grounding!I AM a Thalassophile at heart centre.I have also become very Electro-Sensitive especially from the Dirty Electricity and Wireless Technologies all around us everywhere since coming out of my opiate suit. I have had a cell phone since the beginning.  We sleep in a room painted with special Carbon paint with a healing vibration which protects us from the carcinogenic WIFI and Microwaves.I Vibrate, it’s painful from WIFI/ Cell Towers ect. My heart pounds when I am exposed to high levels of wireless tech microwaves publiclly everywhere. The kids today are going sterile, please educate. Please continue to watch us as we grow and share freely with you.The actual vibration of this awareness is one of love, gratitude, and abundance.Forgive others, be at peace, Let it Be. This is an uphill battle with a lot of Blow Back.Keep looking up, CE5. Blessings!Thank you!Namaste!"
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Mentored by Profound Healers/ ND’s/ Scientists/ Financial Visionaries/ ET-UFO Researchers",
                "Degree Name",
                "Experiences and Synchronicities of MY Life",
                "Field Of Study",
                "Sales | Tesla Healing Modalities | Visionary | Pain Management | Drug Addiction | Spirituality",
                "Grade",
                "http://www.Imaginehealing.youngevity",
                "Dates attended or expected graduation",
                "2014 – 2017",
                "Activities and Societies:",
                "I am currently involved in the Oxycontin class action, and contributing to the opiate exposer online and press. The drugs will ruin your life because  some of the doctor’s turn you into addicts. Then they try and diagnose you with the effects of the drugs they created? Myself and my experts are involved in fighting the powers to be about EMF’s/EHS that make us sick and unhealthy.  5G is on the way, it’s the New Acid Rain. I genuinely care about the future.",
                "Canada and USA are behind in healthcare, the countries that are ahead of us areGermany, Switzerland, Austria, France, Cuba, Costa Rica, Russia and other progressive countries. Canada and USA have the strongest microwave Microwaves  in the world, we are being ZAPPED!This is 1000 times worse than the Cigarette saga and is the new Acid Rain, says Dr Magda Havas PHD, we don’t have a choice.Cell Towers, Cell phones and other Microwave wireless technologies that are causing immune problems with cancer, MS, Inflammation, ringing ears, plus many others includes changing our DNA.We are both EHS from the microwaves, most people think it’s psychosomatic, it is real you just don’t know it yet, wait a few more years.We must all heal and detox ourselves! We are gradually waking up because of the speed and knowledge of the internet along with World Collective Consciousness.There is so much dis-information Sharing Knowledge is power!We are in the MATRIX/MultiverseWe are the Alliance."
            ],
            [
                "Mentored by Profound Healers/ ND’s/ Scientists/ Financial Visionaries/ ET-UFO Researchers",
                "Degree Name",
                "Experiences and Synchronicities of MY Life",
                "Field Of Study",
                "Sales | Tesla Healing Modalities | Visionary | Pain Management | Drug Addiction | Spirituality",
                "Grade",
                "http://www.Imaginehealing.youngevity",
                "Dates attended or expected graduation",
                "2014 – 2017",
                "Activities and Societies:",
                "I am currently involved in the Oxycontin class action, and contributing to the opiate exposer online and press. The drugs will ruin your life because  some of the doctor’s turn you into addicts. Then they try and diagnose you with the effects of the drugs they created? Myself and my experts are involved in fighting the powers to be about EMF’s/EHS that make us sick and unhealthy.  5G is on the way, it’s the New Acid Rain. I genuinely care about the future.",
                "Canada and USA are behind in healthcare, the countries that are ahead of us areGermany, Switzerland, Austria, France, Cuba, Costa Rica, Russia and other progressive countries. Canada and USA have the strongest microwave Microwaves  in the world, we are being ZAPPED!This is 1000 times worse than the Cigarette saga and is the new Acid Rain, says Dr Magda Havas PHD, we don’t have a choice.Cell Towers, Cell phones and other Microwave wireless technologies that are causing immune problems with cancer, MS, Inflammation, ringing ears, plus many others includes changing our DNA.We are both EHS from the microwaves, most people think it’s psychosomatic, it is real you just don’t know it yet, wait a few more years.We must all heal and detox ourselves! We are gradually waking up because of the speed and knowledge of the internet along with World Collective Consciousness.There is so much dis-information Sharing Knowledge is power!We are in the MATRIX/MultiverseWe are the Alliance."
            ],
            [
                "Earth School",
                "Degree Name",
                "Life Experiences",
                "Field Of Study",
                "Resources",
                "Dates attended or expected graduation",
                "1957 – 2023",
                "Is there any help?In my recovery  journey I am drug free after 30 years of high opiates  and many other drugs by doctors.When I try and hold the MD’s and pharmacist accountable they covered it up and lie to their governing bodies. They overdosed me twice with a witness from AdaptCorruption is prevalent  they label you to hide the truth. It’s typical David against Goliath to get the Truth out.About BIG PHARMA protecting their MD'sIs there any justice left?I feel Trump will expose this and Tesla Techs plus many other truths hidden from you.  Light against dark... The Light will winReferencesJoel Osteenwww.c4st.orgwww.electricsense.comwww.magdahavas.comwww.healthranger.comwww.discloser.comSimon ParksSteve BassettDavid WilcockCorey GoodeCoast to CoastMr. Paul HellyerSteven GreerLana MarconiConscious EvolutionGlobal ResearchWiki Leakshttp://in5d.comRalph SmartInfowars.comEnvironmental Trustwww.Takebackyourpower.comAncient AliensErich von Däniken"
            ],
            [
                "Earth School",
                "Degree Name",
                "Life Experiences",
                "Field Of Study",
                "Resources",
                "Dates attended or expected graduation",
                "1957 – 2023",
                "Is there any help?In my recovery  journey I am drug free after 30 years of high opiates  and many other drugs by doctors.When I try and hold the MD’s and pharmacist accountable they covered it up and lie to their governing bodies. They overdosed me twice with a witness from AdaptCorruption is prevalent  they label you to hide the truth. It’s typical David against Goliath to get the Truth out.About BIG PHARMA protecting their MD'sIs there any justice left?I feel Trump will expose this and Tesla Techs plus many other truths hidden from you.  Light against dark... The Light will winReferencesJoel Osteenwww.c4st.orgwww.electricsense.comwww.magdahavas.comwww.healthranger.comwww.discloser.comSimon ParksSteve BassettDavid WilcockCorey GoodeCoast to CoastMr. Paul HellyerSteven GreerLana MarconiConscious EvolutionGlobal ResearchWiki Leakshttp://in5d.comRalph SmartInfowars.comEnvironmental Trustwww.Takebackyourpower.comAncient AliensErich von Däniken"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Dog Whisperer/Therapy Dog Trainer/Owner.",
                "Company Name",
                "St Johns Ambulance",
                "Dates volunteered",
                "Jul 2015 – Jul 2015",
                "Volunteer duration",
                "1 mo",
                "Cause",
                "Animal Welfare",
                "My PTSD Therapy Dog I trained was stolen by my Ex, I was betrayed by her whole family for having her removed by police for abuseI guess she needed more then me, my best friend I trained for myself and others.My dogs drink OZONE water to keep them healthy and I keep them away from wireless techs which are a carcinogen.Khali should have been certified Sept. 2015 by St. John’s Ambulance, as a Therapy Dog.Good Karma a New Chocolate Lab, Coco 16 months old given to me is being trained by me for PTSD Therapy to help me and others, good Karma. Did you notice DOG spelled backwards is God. They are Fun, Loving, Forgiving, Think with Intention and are Happy Souls.They are extremely sensitive to the wireless technologies around us, it’s up to you to protect yourselves, animals, and kids you love.I have offered my services to help opiate victims to the authorities they are not interested, it’s against their jobs?"
            ],
            "Recommendations",
            [
                "Lonely Planet",
                "45,164 followers"
            ],
            [
                "Singularity University",
                "44,060 followers"
            ],
            [
                "Tony O. Elumelu, C.O.NTony O. Elumelu, C.O.N is a LinkedIn Influencer",
                "Chairman at Heirs Holdings",
                "534,612 followers"
            ],
            [
                "City TV",
                "583 followers"
            ],
            [
                "Guiding Eyes for the Blind",
                "1,050 followers"
            ],
            [
                "Ryan HolmesRyan Holmes is a LinkedIn Influencer",
                "CEO at Hootsuite",
                "1,546,236 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Lonely Planet",
                "45,164 followers"
            ],
            [
                "Lonely Planet",
                "45,164 followers"
            ],
            [
                "Singularity University",
                "44,060 followers"
            ],
            [
                "Singularity University",
                "44,060 followers"
            ],
            [
                "Tony O. Elumelu, C.O.NTony O. Elumelu, C.O.N is a LinkedIn Influencer",
                "Chairman at Heirs Holdings",
                "534,612 followers"
            ],
            [
                "Tony O. Elumelu, C.O.NTony O. Elumelu, C.O.N is a LinkedIn Influencer",
                "Chairman at Heirs Holdings",
                "534,612 followers"
            ],
            [
                "Tony O. Elumelu, C.O.N is a LinkedIn Influencer"
            ],
            [
                "City TV",
                "583 followers"
            ],
            [
                "City TV",
                "583 followers"
            ],
            [
                "Guiding Eyes for the Blind",
                "1,050 followers"
            ],
            [
                "Guiding Eyes for the Blind",
                "1,050 followers"
            ],
            [
                "Ryan HolmesRyan Holmes is a LinkedIn Influencer",
                "CEO at Hootsuite",
                "1,546,236 followers"
            ],
            [
                "Ryan HolmesRyan Holmes is a LinkedIn Influencer",
                "CEO at Hootsuite",
                "1,546,236 followers"
            ],
            [
                "Ryan Holmes is a LinkedIn Influencer"
            ]
        ],
        "recommendations": [
            [
                "Bill Harvey",
                "Trainer and Professional Speaker",
                "January 13, 2011, Jordan was a client of Bill’s"
            ],
            [
                "Bill Harvey",
                "Trainer and Professional Speaker",
                "January 13, 2011, Jordan was a client of Bill’s"
            ],
            [
                "Bill Harvey",
                "Trainer and Professional Speaker",
                "January 13, 2011, Jordan was a client of Bill’s"
            ],
            [
                "Bill Harvey",
                "Trainer and Professional Speaker",
                "January 13, 2011, Jordan was a client of Bill’s"
            ],
            "Trainer and Professional Speaker",
            [
                ""
            ],
            [
                ""
            ]
        ],
        "skills": [],
        "summary": "    I AM not a Doctor-WriterThis piece reflects my own personal viewsAltruisticPositive  ActivismConspiracy Theorist who questions the statements of known liarsWhere is the Integrity???Truth is stranger than FictionLaughing gets me through I AM an Opiate, 4 back surgeries and 3 heart attack Survivor. TY God/ JesusI am the first born, with my six senses on high alert.I was the eyes for my mother and two sisters since age 3, who are blind.I was a bodybuilder for 15 years until I blew two disc’s in my  back.I am suffering 33 years chronic back pain and took opiates plus many other drugs for 30 years with MD'sI was consistently one of the top salespeople for decades in auto business with this disability. I became dependent, believing  in Western Medicine?Drugs can be lethal, they kill hundreds of thousands of people each year.I lost my Career/Job because of opiates, pain and share my story of HopeMD’s DID NOT want me off drugs $$$?I was told I would NEVER get better.Subtile electrocution from wireless techs, doctors are diagnosing patients with ADHD (Attention-Deficit Hyperactivity Disorder) when the trigger was actually electromagnetic fields (EMFs). I AM NOW OPIATE-DRUG FREE 2 + years.I also saved my fiancee’s life,  she WAS  illGodspeed  I am in ONE with my Higher Self, I live within the resonance of …All That Is, Was and Will Be.I AM a victim of a coverup by my Md’s and my 2 Narcissistic, Sociopathic  families over $$$, they TRIED to ruin me because I had my abusers exposed, the truth will be revealed legally about them and you know who you are, KARMA’s a bitch.  They used my Linkedin against me?Accused of being in a cult for healing and being  too happy … drug free?Judge said “New Age is not a Cult” Vindicated Where is the“compassion” and “kindness”?I AM not the Status QuoPEMF - VictorI AM in the new film “FEEL” by Lana Marconihttps://www.indiegogo.com/projects/feelhttp://www.Imaginehealing.youngevity.com\n  \n  \n",
        "name": "Jordan (iMAGiNE HEALiNG) Grenier",
        "title": "Facilitator, Opiate Survivor, EMF/EHS, Awakening, Catalyst, UFO/ET Research, Spiritual Warrior, Protector, LION 15,700+",
        "url": "linkedin.com/in/imaginehealing777",
        "phone": "",
        "email": "imaginehealing777@gmail.com"
    }
]