[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "20 Mutual Connections",
                "You and Jeff both know Chris Kitze, Carl Ford, and 18 others"
            ],
            [
                "Jeff can introduce you to 13 people at Oracle",
                "You are following Oracle"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "CEO",
                "Company Name",
                "Scrum, Inc.",
                "Dates Employed",
                "Jun 2006 – Present",
                "Employment Duration",
                "11 yrs 5 mos",
                "Location",
                "MIT Cambridge Innovation Center, Cambridge, MA",
                "Scrum, Inc. was founded by Jeff to continue and extend thought leadership on Scrum by coaching, training, and transforming companies, moving Scrum beyond it's initial IT focus to cover all business domains, and publishing new books and web content to help set a high standard for Scrum implementations. Many companies working with Scrum, Inc. have tripled both both productivity and revenue in the first year of Agile deployment. This requires aggressive commitment to performance improvement by management and software development teams. Scrum Inc. enjoys working most with companies that want to go from good to great whether they are starting out with Scrum or have been doing Scrum for many years."
            ],
            [
                "Senior Advisor",
                "Company Name",
                "OpenView Venture Partners",
                "Dates Employed",
                "Aug 2007 – Present",
                "Employment Duration",
                "10 yrs 3 mos",
                "Dr. Sutherland has trained the OpenView Venture Partners team in Agile processes and they will be the first venture group to run all operations with Scrum. The group has a $200M portfolio of funded companies and all of them use Agile processes. Jeff is working with each of the companies training and consulting on the Scrum development process and using Scrum as an agent of organizational transformation driving the Scrum process up through senior management and into the Board room."
            ],
            [
                "Chairman",
                "Company Name",
                "Scrum Foundation",
                "Dates Employed",
                "Jun 2008 – Jun 2016",
                "Employment Duration",
                "8 yrs 1 mo",
                "Location",
                "Cambridge, MA",
                "The Scrum Foundation (formerly Training Institute) is the premier global provider of certified Scrum training and consulting. Founded by four of the leading Scrum experts in the US, Europe, and Asia, STI provides a complete solution for companies seeking high-impact results from Scrum and Agile development. Our team includes the leaders of some of the largest enterprise Scrum implementations to date, totaling thousands of employees worldwide. The STI founders are some of the most experienced Scrum practitioners anywhere, and worked with many of the world’s best-known companies on their Scrum and Agile implementations, companies ranging from Google and Microsoft to IBM, Oracle, HP, among many others. The STI has a full-time presence by its founders in the US, Europe, and Asia, and is the largest provider of certified Scrum training in India. We have extensive experience using Scrum successfully for offshore and multi-location development, including in a services environment and at CMMI Level 5 organizations."
            ],
            [
                "CTO & Worldwide Scrum Consulting Practice Manager",
                "Company Name",
                "PatientKeeper",
                "Dates Employed",
                "Jan 2000 – Jun 2008",
                "Employment Duration",
                "8 yrs 6 mos",
                "Location",
                "Waltham, MA",
                "New venture in healthcare mobile/wireless computing. Design and deploy platform architecture to support financial and clinical applications on all major mobile device types and the web with backend integration to all heathcare vendor systems and homegrown clinical data repositories via web services, HL7, or direct SQL binding. Used the Scrum Agile Development Process (Type C Scrum) to achieve industry leadership for the PatientKeeper Platform (GartnerGroup, 2002).Hired by founders in 2000 with zero revenue. The Scrum implementation achieved 50M in revenue by 2007."
            ],
            [
                "CTO & SVP Engineering and Product Development",
                "Company Name",
                "IDX Systems",
                "Dates Employed",
                "Sep 1996 – Dec 2000",
                "Employment Duration",
                "4 yrs 4 mos",
                "Introduced Scrum to a nationwide team of over 500 developers with a $47M budget. Launched the first web-enabled patient information system (Outreach) and the first physician's practice management system on the web (IDXSite); a high-volume transaction processing application. OutReach provides physicians with web-browser Internet access to important patient financial and clinical information. IDXsite provides complete billing, accounts receivable, scheduling, and manage care claims processing for physician groups.IDX was acquired by General Electric in 2005 to become GE Healthcare."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "University of Colorado School of Medicine",
                "Degree Name",
                "Ph.D.",
                "Field Of Study",
                "Biometrics, Radiology, Preventive Medicine",
                "Dates attended or expected graduation",
                "1975 – 1980",
                "Activities and Societies:",
                "Center for Vitamins and Cancer Research",
                "Doctoral Degree in Biometrics and Radiology"
            ],
            [
                "University of Colorado School of Medicine",
                "Degree Name",
                "Ph.D.",
                "Field Of Study",
                "Biometrics, Radiology, Preventive Medicine",
                "Dates attended or expected graduation",
                "1975 – 1980",
                "Activities and Societies:",
                "Center for Vitamins and Cancer Research",
                "Doctoral Degree in Biometrics and Radiology"
            ],
            [
                "Stanford University",
                "Degree Name",
                "M.S.",
                "Field Of Study",
                "Statistics, Mathematics, Computer Science",
                "Dates attended or expected graduation",
                "1970 – 1972",
                "Activities and Societies:",
                "Creative Initiative Foundation",
                "Masters in Statistics, Mathematics, Computer Science"
            ],
            [
                "Stanford University",
                "Degree Name",
                "M.S.",
                "Field Of Study",
                "Statistics, Mathematics, Computer Science",
                "Dates attended or expected graduation",
                "1970 – 1972",
                "Activities and Societies:",
                "Creative Initiative Foundation",
                "Masters in Statistics, Mathematics, Computer Science"
            ],
            [
                "West Point",
                "Degree Name",
                "B.S.",
                "Field Of Study",
                "Engineering, Mathematics, Economics",
                "Dates attended or expected graduation",
                "1960 – 1964",
                "Activities and Societies:",
                "Gymnastics",
                "Engineering, Mathematics, and Economics"
            ],
            [
                "West Point",
                "Degree Name",
                "B.S.",
                "Field Of Study",
                "Engineering, Mathematics, Economics",
                "Dates attended or expected graduation",
                "1960 – 1964",
                "Activities and Societies:",
                "Gymnastics",
                "Engineering, Mathematics, and Economics"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Volunteer Experience"
            ],
            [
                "Co-Chair, Clinical Statement Work Group",
                "Company Name",
                "HL7",
                "Dates volunteered",
                "2003 – 2006",
                "Volunteer duration",
                "3 yrs",
                "Cause",
                "Science and Technology",
                "Previously the Orders and Observations committee that generated standards for core clinical data."
            ],
            [
                "Scrum Practitioners",
                "112,574 members"
            ],
            [
                "Lean Six Sigma and DFSS for IT and Software Engineering",
                "3,656 members"
            ],
            [
                "QAGuild Network - Quality Assurance and Software Testing",
                "24,811 members"
            ],
            [
                "OpenView Venture Partners",
                "6,878 followers"
            ],
            [
                "Stanford University",
                "464,702 followers"
            ],
            [
                "Eric RiesEric Ries is a LinkedIn Influencer",
                "CEO at Long-Term Stock Exchange",
                "496,879 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Scrum Practitioners",
                "112,574 members"
            ],
            [
                "Scrum Practitioners",
                "112,574 members"
            ],
            [
                "Lean Six Sigma and DFSS for IT and Software Engineering",
                "3,656 members"
            ],
            [
                "Lean Six Sigma and DFSS for IT and Software Engineering",
                "3,656 members"
            ],
            [
                "QAGuild Network - Quality Assurance and Software Testing",
                "24,811 members"
            ],
            [
                "QAGuild Network - Quality Assurance and Software Testing",
                "24,811 members"
            ],
            [
                "OpenView Venture Partners",
                "6,878 followers"
            ],
            [
                "OpenView Venture Partners",
                "6,878 followers"
            ],
            [
                "Stanford University",
                "464,702 followers"
            ],
            [
                "Stanford University",
                "464,702 followers"
            ],
            [
                "Eric RiesEric Ries is a LinkedIn Influencer",
                "CEO at Long-Term Stock Exchange",
                "496,879 followers"
            ],
            [
                "Eric RiesEric Ries is a LinkedIn Influencer",
                "CEO at Long-Term Stock Exchange",
                "496,879 followers"
            ],
            [
                "Eric Ries is a LinkedIn Influencer"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "    Jeff Sutherland, the inventor and Co-Creator of Scrum, started his career as a fighter pilot in the U.S. Air Force where he achieved Top Gun status in 1967 and flew 100 combat missions over North Vietnam.  After 11 years as a pilot, he joined the faculty of the University of Colorado Medical School where he received his Doctoral degree. As Asst. Prof.of Radiology, Biometrics, and Preventive Medicine he co-founded the Center for Vitamins and Cancer Research under the sponsorship of Nobel Laureate Linus Pauling and for eight years was the Principle Investigator of a National Cancer Center research grant that ran all IT programs and research for the Colorado Regional Cancer Center. In 1983 he joined a banking company that operated 150 banks throughout North America where he was VP of Advanced Systems and General Manager of their ATM Business Unit. Noticing that waterfall processes at the bank were not working, he implemented the first prototype of Scrum for organizational transformation of a business unit. He has been VP of Engineering and CTO or CEO of eleven software companies. In the first four companies he prototyped Scrum and in the fifth company created Scrum as we now see it used in 74% of Agile software companies in over 100 countries.  In 2006, Sutherland established his own company, Scrum, Inc. now recognized as the premiere source of Scrum Training in the world.   He is also chair of the Scrum Foundation and  Senior Advisor and Agile Coach to Openview Venture Partners. His latest book, Scrum: The Art of Doing Twice the Work in Half the Time,\" describes how he used his background and experience to create the most widely used Agile practice in industry today.\n  \n  \n",
        "name": "Jeff Sutherland",
        "title": "CEO at Scrum, Inc.",
        "url": "linkedin.com/in/jeffsutherland",
        "phone": "+1 617 606 3652 (Work)",
        "email": "jeff.sutherland@scruminc.com"
    }
]