[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "1 Mutual Connection",
                "You and Timo C. both know Glen Chamberlain"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "IT Recruiting Team Lead",
                "Company Name",
                "MATRIX Resources",
                "Dates Employed",
                "Nov 2016 – Present",
                "Employment Duration",
                "1 yr 1 mo",
                "Currently an IT Recruiter Team Lead for one of the biggest IT consulting business in the industry. I manage a team of 7 recruiters for international recruiting. We are hiring people from all levels and all areas within the Tech industry. We have a vast network of clients all around the country and would be glad to offer you the opportunity to expand your professional career. Don't hesitate at connecting with me, I would be more than happy to help you find the ideal job for you."
            ],
            [
                "IT Recruiter",
                "Company Name",
                "MATRIX Resources",
                "Dates Employed",
                "Aug 2016 – Nov 2016",
                "Employment Duration",
                "4 mos",
                "Location",
                "Dallas/Fort Worth Area",
                "Worked as an IT recruiter a vast amount of different profiles such as: Business Analysts, Data Analysts, Project Managers, Program Managers, Quality Assurance Analysts/Engineers, Java Developers, Release Managers, .Net Developers, DBA's (SQL, ETL, MySQL, DataWarehouse), Mobile Developers etc.IT Recruitment in the USA."
            ],
            [
                "IT Recruiter",
                "Company Name",
                "Dextra Technologies",
                "Dates Employed",
                "Apr 2016 – Aug 2016",
                "Employment Duration",
                "5 mos",
                "Location",
                "Monterrey Area, Mexico",
                "IT R&S Recruiter. Looking for any possible IT candidates for many different job positions. Hit me up"
            ],
            [
                "Management Intern",
                "Company Name",
                "Grupo JV",
                "Dates Employed",
                "Sep 2012 – Oct 2014",
                "Employment Duration",
                "2 yrs 2 mos",
                "Location",
                "Monterrey Area, Mexico",
                "I was required to help with general administration. I did payments, handled money, did bank transactions. I was responsible for scheduling installations, verifying minor contracts and I developed a new business model for one of the businesses they had. I would help the CEO with any kind of errands and/or work related requirements. I was one of the employees responsible for the office and it's safety as I had my own set of keys and administrated finger print access codes. I would on occasions meet clients and receive payments among minor other office operating tasks."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Universidad del Valle de México",
                "Degree Name",
                "International Business Administration",
                "Field Of Study",
                "International Business/Trade/Commerce",
                "Grade",
                "9th term",
                "Dates attended or expected graduation",
                "2013 – 2016",
                "Activities and Societies:",
                "Previously Part of U-Media (University Media) as Spokesperson, Swimming Team, EduCambio, Activarte.",
                "International straight A student, originally from South Africa. Currently studying my second last term as an International Business Student. Won the award of student image in my first year at the university. Was a part of the leadership team in a value driven school society named Activarte. I have been a spokesperson on multiple occasions for school events and projects. Leader in my class. I am a objective driven person. I strive through challenges and work well under pressure."
            ],
            "Recommendations",
            [
                "MATRIX Resources",
                "20,066 followers"
            ],
            [
                "US Companies in Mexico",
                "7,731 members"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,136,436 followers"
            ],
            [
                "GE",
                "1,559,012 followers"
            ],
            [
                "Honeywell",
                "719,003 followers"
            ],
            [
                "Universidad del Valle de México",
                "176,951 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "MATRIX Resources",
                "20,066 followers"
            ],
            [
                "MATRIX Resources",
                "20,066 followers"
            ],
            [
                "US Companies in Mexico",
                "7,731 members"
            ],
            [
                "US Companies in Mexico",
                "7,731 members"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,136,436 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "13,136,436 followers"
            ],
            [
                "Richard Branson is a LinkedIn Influencer"
            ],
            [
                "GE",
                "1,559,012 followers"
            ],
            [
                "GE",
                "1,559,012 followers"
            ],
            [
                "Honeywell",
                "719,003 followers"
            ],
            [
                "Honeywell",
                "719,003 followers"
            ],
            [
                "Universidad del Valle de México",
                "176,951 followers"
            ],
            [
                "Universidad del Valle de México",
                "176,951 followers"
            ]
        ],
        "recommendations": [],
        "skills": [],
        "summary": "    Currently working as an IT Recruitment Team Lead (Manager) for Matrix at their Nearshore Operation in Monterrey, Mexico.I manage a team of 17 recruiters/sourcers. We are focused on a large range of roles that range from full IT positions such as: Java Developers / .NET Developers   -Fullstack, Middleware, Front End, Back End.Project Managers    -Full SDLC, Software, Application & Infrastructure.Programmers / Developers   -Java, Python, C, C#, C++, ASP.NET, Ruby, Objective C, JavaScript, PHP, SQLQA Analysts / Tester(s)   -Selenium, QTP, UFT, Regression Testing, Performance Testing, Black-box Testing, Unit Testing, Integration Testing, Functional Testing, Stress Testing, Usability Testing, Acceptance Testing etc.Information Security Analysts, System Engineer, BA's (Business Analyst), Program Managers, Product Managers,  Front End Developers, Oracle and/or SQL DBA (Data Base Analyst), Scrum Masters,  Release Managers, Build/Release Engineers, to none IT roles such as Accounts Payable, AP Specialist, Designers.My responsibilities roam from general management, hands on/off recruiting, operational analysis, operational strategy, forecasting, training.If you are looking for a job or to change up your career path, we have tons of job opportunities for you. Feel free to contact me and I will either contact you directly or channel you through to one of my team members. I am also fond of anything business and management related. Looking for a career growth opportunity in Business Management, Logistics and Client Relations. Always open to new opportunities for personal and professional growth. I have a degree in International Business Administration with a 4.0 GPA. I love challenges, if it's boring leave me out. \"Be conformed to your current situation or be the change you are looking for.\"\n  \n  \n",
        "name": "Timo C. King",
        "title": "IT Recruiter Team Lead at MATRIX Resources",
        "url": "linkedin.com/in/timocoleking",
        "phone": "8117813969 (Mobile)",
        "email": "Timo.King@matrixres.com"
    }
]