[
    {
        "experience": [
            "Highlights",
            [
                "1 Mutual Connection",
                "You and Jim both know David Mussehl"
            ],
            [
                "Check out these 8 proven time management tips form 12 top business executives…",
                "Jim shared this"
            ],
            [
                "“Small deeds done are better than great deeds planned.” ~Peter Marshall",
                "Jim shared this"
            ],
            [
                "Post-death legal issues can be complicated, so it’s a good idea to get some affairs in order before that time comes…",
                "Jim shared this"
            ],
            [
                "Hey Jonelle Anderson!  Thanks again for supporting  SC&RA’s Member - Get - A - Member (MGAM) Program and for sending this awesome photo.   The gifts are our pleasure and for more information about SC&RA’s MGAM program visit www.scranet.org",
                "Jim liked"
            ],
            [
                "Successful People On The Last Time They Overcame Failure",
                "Jim liked"
            ],
            [
                "Here are some great tips any small business owner can employ to boost e-newsletter subscribers…",
                "Jim shared this"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Founder, President & CEO",
                "Company Name",
                "Strategic Financial Associates, LLC",
                "Dates Employed",
                "Jan 1996 – Present",
                "Employment Duration",
                "21 yrs 10 mos",
                "ABOUT USFounded in 1996, Strategic Financial Associates provides expertise in the most critical areas of financial planning, risk management and wealth accumulation, preservation and distribution. Working as a cohesive team to provide innovative financial solutions and exceptional client service, we can assist you in coordinating the many different aspects of your financial life, and then develop a comprehensive plan to help you meet your goals and objectives. Leveraging both internal and external resources, we are uniquely prepared to assist you with your needs.Whether you are an individual concerned about securing a comfortable retirement, a business owner wondering how to effectively monetize succession of your business, or a family member facing estate conservation or asset transfer issues, SFA can assist you. OUR PURPOSEStrategic Financial Associates is a holistic financial practice that specializes in working with executives, business owners and affluent individuals and families. Committed to the belief that the only plan that truly succeeds is customized to fit your individual needs, we take exceptional care to understand your unique financial situation, goals and objectives and tolerance for risk. Utilizing the best analytical tools available to us, we design and continually monitor your plan to ensure optimal results and relevance. Whether you are in the accumulation, preservation or distribution phase of your financial life, we can assist you with both building and managing a customized solution.OUR SPECIALITIES•\tComprehensive Wealth Management•\tHolistic Financial Planning•\tInvestment Advisory Services •\tExecutive and Business Planning •\tLife Insurance Planning•\tHealth and Disability Insurance Planning•\tGroup Benefits Planning •\tLong Term Care Insurance •\tRetirement and Educational Planning •\tEstate Planning"
            ],
            [
                "Financial Adviser and Board Member",
                "Company Name",
                "Eagle Strategies, LLC",
                "Dates Employed",
                "Jan 2002 – Present",
                "Employment Duration",
                "15 yrs 10 mos",
                "Through my affiliation with Eagle Strategies, LLC, a Registered Investment Adviser, I provide sophisticated wealth management services by designing customized investment solutions that address my clients’ unique investment objectives and risk tolerance levels. My investment experience, coupled with Eagle’s diverse team of investment experts, allows me to provide the continuous financial guidance needed to help my clients achieve long-term financial success.DISCLAIMERI offer a variety of products that can help you meet a number of insurance and financial needs, including, but not limited to college funding, retirement, managing costs for extended periods of care and lifetime income strategies. Please contact me to help you fully analyze your needs and recommend appropriate solutions.   In addition to a Financial Adviser offering investment advisory services through Eagle Strategies LLC, A Registered Investment Adviser, I am also licensed as an Agent with New York Life Insurance Company and a Registered Representative of and offer securities products & services through NYLIFE Securities LLC, (Member FINRA/SIPC), A Licensed Insurance Agency.  6901 Rockledge Drive, Suite 700, Bethesda, MD 20817. 301-214-6600Neither New York Life Insurance Company, nor its agents, provide tax, legal, or accounting advice. Please consult your own tax, legal, or accounting professionals before making any decisions.   Strategic Financial Associates, LLC is not owned or operated by Eagle Strategies, LLC or it's affiliates. I am not licensed in all jurisdictions. My California insurance license number is #OB77623 and my Arkansas Insurance license #358527."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "The College of William and Mary",
                "Degree Name",
                "BBA, Finance",
                "Field Of Study",
                "Finance",
                "Dates attended or expected graduation",
                "1988 – 1992"
            ],
            "Recommendations",
            [
                "Daymond JohnDaymond John is a LinkedIn Influencer",
                "CEO of FUBU and The Shark Group, TV Personality on ABC Shark Tank",
                "625,491 followers"
            ],
            [
                "Kevin O'LearyKevin O&#39;Leary is a LinkedIn Influencer",
                "Contributor/Investor at CNBC & Shark Tank Investor",
                "1,016,606 followers"
            ],
            [
                "Eagle Strategies, LLC",
                "1,611 followers"
            ],
            [
                "Prospecting Without Limits -- NYL Study Group",
                "2,198 members"
            ],
            [
                "Advanced Building Performance, Inc.",
                "40 followers"
            ],
            [
                "Legg Mason",
                "25,937 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Daymond JohnDaymond John is a LinkedIn Influencer",
                "CEO of FUBU and The Shark Group, TV Personality on ABC Shark Tank",
                "625,491 followers"
            ],
            [
                "Daymond JohnDaymond John is a LinkedIn Influencer",
                "CEO of FUBU and The Shark Group, TV Personality on ABC Shark Tank",
                "625,491 followers"
            ],
            [
                "Daymond John is a LinkedIn Influencer"
            ],
            [
                "Kevin O'LearyKevin O&#39;Leary is a LinkedIn Influencer",
                "Contributor/Investor at CNBC & Shark Tank Investor",
                "1,016,606 followers"
            ],
            [
                "Kevin O'LearyKevin O&#39;Leary is a LinkedIn Influencer",
                "Contributor/Investor at CNBC & Shark Tank Investor",
                "1,016,606 followers"
            ],
            [
                "Kevin O&#39;Leary is a LinkedIn Influencer"
            ],
            [
                "Eagle Strategies, LLC",
                "1,611 followers"
            ],
            [
                "Eagle Strategies, LLC",
                "1,611 followers"
            ],
            [
                "Prospecting Without Limits -- NYL Study Group",
                "2,198 members"
            ],
            [
                "Prospecting Without Limits -- NYL Study Group",
                "2,198 members"
            ],
            [
                "Advanced Building Performance, Inc.",
                "40 followers"
            ],
            [
                "Advanced Building Performance, Inc.",
                "40 followers"
            ],
            [
                "Legg Mason",
                "25,937 followers"
            ],
            [
                "Legg Mason",
                "25,937 followers"
            ]
        ],
        "recommendations": [
            [
                "Laura Shaw",
                "President & Founder - Solutions Oriented Leadership Consultant",
                "March 8, 2015, Laura was a client of Jim’s",
                "Laura is senior Human Resources executive.  I have work with her for almost 20 years and have found her to be very detailed, professional and excellent at her job.  Laura has in depth working experience in the areas of compensation/incentives, benefits design, recruitment, retention, performance management, employee relations, and organizational development. I would highly recommend Laura.  She is a real asset to any organization."
            ],
            [
                "Laura Shaw",
                "President & Founder - Solutions Oriented Leadership Consultant",
                "March 8, 2015, Laura was a client of Jim’s"
            ],
            [
                "Laura Shaw",
                "President & Founder - Solutions Oriented Leadership Consultant",
                "March 8, 2015, Laura was a client of Jim’s"
            ],
            [
                "Laura Shaw",
                "President & Founder - Solutions Oriented Leadership Consultant",
                "March 8, 2015, Laura was a client of Jim’s"
            ],
            "President & Founder - Solutions Oriented Leadership Consultant",
            [
                "Laura is senior Human Resources executive.  I have work with her for almost 20 years and have found her to be very detailed, professional and excellent at her job.  Laura has in depth working experience in the areas of compensation/incentives, benefits design, recruitment, retention, performance management, employee relations, and organizational development. I would highly recommend Laura.  She is a real asset to any organization."
            ],
            [
                "Laura is senior Human Resources executive.  I have work with her for almost 20 years and have found her to be very detailed, professional and excellent at her job.  Laura has in depth working experience in the areas of compensation/incentives, benefits design, recruitment, retention, performance management, employee relations, and organizational development. I would highly recommend Laura.  She is a real asset to any organization."
            ],
            [
                "Karen Gates-Miscovich",
                "Healthcare technology solutions and insurance consulting.",
                "December 7, 2012, Jim worked with Karen but at different companies",
                "I have worked with Karen for 13 years.  Karen is a top notch business professional.  She is a dedicated and persistent executive capable of providing high quality business and operational solutions.I strongly endorse Karen.  She will be a great asset for any organization."
            ],
            [
                "Karen Gates-Miscovich",
                "Healthcare technology solutions and insurance consulting.",
                "December 7, 2012, Jim worked with Karen but at different companies"
            ],
            [
                "Karen Gates-Miscovich",
                "Healthcare technology solutions and insurance consulting.",
                "December 7, 2012, Jim worked with Karen but at different companies"
            ],
            [
                "Karen Gates-Miscovich",
                "Healthcare technology solutions and insurance consulting.",
                "December 7, 2012, Jim worked with Karen but at different companies"
            ],
            "Healthcare technology solutions and insurance consulting.",
            [
                "I have worked with Karen for 13 years.  Karen is a top notch business professional.  She is a dedicated and persistent executive capable of providing high quality business and operational solutions.I strongly endorse Karen.  She will be a great asset for any organization."
            ],
            [
                "I have worked with Karen for 13 years.  Karen is a top notch business professional.  She is a dedicated and persistent executive capable of providing high quality business and operational solutions.I strongly endorse Karen.  She will be a great asset for any organization."
            ]
        ],
        "skills": [],
        "summary": "    As the founder, President and CEO of Strategic Financial Associates in the Washington D.C. area, I have had the privilege of working with some of the most sophisticated and well-regarded organizations and clients in the world over the past 20 years. I’m proud to lead a team of over twenty-five professionals who each bring a unique skill set to the firm. We are all deeply committed to helping our clients succeed in pursuing their goals across a broad range of financial planning and wealth management needs. We are dedicated to ensuring that every client clearly understands their situation and has an actionable plan, and we maintain continual communication with our clients. When working with my clients, I embrace a holistic planning process to help business owners, executives and high net worth families with comprehensive financial planning, investment management, portfolio design, business succession planning, estate planning, retirement income and insurance design. In addition, I also provide employee welfare and executive benefits to small and mid-size businesses.When I’m not in the office, I speak across the country about the processes and culture that have generated results for so many of our clients. I also serve on several boards, including the Advisory Board of Eagle Strategies, LLC, and The Nautilus Group©, a service of New York Life Insurance Company.To learn more about what I do and how I may be of service to your family or business, please connect with me here on LinkedIn or visit our website at www.SFAFN.com.\n  \n  \n",
        "name": "Jim Adkins",
        "title": "Founder & CEO of Strategic Financial Associates, Specializing in Holistic Financial Planning for Families and Businesses",
        "url": "linkedin.com/in/adkinsjim",
        "phone": "703-627-7175 (Mobile)",
        "email": "JAdkins@SFAfn.com"
    }
]