[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "7 Mutual Connections",
                "You and Renae both know Karen Matteuzzi, Katie Featherston, and 5 others"
            ],
            [
                "Renae can introduce you to 2 people at NightHawk Radiology Services",
                "Renae worked at NightHawk Radiology Services"
            ],
            [
                "I HIRED a person over 50. Should not be a big deal, but it was. You can't imagine the resistance I had to overcome.",
                "\" He will never work hard enough\", \"he will not fit into our culture\", \"he will be taking a lot of sick days\", \"he is overqualified\" etc",
                "Nobody said he was too old. They were all \"politically correct\".",
                "Even now, many years later, I am still upset about those remarks.",
                "I had to put my foot down to get him hired.",
                "Long story short, he was one of the best hires I ever made. We all learned from him. He made a huge difference for the company.",
                "We should STOP calling people over 50 as \"overqualified\" and \"over the hill\".",
                "Instead let's consider using these: veteran, very experienced, \"someone I can learn from\", someone who can make a huge difference because of their experience.",
                "Do you agree ?",
                "Renae liked"
            ],
            [
                "\"The world is changed by your example, not by your opinion.\" - Paulo Coelho",
                "Renae liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Operations Manager",
                "Company Name",
                "Grateful Ventures",
                "Dates Employed",
                "Oct 2017 – Present",
                "Employment Duration",
                "2 mos",
                "Location",
                "Phoenix, Arizona"
            ],
            [
                "Director of Human Resources",
                "Company Name",
                "Care1st Health Plan Arizona",
                "Dates Employed",
                "Feb 2015 – Oct 2017",
                "Employment Duration",
                "2 yrs 9 mos",
                "Location",
                "Phoenix, Arizona",
                "•\tManage the HR function for Care1st Health Plan Arizona.  This is a tactical and strategic position reporting to the Chief Administrative Officer.•\tCounsel managers on employee relations issues and performance management questions.•\tAudit HR policies and practices – make recommendations to Executive Management and roll out new policies.•\tPartner with hiring managers to make the recruiting and onboarding process more effective.•\tOversee the ADP/HRB HRIS system.•\tManage health and welfare benefits.  Lead Benefit Open Enrollment – work with the broker and executive management.•\tManage the performance review process.•\tLead and manage the company Wellness Program.•\tResponsible for HR and Facilities budget•\tManage two Human Resources professionals."
            ],
            [
                "Director of Human Resources",
                "Company Name",
                "SheKnows Media",
                "Dates Employed",
                "Nov 2012 – Sep 2014",
                "Employment Duration",
                "1 yr 11 mos",
                "Location",
                "Scottsdale, AZ",
                "•\tCreated and managed the Human Resources function for SheKnows.  Supported offices in Scottsdale, Los Angeles, Chicago, and New York.  This was a strategic and tactical position reporting directly to the CFO.•\tAdvised executive management on salary planning, change management, performance management, employee training, benefits offerings and contribution strategy, and acquisition communication to employees.  •\tCoached and advised managers on how to deal with performance issues, goal setting, performance management, etc. •\tPartnered with hiring managers to successfully fill over 100 positions in 18 months. Used social media, employee referrals and recruiters as part of the recruiting strategy.•\tDeveloped a new benefits program for the company.  Cut costs for the organization while changing the contribution strategy to be more in line with market data.•\tWorked with ADP to set up the payroll and HRIS modules.  Met the deadline for the first pay run after SheKnows was acquired.   Had less than 30 days to complete.  •\tManaged the Performance Review process – created new forms, changed to a common date review cycle, trained managers, managed the increase budget.•\tInitiated training program for the organization.  Management 101, Sexual Harassment Training, LOA for Management, Documentation training for managers, SK University for new hires.•\tCreated and rolled out a new team member handbook.   Communicated new and revised policies to employees.•\tConducted exit interviews with departing employees.  Reported trends and turnover rates to executive management.  •\tBenchmarked salaries for SheKnows positions.•\tWorked with managers on creating position descriptions.•\tCreated and rolled out a benefit survey and Employee Engagement survey.•\tManaged the Payroll Manager/Benefits Administrator and Office Administrator."
            ],
            [
                "HR Consultant (Contract Position)",
                "Company Name",
                "SupportSpace",
                "Dates Employed",
                "Sep 2012 – Nov 2012",
                "Employment Duration",
                "3 mos",
                "Location",
                "San Francisco Bay Area",
                "Recruited for technical, product and marketing positions for SupportSpace.  Worked with hiring managers to identify the best candidates."
            ],
            [
                "HR Director (Contract Position)",
                "Company Name",
                "Imaging Advantage",
                "Dates Employed",
                "Aug 2011 – Jan 2012",
                "Employment Duration",
                "6 mos",
                "Location",
                "Phoenix, AZ and Santa Monica, CA",
                "Audited HR policies & procedures - updated and added as needed.Recruited for all levels of the organizationAdvised and worked with managers on employee relations issuesWorked with benefits broker on a new benefit plan for the organization."
            ],
            [
                "Human Resources Manager",
                "Company Name",
                "NightHawk Radiology Services",
                "Dates Employed",
                "Jun 2007 – Jun 2011",
                "Employment Duration",
                "4 yrs 1 mo",
                "Location",
                "Scottsdale, AZ",
                "•\tManaged Human Resources function in the US, Sydney and Zurich offices.  Became well versed in employment laws and practices in all three countries.  Reported directly to the CFO.•\tSuccessfully filled over 200 positions across all levels of the organization using a variety of recruiting strategies and tactics.  Recruiting budgets ranged from $100,000 to $250,000. •\tWorked with paralegal on processing for H1B, E3 and L1B visas for employees.•\tAdvised, coached and counseled managers regarding employee relations issues involving sexual harassment, racial slurs, unfair treatment claims and other issues.  The result was no EEOC claims being filed during my tenure at NightHawk.•\tRevised onboarding process resulting in lower turnover rates.•\tMaintained and revised employee handbook as needed.  Communicated new or revised policies to employees.•\tCreated and implemented the first official training program for the company (NightHawk University).  Rolled out both online and classroom training resulting in improved customer service and an increase in employee satisfaction.•\tConducted exit interviews with departing employees.  Compiled, analyzed and presented data to executives resulting in a better understanding of why employees were leaving.•\tManaged the yearly performance appraisal process including the communication to all employees and training for the managers.•\tLed the HR team in the benefit renewal process.  Worked with Benefits Administrator on new enrollments and changes.•\t¬¬Conducted compensation market surveys.   •\tManaged the transition of NightHawk Human Resources to Virtual Radiologic (vRAd).  Played a key role in the transfer of information both before and after close.  Assisted employees with managing change as a result of the acquisition.  Was complimented and thanked by vRad’s HR Director for my assistance and professionalism."
            ],
            [
                "HR Manager",
                "Company Name",
                "Criticial Care Systems/Curative Wound Care",
                "Dates Employed",
                "2003 – 2006",
                "Employment Duration",
                "3 yrs",
                "Provided Generalist Support for the Wound Care Division and Corporate Operations.Recruited for Directors for Wound Care Centers, attorneys, IT professionalsAdvised and worked with managers on employee relations issuesWorked on employee retention plan for Wound Care Directors"
            ],
            [
                "HR Manager",
                "Company Name",
                "Achieve Healthcare Information Systems",
                "Dates Employed",
                "2000 – 2001",
                "Employment Duration",
                "1 yr",
                "Created and implemented the recruiting strategy for the organization.Coached and advised managers on employee relations, retention and organizational changes.Developed a new compensation structure for the organization."
            ],
            [
                "HR Generalist",
                "Company Name",
                "Express Scripts",
                "Dates Employed",
                "1998 – 2000",
                "Employment Duration",
                "2 yrs",
                "Provided Generalist support to IT, Call Center, Finance, Legal and Clinical departments.Recruited and pre-screened candidates for open positions.Partnered with co-worker to train managers on effective interviewing and writing performance evaluations.Coached and mentored new managersAdvised and worked with managers on employee relations issues."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "St. Cloud State University",
                "Degree Name",
                "Bachelor of Science",
                "Field Of Study",
                "Speech Communications w/emphasis in Management",
                "Dates attended or expected graduation",
                "1986 – 1989"
            ],
            [
                "St. Cloud State University",
                "Degree Name",
                "Bachelor of Science",
                "Field Of Study",
                "Speech Communications w/emphasis in Management",
                "Dates attended or expected graduation",
                "1986 – 1989"
            ],
            [
                "University of Minnesota Crookston",
                "Degree Name",
                "AAS",
                "Field Of Study",
                "Retail Management",
                "Dates attended or expected graduation",
                "1984 – 1986"
            ],
            [
                "University of Minnesota Crookston",
                "Degree Name",
                "AAS",
                "Field Of Study",
                "Retail Management",
                "Dates attended or expected graduation",
                "1984 – 1986"
            ],
            "Recommendations",
            [
                "Tech Finders",
                "7,553 followers"
            ],
            [
                "St Cloud State University Alumni",
                "13,024 members"
            ],
            [
                "University of Minnesota Crookston",
                "4,985 followers"
            ],
            [
                "Dr. Travis BradberryDr. Travis Bradberry is a LinkedIn Influencer",
                "Coauthor EMOTIONAL INTELLIGENCE 2.0 & President at TalentSmart",
                "2,346,402 followers"
            ],
            [
                "SAHRA*MIT",
                "259 members"
            ],
            [
                "Linked: HR Exec",
                "33,899 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (339)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Tech Finders",
                "7,553 followers"
            ],
            [
                "Tech Finders",
                "7,553 followers"
            ],
            [
                "St Cloud State University Alumni",
                "13,024 members"
            ],
            [
                "St Cloud State University Alumni",
                "13,024 members"
            ],
            [
                "University of Minnesota Crookston",
                "4,985 followers"
            ],
            [
                "University of Minnesota Crookston",
                "4,985 followers"
            ],
            [
                "Dr. Travis BradberryDr. Travis Bradberry is a LinkedIn Influencer",
                "Coauthor EMOTIONAL INTELLIGENCE 2.0 & President at TalentSmart",
                "2,346,402 followers"
            ],
            [
                "Dr. Travis BradberryDr. Travis Bradberry is a LinkedIn Influencer",
                "Coauthor EMOTIONAL INTELLIGENCE 2.0 & President at TalentSmart",
                "2,346,402 followers"
            ],
            [
                "Dr. Travis Bradberry is a LinkedIn Influencer"
            ],
            [
                "SAHRA*MIT",
                "259 members"
            ],
            [
                "SAHRA*MIT",
                "259 members"
            ],
            [
                "Linked: HR Exec",
                "33,899 members"
            ],
            [
                "Linked: HR Exec",
                "33,899 members"
            ]
        ],
        "recommendations": [
            [
                "Crystal Moore",
                "Healthcare Leader | Strategic Growth Mindset | Innovative and Driven",
                "March 11, 2012, Crystal worked with Renae in different groups",
                "Renae was very personable and easy to talk to which was important in an HR manager. She was professional with all dealings with the team and was always eager to help resolve situations that arose. Renae was an asset to the company and I enjoyed working with her."
            ],
            [
                "Crystal Moore",
                "Healthcare Leader | Strategic Growth Mindset | Innovative and Driven",
                "March 11, 2012, Crystal worked with Renae in different groups"
            ],
            [
                "Crystal Moore",
                "Healthcare Leader | Strategic Growth Mindset | Innovative and Driven",
                "March 11, 2012, Crystal worked with Renae in different groups"
            ],
            [
                "Crystal Moore",
                "Healthcare Leader | Strategic Growth Mindset | Innovative and Driven",
                "March 11, 2012, Crystal worked with Renae in different groups"
            ],
            "Healthcare Leader | Strategic Growth Mindset | Innovative and Driven",
            [
                "Renae was very personable and easy to talk to which was important in an HR manager. She was professional with all dealings with the team and was always eager to help resolve situations that arose. Renae was an asset to the company and I enjoyed working with her."
            ],
            [
                "Renae was very personable and easy to talk to which was important in an HR manager. She was professional with all dealings with the team and was always eager to help resolve situations that arose. Renae was an asset to the company and I enjoyed working with her."
            ],
            [
                "John Wolff",
                "IT Practice Lead at VincentBenjamin",
                "August 27, 2015, Renae was a client of John’s",
                "I have known John for 3 years.  We met while I was in a job search.  Once I landed, I contacted John to help with several IT positions my company had open.  He and his team were very successful.  They filled at least 20 positions.  John took the time to get to know the culture of the company, the hiring manager and the IT team.  If there ever was a problem with a candidate, John handled it and did the right thing.  There are numerous search firms and account managers in Phoenix.  I believe John is one of the best."
            ],
            [
                "John Wolff",
                "IT Practice Lead at VincentBenjamin",
                "August 27, 2015, Renae was a client of John’s"
            ],
            [
                "John Wolff",
                "IT Practice Lead at VincentBenjamin",
                "August 27, 2015, Renae was a client of John’s"
            ],
            [
                "John Wolff",
                "IT Practice Lead at VincentBenjamin",
                "August 27, 2015, Renae was a client of John’s"
            ],
            "IT Practice Lead at VincentBenjamin",
            [
                "I have known John for 3 years.  We met while I was in a job search.  Once I landed, I contacted John to help with several IT positions my company had open.  He and his team were very successful.  They filled at least 20 positions.  John took the time to get to know the culture of the company, the hiring manager and the IT team.  If there ever was a problem with a candidate, John handled it and did the right thing.  There are numerous search firms and account managers in Phoenix.  I believe John is one of the best."
            ],
            [
                "I have known John for 3 years.  We met while I was in a job search.  Once I landed, I contacted John to help with several IT positions my company had open.  He and his team were very successful.  They filled at least 20 positions.  John took the time to get to know the culture of the company, the hiring manager and the IT team.  If there ever was a problem with a candidate, John handled it and did the right thing.  There are numerous search firms and account managers in Phoenix.  I believe John is one of the best."
            ],
            [
                "La'Mont Standifer, PMP, BHT",
                "Operation Sales Management, leading teams to exceed company sales and SLA goals using positive Motivation  !!",
                "February 9, 2012, Renae worked with La'Mont in different groups",
                "I had the pleasure of working with LaMont for 1 ½ years while at NightHawk.  He was hired as the IT Manager for the new Phoenix location.   Being in HR, I worked with LaMont on staffing his department and on employee relations issues.  I found him to be professional and responsive while working with his staff and all levels of the organization.   He did a great job training his staff in order to meet the needs of the business and came up with innovative ideas to make IT support run more smoothly."
            ],
            [
                "La'Mont Standifer, PMP, BHT",
                "Operation Sales Management, leading teams to exceed company sales and SLA goals using positive Motivation  !!",
                "February 9, 2012, Renae worked with La'Mont in different groups"
            ],
            [
                "La'Mont Standifer, PMP, BHT",
                "Operation Sales Management, leading teams to exceed company sales and SLA goals using positive Motivation  !!",
                "February 9, 2012, Renae worked with La'Mont in different groups"
            ],
            [
                "La'Mont Standifer, PMP, BHT",
                "Operation Sales Management, leading teams to exceed company sales and SLA goals using positive Motivation  !!",
                "February 9, 2012, Renae worked with La'Mont in different groups"
            ],
            "Operation Sales Management, leading teams to exceed company sales and SLA goals using positive Motivation  !!",
            [
                "I had the pleasure of working with LaMont for 1 ½ years while at NightHawk.  He was hired as the IT Manager for the new Phoenix location.   Being in HR, I worked with LaMont on staffing his department and on employee relations issues.  I found him to be professional and responsive while working with his staff and all levels of the organization.   He did a great job training his staff in order to meet the needs of the business and came up with innovative ideas to make IT support run more smoothly."
            ],
            [
                "I had the pleasure of working with LaMont for 1 ½ years while at NightHawk.  He was hired as the IT Manager for the new Phoenix location.   Being in HR, I worked with LaMont on staffing his department and on employee relations issues.  I found him to be professional and responsive while working with his staff and all levels of the organization.   He did a great job training his staff in order to meet the needs of the business and came up with innovative ideas to make IT support run more smoothly."
            ]
        ],
        "skills": [],
        "summary": "",
        "name": "Renae Vaules, SPHR",
        "title": "Operations Manager at Grateful Ventures",
        "url": "linkedin.com/in/renae-vaules-sphr-bb90812",
        "phone": "",
        "email": "renae@vaules.com"
    }
]