[
    {
        "experience": [
            "Highlights",
            [
                "157 Mutual Connections",
                "You and Dave both know Dan Nienhauser, Sergey Zaytsev, and 155 others"
            ],
            [
                "Employers could you be more humane! I got this disturbing message from someone:",
                "“ Not been able to communicate with my mom in Puerto Rico and had a surgery at tje beginning of the year, so I ran out my PTO. I requested next week time off to try to find my mom, HR says that my condition doesn't qualify as hardship. So, I went to the head of HR, she doesn't guarantee that I would not be written up for unapproved absenteeism. Let's see what happens. Either way I'm going to find my mom, and if they tarnish my record w a written warning, so be it. I'm so sad that sometimes I think this world should end, people has lost humanity and compassion. Maybe I will resign after coming back if I see that written warning.\"",
                "Not only is this negatively affecting this employee, but all other employees are watching how you treat them in their lowest moments.",
                "Read Full post here: \"Want Loyal Employees? Develop This One Habit!\" https://lnkd.in/d477afz",
                "My advice is focus on your health and family (finding your mom). These cannot be replaced. You will get a another job.",
                "#Leadership #Management #BrigetteHyacinth",
                "Dave liked"
            ],
            [
                "I came across this amazing video of a noble soul who made a huge difference in people's lives without expecting anything in return.",
                "Kindness in words creates confidence, in thoughts creates profoundness and in giving creates love.",
                "This man proved that love and kindness are never wasted. As William Wordsmith stated \" The best portion of a mans life are his little ,nameless, unremembered acts of kindness and love\".",
                "Dave replied to a comment"
            ],
            [
                "I came across this amazing video of a noble soul who made a huge difference in people's lives without expecting anything in return.",
                "Kindness in words creates confidence, in thoughts creates profoundness and in giving creates love.",
                "This man proved that love and kindness are never wasted. As William Wordsmith stated \" The best portion of a mans life are his little ,nameless, unremembered acts of kindness and love\".",
                "Dave commented"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Vice President",
                "Company Name",
                "Derive",
                "Dates Employed",
                "Aug 2012 – Present",
                "Employment Duration",
                "5 yrs 3 mos",
                "Location",
                "Phoenix, Arizona Area",
                "Derive offers a range of IT staffing, Recruitment Process Outsourcing, and IT services to many Fortune 1000 clients and leading companies across the US. Key responsibilities and achievements:I am successfully leading the recruitment and talent management teams and helping them in identifying and screening the suitable candidates for our clients. I offer recruitment and talent acquisition related consultation to clients to help them in developing intelligent growth strategies.•Help our clients in developing and successfully executing effective recruitment strategies and plans that are tied to business objectives. •Provide partnership development, personal interaction with hiring managers, candidate identification and recruitment for all levels of IT personnel. •Working within complex, constantly-changing, and fast-paced environments and help our clients resolve their recruitment challenges within tight deadlines."
            ],
            [
                "CEO",
                "Company Name",
                "2aspire",
                "Dates Employed",
                "Aug 2009 – Sep 2012",
                "Employment Duration",
                "3 yrs 2 mos",
                "Location",
                "Phoenix, Arizona Area",
                "2Aspire is a leading global provider of innovative consulting, technology, and outsourcing services. 2Aspire delivers IT enabled business services that help enterprises operate more efficiently and profitably.Key responsibilities and achievements:I combined my in-depth understanding of our clients' businesses with our expertise in IT and business processes to resolve our clients' challenges and develop innovative solutions to address them. Through my highly collaborative consulting style, I worked with our clients to transform their businesses, and enabled them to focus on what they do best. I helped our clients define requirements and find the best resources to complete the jobs at hand in the best possible way."
            ],
            [
                "Senior Account Manager",
                "Company Name",
                "Ensynch",
                "Dates Employed",
                "Jan 2005 – Aug 2009",
                "Employment Duration",
                "4 yrs 8 mos",
                "Location",
                "Tempe AZ",
                "Ensynch, Inc. is a leading professional services consulting firm with more than 10 years in providing information technology, business intelligence, project management, and technical recruiting solutions. (Ensynch is now an Insight Company.)Key responsibilities and achievements:I supervised the talent management team, and built and steered end-to-end recruitment strategies for key clients. I refined several practices in order to increase recruiting efficiency and decreasing cost per hire.•Instrumental in driving ‘Talent Solutions’ business for Ensynch. •Devised recruitment model for the world’s largest semiconductor chip maker.•Received appreciation for exceptional customer service. •Worked with the managers to set hiring goals and expectations.•Hired, managed and trained multiple teams of recruiters.•Understood our clients’ recruitment needs, created effective strategies that tied to their business objectives, and drove successful results, while assuring a positive candidate experience.•Identified qualified candidates through direct sourcing, in-house database searches, internet searches, third party alliances, advertisements, and referrals. •Utilized recruitment tools such as Dice, Monster, Career Builder, LinkedIn, Hot Jobs, and other online boards as well as an internal ATS called Bond Adapt.•Managed full life-cycle recruitment including technical screening, interview coordination, compensation negotiation, and contract preparation"
            ],
            [
                "Senior Technical Recruiter",
                "Company Name",
                "Mindlance",
                "Dates Employed",
                "May 2001 – Jan 2005",
                "Employment Duration",
                "3 yrs 9 mos",
                "Location",
                "Hoboken, NJ",
                "Mindlance is a global business and information technology consulting firm providing services via professional consulting, outsourcing and staff augmentation delivery channels.Key responsibilities and achievements:I managed full lifecycle recruitment including requirements gathering, defining, benchmarking, sourcing, screening, interview scheduling, negotiations and preparing offer packages, first day of employment, and orientation.•Primary responsibilities included recruiting people on an on-going basis for Intel and Deutsche Bank.•Enabled faster placement by setting up interviews, work schedules, H1-transfers, and liaising with immigration counsel.•Directly identified, evaluated, and hired IT professionals in a variety of business sectors and industries. •Negotiated contracts with software companies to identify and subcontract candidates.•Trained new recruits about company procedures, rate negotiation, lead generation, and industry standards."
            ],
            [
                "Software Marketing Manager",
                "Company Name",
                "Applogic Systems",
                "Dates Employed",
                "May 1998 – Dec 2000",
                "Employment Duration",
                "2 yrs 8 mos",
                "Location",
                "Hyderabad Area, India",
                "Key responsibilities and achievements:I worked on identifying sales and marketing objectives, and assisted in creating powerful brand image for the Billing Software.  •Created sales presentations, marketing collateral, whitepapers, demos, etc., and delivered these in formats and forums appropriate for prospects, analysts, technology partners, and operators.•Actively supported outbound marketing activities such as trade shows, industry events, conferences, website updates/maintenance, and analyst meeting.•Supported sales staff with product marketing collateral, presentations, and training information."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "IBS",
                "Degree Name",
                "MBA",
                "Field Of Study",
                "Marketing and Finance",
                "Dates attended or expected graduation",
                "1996 – 1998"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See fewer skills"
            ],
            "Recommendations",
            [
                "Linux Admins",
                "29,007 members"
            ],
            [
                "System Administrator (Windows Linux Unix Apple VMware Oracle EMC Cloud SAP SQL CRM Cisco ITIL SAN)",
                "238,223 members"
            ],
            [
                "WebSphere MQ & WebSphere Message Broker",
                "14,815 members"
            ],
            [
                "Job Openings for OPT/CPT Students - North America",
                "80,135 members"
            ],
            [
                "Linked.NET Users Group (LIDNUG)",
                "73,692 members"
            ],
            [
                "End to End Web Developers",
                "86,228 members"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Linux Admins",
                "29,007 members"
            ],
            [
                "Linux Admins",
                "29,007 members"
            ],
            [
                "System Administrator (Windows Linux Unix Apple VMware Oracle EMC Cloud SAP SQL CRM Cisco ITIL SAN)",
                "238,223 members"
            ],
            [
                "System Administrator (Windows Linux Unix Apple VMware Oracle EMC Cloud SAP SQL CRM Cisco ITIL SAN)",
                "238,223 members"
            ],
            [
                "WebSphere MQ & WebSphere Message Broker",
                "14,815 members"
            ],
            [
                "WebSphere MQ & WebSphere Message Broker",
                "14,815 members"
            ],
            [
                "Job Openings for OPT/CPT Students - North America",
                "80,135 members"
            ],
            [
                "Job Openings for OPT/CPT Students - North America",
                "80,135 members"
            ],
            [
                "Linked.NET Users Group (LIDNUG)",
                "73,692 members"
            ],
            [
                "Linked.NET Users Group (LIDNUG)",
                "73,692 members"
            ],
            [
                "End to End Web Developers",
                "86,228 members"
            ],
            [
                "End to End Web Developers",
                "86,228 members"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Technical Recruiting",
                "See 79 endorsements for Technical Recruiting",
                "79",
                "Technical Recruiting",
                "Endorse",
                "Endorsed by Ashish Mahajan and 1 other who is highly skilled at this",
                "Endorsed by Jay Witherspoon (mutual connection)"
            ],
            [
                "Technical Recruiting",
                "See 79 endorsements for Technical Recruiting",
                "79"
            ],
            [
                "Applicant Tracking Systems",
                "See 41 endorsements for Applicant Tracking Systems",
                "41",
                "Applicant Tracking Systems",
                "Endorse",
                "Endorsed by Tom McCloud and 1 other mutual connection",
                "Endorsed by 2 of Dave’s colleagues at Ensynch"
            ],
            [
                "Applicant Tracking Systems",
                "See 41 endorsements for Applicant Tracking Systems",
                "41"
            ],
            [
                "Screening",
                "See 36 endorsements for Screening",
                "36",
                "Screening",
                "Endorse",
                "Endorsed by Ashish Mahajan, who is highly skilled at this",
                "Endorsed by 4 of Dave’s colleagues at Derive"
            ],
            [
                "Screening",
                "See 36 endorsements for Screening",
                "36"
            ],
            [
                "Agile Methodologies",
                "See 7 endorsements for Agile Methodologies",
                "7",
                "Agile Methodologies",
                "Endorse"
            ],
            [
                "Agile Methodologies",
                "See 7 endorsements for Agile Methodologies",
                "7"
            ],
            [
                "Business Intelligence",
                "See 6 endorsements for Business Intelligence",
                "6",
                "Business Intelligence",
                "Endorse"
            ],
            [
                "Business Intelligence",
                "See 6 endorsements for Business Intelligence",
                "6"
            ],
            [
                "Full-cycle Recruiting",
                "See 2 endorsements for Full-cycle Recruiting",
                "2",
                "Full-cycle Recruiting",
                "Endorse"
            ],
            [
                "Full-cycle Recruiting",
                "See 2 endorsements for Full-cycle Recruiting",
                "2"
            ],
            [
                "Direct Sourcing",
                "See 1 endorsement for Direct Sourcing",
                "1",
                "Direct Sourcing",
                "Endorse"
            ],
            [
                "Direct Sourcing",
                "See 1 endorsement for Direct Sourcing",
                "1"
            ]
        ],
        "summary": "    I have been in the field of talent management and recruitment planning for 12+ years and during these years I have built tremendous expertise in recognizing, fostering, and finding the right opportunities for capable individuals. With a past of working in the IT domain, my core strength lies in sourcing people for the IT industry as I can understand the specific business, technology and functional needs that are required for an IT job. I creatively combine client objectives with an analytical problem-solving approach to build and manage cross-functional teams that deliver better ROI under tight deadlines.My achievements have been game-changing for the many clients that I have worked with. As Vice President of Derive, I bring in smart recruitment and sourcing strategies to help our clients grow profitably, and build a path of sustainable future through a dependable source of high quality ITSpecialties: -Recruitment strategy development-Talent sourcing and screening-Minimizing recruitment costs-Maximizing recruitment effectiveness-\tExpertise in full recruitment lifecycle\n  \n  \n",
        "name": "Dave Narania",
        "title": "Vice President at Derive - Nurturing talent and building perceptive recruitment strategies for growing IT companies",
        "url": "linkedin.com/in/davenarania",
        "phone": null,
        "email": "dnarania@derivetalent.com"
    }
]