[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "70 Mutual Connections",
                "You and Michael J. both know John Fanning, Matt Greene, and 68 others"
            ],
            [
                "Michael J. can introduce you to 6 people at Google",
                "You are following Google"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "President and Co-Founder",
                "Company Name",
                "Promsocial",
                "Dates Employed",
                "Aug 2013 – Present",
                "Employment Duration",
                "4 yrs 3 mos",
                "Location",
                "Old Bridge, NJ",
                "Promsocial is the worlds first social network where students can plan, organize and share their prom experience.  To view our explainer video and to pre register now, visit Promsocial.com"
            ],
            [
                "Online Branding Consultant & Domain Investor",
                "Company Name",
                "Self Employed - Online Business Development",
                "Dates Employed",
                "Mar 2008 – Present",
                "Employment Duration",
                "9 yrs 8 mos",
                "Location",
                "The Internet",
                "I am an investor, a creator, visionary, WordPress site manager, SEM/SEO/Social Media expert and consultant who thinks way outside of the box. I own a diverse domain portfolio and have numerous online partnerships.  I offer consulting to personal projects, online start-ups and small and large size businesses, specializing and focusing on their online goals, social presence, ecomm, traffic, links, keyword ranking and monetization methods and results.  I personally like acquiring brandable/memorable domains, future trend domains, 4/5Letter .com's, geo related domains, as well as product related, exact match domains. My goal as an investor is to not just buy and hold quality domains and wait for an end user to come, rather, I enjoy creating brands, building online properties and portals that earn passive income on a ongoing basis and provide users with quality content. I constantly look to partner up with like-minded individuals who are motivated and share the same passions and work ethic that I bring to the table.  I'm learning and getting involved in the startup space, as of recently.  Regarding domains, I am both a buyer, seller and both short and long term investor.  I focus primarily on direct company and end user sales, as well as building recurring online revenue properties.I look to maximize revenue and improve current processes through search engine optimization, unique and relevant content updated regularly by authority sources and writers, SEO keyword selection and focus, eye catching/vibrant/artistic logos, strong/functional code and creative design, social media, quality backlinking, marketing, affiliate marketing and advertising, PR & event management/promotion and much more."
            ],
            [
                "Chief Operating Officer",
                "Company Name",
                "NuSquare, Inc",
                "Dates Employed",
                "Jan 2011 – Jun 2016",
                "Employment Duration",
                "5 yrs 6 mos",
                "Location",
                "New York, NY",
                "•Overseeing and executing day-to-day operations of NuSquare, Inc online properties, with a core focus on NewYorkEvents.co & NYFSP.com•Keeping the CEO apprised of significant events and relative industry news •Oversee Communications Director, Content/Social Media Manager, Writers and other key employees relative to operations•Daily updating of the website, including all back-end operations in Wordpress•Creating operations strategy and policies as well as communicating strategy and policy to employees.•Fostering employee alignment with company goals and managing multiple writers"
            ],
            [
                "Structured Finance Associate",
                "Company Name",
                "Moody's Investors Service",
                "Dates Employed",
                "Oct 2009 – Apr 2013",
                "Employment Duration",
                "3 yrs 7 mos",
                "Location",
                "New York, NY",
                "•\tManage a $10 million dollar Structured Finance portfolio of issuers as well as $14 million dollar Sovereign/Latin America portfolio concurrently (transactions including ABS, RMBS, ABCP, CMBS, SQR/OQR, CLO/CDO, Derivatives, Government & Ministry)•\tAttend weekly and monthly meetings with Senior Management, AVP/SVP/MD to provide an account of progress made or any outstanding issues with client accounts. •\tHandle most of post rating operations and client management including invoice adjustments, fee inquiries, general business questions, outstandings reporting, general accounting and documentation.•\t  Liaise with the Cash Applications Department (New York & International) to follow through on allocations of funds to the appropriate issuer account.•\t  Maintain accurate details of all communication and account changes (trustee, mergers and acquisitions, bankruptcies/liquidations) with issuers in the Oracle Peoplesoft Financials, Phoenix, Cortera and internal database systems."
            ],
            [
                "Project Manager/Operational Consultant",
                "Company Name",
                "Compustall Services, Inc.",
                "Dates Employed",
                "Jun 2009 – Jan 2012",
                "Employment Duration",
                "2 yrs 8 mos",
                "Location",
                "Greater New York City Area",
                "Assist with proposal development, implementation and execution of a complete IT relocation for a client.•\t Work on project cost control, process improvement and streamlining the entire relocation start to finish.•\t In charge of client relation, retention, setting and tracking milestones, troubleshooting and project progress.•\t Assume project leadership role, manage a staff of technicians and movers and delegate work as needed.•\t Work directly with the client to ensure  project completion/satisfaction and deliver results on schedule."
            ],
            [
                "Educational Consultant",
                "Company Name",
                "NetCom Information Technology",
                "Dates Employed",
                "Jan 2008 – Feb 2009",
                "Employment Duration",
                "1 yr 2 mos",
                "Location",
                "New York, NY",
                "•\tProvided consultative solutions to personal clients and corporations to meet their training/certification goals•\tAssisted and organized DDOS training for government employees to meet training requirements by US law.•\tBuilt a business relationship clients and focused on repeat business, account penetration and networking.•\tServiced numerous Fortune 500 corporate accounts as well as private firms and senior leaders. •\tMet and exceeded increasing individual and business sales and revenue goals set forth by management."
            ],
            [
                "Account Manager",
                "Company Name",
                "SHI",
                "Dates Employed",
                "2007 – 2008",
                "Employment Duration",
                "1 yr",
                "•\tPerformed information technology based sales and consultation to all Michigan State and local government     agencies including schools and law enforcement agencies; sales averaged $1.5 monthly .•\tResponsible for all order and account management for multiple accounts and regions.•\tExhibited excellent collaboration skills with fellow team members to meet monthly/quarterly quotas.•\tAttended yearly sales conferences and monthly vendor meetings to learn about all new IT products in the     market and surrounding the industry.•\tExtended knowledge of major software manufacturers, products and services they offer and befits of each."
            ],
            [
                "Lead Trainer & Bartender",
                "Company Name",
                "The Frog and the Peach",
                "Dates Employed",
                "2006 – 2008",
                "Employment Duration",
                "2 yrs",
                "Location",
                "New Brunswick, NJ",
                "Train new employees on in house process, fine dining procedure and etiquette, wine and cuisine knowledge and bar operations."
            ],
            [
                "Operations Manager",
                "Company Name",
                "Torik Corporation",
                "Dates Employed",
                "Jan 2004 – Dec 2007",
                "Employment Duration",
                "4 yrs",
                "Location",
                "Matawan, NJ",
                "Managed all daily operations and helped organize various contractors assigned to specific contract jobs and job site duties.Managed a team of 6 with various day to day responsibilities and deadlines based around contracting, scheduling and operational functions.Setup and maintained entire office Microsoft Windows Server network."
            ],
            [
                "Sales Manager/Account Executive",
                "Company Name",
                "Executive Cellular Incorporated",
                "Dates Employed",
                "Sep 2000 – Oct 2002",
                "Employment Duration",
                "2 yrs 2 mos",
                "Maintained a monthly and quarterly sales quota while continually increasing revenue in multiple locations.Created an extensive training program for new employees, a more efficient point of sale system and creative advertising/marketing techniques that ultimately increased sales for the company each quarter.Recruited, trained and managed new and existing employees for both Central New Jersey and Manhattan district and brought both teams from 10 to 20 employees creating a stronger sales force."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "Kean University",
                "Degree Name",
                "Bachelors Degree",
                "Field Of Study",
                "Finance",
                "Dates attended or expected graduation",
                "2003 – 2007"
            ],
            [
                "Kean University",
                "Degree Name",
                "Bachelors Degree",
                "Field Of Study",
                "Finance",
                "Dates attended or expected graduation",
                "2003 – 2007"
            ],
            [
                "Saint John Vianney Regional",
                "Degree Name",
                "High School",
                "Field Of Study",
                "All",
                "Dates attended or expected graduation",
                "1995 – 1999",
                "Activities and Societies:",
                "Basketball"
            ],
            [
                "Saint John Vianney Regional",
                "Degree Name",
                "High School",
                "Field Of Study",
                "All",
                "Dates attended or expected graduation",
                "1995 – 1999",
                "Activities and Societies:",
                "Basketball"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 47 more skills"
            ],
            "Recommendations",
            [
                "Algorithmic Trading",
                "78,750 members"
            ],
            [
                "On Startups - The Community For Entrepreneurs",
                "892,330 members"
            ],
            [
                "Inc. Magazine",
                "1,813,833 followers"
            ],
            [
                "Domainers",
                "4,828 members"
            ],
            [
                "Social Media Central",
                "824 members"
            ],
            [
                "Arianna HuffingtonArianna Huffington is a LinkedIn Influencer",
                "Founder and CEO at Thrive Global",
                "6,353,533 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "See connections (500+)"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Algorithmic Trading",
                "78,750 members"
            ],
            [
                "Algorithmic Trading",
                "78,750 members"
            ],
            [
                "On Startups - The Community For Entrepreneurs",
                "892,330 members"
            ],
            [
                "On Startups - The Community For Entrepreneurs",
                "892,330 members"
            ],
            [
                "Inc. Magazine",
                "1,813,833 followers"
            ],
            [
                "Inc. Magazine",
                "1,813,833 followers"
            ],
            [
                "Domainers",
                "4,828 members"
            ],
            [
                "Domainers",
                "4,828 members"
            ],
            [
                "Social Media Central",
                "824 members"
            ],
            [
                "Social Media Central",
                "824 members"
            ],
            [
                "Arianna HuffingtonArianna Huffington is a LinkedIn Influencer",
                "Founder and CEO at Thrive Global",
                "6,353,533 followers"
            ],
            [
                "Arianna HuffingtonArianna Huffington is a LinkedIn Influencer",
                "Founder and CEO at Thrive Global",
                "6,353,533 followers"
            ],
            [
                "Arianna Huffington is a LinkedIn Influencer"
            ]
        ],
        "recommendations": [
            [
                "Eileen Gnadinger",
                "Sales Support Operations Manager at SHI International Corp.",
                "January 7, 2011, Eileen worked with Michael J. in different groups",
                "Michael is a professional worker.  He is dependable and courteous to his co-workers as well as his customers.  Michael adapts well to stressful situations and can be counted on to handle more than his share of work."
            ],
            [
                "Eileen Gnadinger",
                "Sales Support Operations Manager at SHI International Corp.",
                "January 7, 2011, Eileen worked with Michael J. in different groups"
            ],
            [
                "Eileen Gnadinger",
                "Sales Support Operations Manager at SHI International Corp.",
                "January 7, 2011, Eileen worked with Michael J. in different groups"
            ],
            [
                "Eileen Gnadinger",
                "Sales Support Operations Manager at SHI International Corp.",
                "January 7, 2011, Eileen worked with Michael J. in different groups"
            ],
            "Sales Support Operations Manager at SHI International Corp.",
            [
                "Michael is a professional worker.  He is dependable and courteous to his co-workers as well as his customers.  Michael adapts well to stressful situations and can be counted on to handle more than his share of work."
            ],
            [
                "Michael is a professional worker.  He is dependable and courteous to his co-workers as well as his customers.  Michael adapts well to stressful situations and can be counted on to handle more than his share of work."
            ],
            [
                "Patrick Griffin",
                "Associate Relationship Manager, Business Banking for M&T in Syracuse",
                "November 4, 2010, Patrick worked with Michael J. in different groups",
                "Michael has a strong work ethic, is quick to learn new skills, and is easy to work with.  He works well with both internal and external customers.While he does not report to me directly, I often have to give Michael work which he processes quickly and with due care.  I would recommend him highly."
            ],
            [
                "Patrick Griffin",
                "Associate Relationship Manager, Business Banking for M&T in Syracuse",
                "November 4, 2010, Patrick worked with Michael J. in different groups"
            ],
            [
                "Patrick Griffin",
                "Associate Relationship Manager, Business Banking for M&T in Syracuse",
                "November 4, 2010, Patrick worked with Michael J. in different groups"
            ],
            [
                "Patrick Griffin",
                "Associate Relationship Manager, Business Banking for M&T in Syracuse",
                "November 4, 2010, Patrick worked with Michael J. in different groups"
            ],
            "Associate Relationship Manager, Business Banking for M&T in Syracuse",
            [
                "Michael has a strong work ethic, is quick to learn new skills, and is easy to work with.  He works well with both internal and external customers.While he does not report to me directly, I often have to give Michael work which he processes quickly and with due care.  I would recommend him highly."
            ],
            [
                "Michael has a strong work ethic, is quick to learn new skills, and is easy to work with.  He works well with both internal and external customers.While he does not report to me directly, I often have to give Michael work which he processes quickly and with due care.  I would recommend him highly."
            ],
            [
                "Masud Rahman",
                "Director Learning & Development",
                "August 9, 2010, Masud was senior to Michael J. but didn’t manage directly",
                "This is my personal recommendation for Masud.  Let me start by saying it was an absolute pleasure to work with Masud.  He is a great manager and a true professional.  Masud is very versatile because he knows his product inside and out and is able to identify a clients need or an opportunity for business.  He is the kind of manager who thrives on his teams success and is constantly there to lend a helping hand and mentor you to success.  Masud is successful now and will be even more successful in the future due to his go getter attitude and his work ethic. It truly was my pleasure to work with Masud, he helped me develop both personally and professionally.  He is a stand up guy in and out of the office and any company would be lucky to have him as a member of their team.  He is a friend and a great guy to know!Regards,Michael J. Hudak"
            ],
            [
                "Masud Rahman",
                "Director Learning & Development",
                "August 9, 2010, Masud was senior to Michael J. but didn’t manage directly"
            ],
            [
                "Masud Rahman",
                "Director Learning & Development",
                "August 9, 2010, Masud was senior to Michael J. but didn’t manage directly"
            ],
            [
                "Masud Rahman",
                "Director Learning & Development",
                "August 9, 2010, Masud was senior to Michael J. but didn’t manage directly"
            ],
            "Director Learning & Development",
            [
                "This is my personal recommendation for Masud.  Let me start by saying it was an absolute pleasure to work with Masud.  He is a great manager and a true professional.  Masud is very versatile because he knows his product inside and out and is able to identify a clients need or an opportunity for business.  He is the kind of manager who thrives on his teams success and is constantly there to lend a helping hand and mentor you to success.  Masud is successful now and will be even more successful in the future due to his go getter attitude and his work ethic. It truly was my pleasure to work with Masud, he helped me develop both personally and professionally.  He is a stand up guy in and out of the office and any company would be lucky to have him as a member of their team.  He is a friend and a great guy to know!Regards,Michael J. Hudak"
            ],
            [
                "This is my personal recommendation for Masud.  Let me start by saying it was an absolute pleasure to work with Masud.  He is a great manager and a true professional.  Masud is very versatile because he knows his product inside and out and is able to identify a clients need or an opportunity for business.  He is the kind of manager who thrives on his teams success and is constantly there to lend a helping hand and mentor you to success.  Masud is successful now and will be even more successful in the future due to his go getter attitude and his work ethic. It truly was my pleasure to work with Masud, he helped me develop both personally and professionally.  He is a stand up guy in and out of the office and any company would be lucky to have him as a member of their team.  He is a friend and a great guy to know!Regards,Michael J. Hudak"
            ],
            [
                "Dana Masterman",
                "Channel Manager - IBM Security Solutions (MaaS360)",
                "April 13, 2010, Michael J. worked with Dana in different groups",
                "This is my personal recommendation for Dana Masterman.  I had the pleasure of working with her at Software House International.  She is dedicated to her job and extremely professional and hard working. Dana constantly was recognized for exceeding her clients expectations and sets a great example of what an accont manager should be doing.  Her co-workers at the office would also speak very highly of her as well and compliment her work ethic constantly.  Dana would be an asset to any company or organization and it was an absolute pleasure working with her.Sincerely,Michael J. Hudak"
            ],
            [
                "Dana Masterman",
                "Channel Manager - IBM Security Solutions (MaaS360)",
                "April 13, 2010, Michael J. worked with Dana in different groups"
            ],
            [
                "Dana Masterman",
                "Channel Manager - IBM Security Solutions (MaaS360)",
                "April 13, 2010, Michael J. worked with Dana in different groups"
            ],
            [
                "Dana Masterman",
                "Channel Manager - IBM Security Solutions (MaaS360)",
                "April 13, 2010, Michael J. worked with Dana in different groups"
            ],
            "Channel Manager - IBM Security Solutions (MaaS360)",
            [
                "This is my personal recommendation for Dana Masterman.  I had the pleasure of working with her at Software House International.  She is dedicated to her job and extremely professional and hard working. Dana constantly was recognized for exceeding her clients expectations and sets a great example of what an accont manager should be doing.  Her co-workers at the office would also speak very highly of her as well and compliment her work ethic constantly.  Dana would be an asset to any company or organization and it was an absolute pleasure working with her.Sincerely,Michael J. Hudak"
            ],
            [
                "This is my personal recommendation for Dana Masterman.  I had the pleasure of working with her at Software House International.  She is dedicated to her job and extremely professional and hard working. Dana constantly was recognized for exceeding her clients expectations and sets a great example of what an accont manager should be doing.  Her co-workers at the office would also speak very highly of her as well and compliment her work ethic constantly.  Dana would be an asset to any company or organization and it was an absolute pleasure working with her.Sincerely,Michael J. Hudak"
            ]
        ],
        "skills": [
            [
                "CRM",
                "See 78 endorsements for CRM",
                "78",
                "CRM",
                "Endorse",
                "Parker Powers and 77 connections have given endorsements for this skill"
            ],
            [
                "CRM",
                "See 78 endorsements for CRM",
                "78"
            ],
            [
                "E-commerce",
                "See 75 endorsements for E-commerce",
                "75",
                "E-commerce",
                "Endorse",
                "Endorsed by Xavier Buck and 9 others who are highly skilled at this",
                "Endorsed by Tracy Fogarty and 1 other mutual connection"
            ],
            [
                "E-commerce",
                "See 75 endorsements for E-commerce",
                "75"
            ],
            [
                "SEO",
                "See 68 endorsements for SEO",
                "68",
                "SEO",
                "Endorse",
                "Endorsed by Timothy M. Evans, who is highly skilled at this"
            ],
            [
                "SEO",
                "See 68 endorsements for SEO",
                "68"
            ]
        ],
        "summary": "  High performing, driven, hard working, creative professional.  Startup company founder, experienced in financial services, online branding and marketing, ip, domain name management, development and investment.\n  \n  \n",
        "name": "Michael J. Hudak",
        "title": "President and Co-Founder at Promsocial",
        "url": "linkedin.com/in/michaeljhudak1",
        "phone": "",
        "email": "MichaelJHudak@gmail.com"
    }
]