[
    {
        "experience": [
            [
                "Highlights"
            ],
            [
                "173 Mutual Connections",
                "You and David both know Ed Nusbaum, Curtis Gunn, and 171 others"
            ],
            [
                "You both studied at Northern Arizona University",
                "David studied at Northern Arizona University before you started"
            ],
            [
                "Good morning  from Lukachukai, Arizona - Navajo Nation.  #nativeamerican #navajo #navajotribe",
                "David liked"
            ],
            [
                "Thank you Moonshot powered by NACET and the city of Henderson for hosting a great event.",
                "Scott Hathcock",
                "David liked"
            ],
            [
                "Smart lock company August gets acquired",
                "David liked"
            ],
            [
                "It was a pleasure speaking last night in L.A. on Banking and payments in the State legal Cannabis industry. Thank you CLAB for hosting a great event!",
                "David liked"
            ],
            [
                "The 2018 Wealthfront Career Launching Companies List",
                "David liked"
            ],
            [
                "PwC: Arizona startups raise more than $40 million this quarter",
                "David liked"
            ],
            [
                "Experience"
            ],
            [
                "Experience"
            ],
            [
                "Principal",
                "Company Name",
                "Shift. Creative Solutions",
                "Dates Employed",
                "Nov 2016 – Present",
                "Employment Duration",
                "1 yr",
                "Location",
                "United States",
                "Partnering with executive teams to develop and implement creative solutions to scale clients. Through a fully-immersive model, our team assists growing businesses overcome challenges and accelerate growth. Shift. is the creative and well connected partner you wished you started your business with. We specialize in:Business OutlinesExecutive StrategyCapital RaiseFinancial ModelingPartnership StrategyLegal Agreements & ContractsBranding & MarketingBusiness Growth StrategyPersonnel RecruitmentLeadership Training... and Implementation!www.shiftcreativesolutions.com"
            ],
            [
                "Advisory Board Member",
                "Company Name",
                "Asturia Ventures",
                "Dates Employed",
                "2006 – Present",
                "Employment Duration",
                "11 yrs",
                "Advise management team in strategic planning to identify and develop financial and strategic matrices to ensure future growth of target markets. Collaboratively advise team to sustain long term working relationships with financial partners (high net worth investors, angel investors, strategic investors and venture capital firms) raising capital, M&A and transition/ exit strategy for clients. My key roles below were fulfilled until 2015 when I became an advisor to the organization.Key Roles:•\tIdentify and develop intellectual property while mentoring entrepreneur’s to ensure success.  •\tDevelopment of financial and strategic matrices, business consulting, financial forecasting/ reporting, international business, reporting to SEC and other agencies, and franchising.•\t Branding, market positioning/ development, improve customer/ investor relations and public speaking. •\tExcellent working relationships with financial partners (high net worth investors, angel investors, strategic investors and venture capital firms).•\tAdditional services offered include raising capital, M&A and transition/ exit strategy, developing & implementing corporate strategy, conflict resolution, and negotiation facilitation."
            ],
            [
                "COO",
                "Company Name",
                "OneGlobe Citizen",
                "Dates Employed",
                "2016 – Mar 2017",
                "Employment Duration",
                "1 yr",
                "Location",
                "Chicago, Illinois",
                "OneGlobe Citizen’s technology is a progressive web application that connects travelers and locals around the world through a single, community-based platform the combines the best of multimedia-based editorial content, experiences, recommendations and social connectivity, allowing users to imagine, plan, and explore the world in a truly authentic and immersive fashion.Key Roles:-Lead management team in strategic planning to identify and development of financial and strategic matrices. -Building scale-able robust business models and Initiating growth hacking models to build brand and    lead company to sustained organic growth with a strong market positioning. -Proactively communicate with board of directors and management teams. -Collaboratively build and sustain long term working relationships with financial partners (high net worth investors, angel investors, strategic investors and venture capital firms) raising capital, M&A and transition strategy."
            ],
            [
                "CEO",
                "Company Name",
                "American Bionutritional Care, LLC",
                "Dates Employed",
                "Aug 2015 – Feb 2016",
                "Employment Duration",
                "7 mos",
                "Location",
                "Tucson, Arizona Area",
                "Strategically lead the team focused on delivering high quality, all natural products to build the quintessential nutraceutical beverage. By leveraging the latest scientific research and technology, our team has worked to develop an innovative line specific blend of naturally occurring nutrients found to deliver powerful metabolic health benefits beverages designed to positively influence through enhanced naturally needed vitamins and minerals missing from normal diets and fortified with natural ingredients to functionally enhance and support consumer’s health. Acquired February 2016."
            ],
            [
                "CFO",
                "Company Name",
                "Mouser & Schmillen, PLLC",
                "Dates Employed",
                "2009 – 2014",
                "Employment Duration",
                "5 yrs",
                "Responsibilities include Management and guidance of all financial aspects while coordinating the restructuring of a sole practitioner family and employment law firm into a larger multiple partner family, business and employment firm.  Growth modeling also included work on private contracts which gave me the unique opportunity to learn about the legal challenges facing entrepreneurs during growth planning and implementation phases.     Key Roles:•Provide day-to-day leadership and management to Board based on the mission and core        values of the company. •Design and Facilitate business strategies, analyze and improve financial metrics in order to achieve company revenue and profitability. Provide financial budgeting, forecasting and other analyses to arm management and Board with information on which to base strategic decisions.•Lead in the analysis and development of revenue, brand and growth opportunities.  •Maintain knowledge of industry trends, legislation and regulatory standards applicable to Business and Legal industry. Interface and manage staff. Perform risk management procedures and lead company policy."
            ],
            [
                "Education"
            ],
            [
                "Education"
            ],
            [
                "University of Phoenix",
                "Degree Name",
                "Master of Business Administration (M.B.A.)",
                "Field Of Study",
                "Masters of Business Administration",
                "Dates attended or expected graduation",
                "2005 – 2006"
            ],
            [
                "University of Phoenix",
                "Degree Name",
                "Master of Business Administration (M.B.A.)",
                "Field Of Study",
                "Masters of Business Administration",
                "Dates attended or expected graduation",
                "2005 – 2006"
            ],
            [
                "University of Phoenix",
                "Degree Name",
                "Certificate in Alternative Dispute Resolution",
                "Dates attended or expected graduation",
                "2006 – 2006"
            ],
            [
                "University of Phoenix",
                "Degree Name",
                "Certificate in Alternative Dispute Resolution",
                "Dates attended or expected graduation",
                "2006 – 2006"
            ],
            [
                "Northern Arizona University",
                "Degree Name",
                "Bachelor’s Degree",
                "Field Of Study",
                "Accounting and Finance",
                "Dates attended or expected graduation",
                "1990 – 1994"
            ],
            [
                "Northern Arizona University",
                "Degree Name",
                "Bachelor’s Degree",
                "Field Of Study",
                "Accounting and Finance",
                "Dates attended or expected graduation",
                "1990 – 1994"
            ],
            [
                "Featured Skills & Endorsements"
            ],
            [
                "See 33 more skills"
            ],
            "Recommendations",
            [
                "Angels Den",
                "1,431 members"
            ],
            [
                "OurCrowd",
                "5,240 followers"
            ],
            [
                "TechCrunch",
                "1,874,290 followers"
            ],
            [
                "Steve TappinSteve Tappin is a LinkedIn Influencer",
                "CEO Xinfu, CEO Coach & BBC CEO Guru",
                "788,343 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "12,965,358 followers"
            ],
            [
                "Govig & Associates",
                "12,774 followers"
            ],
            [
                "See all",
                "See all following"
            ],
            [
                "Contact and Personal Info"
            ],
            "People Also Viewed"
        ],
        "interests": [
            [
                "Angels Den",
                "1,431 members"
            ],
            [
                "Angels Den",
                "1,431 members"
            ],
            [
                "OurCrowd",
                "5,240 followers"
            ],
            [
                "OurCrowd",
                "5,240 followers"
            ],
            [
                "TechCrunch",
                "1,874,290 followers"
            ],
            [
                "TechCrunch",
                "1,874,290 followers"
            ],
            [
                "Steve TappinSteve Tappin is a LinkedIn Influencer",
                "CEO Xinfu, CEO Coach & BBC CEO Guru",
                "788,343 followers"
            ],
            [
                "Steve TappinSteve Tappin is a LinkedIn Influencer",
                "CEO Xinfu, CEO Coach & BBC CEO Guru",
                "788,343 followers"
            ],
            [
                "Steve Tappin is a LinkedIn Influencer"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "12,965,358 followers"
            ],
            [
                "Richard BransonRichard Branson is a LinkedIn Influencer",
                "Founder at Virgin Group",
                "12,965,358 followers"
            ],
            [
                "Richard Branson is a LinkedIn Influencer"
            ],
            [
                "Govig & Associates",
                "12,774 followers"
            ],
            [
                "Govig & Associates",
                "12,774 followers"
            ]
        ],
        "recommendations": [],
        "skills": [
            [
                "Executive Management",
                "See 14 endorsements for Executive Management",
                "14",
                "Executive Management",
                "Endorse",
                "Endorsed by Vincent Serpico (mutual connection)"
            ],
            [
                "Executive Management",
                "See 14 endorsements for Executive Management",
                "14"
            ],
            [
                "Venture Capital",
                "See 16 endorsements for Venture Capital",
                "16",
                "Venture Capital",
                "Endorse",
                "Endorsed by Vincent Serpico (mutual connection)"
            ],
            [
                "Venture Capital",
                "See 16 endorsements for Venture Capital",
                "16"
            ],
            [
                "Start-ups",
                "See 41 endorsements for Start-ups",
                "41",
                "Start-ups",
                "Endorse",
                "Endorsed by Mr. Louis David Spagnuolo and 3 others who are highly skilled at this",
                "Endorsed by Vincent Serpico and 1 other mutual connection"
            ],
            [
                "Start-ups",
                "See 41 endorsements for Start-ups",
                "41"
            ]
        ],
        "summary": "    Accomplished start-up leader, hands-on Investment focused CEO/COO/CFO and entrepreneur who has successfully developed and implemented corporate strategy from a business and financial perspective, trusted business partner and advisor to CEO’s and entrepreneurs. Seasoned at working in rapidly growing start-ups, specializes in early growth stage strategy, positioning, revenue model development & new business development in companies. Innovative business strategist gifted at cultivating strategic alliances, developing multiple revenue streams within cutting edge technology environments and successfully executed corporate transactions including M&A (buy-side and sell-side), capital raises and restructuring.Proven revenue generator, recognized for the ability to inspire, engage and collaborate with executives and peers; leverage resources, direct reports, and building world class sales organizations. Driven negotiator known for exceeding sales, margin and cost targets. Specialties: Strategic positioning & Financial Analysis: Business planning based on strong financial matrices, developing agendas for scalable explosive growth, strategic alliances geared to utilize cross-platform opportunities, optimizing monetization & strategic synergy. Creative & innovative visionary, proven industry analyst, talented at evaluating new markets, business opportunities and cutting-edge technologies with goal to assist companies who are currently performing below their potential to overcome challenges and increase their growth and revenue. Through an infusion of expertise, management and capital directed towards assisting companies with the introduction and commercialization of their technologies to their relevant market and turning existing companies around.\n  \n  \n",
        "name": "David Soto",
        "title": "Shift. Creative",
        "url": "linkedin.com/in/davidsoto1",
        "phone": "",
        "email": "dsoto.asturia@gmail.com"
    }
]