{
    "thread": "https://www.facebook.com/messages/archived/t/100007921562720",
    "participants": [
        {
            "name": "C.M. Dabbah",
            "description": "Followed by 113 people",
            "url": "https://www.facebook.com/profile.php?id=100007921562720"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2016-10-09T01:24:00.000Z",
            "message": "Brian\nWOw you have a lot of insight.  OMG\nI love your icon!\nHoly crap, you just took that away!  Nice job.  You are leveling up like me.\nSo many people post things hoping for a personal conversation.  You did it. \nI guess the most important thing I can ask a fellow genius is, what is your ambition?\n"
        },
        {
            "from": "C.M.",
            "time": "2016-10-09T01:24:00.000Z",
            "message": "\nTheists make me sick with their primitive worship. It's barbaric and it's holding us back as a species. I want to take away all control they have over society.\nIn the end game I want no religion at all. I don't want to force it on them. I want them to realize how stupid it is and walk away from it. It won't happen in my lifetime.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T01:24:00.000Z",
            "message": "Brian\nI agree completely. I am a theist and an atheist.\n"
        },
        {
            "from": "C.M.",
            "time": "2016-10-09T01:24:00.000Z",
            "message": "\nSorry you can't be both, that's an oxymoron.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T01:24:00.000Z",
            "message": "Brian\nIt Will happen in your Life and it starts Now.\n"
        },
        {
            "from": "C.M.",
            "time": "2016-10-09T01:24:00.000Z",
            "message": "\nNo it require a paradigm shift in the culture mores of this country and many others. That happens generationally not overnight. The alternative is genocidal behavior based on religion which I find unacceptable.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T04:09:00.000Z",
            "message": "Brian\nI agree completely! It already happened though. The scales have been tipped Now it's just s matter of time.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-27T21:48:00.000Z",
            "message": "Brian\nNot sure what you are going for \n\n"
        }
    ]
}