{
    "thread": "https://www.facebook.com/messages/archived/t/100000462188807",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "",
            "time": "2016-10-08T11:00:00.000Z",
            "message": "\nOn a scale from 1-10, how satisfying is it to troll the geniuses in that horrible Atheism group?\n"
        },
        {
            "from": "",
            "time": "2016-10-08T21:37:00.000Z",
            "message": "You accepted their request."
        },
        {
            "from": "Brian",
            "time": "2016-10-08T21:37:00.000Z",
            "message": "Brian\nI need your brains! 10  you are so smart. Good idea.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T21:37:00.000Z",
            "message": "Brian\nAre you having a good day?\n"
        },
        {
            "from": "",
            "time": "2016-10-09T20:31:00.000Z",
            "message": "\nvery busy days mostly\nI figured trolling them must be fun, I unfortunatly tend to fall into that in most groups I join.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T00:15:00.000Z",
            "message": "Brian\nHa!  Not trying to convert anyone, I just wanted them to justify their existence.  Weird how atheists can exist without having a purpose, and then when I have presented a purpose to them, suddenly they are willing to argue about why they believe what they believe.  It's kind of like, if God didn't matter at all, what is the point of talking about it?\n"
        },
        {
            "from": "",
            "time": "2016-10-10T00:15:00.000Z",
            "message": "\nI found the history question quite entertaining, the sarcasm was pretty clear, but it's a messed up group full of morons.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T02:49:00.000Z",
            "message": "Brian\nA lot of them become not mean as soon as I start a personal conversation.  Lots of very intelligent people.  Most of them are even better studied on religion than I am.  I also learned some physics, that was cool.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T17:41:00.000Z",
            "message": "Brian\nI am trying to decide between \"Do you believe life has a purpose?\" and \"Why does religion still exists?\"\n"
        },
        {
            "from": "",
            "time": "2016-10-13T13:09:00.000Z",
            "message": "\nI studied mostly mythologies and started as a young child, which made me an atheist at around age 10 I suppose. I saw that most stories are altered legends from other mythologies and simply found that weird.  And no, even today I don't have other hobbies...\nThe purpose of life seems more interesting I think.\nI sat through ten hours of prayer in the synagogue yesterday I really need human interaction lol.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T13:10:00.000Z",
            "message": "\nThe purpose of life seems more interesting I think.\nI sat through ten hours of prayer in the synagogue yesterday I really need human interaction lol.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI would love to help!\nSorry I took so long to reply.\nI too have been meditating deeply on this, but I don't know if there is enough time.\nI think we are on the exact same page.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nMeditating about the topic \"purpose of life\"?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nYes.  I love where your head is at right now.\nWhat do you think the purpose is?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nLet's start with something about yourself, you said you were interested in conversations in an atheist group, so you are religious?\nI think that will be a pretty short answer: There's no purpose.\nWhy does there have to be a purpose\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI identify as a Christian seeking answers.  But I've begun making relations to all forms of religion and now I can't seem to find any differences.  Just different ways of explaining it.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nWhat kind of christian, there are many groups.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI was raised Catholic, but because of my parents and lack of trust, I never felt at home in the church.  I went to Impact Church, it is non-denominational but I believe it has some backing in Baptist.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nI too was raised catholic so we have something in common there.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nSo how do you feel about it now?  I feel lied to.\nBut not because I don't believe it, because I believe in this concept called \"Lying by omission\"\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nMy grandparents didn't \"lie\" to me, lying would implify they keep the truth from me and decide to tell me something they now is wrong.\nThey simply raised me according to their core beliefs which was catholic.\nReligion in general is a lie  but we'll come to that later...\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI agree.  We have to come full circle.  I think it is a lie because it is a miscommunication.  It is incomplete and impersonal and people see church as a stage.\nYour picture is very beautiful, I am glad we had this conversation.  I am married, so I am not after anything except understanding, just had a break.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nMany catholics think the catholic church has the monopoly on \"Christianity\" in general, they think it's the only christian way.\nAnd I am always seeking for compliments, so thank you.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nHa!  I've been playing this game where I ask my friends to compliment 1 person at a time.  Not quite sure if it is productive yet though.  Facebook is noisey, I would rather people focus on what is important to them instead of the noise.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nIs this your troll profile?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nThis is my only profile.\nWhat is trolly?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nOh, facebook is extremely noisy indeed\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI get called that sometimes, and I am trying to be really positive.  Are trolls positive?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nI was simply wondering, I see your name which might not be your true name given you have \"Megamind\" there as well. Moreover you seem to have only one profile picture and no feed or images whatsoever.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI think we've come full circle.  The problem with the church is trust.  Same problem with talking to strangers.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nTrolling is entertaining to do, it is not entertaining to experience. I trolled many groups and flew out, it was always glorious. Friend of mine was banned for cursing after says \"What'ya gonna do about me, bitch\"  The most glorioust banning of a person I've ever witnessed\nIndeed, trust is a big issue. How would I know who the other person is? What is a lie and what isn't.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nHahha.. Then I think I can help.  Have you heard the phrase \"kill them with kindness\"?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nAlso, to address your feed.  That is interesting you bring up the feed.  I didn't use Facebook for almost a year.  Not the internet is acting really strange to me.  I didn't change my timeline at all, but I did add Quasi-dimensional being just to be funny.  I believe I exist, but there is no sure way to prove it to others over the internet.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nI'm not much for kindness, I enjoy insulting people and let them run against walls as I know more about certain topics and simply watch them go aggressive until I'm blocked.\nI see, I see...\n\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nHaha, that is pretty trolly.  Maybe just people who act like they are the smartest are the trolls themselves?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nPerhaps\nI got kicked out of many groups because I told people to \"man the fuck up\" as they opinions were called out as not being universal. I don't miss those groups. However this atheism group is seriously a smashed together pile of strange people\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI think the difference between being smart and being a troll is kindness.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nAlmost nobody in there cares about good conversation\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI care!\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\n^^ We will never know\nGreat, so do I\nMostly in this group you will meet antisemitic people though\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nMy entire life has been training me for good conversation.  You don't seem like a troll to me \n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nPeople are hating on Israel all the time, that's all they really care for, I enjoy the offensive memes, but more you can't really hope for\nAh, because I'm not up to trolling you\nyet \n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nI would like to ask you about your core beliefs though before we talk about the purpose of life if that is alright with you, I would like to know what you believe in in general so I know where you're coming from as I read you opinion.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nOk sure.\nI don't agree with the hate on Israel and I think it's controlled by greed.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nI simply know too much about Israel and am too involved with Judaism to simply accept ignorance. Yet the people in the group are not really up to intellectual conversations. They simply want to force their subjective mind upon others without reconsidering any of their knowledge.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI appreciate that, I don't know much about it.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nMy boyfriend is Israeli plus I am part of a Jewish community. I however am atheist and therefor never converted\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI have some friends that are Israeli and they invited me to new years party.  I felt really welcome and at peace with them.  Really intelligent people.\nWhat do you think is the biggest cause of violence in the middle east?  I think it is that same understanding and we get it but they don't.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nRosh Hashana? Man that service is three hours long, did you visit for that too or just the party?\nI need to say the main cause is Islam, first of all that most muslim countries have been destabilized by the US but also they took one giant step in the direction of extremism\nThe western people believe it's all Israel's fault because Israel has, despite extreme sanctions, a great economy plus extreme military, they won every war the other nations started around them. Everybody thinks Israel is backed by somebody, but they are not.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nThey had it at their house so it wasn't that bad.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nThen it was just the party  Rosh Hashana service lasts for at least three hours\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nYeah probably.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nI think the US and Israel has very similar armies.  That is a problem because a lot of people disagree with us.  My friend use to be really \"savage\".  He would say things like \"It's ok to break up a Christian marriage, but not a Jewish marriage\"  We made a really good influence on him to be more compassionate.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nLol that friend sounds like a nice guy\nThe Israeli military is insanely strong, every person of every gender has to be part for at least three years, not going is considered a crime and you have to go to jail. UNLESS you're ultra orthodox because Bibi needs their votes to remain in power.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nRight?  What a dick.  But last time I saw him, I noticed a really honorable change in him.  Now he wants to follow us around the country when I get my new job.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nThat sounds about better\nSo he's Jewish?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nYes.  Very.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nVery? \nWhat do you mean by that\nChassidic?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "Brian\nNot quite, just in his beliefs.  Very aggressive.  But like I said, I noticed a really positive change.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T18:17:00.000Z",
            "message": "\nLol that's interesting...\nWe wanted to talk about the purpose of life didn't we\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T19:49:00.000Z",
            "message": "Brian\nOh yeah.  There is no purpose other than to prove there is a purpose.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T19:49:00.000Z",
            "message": "\nWhy does there have to be a purpose though\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T19:49:00.000Z",
            "message": "Brian\nnot sure people who fight think there is\n"
        },
        {
            "from": "",
            "time": "2016-10-13T19:49:00.000Z",
            "message": "\nWell what do you think\nyou said the purpose is to prove there is one\nbut that would implify there already is one\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nwell put.  what is the purpose of life?  I don't know.\nLove?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nI'm still wondering\nWhy does there have to be a purpose at all\nWhy does there need to be reason behind it\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nI guess if Love is the reason, then it is the greatest reason.  I've started talking to the people I love in order and asking about their goals, and I believe I've transcended, kind of like astral-projection.  If you spread the love, it comes back to you.  \n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nWell love is pretty nice, perhaps for us humans the best there is, but that doesn't make it a reason\nJust think of the entire universe and everything, why would love be a reason for all of that\nMoreover\nWhat is life?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nLove\nMaybe aliens are harvesting love emotions from us?\nMaybe we are a baby species inside an aliens stomach?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nThat makes no sense whatsoever\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nLife is created through love. when two people come together.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nNew life is created by meiosis or mitosis\nHumans feel love (sometimes) when they indulge in sexual activities which might result in children, not all animals do so and most are not even capable of feeling a lot beside hunger\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nHmm, interesting point about animals, maybe they are natures robots?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nI will come back to that question of...\nwhat is life\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nok\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nHumans are alive, I suppose we agree on that one\nSo are animals\nPlants\nWhat about bacteria\nthey reproduce through mitosis, I suppose you know the difference between mitosis and meiosis?4\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nI do now.\nI think life is a perfect balance of quantum improbability.\nWe're getting close to creating it in a lab though.\nCan a lab created life have a soul?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\ngreat you know the difference now! I'll wait with an answer to that because there's more to the question what is life\nso we agree than animals (including humans) are alive, like plants or bacteria...\nwhat about viruses\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nI think we make viruses living.  I struggled to understand that for a while.  Maybe life is DNA + RNA?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nRNA is a copy of DNA, created in order to send information\nWhy would WE make viruses living? How are they alive though, they don't have metabolism\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nI don't know.  They virus carries throughout the species, it mutates which means it has a history.  Maybe history is was makes life possible?\nThe population is the metabolism.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nThe thing is biology does not recognise viruses as alive since they show no sign of life or intelligence, viruses have no metabolism and adapt to some sort of programming, but they cannot \"think\" outside of taht\n*that\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nSo why do they mutate?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nIt's really interesting, I'm talking about it with a friend who studies medicine recently, technically they change according to their \"program\" they can't learn though\nhowever though this discussion, what is life and what truly makes something alive, goes really really deep\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nyeah this is very complex just to become very simple\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nWell the end of the discussion is\nwhat makes us alive\nsome chemical reactions are what it is in the end\nWe are technically made of stardust, up to 90% of our body is if not more. We have parts that have different DNA because it's not us but technically a \"dead\" bacteria that is now integrated in us.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nTechnically we are robots is the short end of this biological topic and it goes further as to there are only two options physically speaking: Either everything is alive or nothing. If you break it up, your body, down to the smallest piece, you understand you're made of dead matter.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nLife is technically an illusion of complex chemistry \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nholy shit you're a genius.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "\nI'm not, I read a lot about it\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T21:20:00.000Z",
            "message": "Brian\nI can tell you are.  I think probably 90% of people are geniuses that just haven't realized it yet.  I can tell by your jumps in reason, you programmed me to think of life this way before explaining it.\nSo what if the purpose of life is to prove we aren't dead inside?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "\nI consider myself quite intelligent so thank you for inflating my ego\nI'll state more ideas of the question what is alive\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "Brian\nwe are all made up of dead matter.  Our entire foundation of DNA, so life starts with death?\n"
        },
        {
            "from": "",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "\nThink of something bigger like\na planet\na sun\na galaxy\nDid you know that the universe looks like a brain cell?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "Brian\nI can imagine that yes.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "\nLet't think of a sun I think that makes most sense plus I'm tired and will go to bed soon\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "Brian\nI think I believe in reincarnation now, this gives me chills. https://en.wikipedia.org/wiki/Autonomous_sensory_meridian_response\nAutonomous sensory meridian response - Wikipedia, the free encyclopedia\nAutonomous sensory meridian response (ASMR) is a euphoric experience characterized by a static-like or tingling sensation on the skin that typically begins on the scalp and moves down the back of the neck and upper spine, precipitating relaxation.\nen.wikipedia.org\nASMR could be an emotional connection.\nAssuming emotions matter, giving someone ASMR makes a connection to what is going on in your brain.\nI looked up people who died on the same day as I was born today and I see similarities in cause and passion.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "\nI saved the link and I'll look through it toomrrow\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "Brian\nGood night!  Thank you for the connection!\n"
        },
        {
            "from": "",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "\nBefore I leave though\nI wanted to say (leaving aside the physical theory behind all of this because it would take too long to talk about it) suns are technically \"born\" from the nebulas\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "Brian\nThank you for your help on this \n"
        },
        {
            "from": "",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "\nThey burn and burn up everything they find (hydrogen etc.) until their core is iron\nThey burn and burn and transform energy until their core and they themselves are so heavy and pure iron they don't have anything else to burn\nso they grow\nbigger and bigger, eating all the planets and dusty bits around them until they grow cold. They get smaller again, fighting to stay burning, but then go out\nThey might implode or become a cold star simply, they might form a black hole due to their mass or start emitting a strange magnetic field\nso how are they dead as they change and try to stay burning and how are they alive as they are merely a ball of burning gas\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "Brian\nI have to think on this and get back to you.\n"
        },
        {
            "from": "",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "\nDo that! The discussion of what is life and makes might be the sense behind it suddenly turns pointless, like life itself, when you realize it might not even exist.\nIt might be an illusion of a chemical very complex process, asking itself why it works as it does.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "Brian\nhttps://en.wikipedia.org/wiki/Simulated_reality\nSimulated reality - Wikipedia, the free encyclopedia\nSimulated reality is the hypothesis that reality could be simulated—for example by computer simulation—to a degree indistinguishable from \"true\" reality. It could contain conscious minds which may or may not be fully aware that they are living inside a simulation. This is quite different from the cu...\nen.wikipedia.org\nElon Musk gets it\n"
        },
        {
            "from": "",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "\nI want you to also take into consideration the following: The dimensions we live on or in plus the fact that everything is working according to relativity. There is not even something you call \"reality\" so how could there be something called \"life\" if nothing is real while everything is at the same time?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T22:29:00.000Z",
            "message": "Brian\nhttps://en.wikipedia.org/wiki/Flatland\nFlatland - Wikipedia\nFlatland: A Romance of Many Dimensions is a satirical novella by the English schoolmaster Edwin Abbott Abbott, first published in 1884 by Seeley & Co. of London.\nen.wikipedia.org\nMy icon.\nLove transcends\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-14T17:13:00.000Z",
            "message": "Brian\nI've thought a lot about what you said on viruses.  I think the closer we get to creating life in a lab, we realize that technology leads to life, and life leads to technology, it's just a matter of time.  So my question is, where does this all begin and is it too late for humanity to survive the test of time?\n"
        },
        {
            "from": "",
            "time": "2016-10-15T10:23:00.000Z",
            "message": "\nAh, you are back\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T15:33:00.000Z",
            "message": "Brian\nAny ideas? \n"
        },
        {
            "from": "",
            "time": "2016-10-15T15:33:00.000Z",
            "message": "\nWere you reported and blocked for some time?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T15:33:00.000Z",
            "message": "Brian\nHow did you know?\n"
        },
        {
            "from": "",
            "time": "2016-10-15T15:33:00.000Z",
            "message": "\nI am god\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T15:35:00.000Z",
            "message": "Brian\nI miss you.  \n"
        },
        {
            "from": "",
            "time": "2016-10-15T15:35:00.000Z",
            "message": "\nAw\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T15:35:00.000Z",
            "message": "Brian\nWho do you miss?\n"
        },
        {
            "from": "",
            "time": "2016-10-15T15:35:00.000Z",
            "message": "\nI don't know\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T15:35:00.000Z",
            "message": "Brian\nFinally I asked you something you don't know \n"
        },
        {
            "from": "",
            "time": "2016-10-15T15:35:00.000Z",
            "message": "\nYou had to disappear and meditate to find something, eh\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T17:03:00.000Z",
            "message": "Brian\nSomething awakened in me.  Facebook is still a waste of time.  I only care about the people who use it.\n"
        },
        {
            "from": "",
            "time": "2016-10-15T19:30:00.000Z",
            "message": "\nFacebook is pretty much a pain only\nUseful though for communication sometimes\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T19:30:00.000Z",
            "message": "Brian\nI agree.  I think I found some new information that explains how I am feeling.  I've heard references to all of these concepts before.  Would you like to study?\n"
        },
        {
            "from": "",
            "time": "2016-10-15T19:30:00.000Z",
            "message": "\nUnfortunately too tired right now\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T19:30:00.000Z",
            "message": "Brian\nOk.  Rest well, it's been a pleasure. \nI have references when you are ready.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-25T00:46:00.000Z",
            "message": "Brian\nHow is life?\n"
        },
        {
            "from": "",
            "time": "2016-11-08T16:26:00.000Z",
            "message": "\nah man\nlife was shit\nhad to go to the hospital\ncouldn't reply earlier, I was very busy\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-09T01:56:00.000Z",
            "message": "Brian\nAww I'm sorry, I hope you are feeling better.\n"
        },
        {
            "from": "",
            "time": "2016-11-09T09:05:00.000Z",
            "message": "\nyeah little bit\n\n"
        }
    ]
}