{
    "thread": "https://www.facebook.com/messages/archived/t/1106388459412205",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Facebook User",
            "time": "2009-08-20T22:05:00.000Z",
            "message": "\nFacebook User\nHey all,\n\nWith the science party only a week away I'd like to tell everyone chemicals are in route.  Leah and myself have ordered about $100 of chemicals and lab-ware apiece!  So let's see a little initiative from everyone else!  We still need a lot of alcohol and snacks, and any help that you can provide in purchasing materials such as lab coats and goggles would be greatly appreciated.\n\nLast night we started preparing the first experiment, Thermite.  The iron from steel wool is oxidized by bleach then the remaining toxic liquid is evaporated, and all that is left is black rust!  You will have to look up the rest of the ingredients yourself.\n\nPlease contact either Leah or I to help fund or help prepare experiments.  We would also like to prepare drinks ahead of time before the party so the sooner we get alcohol the better.  And please post comments and suggestions on the wall!\n\nHope to see everyone there!\nBrian\n"
        },
        {
            "from": "Facebook User",
            "time": "2009-08-28T08:01:00.000Z",
            "message": "\nFacebook User\nWould anyone be willing to go pick up our DJ Micheal Brooks in Prescott?\n"
        },
        {
            "from": "Facebook User",
            "time": "2009-08-30T05:41:00.000Z",
            "message": "\nFacebook User\nOur DJ Michael Brooks left some stuff outside because he recently moved.  Amongst these items was a cross bow.  This has been stolen and he would like to get it back.  If anyone can provide information we are offering a cash reward.  Please call my cell, 614-425-6054.\n\n"
        }
    ]
}