{
    "thread": "https://www.facebook.com/messages/archived/t/1137212642988109",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Facebook User",
            "time": "2011-06-22T04:14:00.000Z",
            "message": "\nFacebook User\nHi there,\nAfter some discussion, it has been decided that we are leaving early Saturday morning. This is NOT like the Blue Ridge camping trip, where we left at 12, because we will need to be backpacking for a significant portion of the day, and I would hate to be rushed, and some people would not like to backpack at night. \nThat being said, Fossil Creek is 2 hr, 37 min away according to Mapquest: http://www.mapquest.com/#f972fba623ccfca1423a584c\n(I do not believe in Google Maps anymore based off of the Blue Ridge experience.)\nBased on the time frame I would like to leave at 8am, no later than 9am on Saturday. Any earlier would be great too.\nI know that the preceding night is a Friday, but try to get some sleep, as you will be thanking yourself later.\n-Teresa\n"
        },
        {
            "from": "Facebook User",
            "time": "2011-06-23T13:20:00.000Z",
            "message": "\nFacebook User\nI have better location information: Take Interstate 17 north from Phoenix or south from Flagstaff. Exit State Route 260 heading east to Camp Verde. Turn right on Forest Road 708 (sign says Fossil Creek) less than 10 miles from I-17. The forest road is very winding and also very washboarded but it's passable by standard vehicles if you take it slow.\n\nIt appears to be only an hourish of driving, but is still good to get there early.\nMake sure that you bring a gallon of water per person and food for lunch, dinner, and breakfast (and snacks)\nI also recommend bringing your swimsuit \nSee ya soon \n-Teresa\n"
        },
        {
            "from": "Facebook User",
            "time": "2011-06-24T23:53:00.000Z",
            "message": "\nFacebook User\nAt 8 manana!\n\n"
        }
    ]
}