{
    "thread": "https://www.facebook.com/messages/archived/t/1233697916394",
    "participants": [
        {
            "name": "Blake Cain",
            "description": "Realtor at Russ Lyon Sotheby's International Realty",
            "url": "Studied Marketing Alumni at Northern Arizona University"
        },
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Bridget",
            "time": "2009-10-06T21:12:00.000Z",
            "message": "\nBridget\nAs some of you might know, I am currently a field organizer for a nonprofit called Repower America. We are underneath the umbrella of the Alliance for Climate Protection and the WE Campaign, which are all the focus of Al Gore. Across Arizona, we are diligently working to convince our Senator, John McCain, to be a part of passing the first comprehensive clean energy bill. \n\nOur next phase of the campaign will be hand written letters to Senator McCain, as well as 20-30 second clips of constituents like yourselves explaining why you think comprehensive clean energy legislation is so important and/or why our leaders need to act now. These clips will be placed on a \"wall\" on repoweramerica.org. We've seen that healthcare has taken a front seat in Congress as well as in the media, but we need to express the importance of passing clean energy legislation as well, which will create millions of jobs across the country as well as break our dependence on foreign oil. \n\nSo this is where you come in: I need you to write a hand written letter and/or let me film a short clip of you. I really, really need your support right now. If you can do either of these things, you will not only be helping me out, but you will be a part of passing the first comprehensive clean energy legislation ever! If you need talking points for your letter OR the video clip, I am more than willing to get these to you! I do want these clips to be as organic, truthful and original as possible, however. \n\nPlease write me a message or call me if you can do this by next Friday, October 16th. I'm more than willing to meet for coffee, meet you between a class or after work. Or, if you are a part of a larger organization and I could give a quick speech at a meeting, that would be great as well. Let me know!  can't stress enough how much I need your support right now! Thank you in advance!\n\nBridge\n\n"
        },
        {
            "from": "Erika",
            "time": "2009-10-06T22:49:00.000Z",
            "message": "\nErika\nI wanna help!  Email me some talking points and I'll do a short video clip on my mac.\n\n"
        }
    ]
}