{
    "thread": "https://www.facebook.com/messages/archived/t/1300271885426",
    "participants": [
        {
            "name": "Andrew Madden",
            "description": "Studied at Northern Arizona University",
            "url": "From Tucson, Arizona"
        },
        {
            "name": "Ashley Garst",
            "description": "Special Event Coordinator at City of Northglenn Government",
            "url": "Former Events Coordinator at Arvada Chamber of Commerce"
        }
    ],
    "messages": [
        {
            "from": "Ashley",
            "time": "2010-09-29T18:27:00.000Z",
            "message": "\nAshley\nHello everyone. So Sam's birthday is today. The plan is to do dinner at Flagbrew at 6:45. After dinner everyone is welcome to come back to our place for drinking, video gaming, birthday party action. If you would like to bring something any drink stuff, be it hard alcohol, mixers or beer would be wonderful. Cards about be old are very encouraged. If you have a video game console other than an x-box or games that are good to play with multiple people (Andrew I know sam would be into smash bros. If it's not a huge bother) that would be appreciated. If you don't drink much please still come. If you drink a lot please help stock the bar. If you can't make dinner and just want to come to the house plan on us being home by 8:30ish. If you need directions message me back or call me at 303-868-2889.\n"
        },
        {
            "from": "Chelsea",
            "time": "2010-09-29T18:27:00.000Z",
            "message": "\nChelsea\nI offer up a Wii, as long as someone has an extra controller and games for it.. Sooo pretty much useless. That, and the only good PS3 multiplayer I have is Modern Warfare 2.\n\n"
        },
        {
            "from": "Ashley",
            "time": "2010-09-30T00:42:00.000Z",
            "message": "\nAshley\nDinner will be at big foot instead.  If you see this spread the word.\n"
        },
        {
            "from": "Stan",
            "time": "2010-09-30T00:42:00.000Z",
            "message": "\nStan\nwhere is big foot and how expensive\n"
        },
        {
            "from": "Andrew",
            "time": "2010-09-30T00:42:00.000Z",
            "message": "\nAndrew\nget a job and get a job.\n"
        },
        {
            "from": "Stan",
            "time": "2010-09-30T00:42:00.000Z",
            "message": "\nStan\nwait im confused on the later of those two stements.....umm which one is punk rock!\n\n"
        },
        {
            "from": "Andrew",
            "time": "2010-09-30T00:42:00.000Z",
            "message": "\nAndrew\n*latter; *statements, its just below black hound gallery, which is right around the corner (north) of the Orpheum. I'll be in the smc in twenty minutes about.\n\n"
        },
        {
            "from": "Ashley",
            "time": "2010-09-30T00:42:00.000Z",
            "message": "\nAshley\nYay yes. Thank you andrew. It's no more expensive than flagbrew.\n\n"
        }
    ]
}