{
    "thread": "https://www.facebook.com/messages/archived/t/1380739128999",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        },
        {
            "name": "David Earl Smith",
            "description": "Lives in Flagstaff, Arizona",
            "url": "From Peoria, Arizona"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2010-03-25T17:50:00.000Z",
            "message": "Brian\nHey guys,\n\nThere are a couple of awesome things I have planned for this weekend and I hope everyone can participate.  I have only included a few people in this message so everyone that isn't included that is fun to have around needs to be notified.\n\nFriday:\n*I would like to use the stuff we got in Mexico (this may need to be clarified on another medium \n*Also, I am going to go pick up Micheal Brooks because he is alone in Prescott, and he and I have much coding to do (I hope David will also join us in exploring some cool APIs and showing off my new sites API).\n\nSaturday:\n*This is when Mike and I will be coding, so not much going on during the day as far as partying goes.  I also have some school work to do, so it will probably be a day of sitting around on computers.\n*If anyone would like to join us in being productive, then we can help each other stay on task!  Just let me know.\n*But we would be open to suggestions for the evenings activities.\n\nSunday:\n*This is the big one.  Jessie's Recital is at Ashurst at 5:30 PM, I hope everyone can attend, as it would make her incredibly happy.\n*Her parents are coming in to town and because her mother is crazy, I thought it might be nice to have them over for dinner at my place and they can meet all the wonderful friends she's made.\n*I have decided this would be the perfect time to use up the tortillas and throw a Mexican dinner and reminiscence party.  So please bring your full quality pictures for me to archive \n*I would like to pull in some other people who missed out on the trip because of other plans, and we can here about their spring break!\n\nPlease notify everyone else you can think of, and I will also be posting Sunday plans on the recent event wall.  For the dinner party Sunday, I will need lots of snacks and drinks.  If you can still afford it, please bring chips and soda and anything else you think would fit in with the Mexican dinner.\n\nOther people who particularly expressed interest in plans this weekend:\nDonnely West\nJoe Flieger\n"
        },
        {
            "from": "Michael",
            "time": "2010-03-25T17:50:00.000Z",
            "message": "\nMichael\nSounds awesome!\n"
        },
        {
            "from": "Jessica",
            "time": "2010-03-25T21:00:00.000Z",
            "message": "\nJessica\nThe use of Mexico stuff is limited to Friday night for me, since my grandparents are coming into town on Saturday. My dad says that he will check with my mom and grandparents about Sunday, which potentially means grandparental participation as well. I'm not ecstatic about this, but as Brian says my mom is crazy and I would appreciate help protecting myself and Brian from her. If nothing else, she'll be on her best behavior where there are witnesses.\n"
        },
        {
            "from": "Michael",
            "time": "2010-03-25T21:00:00.000Z",
            "message": "\nMichael\nI'll do what I can.\n\n"
        },
        {
            "from": "Jessica",
            "time": "2010-03-26T05:32:00.000Z",
            "message": "\nJessica\nHah hah, thanks. Especially since I don't dare touch a drop of alcohol if she's within a mile of me. To put people at ease, though, I have heard from several friends that while she is obviously crazy, she's a cool person to know and not have as a relative.\n\n"
        }
    ]
}