{
    "thread": "https://www.facebook.com/messages/archived/t/13936436",
    "participants": [
        {
            "name": "Mike Ferrari",
            "description": "",
            "url": "https://www.facebook.com/profile.php?id=13936436"
        }
    ],
    "messages": [
        {
            "from": "Mike",
            "time": "2011-03-12T04:18:00.000Z",
            "message": "\nyou brian.  i know you are probably secretly laughing at my computer problems so i have decided to implore your knowledge on the matter.  so i was given a quote of $560 to fix my motherboard on my laptop.  i kinda know what i am doing, so i have found replacement ones for my model at about $230.  so i was thinking of just buying a replacement and fixing it myself.  only thing is, i dont really know how much work i am in for.  ive only ever added drives and things like memory but have yet to replace a motherboard.  safe call for an ametuer or should i let them just fix it?  also, i was thinking of just replacing it all together, but i am slim on cash.  but do you know any decent already built gaming laptops out there for maybe around $1000?  either advice will do.  Help me brian, youre my only hope!\n"
        },
        {
            "from": "Brian",
            "time": "2011-03-12T18:09:00.000Z",
            "message": "Brian\nMotherboard are pretty difficult to replace, but I could do it. The problem with me doing it is if something goes wrong then what??  It is a lot of work that's why they charge so much for it. I haven't shopped around for a laptop yet, but I would probably look for something more than what you get for $1000.\n"
        },
        {
            "from": "Mike",
            "time": "2011-03-15T20:10:00.000Z",
            "message": "\nlike i said,  im not really looking for high end, but my cousin works for Dell and can get me close to 20% off so it will cost me around 1k.  let me know what you think about the m15x.  it looks alright to me.  just going with all basic specs all around.    http://www.dell.com/us/p/alienware-m15x/pd?refid=alienware-m15x&s=dhs\nAttachment Unavailable\nThis attachment may have been removed or the person who shared it may not have permission to share it with you.\n\n"
        }
    ]
}