{
    "thread": "https://www.facebook.com/messages/archived/t/1586339423432",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        },
        {}
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2010-08-22T08:36:00.000Z",
            "message": "Brian\nI want to express myself more reasonably than I was earlier.  So, let us set aside a few things, such as Jessie and I trying to work out our friendship, and set aside me needing people there for me last Sunday, and set aside how upsetting my letter was yesterday morning, and set aside all other assumptions.  And for the following paragraph set aside my selfishness, etc.\n\nMy feelings towards this issue are quite simple, and have been unchanged since high school.  There are some people in this world who believe that hooking up with a friend's ex-girlfriend is perfectly fine, I am not saying there is anything wrong with this view.  Just to give a few examples (implications aside) of people who subscribe to this view include David M, John Meyer, David Smith, and Mike.  There are other people who believe that the pain caused by doing this is not worth losing friends and creating drama.  I talked to Joe and we were able to relate because we both subscribe to the latter view and we have both been in the position where a friend has pursued our ex-girlfriend.\n\nMy confusion towards the matter is seeded in not knowing which view you subscribe to beforehand.  When Jessie and I talked about it, I asked \"Do you plan on hooking up with Mike?\", and Jessie responded, \"No, because he is your best friend.\"  We spent many conversations talking about what a douche David M is, and all the drama surrounding Joe.  I thought that you guys subscribed to the opinion that hooking up with other people in the group was a bad idea.  I was mistaken, and I have since taken that out on all of you.\n\nIt is obvious that I have hurt Jessie a lot, and that is not a good thing for a \"friend\" to do.  I have been very selfish, because I did not consider Mike's feelings towards Jessie at all.  I do not want to impose drama on the wonderful people in this group.  I don't want people to talk shit about me behind my back, the same way we talked about David and Joe.  Right now, I find it hard for people with such opposing views to be friends with each other.  I know we all make mistakes, and I don't want anyone to suffer the consequences of mine.\n\nI need to be alone.\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-22T08:36:00.000Z",
            "message": "Brian\nP.S.  Jessie; when I said I don't want to be around people like you, all I meant was people who are OK with hooking up with ex's of friends, that is all.  I did not mean I don't want to be around \"sluts\", because that is not how I think of you.\n"
        },
        {
            "from": "Jessica",
            "time": "2010-08-22T08:36:00.000Z",
            "message": "\nJessica\nAt the risk of belaboring a point that has already been raised, you do not know which view you subscribe to. Pursuing someone in a relationship is far worse than pursuing someone who is not in a relationship, correct? And I am sure that you did not think to yourself \"I am changing my view now.\" That's not what people do. We find ways to forget, or to rationalize, to say \"That was different,\" and to ignore the pain we cause others. I am trying incredibly hard not to ignore that pain in you. You have been on both sides of the equation now. So you remember that process of justification and, probably, ignoring or rationalizing Steve's pain. Can you empathize, just a little? Since you have been there? I can't quite empathize with you, I can only sympathize.\n\nWhen we talked, I said that nothing would be undertaken lightly. I did not say that I wouldn't do anything. I said I had no plans. I was, in fact, very careful NOT to say that I would never do anything like what happened, just in case. Not that I had plans, like I told you. I just know that I am human, and humans do things that hurt other humans.\nMy point being that your views aren't exactly constant, and neither of mine. And that's how it is to be human.\n\nYes, you have hurt me. And I have hurt you. These things happen. Once again, we are human. I want to stress that point; humans do shitty things sometimes. We don't think, we lash out, we act irrationally and impulsively. It's part of us, for whatever reason.\n\nSo, this brings me to the question, and I want you to think about it and answer it honestly. Either answer is perfectly fine, and I will act in accordance to your wishes.\nDo you need to be alone because that is what you want right now? Or do you say that you need to be alone because you feel sad and isolated and like you cannot be around people without causing problems? In other words, would it help to know that you are loved and cared about very deeply by a great many people?\nBecause I am more than willing to answer your statement with \"no you don't. You need friends,\" if that's what you secretly, deep down, mean. But if you truly need to be alone, then I must be able to respect that. So let me know.\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-22T15:23:00.000Z",
            "message": "Brian\nIf you are referring to when I hooked up with Crystal.  I was not friends with Steve.  It was kind of like when Joe pursued Alicia after she broke up with Jason.  He was someone we barely knew and rarely saw.  I have not been in position where I have hooked up with my best friend's ex-girlfriend after him telling me \"there are plenty of fish in the sea\".  And I did not do so without talking to him about it first.\n\nMy views have not changed, and they are not new.  If I were friends with Steve, or if anyone I knew were friends with Steve, things would have gone differently.  If Crystal wasn't so obviously wanting out of the relationship, if Leah wasn't so encouraging, if Steve had no idea that she was partying with me and planning on hooking up with me, than things would be different.  It still doesn't change what Mike and you did, and I can't have that in my life right now.\n\nYou are right, people make mistakes.  But it doesn't change the pain.  Please do not make assumptions about my relationship experience based on rumors from David M.  You made the assumption that Joe and Alicia were separated, and now all of a sudden David M's actions are OK and not longer ridiculous.  How did you come to understand that part of the story, also from David M?  How can you take his word for the situation over Joe's and mine after all the times we talked about what an asshole he is?  You know what he is like, so if you want to know the full story then ask Steve, or ask me, or ask Alicia what her relationship status is.  He fools around with married women, what makes you think he would apply any other set of morals when it comes to other relationships?  He is not someone I would associate with.\n\nYou are still trying to justify your actions and the pain you have caused, by putting me down, saying that I have done the same thing.  It is not the same at all.  Steve and I are were not good friends, I did not care about his friendship at all, we just started speaking, he never came to any of my parties I invited him to.  So there is another huge difference, if my actions are the same as Mike's, then Mike does not give a shit about me past being an acquaintance; but I do not believe that to be true.\n\nI have only been on one side of the equation, because I know the other end is wrong and hurtful.  When I broke up with my girlfriend in high school and my best friend started dating her, I was torn apart.  But I got through it, just like I will get through this.  However, I am not longer friends with him, partially because of the strain that put on our relationship.\n\nI've since forgiven Eric.  But it was a long time afterward.  We've talked about hanging out recently, but it has never happened.  People change and people grow, an I feel like you changed your mind about dating within the group, based on countless conversations.  Now I need to make a change, and I need to grow up and get a career.  Unfortunately, the opportunities to mend these friendships are becoming slim, but the people who love me the most will be there in the end.\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-22T15:23:00.000Z",
            "message": "Brian\nP.S. I did feel terrible for pursuing Crystal, I felt like Steve deserved to hit me in the face.  I struggled with it for weeks knowing that I had hurt someone so bad.  If I could go back and stop her from coming on to me, I would have handled it completely differently.  I was desperate from being lonely, and I was not thinking clearly.  It was incredibly selfish of me, and I will never do that again.  Maybe this is the point where Mike and you come to that realization.  The pain isn't worth the temporary reward, and if you guys do last, then is my friendship worth showing restraint?  If you guys had thought ahead on how this might hurt me, and given it another week and talked to me about it.  If that were the difference between hurting me and giving me time to accept it, and betraying my friendship, what path would you have chosen?\n\nThe hypothetical isn't really important to me, just something to think about.\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-22T15:23:00.000Z",
            "message": "Brian\nP.S.S. Crystal was also in an incredibly emotional state, not thinking clearly, probably as unstable as you were Sunday night from coming off the drugs.  So, excellent example because I did not care about Steve, he was not my friend.\n"
        },
        {
            "from": "Jessica",
            "time": "2010-08-22T18:35:00.000Z",
            "message": "\nJessica\nI don't want to get into an endless argument about details, but I want to say that you are kind of justifying, too. And in the case of Joe and Aleisha, I think they were broken up because Joe said that he had dumped her. The end. Was Dave his best friend or something? My understanding is that Steve asked you to watch out for Crytsal, and make sure that nothing happened to her. If this is true - and it comes from Dave S, not Dave M, by the by - then you are definitely downplaying your actions. He knew she was partying with you, but trusted you to make sure she didn't act like she did. So here's another scenario. \nIf I hadn't been single for several months... if I hadn't been coming down off of drugs... if I hadn't been extremely emotionally drained anyway because of other influences in my life... if I had been planning on hooking up with someone... If Mike hadn't also been desperate for being lonely, and not thinking clearly, just like you...Then things would have gone differently. Look at your justification scenario. Look at mine. Please don't tell me that you are more justified because you didn't know the guy very well. Because your factors were so much worse than mine in every way except for how well you know Mike. That doesn't excuse my actions or Mike's, but it really undercuts the intense anger and wounded pride that you feel. Pain, yes. Understandable. Self conscious anger? Not so justified.\n\nOf course if I could go back and wait a week I would. I don't think it would change the pain you feel, but at least it would make me feel better about myself. But I can't do that. Of course I've thought of that. And I do feel like you deserve to hit me in the face. And it was selfish. I haven't denied that. I do feel that your actions are a little over the top, however. We care about you. We love you. Something happened that shouldn't have, or at least should have been postponed. And I will be there for you when you need me. I'm confident that Mike will be, too.\n"
        },
        {
            "from": "Jessica",
            "time": "2010-08-22T18:35:00.000Z",
            "message": "\nJessica\n*self righteous, not self conscious\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-22T18:35:00.000Z",
            "message": "Brian\nThank you for the reply.  You've given me a lot to think about.  I don't want to be self righteous beyond the fact that I have felt terrible for my actions in the past, and that makes it easy for me to say that I would never do \"that\" to someone.  Now I am on the receiving end, and it just hurts.  Talking about our feelings with each other isn't making the pain of our short-ended relationship any easier, so I need to find another way to deal with the pain.  I'll be in touch.\n"
        },
        {
            "from": "Jessica",
            "time": "2010-08-22T18:35:00.000Z",
            "message": "\nJessica\nOk. And I'm still sorry to have hurt you. Please don't think that anything I have said negates that fact. It feels awful that I have hurt you in this way. But I can't change that. Please be careful and don't do something dangerous to deal with pain.\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-22T18:35:00.000Z",
            "message": "Brian\nYou are right about Crystal and Steve, we did talk, but it wasn't so clear cut at the time, a lot of other things got in the way, emotion, loneliness, etc.  I still didn't feel like it was my responsibility or like I owed him anything.  But that was purely because I didn't care about his feelings.  Details...  I still felt terrible afterward, and I still think it's wrong to date a friend's ex-girlfriend, and it is more wrong to date a friend's current girlfriend, and it is even more wrong to date a married woman.  And we still disagree on that subject, that is what is important to me.  But your example with Steve and Crystal was surprisingly relevant.\n"
        },
        {
            "from": "Jessica",
            "time": "2010-08-22T18:35:00.000Z",
            "message": "\nJessica\nIt's still hurtful, and I am in no way saying that you don't have the right to be hurt. Please know that. It's a shitty situation all around. In an ideal world, people wouldn't develop feelings for an exes' friends. But people are friends for a reason, and that can all too easily go other places. I wouldn't do this again. I wouldn't have done it this time, if I could help it. I am repeating myself, but if there were some way I could go back and make things easier on everyone, I would.\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-22T18:35:00.000Z",
            "message": "Brian\nYes, you are repeating yourself, and I am \"hearing\" you, that means a lot to me.\n"
        },
        {
            "from": "Jessica",
            "time": "2010-08-22T18:35:00.000Z",
            "message": "\nJessica\nIn a good way? Or should I stop repeating myself? I just want to emphasize that knowing that I have hurt you hurts me. But I will stop.\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-22T18:35:00.000Z",
            "message": "Brian\nIn a good way.\n"
        },
        {
            "from": "Jessica",
            "time": "2010-08-22T18:35:00.000Z",
            "message": "\nJessica\nOk.\n\n"
        }
    ]
}