{
    "thread": "https://www.facebook.com/messages/archived/t/1595288350786958",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Facebook User",
            "time": "2011-11-01T16:23:00.000Z",
            "message": "\nFacebook User\nHey guys!  Only about a month away until our amazing date dash.  I just booked the party bus.  If we get 22 people to come, it will be $20 a person for free transportation all night - AND we can bring booze on the bus, holler!  \n\nIt will pick up from our house after the pre-party at 10 PM and drop off in Scottsdale at a few locations, and then will ultimately stop at our house at 2 AM.  If for some reason you don't think you will partake in the party bus, please let me know.  And, if you haven't RSVP'd yet, please do so!  This event will seriously be amazing.  The more people who come, the cheaper it is for all of us!\n\nI will most likely set up a PayPal account before the event so we don't have to worry about checks.\n\nStart getting your costumes ready...I've already heard of people dressing up as multiple different holidays and can't wait to see what you guys come up with!\n"
        },
        {
            "from": "Facebook User",
            "time": "2011-11-22T17:26:00.000Z",
            "message": "\nFacebook User\nCan you believe the big DATE DASH is in less than 2 weeks?  I've been waiting for 6 1/2 years for this...\n\nIf you're planning on attending, please send me $20 per person through PayPal to my email address - megan.mcnamee.rd@gmail.com.  This will pay for the party bus (read: free transportation all evening!).  The bus picks up at our place after the pre-party at 10 PM and can stop at houses in Scottsdale on our way home.  Feel free to leave your car at our house. \n\nGreg and I are going to get a keg for the pre-party that we will take with us on the bus.  We will also have delicious snacks and wine.  Please feel free to bring other booze that you prefer...and you can take it on the bus to the bar(s)!\n\nDon't forget to dress up!  Any holiday will do...get creative people.  And no, despite what Greg says, the theme is NOT religions of the world.\n\nMessage or text me (480-510-9634) if you have any questions.  See you guys soon!\n"
        },
        {
            "from": "Facebook User",
            "time": "2011-12-02T15:47:00.000Z",
            "message": "\nFacebook User\nOK this will be my last message, I promise :)  I wanted everyone to know that while you are completely welcome to bring alcohol on the bus (we will bring the keg with us), we can't have any glass bottles.  Sooo I'd recommend bringing an empty water bottle or flask if you're imbibing in hard alcohol :)\n\nWe will arrive in Old Town around 11 pm, place still TBD (taking suggestions!)\n\nAlso, if you haven't had a chance to pay for the bus, please do so today if possible.  We still have some space left, and the pre-party/bus will the the highlight of the evening!  I'm trying to avoid handling cash tomorrow.  It's $20 per person, and you can send it via PayPal to my account (megan.mcnamee.rd@gmail.com).  Let me know if you have any questions!\n\nThis is going to be seriously epic, people.\n\n"
        }
    ]
}