{
    "thread": "https://www.facebook.com/messages/archived/t/1612802805634502",
    "participants": [
        {
            "name": "Andrea Paige",
            "description": "Group Sales Manager at The Westin Columbus",
            "url": "Lives in Columbus, Ohio"
        },
        {
            "name": "Bob Morgan",
            "description": "Former IL Jewish Outreach Coordinator at Hillary for America",
            "url": "Worked at Office of Governor Pat Quinn"
        }
    ],
    "messages": [
        {
            "from": "Chris",
            "time": "2015-06-01T17:11:00.000Z",
            "message": "\nChris\nI have some sad news to report.  I'm very sad to say that Wendy has asked me for a divorce.  I don't want to go into too much detail but Wendy told me about a month ago that her feelings for me have changed.  I have asked her to go to counseling but she is determined to proceed with the divorce.  Sadly I am in shock as I thought we were doing very well.  We are going to try to remain friends and we will share in the duty of taking care of our children but other than that she has, for the most part, moved out of our house.\n\nI'm sorry for this sad news but I wanted to let you guys know since you may start seeing confusing posts on Facebook that make it seem like we are not together.  \n\nPlease respect her privacy as she can't control how her heart feels.\n\nThank you and love you guys,\n"
        },
        {
            "from": "Kate",
            "time": "2015-06-01T17:12:00.000Z",
            "message": "\nKate\nKeeping all of you in my prayers. So sorry.\n"
        },
        {
            "from": "Brian",
            "time": "2015-06-01T17:12:00.000Z",
            "message": "\nBrian\nWow chris! So sorry.  Please let us know if there is anything we can do to help!\n\n"
        },
        {
            "from": "Jennifer",
            "time": "2015-06-01T17:12:00.000Z",
            "message": "\nJennifer\nI am so sorry.  I will keep everyone in my prayers.\n\n"
        },
        {
            "from": "Elizabeth",
            "time": "2015-06-01T17:12:00.000Z",
            "message": "\nElizabeth\nI am really sorry for this news. We love you both.\n\n"
        },
        {
            "from": "",
            "time": "2015-06-01T17:12:00.000Z",
            "message": "Lindsay Koegle left the group."
        },
        {
            "from": "Cathy",
            "time": "2015-06-01T17:12:00.000Z",
            "message": "\nCathy\nSo sorry Chris.  Thinking about you both, and hating the sad news.  Love you guys.\n\n"
        },
        {
            "from": "Patti",
            "time": "2015-06-01T17:12:00.000Z",
            "message": "\nPatti\nSo very sorry to hear Chris! Will keep you in our prayers! Hugs\n\n"
        },
        {
            "from": "Shane",
            "time": "2015-06-01T17:12:00.000Z",
            "message": "\nShane\nSorry to hear. Thoughts are with you.\n\n"
        },
        {
            "from": "Megan",
            "time": "2015-06-01T17:12:00.000Z",
            "message": "\nMegan\nVery sorry Chris you and your family are in our prayers and we love you all wish nothing but the best for you all\n\n"
        },
        {
            "from": "Jason",
            "time": "2015-06-01T17:12:00.000Z",
            "message": "\nJason\nChris I'm very sorry and I only wish you the best through this.  You're a great guy...Don't forget that\n\n"
        },
        {
            "from": "Mary",
            "time": "2015-06-01T19:11:00.000Z",
            "message": "\nMary\nSo sorry to hear this. Do not assume friendship is an option at this point. Be careful and seek advice. Take care Chris.\n"
        },
        {
            "from": "Chris",
            "time": "2015-06-01T19:11:00.000Z",
            "message": "\nChris\nThank you guys, we can definitely use your prayers.  Thanks too, Mary Ellen.  You're right that it may not be possible at this time.  I will probably still go to some sessions of counseling to see how best to handle all this.  We are staying cordial, which is helping the kids deal with all this.  Thank you guys!\n\n"
        },
        {
            "from": "Mary",
            "time": "2015-06-01T19:11:00.000Z",
            "message": "\nMary\nAbsolutely Chris. The focus has to your children and you have to maintain a civil relationship for them.\n"
        },
        {
            "from": "Colleen",
            "time": "2015-06-01T19:11:00.000Z",
            "message": "\nColleen\nSending you vibes of love and acceptance xoxo\n\n"
        },
        {
            "from": "Mary",
            "time": "2015-06-01T19:11:00.000Z",
            "message": "\nMary\nWe in Chicago are here for you in any way you need. We love you.\n\n"
        },
        {
            "from": "Marilyn",
            "time": "2015-06-02T05:30:00.000Z",
            "message": "\nMarilyn\nChris, I'm so sorry to read this. Let me know if I can do anything for you.\n\n"
        },
        {
            "from": "Brian",
            "time": "2015-06-02T05:30:00.000Z",
            "message": "Brian\nYou are always welcome in AZ if you need to get out of town for a few days.  Our prayers are with you and your family.\n"
        },
        {
            "from": "",
            "time": "2015-06-02T05:30:00.000Z",
            "message": "Tusweca Kate left the group."
        },
        {
            "from": "Patrick",
            "time": "2015-06-02T09:25:00.000Z",
            "message": "\nPatrick\nSo sorry Chris, I know this is terribly painful for you.  You are a very wonderful guy and a strong soul and you will get through this.  Please don't hesitate to let Jeri and I know if there is anything we can do - talk, help out with the kids, etc.  You're in our thoughts and prayers. Hang in there.\n\n"
        },
        {
            "from": "Kathy",
            "time": "2015-06-23T03:22:00.000Z",
            "message": "\nKathy\nHey Chris... we are always here in Charleston for you too...We pray for God's love and protection for your family\n\n"
        }
    ]
}