{
    "thread": "https://www.facebook.com/messages/archived/t/164207252901",
    "participants": [
        {
            "name": "Anders Saltin",
            "description": "Worked at Skogsstyrelsen",
            "url": "Went to Wargentinsskolan"
        },
        {
            "name": "Andrea Alonso",
            "description": "From Granada, Spain",
            "url": "https://www.facebook.com/andreabbaa"
        }
    ],
    "messages": [
        {
            "from": "Steve",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nSteve\nHello everyone! This is Steve, your friendly Vegas-trip provider :-)\nI do not have the contact information for every person going, so please pass this message along to those who have paid (and those not on Facebook).\n\nI wanted to write this to address some basic expectations about the trip to Las Vegas. If you have any additional concerns, please contact me through facebook or my nau email address: sa366@nau.edu\n\nFirst, we will be leaving from NAU at 4pm. Please be there no later than 4pm. My friend Ryan and I have reserved two rental vans and will be meeting everyone at the parking lot behind the library. Map: (parking lot P13 West of the library, building 28)\nhttp://sapphire.ucc.nau.edu/web/campus_map/north_campus.html\nI will try my best to have someone there at the parking lot with a sign. If you don't see that, look for two large white vans. We'll try to meet near the South part of the library, in between the library and the music building, but if we are not there, we will be somewhere in parking lot P13. We don't want to leave people behind, but if everyone is waiting and we cannot find you, we may leave.\n\nTRANSPORTATION EXPECTATIONS\n1) Do not bring too much, we do not have the capacity to take lots of luggage!\nWe are only going for 2 nights, so please pack light. Bring only one backpack (or two if absolutely necessary), as the vans only have that much space for luggage. If you have a costume for Halloween, try to make it as compact as possible. We also have two cars along with the two vans, but they have people and luggage too. We will do everything we can to fit everyone and all luggage in all the vehicles, but if something doesn't fit, someone will need to put their luggage back in their room, and if this happens it delays the trip for everyone.\nThings to bring: clothes, a towel, soap/shampoo, alcohol, money (bring more than you think you need, Vegas is expensive even if you do not gamble - I think about $200-$300 is good).\nDo not bring: hair dryers, loud music players, more luggage than necessary.\n\n2) Hoover Dam: I heard some people would like to stop at the dam - it may be possible to stop on the way there or returning from Vegas. I think this can work, but I will discuss the potential problems on the way there, and we can make a group decision as to what to do.\n\n3) Security Checkpoint: we will pass a security checkpoint near the Nevada border. This is no cause for alarm, and most of the time cars will get waved through without stopping. Our vans may be stopped for a quick inspection, but since we will be doing nothing illegal in the car (like drinking) we will not have a problem.\n\n4) It would be good to stop as little as possible on the trip. We can go to Vegas without stopping for gas, so please go to the bathroom before we depart. Also, please bring some snacks for the ride.\n\n\nROOM EXPECTATIONS\n1) First and most importantly, we want to avoid security coming to the room. There is a risk that, if security finds out, we will be fined an extra fee per person in the room. However, I want to stress that this is NOT A PROBLEM if we are quiet. Of course its okay to hang out a little bit in the room, and use it to get ready and things like that, but I think you'll be wanting to spend most of your time outside the room anyway.\n\n2) On arrival, a few people (including myself) will check in, and go up to the rooms. We will get duplicate room keys and will distribute these among the group so that everyone may go up and put their stuff in the room. We just need to be careful because a group of 30 people going to two rooms looks suspicious. Again, this is not a problem, but is just the most complicated part of the trip. Ryan and I will explain the details on the drive there and answer any questions. I estimate we will all be ready by about 10pm or 11pm on Friday.\n\n3) Once we arrive and have checked in, and after everyone has a key: have fun! There are plenty of websites describing what to do in Vegas, so have a look and get a general idea. The MGM Grand is at the South of the Strip, so most things will be North. It is possible to travel short distances on foot, but if you want to go to the North end of the Strip you may want to consider a cab ride. I plan on going to old Las Vegas, now called the Fremont Experience, which is too far from the MGM to walk. Gambling is cheaper there and they have a cool overhead light show.\n\n4) Check out at the hotel is Sunday at 11am. We need to be out by that time and on our way back. The rental vans are due back in Flagstaff at 4pm, so we will appreciate it if everyone is prompt.\n\n\nThank you very much for helping us make this trip! If you have any questions or concerns, please message me on facebook or email me at sa366@nau.edu\nse message me on facebook or email me at sa366@nau.edu\n\n\nList of all going (everyone who has paid):\nAnne\nSteve\nElyse\nJared\nRyan\nTaryn\nJanelle\nBrian\nJessie\nAubrey\nAbby\nSally\nBruce\nMike\nDanielle Seager\nAurianne S\nKim Norraeus\nAnders Saltin\nSylvia\nJudith Aboulker\nSandra Peterson\nAndrea Alonso\nIngrid Hofstra\nRob Langeland\nJan Peder Nilsen\nLola Domingez\nHan Verberne\nHaruna/Eiko Shimojo\nYulia Goncharvia\nAi Odoriba\nMarjan Nugteren\nMakoto Yamauchi\nKsenia Karakozova\nZhikun Xu\nMarlyn S\nNidar Tchezoff\nNorth Campus NAU\nsapphire.ucc.nau.edu\n"
        },
        {
            "from": "Jan",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nJan\n30 people to two rooms??? How is that going to work out? Where are we going to sleep?\n"
        },
        {
            "from": "Danielle",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nDanielle\nOn the floor.\n\nxxxxxx\n"
        },
        {
            "from": "Jan",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nJan\nis it really that expensive in vegas? how big are the rooms?\n"
        },
        {
            "from": "Steve",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nSteve\nYep, on the floor. At random times. I'm going to sleep at 6am. \n"
        },
        {
            "from": "Jan",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nJan\nlol I'll get my own room then, where are we staying?\n"
        },
        {
            "from": "Danielle",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nDanielle\nworst comes to worst u can sleep in the van!\n\n"
        },
        {
            "from": "Jan",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nJan\nwhere are we staying? what hotel?\n"
        },
        {
            "from": "Steve",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nSteve\nMGM Grand, and yes, it can be expensive in Las Vegas (for food and other things)\n"
        },
        {
            "from": "Jan",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nJan\nok, do you have a link to the place you booked a room?\n"
        },
        {
            "from": "Steve",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nSteve\nwww.mgmgrand.com\nLas Vegas Hotels - MGM Grand Hotel & Casino\nMGM Grand Hotel & Casino is your premiere destination for Las Vegas entertainment. Experience the comfort and excitement of MGM Grand, the resort that delivers Maximum Vegas!\nmgmgrand.com\nWe have 2 celebrity suite, 700sqft\n\nhttp://www.mgmgrand.com/hotel/celebrity-spa-suites.aspx\nMGM Grand Hotel and Casino : Celebrity Spa Suites\nStar treatment. This stylish suite provides classic comfort in the heart of Vegas. At 694 square feet, the Celebrity Spa Suites are slightly larger than our Bungalow Suites.\nmgmgrand.com\n"
        },
        {
            "from": "Jan",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nJan\nhehe, I dont wanna sound negative here, but 30 people in two rooms? In a hotel like that? They're not stupid, theyre gonna notice..\n"
        },
        {
            "from": "Brian",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "Brian\nLol, > influence of alcohol = > comfyness of floor\n"
        },
        {
            "from": "Steve",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nSteve\nIt won't be a problem. If you're worried just let me know and I'll refund you. \n\nNo they aren't stupid but we can avoid problems if we are smart about the situation. I've been there plenty of times, to the MGM Grand and I even had someone check a few days ago to see where there are cameras. We will be fine.\n"
        },
        {
            "from": "Jan",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nJan\nHehe, ok. 30 drunk people... someone's gonne mess up..\n\n"
        },
        {
            "from": "Steve",
            "time": "2009-10-27T05:31:00.000Z",
            "message": "\nSteve\nYep being drunk is good, the plan is to party in Vegas, not in the room.\ncool I'm going to bed everyone, please message me or email me if you have any questions: sa366@nau.edu\n\n"
        }
    ]
}