{
    "thread": "https://www.facebook.com/messages/archived/t/1642574834856",
    "participants": [
        {
            "name": "Abe Pralle",
            "description": "Partner at Kati Vegan Thai",
            "url": "Partner at Plasmaworks"
        },
        {}
    ],
    "messages": [
        {
            "from": "Jordan",
            "time": "2011-04-28T18:56:00.000Z",
            "message": "\nJordan\nI could go to E3!\n\nOkay, some of you won't remember me, some of you I haven't spoken to in months, and some of you I didn't even recognize...BUT obviously we ended up as Facebook because I may have affected your life in a positive way or you're unfortunate enough to be related to me. \n\nWhatever caused us to cross paths, I need your help.\n\nI recently submitted a video for the VGVN (Video Game Voters Network) E3 Insider Contest. Long story short, if my video is picked, I get to represent the VGVN at E3! This is a big oppertunity for me and it would be super cool if any of you guys liked/tweeted/shared/whatever or gave the video a positive comment.\n\nI know it's not that great of a video. The original plan of a staged trade show didn't work out so I ended up completely winging it at one of the Digital Carnivals here at NAU.\n\nThis probably seems stupid, but every little bit helps . And if I win I'll throw a party for you guys or something.\n\nAnyway, here's the link http://www.youtube.com/watch?v=hxEekjEuR44\n\nAlso, thanks again to those of you who already commented, liked, etc!\nAttachment Unavailable\nThis attachment may have been removed or the person who shared it may not have permission to share it with you.\n"
        },
        {
            "from": "Jordan",
            "time": "2011-05-02T06:21:00.000Z",
            "message": "\nJordan\nWell looks like I didn't make it into the finals for the VGVN E3 contest, but thanks to all of you who were supportive!\n\n"
        },
        {
            "from": "",
            "time": "2012-08-30T20:14:00.000Z",
            "message": "Steven Link left the group."
        }
    ]
}