{
    "thread": "https://www.facebook.com/messages/archived/t/1652439033162",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        },
        {
            "name": "David Earl Smith",
            "description": "Lives in Flagstaff, Arizona",
            "url": "From Peoria, Arizona"
        }
    ],
    "messages": [
        {
            "from": "Kelsey",
            "time": "2010-10-14T05:43:00.000Z",
            "message": "\nKelsey\nKachina Trail or Wetherford. If you would like to see the leaves change colors. It might be raining. But on the other hand, Chuck Norris doesn't get wet, Rain gets Chuck Norris. \n\nPS I am randomly not some people's friends on facebook so please pass it along to other people you think might want to go.\n"
        },
        {
            "from": "Teresa",
            "time": "2010-10-14T15:39:00.000Z",
            "message": "\nTeresa\nActually something came up where it got moved to Sunday, now I can not make it \n\n"
        },
        {
            "from": "Michael",
            "time": "2010-10-14T17:09:00.000Z",
            "message": "\nMichael\nMake an event,  i'd like to go.\n"
        },
        {
            "from": "Brian",
            "time": "2010-10-14T17:09:00.000Z",
            "message": "Brian\nI'd definitely like to go, but parents will be in town, so I will have to let you know.\n"
        },
        {
            "from": "Jessica",
            "time": "2010-10-14T18:16:00.000Z",
            "message": "\nJessica\nI want to go whenever it is. Hah hah. Need to hike more.\n"
        },
        {
            "from": "Travis",
            "time": "2010-10-15T00:50:00.000Z",
            "message": "\nTravis\nI'm excited about the idea of hiking the Weatherford Trail and continuing onto the Humphreys Trail when Weatherford ends. Through this route, we will reach the summit of Mt. Humphreys, which is the highest point in the entire state. That is guaranteed to be be an amazing climb, and it seems like the better of the two trails to pursue right now.\n"
        },
        {
            "from": "Joseph",
            "time": "2010-10-15T00:50:00.000Z",
            "message": "\nJoseph\nWell as to Travis's Comment. I think Me and Travis would be up for hiking Weatherford + Humphryes but I would bet you sissy girl (especially Kelsy, and Terisa) couldn't hang. \n\nAlthough actually i can't go Sunday cause I'll be out of town. \n"
        },
        {
            "from": "Kelsey",
            "time": "2010-10-15T00:50:00.000Z",
            "message": "\nKelsey\nMike, would you still go, even if this wasn't a facebook event? Weatherford would be tight.\n"
        },
        {
            "from": "Brian",
            "time": "2010-10-15T02:36:00.000Z",
            "message": "Brian\nI will not go it there is not a Facebook event.\n"
        },
        {
            "from": "Joseph",
            "time": "2010-10-15T02:36:00.000Z",
            "message": "\nJoseph\nYeah me too. I'm not going, if there's not a Facebook event.\n"
        },
        {
            "from": "Michael",
            "time": "2010-10-15T02:36:00.000Z",
            "message": "\nMichael\nyeah,  I can't go unless there is a fb event.\n\n"
        },
        {
            "from": "Jessica",
            "time": "2010-10-15T16:54:00.000Z",
            "message": "\nJessica\nI would definitely we down for Weatherford and Humphreys! Rain might put a damper (har har, I'm punny) on the plan, though, since it'll be snowing at the top of humphreys if it's raining in Flagstaff. If it's not raining I'd love to do humphreys during the day, though, I've only done the sunrise hike.\n"
        },
        {
            "from": "Travis",
            "time": "2010-10-15T20:26:00.000Z",
            "message": "\nTravis\nRain is one thing, but I'm seeing weather reports warning about thunderstorms on Sunday. This may have to turn into a Saturday thing or be postponed.\n\n"
        },
        {
            "from": "Jessica",
            "time": "2010-10-15T21:48:00.000Z",
            "message": "\nJessica\nI am ok with Saturday... since a bunch of people can't go Sunday, can they go Saturday? Kelsey?\n"
        },
        {
            "from": "Brian",
            "time": "2010-10-15T23:03:00.000Z",
            "message": "Brian\nThis Saturday doesn't work for me.  Parents are in town, so I have to go to the football game, and work on stuff for Films in the Forest.\n"
        },
        {
            "from": "Kelsey",
            "time": "2010-10-16T02:59:00.000Z",
            "message": "\nKelsey\nIf we went on Saturday I'd have to get back before 2pm. We could do the easier Kachina trail on Sunday and save Weatherford for when the weather permits or more people can come.\n"
        },
        {
            "from": "Kelsey",
            "time": "2010-10-17T03:28:00.000Z",
            "message": "\nKelsey\nFor the people who can go, are you going?\n"
        },
        {
            "from": "Jessica",
            "time": "2010-10-17T03:28:00.000Z",
            "message": "\nJessica\nI want to! Will be there.\n\n"
        },
        {
            "from": "Kelsey",
            "time": "2010-10-17T17:22:00.000Z",
            "message": "\nKelsey\nYAY!\n\n"
        },
        {
            "from": "Joseph",
            "time": "2010-10-17T17:22:00.000Z",
            "message": "\nJoseph\nYeah sorry I can't go.  ill be in Dallas ropen some buffalo. (If they do that in Dallas)\n\n"
        }
    ]
}