{
    "thread": "https://www.facebook.com/messages/archived/t/165476083851195",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Facebook User",
            "time": "2007-11-07T11:03:00.000Z",
            "message": "\nFacebook User\nACM Members: Don't forget to invite all your potentially-interested friends to the LAN Party!\n\nhttp://nau.facebook.com/event.php?eid=5319397317\n"
        },
        {
            "from": "Facebook User",
            "time": "2008-02-26T22:36:00.000Z",
            "message": "\nFacebook User\nPlease invite all your Facebook friends to the Digital Carnival on Friday!  Do it now!  And don't forget to come yourselves!\n\nhttp://nau.facebook.com/event.php?eid=20607610343\n"
        },
        {
            "from": "Facebook User",
            "time": "2008-10-13T09:40:00.000Z",
            "message": "\nFacebook User\nhttp://www.facebook.com/home.php?ref=home#/ical/event.php?eid=30780071989\nReally, facebook? An iCal file?\n\nhttp://www.facebook.com/event.php?eid=30780071989&ref=nf\n"
        },
        {
            "from": "Facebook User",
            "time": "2008-10-29T23:15:00.000Z",
            "message": "\nFacebook User\nHey All,\nBecause I was late on posting the fliers for the meeting I decided this would be the best alternative.  We are having a meeting tomorrow, I (Brian) am presenting on Operating System Independence.  Followed by the movie Iron Man, in BluRay if I can get it set up (not likely).  I hope you all can join me as I present cross platform solutions to being productive as a power user and a developer!  See you there!\n-Brian Cullinan\n"
        },
        {
            "from": "Facebook User",
            "time": "2009-02-05T16:10:00.000Z",
            "message": "\nFacebook User\nHi everyone! Don't forget we have a Digital Carnival coming up the day before Valentine's Day with a highly appropriate \"Doubles\" tournament: Bring a friend/statistically significant other! As always, free admission, with a $5 tournament entry. \n\nhttp://www.facebook.com/editevent.php?eid=59098346873&guests=1&oid=59098346873&view=noreplies#/event.php?eid=59098346873\n"
        },
        {
            "from": "Facebook User",
            "time": "2009-04-13T09:35:00.000Z",
            "message": "\nFacebook User\nHi everyone! So my User Interfaces (CS477) group needs some data about people who live with roommates...if you could please take 2 minutes of your time and fill this out, we would greatly appreciate it!! C'mon, I know you all take the \"Which Vampire Hottie Will You End Up Dating\" Quizzes that are going around anyway, AND THIS ONES FOR CHARITY \n\nPlease take this short (2 minute) survey if you have a roommate:\nhttp://www.surveymonkey.com/s.aspx?sm=RlcGz002DyafRYZLB_2fJxeQ_3d_3d\n\nTHANK YOU GUYS SO MUCH \n"
        },
        {
            "from": "Facebook User",
            "time": "2009-04-17T00:13:00.000Z",
            "message": "\nFacebook User\nSo I suppose it's only fair that I spread other surveys out for other UI teams...and honestly this group totally deserves two minutes of your time: they took some of the harshest criticism I've ever heard from Eck today and they could really use some help with this!! And yes, I've seen Palmer at Capstone! \n(Eck and Palmer are both members of this facebook group, so I kid...mostly)\n\nPlease be a hero today! You'd really be helping out a ton and it only takes 2 minutes!\n\nhttp://spreadsheets.google.com/viewform?hl=en&formkey=cEVBRDVnSmt6VUNPdFVYVUx4eXQ3SWc6MA\n\nTHANK YOU GUYS SO MUCH! \nAnd if you see any of the group members, be generous with hugs!\n\nLeah\n"
        },
        {
            "from": "Facebook User",
            "time": "2009-08-27T06:45:00.000Z",
            "message": "\nFacebook User\nDon't forget to invite your friends to ACM's first Digital Carnival of the semester, this Friday at 7PM in DuBois!\n\nhttp://www.facebook.com/event.php?eid=132425507015#/event.php?eid=132425507015&ref=ts\n\nInvite them! Do it now!\n"
        },
        {
            "from": "Facebook User",
            "time": "2009-09-04T23:36:00.000Z",
            "message": "\nFacebook User\nTo ensure a better turn out for the event this BBQ has been postponed. \n\nI forgot it was Labor Day weekend and have the notion that people have left early for the holiday.\n\nThe CS BBQ has been postponed to next Friday at Kiwanis Park at 5:00 pm\n"
        },
        {
            "from": "Facebook User",
            "time": "2010-09-10T21:38:00.000Z",
            "message": "\nFacebook User\nReminder that tonight is the Welcome Back Digital Carnival.\n7:30 PM at du Bois Dining Area\n\nSuper Smash Bros Brawl Doubles Tournament. Entry is free.\nBring consoles and games. Play with friends and have fun.\nFree food.\n\n"
        }
    ]
}