{
    "thread": "https://www.facebook.com/messages/archived/t/1694066177540194",
    "participants": [
        {
            "name": "Andrea Paige",
            "description": "Group Sales Manager at The Westin Columbus",
            "url": "Lives in Columbus, Ohio"
        },
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Colleen",
            "time": "2016-02-02T09:37:00.000Z",
            "message": "\nColleen\nHello my fabulous cousinzzz!!  Just dropping a line to remind you that Grandma's 95th birthday is coming up this Friday, Feb. 5!\n\nThis is really last minute but in my crazed state of insomnia I had what could be a brilliant idea!\nDo you think we Cullinan Cousins could pull together a group video chat (google hangout or something) and wish Gma a HBD?\n\nI'm flying down to visit tomorrow and staying through til the afternoon of the 5th.  \nLet me know yalls availability! Here's my nums 843.860.4840\n\nIf all else fails we should do this another time anyway!\n\nLove y'all! XOXO\n"
        },
        {
            "from": "Chris",
            "time": "2016-02-02T12:10:00.000Z",
            "message": "\nChris\nIn!  Great idea!  If Friday didn't work for some people, how about a day late video chat on Saturday?\n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-02T16:09:00.000Z",
            "message": "\nColleen\n"
        },
        {
            "from": "Emily",
            "time": "2016-02-02T16:09:00.000Z",
            "message": "\nEmily\nI'm in just let me know when \n\n"
        },
        {
            "from": "Corinne",
            "time": "2016-02-02T19:29:00.000Z",
            "message": "\nCorinne\nI'm in also! Would love that. Let me know when and I will be there.\n"
        },
        {
            "from": "Brian",
            "time": "2016-02-02T19:29:00.000Z",
            "message": "Brian\nYes, my skype name is bjcullinan or my hangouts gmail is bjcullinan@gmail.com.\n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-02T19:29:00.000Z",
            "message": "\nColleen\nWere celebrating w a bday dinner on the 4th, would Thursday work?\n"
        },
        {
            "from": "Brian",
            "time": "2016-02-02T20:25:00.000Z",
            "message": "Brian\nyeah\n"
        },
        {
            "from": "Corinne",
            "time": "2016-02-02T22:02:00.000Z",
            "message": "\nCorinne\nif I have a gmail account will I automatically have google hangouts? I'll have to look into this. my e-mail is cncullinan@gmail.com. Thursday the 4th works, I am at work until 4:30-5 my time but I'm sure if we do it earlier I could sneak off and say what's up \n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-03T01:07:00.000Z",
            "message": "\nColleen\nwe can do it later in the evening if that works-- knowing grandma, we'll be eating dinner around 4:30 anyway haha\n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-03T01:07:00.000Z",
            "message": "\nColleen\nps. i'm ckcullinan@gmail.com (we're oh so original btw lol)\n"
        },
        {
            "from": "Andrea",
            "time": "2016-02-03T20:25:00.000Z",
            "message": "\nAndrea\nHello cousins!! I will actually unfortunately be out of town traveling/on the road this weekend from Thursday to Sunday. I would LOVE to setup another time to Facetime/Google Chat with Grandma, though. My cell is 614-571-8583, Colleen if you want to text me to set up a time maybe later this month that would be wonderful!!! Also - can you send me Grandma's address? I would love to send her a Birthday card!!\n\n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-03T22:10:00.000Z",
            "message": "\nColleen\nAw ok, we will def try and do this again later!\n\nHere's her mailing address:\n135 Brogun Ln\nCharleston SC 29414\n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-03T22:10:00.000Z",
            "message": "\nColleen\nSo what's a good time to do the group chat tomorrow--8pm?\n\nWhoever can't make the group chat--or if it's easier for everyone--if you wanna FaceTime/google chat/ skype individually, text me and we'll work it out 8438604840\n"
        },
        {
            "from": "Chris",
            "time": "2016-02-04T00:40:00.000Z",
            "message": "\nChris\nAre we going to connect with Skype?\n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-04T00:40:00.000Z",
            "message": "\nColleen\nDoes skype do multi chat? Brian had started a google hangout and I know it hosts up to 10 ppl....\nPs can u pass the word along to Sean? I don't have his # anymore\n"
        },
        {
            "from": "Chris",
            "time": "2016-02-04T00:40:00.000Z",
            "message": "\nChris\nI went original.  My gmail account is ccullinan71@gmail.com\n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-04T00:40:00.000Z",
            "message": "\nColleen\nHa!\n"
        },
        {
            "from": "Callie",
            "time": "2016-02-04T05:21:00.000Z",
            "message": "\nCallie\nHi! I will also be out of town this weekend-- but thank you for providing her mailing address!  My number is 614.425.4666-- let me know if you guys do it again \n\n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-04T05:21:00.000Z",
            "message": "\nColleen\nword holla ma balla xoxo\n"
        },
        {
            "from": "Corinne",
            "time": "2016-02-04T14:33:00.000Z",
            "message": "\nCorinne\n8pm works! Chris if you have a gmail account then you should automatically have google hangouts. just type \"google hangouts\" into google and follow the first link. I'm not sure how to add contacts though so maybe Bri or Colleen can add us to the group chat tonight? I'll plan on being online around 7:30 or so to make sure I can figure it all out.\n\n"
        },
        {
            "from": "Chris",
            "time": "2016-02-04T14:33:00.000Z",
            "message": "\nChris\nAhhh got it.  Thanks!  Yes I have hangouts.  For some reason I thought we were going to try to video chat but hangouts works great too.\n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-04T17:21:00.000Z",
            "message": "\nColleen\nI can initiate the group chat if u want? I'll get on at 7:45 to send the invites--pretty sure you just accept the invitation and you'll be connected to the conversation :3\n\nStill need emails from Em and Sean if they're avail\n"
        },
        {
            "from": "Sean",
            "time": "2016-02-04T20:58:00.000Z",
            "message": "\nSean\nSorry it took so long to respond. I can't wait for hear from you guys tonight! Great idea! I can be reached at cullinans1@gmail.com.\n\n"
        },
        {
            "from": "Colleen",
            "time": "2016-02-05T07:28:00.000Z",
            "message": "\nColleen\nIt was so great seeing y'all tonight xoxoxo I love you!!! I can't wait to do this again with everyone \n\nPs. Here's Gma's cell in case u don't have it & wanna call her whenevs:\n(843) 906-8343\n\n"
        },
        {
            "from": "Chris",
            "time": "2016-02-05T15:33:00.000Z",
            "message": "\nChris\nColleen, this was a great idea.  Thank you so much for organizing it.  Hopefully next time we can get the other cousins on too.  Can't wait to do it again.\n\n"
        }
    ]
}