{
    "thread": "https://www.facebook.com/messages/archived/t/1742666315974747",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Facebook User",
            "time": "2011-10-29T18:09:00.000Z",
            "message": "\nFacebook User\nAlright, party people, tonight's the night! Put on your sober hats and take off your costumes! ....Wait, that's not right... Reverse that. \n\nGet ready for a whirlwind of a good time! I hope you're as excited as we are, because we're going to have a professional grade photo area, a kegerator with a full keg, music, dancing, and beer pong all night long.\n\nTonight's going to be one hell of a night. More than anything, we're excited to make sure that everyone has a great time. That said, I do want to mention a few things:\n\n-If you're planning on driving to our house and drinking while you're here, you're either planning on taking a cab home or crashing on the couch. There will be no exceptions (because we like you and don't want anything to happen to you).\n-Want some beer from the keg? Sure! Help yourself! It'd be REAL nice if you threw us a few bucks, though. We don't have tits big enough to get kegs for free... \n-Bringing a bottle of hard liquor/wine/six pack and want to share it? Sure! We'll toss it in the collection of alcohol we have going. Have a personal stash that you want to keep to yourself? No problem! We'll put it away for you and retrieve it whenever you want. Just let us know that it's just for you (and/or your posse, you BAMF) and we'll safeguard it.\n-Again, PLEASE give clear any hangers-on that want to come to the party with you. We're happy to accommodate... within reason. We're not going to allow your brother's best friend's cousin's foster brother from Yugoslavia waltz in like he owns the damn place. We have room for about 50 or 60 people MAX, so please be respectful. And don't bring anyone who's still in high school. That's just weird.\n\nCho, Rob and I are very much people who love hosting. We want you to have a RIDICULOUSLY GOOD TIME! If there's anything we can do to ensure you have the night of your life, we'll do it (within reason...). \n\nIf you're on the fence, jump onto our side (the dark side; the 'yes, I'm attending' side), my friend. We'll make sure you don't regret coming to the party. We're good at that. We hope to see you there!\n\n"
        }
    ]
}