{
    "thread": "https://www.facebook.com/messages/archived/t/1897425995185",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        },
        {}
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2011-07-15T07:17:00.000Z",
            "message": "Brian\nJessie,\n\nI would like to spend time with you and Mike this weekend.  But the current plan involving Kelsey is a little ridiculous (as usual).  So I would like your opinion because it has always mattered a lot to me.  Here is the route I would currently have to drive to maximize the amount of time spent with you guys.  The problem that I have with this plan is I am driving twice as much as anyone else, and will probably spend $100 on gas alone.\n\nhttp://maps.google.com/maps?saddr=Phoenix,+AZ&daddr=Flagstaff,+AZ+to:Jerome,+AZ+to:Flagstaff,+AZ+to:Phoenix,+AZ&hl=en&sll=34.327355,-111.87051&sspn=2.186476,4.22699&geocode=Fblh_gEdy-JR-SnLeaFQ7RIrhzGsG0o1-MdpjA%3BFUghGQIdL4VY-SkxJi7a944thzEAs9vOoTwfjg%3BFe85EgIdlEdR-Smb5-ltkA8thzGLZlUrT_Jj9g%3BFUghGQIdL4VY-SkxJi7a944thzEAs9vOoTwfjg%3BFblh_gEdy-JR-SnLeaFQ7RIrhzGsG0o1-MdpjA&mra=ls&z=9\n\nSo, possible alternatives include:\nOption 1) Meet in Jerome, Friday evening for camping until Saturday then return to Phoenix.\nOption 2) Go to Flagstaff and go to whiskey tasting and do \"other activities\" on Saturday ;) and hope that other stay behind to hang out Saturday/Sunday and return to Phoenix on Sunday.\nOption 3) Still pay lots of money.  Probably not go to Whiskey tasting. But trim an hour off the round trip:\n\nhttp://maps.google.com/maps?saddr=Phoenix,+AZ&daddr=Jerome,+AZ+to:Flagstaff,+AZ+to:Phoenix,+AZ&hl=en&sll=34.32756,-111.871033&sspn=2.186476,4.22699&geocode=Fblh_gEdy-JR-SnLeaFQ7RIrhzGsG0o1-MdpjA%3BFe85EgIdlEdR-Smb5-ltkA8thzGLZlUrT_Jj9g%3BFUghGQIdL4VY-SkxJi7a944thzEAs9vOoTwfjg%3BFblh_gEdy-JR-SnLeaFQ7RIrhzGsG0o1-MdpjA&mra=pr&z=9\n\nI feel like if I am driving this much, it should be for something extraordinary, not for places I have already been.  You choose.\nPhoenix, AZ to Phoenix, AZ - Google Maps\nFind local businesses, view maps and get driving directions in Google Maps\nmaps.google.com\n"
        },
        {
            "from": "Jessica",
            "time": "2011-07-15T15:32:00.000Z",
            "message": "\nJessica\nI think the others are planning to camp on Saturday night, not Friday night, so option 1 would be meeting in Jerome Saturday evening. I don't think Mike and I will be able to camp at all because his mom and aunt and her partner are coming up for lunch at 10 am Sunday.\nThe official non-nefarious Flagstaff activities this weekend are whiskey tasting and the Celtic Festival, which I've never been to and can't vouch for. Travis will also be in town, but I dunno about anyone else. I'm not actually sure what people are doing in Jerome either, other than camping... As a side note, Dave offered to drive us down to Phx since he's going there anyway, and then we would at least be company for you on your drive. And maybe could split gas or something? I'd really like to see you as well, but I think the group's plan is falling apart.\nI don't want to make a decision for you that will involve taking up so much gas and so many hours of your time; it's easy for me to say I want to see you, but it's your time and money investment.\n"
        },
        {
            "from": "Jessica",
            "time": "2011-07-15T15:32:00.000Z",
            "message": "\nJessica\nOh shoot. I have outdated info. Camping is tonight after all. Well crap. I have no idea what to do, then.\n\n"
        }
    ]
}