{
    "thread": "https://www.facebook.com/messages/archived/t/2022855937938573",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Facebook User",
            "time": "2010-03-08T23:47:00.000Z",
            "message": "\nFacebook User\nThere are a lot of people to invite, so if you notice that I forgot anyone, please invite them.  Don't be afraid to invite your friends also.  I would like to see a lot of people at this party in order to make it worth all the effort setting up.  It may be the last party I throw so I hope to see everyone there!  Message me directly for more information on doing ty-dy and what to wear.\n"
        },
        {
            "from": "Facebook User",
            "time": "2010-03-23T20:01:00.000Z",
            "message": "\nFacebook User\nI would like to move the party to Friday the 16th for 2 reasons. 1) Currently it is set for the same weekend as \"Relay for Life\", and fighting cancer is important. And 2) Mike has already arranged for there to be 2 DJs including himself, and I haven't even had the time to create a bunch of cool visuals to play during the party.  So moving it to the 16th would give me more time to create an even more epic party.  If anyone is completely opposed to this change, please MSG me soon!\n"
        },
        {
            "from": "Facebook User",
            "time": "2010-03-25T17:54:00.000Z",
            "message": "\nFacebook User\nIf anyone can't attend because of a time conflict, I have changed the date to Friday the 16th.  Hope to see you there!\n"
        },
        {
            "from": "Facebook User",
            "time": "2010-04-08T05:30:00.000Z",
            "message": "\nFacebook User\nWould anyone be opposed to changing the party day to Saturday?  That way it wouldn't interfere with Circus Baccus, and we would have all day to set up.\n"
        },
        {
            "from": "Facebook User",
            "time": "2010-04-08T20:21:00.000Z",
            "message": "\nFacebook User\nLooks like I am going to blow my entire budget on UV-reactive stuff.  If anyone is willing to contribute by ordering an item, please post on the wall what you ordered and order today!\nHere are some links:\nhttp://www.teachersource.com/Ultraviolet/Ultraviolet.aspx (Excellent stuff)\nhttp://www.xoxide.com/paint.html (UV-Spraypaint)\nhttp://www.starlight.com/bodypaint.html (Bodypaint)\nhttp://www.xenoline.com/uvefxmakeup.html (more Bodypaint)\n\nP.S. Message me directly or post on the event wall.\n\n"
        }
    ]
}