{
    "thread": "https://www.facebook.com/messages/archived/t/207158659669886",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Facebook User",
            "time": "2011-11-30T06:17:00.000Z",
            "message": "\nFacebook User\nAlright, I kept pushing back the date, and if I keep pushing it back, we might be well into Spring. I tried to accommodate the most people by selecting the weekend of Jan 13th. I am very sorry if you cannot make it that weekend  because I do want to see everyone. Please decline if you are not going to make it, so I can get an accurate count. Please also let me know if you do not have a ride to Mammoth Lakes.\n\nI am so excited to see everyone; it will be a much better mountain than the Snowbowl!\n"
        },
        {
            "from": "Facebook User",
            "time": "2011-12-13T05:38:00.000Z",
            "message": "\nFacebook User\nHi all, I know I am supposed to be a stick in the mud about the date for the Snowboarding/Skiing trip, but there seems to have been confusion on the dates. As a result, I can either keep the date as is and we will make it a great trip, or put it for the following weekend (21-22). Please keep in mind that Jan 16th is MLK Jr Day, and that the current weekend that our trip is set for is that weekend which may get crowded. I do not want to push back this any further than we have to, but I want to hear your opinion. Thanks!\n"
        },
        {
            "from": "Facebook User",
            "time": "2011-12-14T15:05:00.000Z",
            "message": "\nFacebook User\nI just posted some deals that we can get on hotels through a friend \n"
        },
        {
            "from": "Facebook User",
            "time": "2011-12-21T06:05:00.000Z",
            "message": "\nFacebook User\nHey all, \nWe are now booked at Juniper Springs for the nights of 1/20-1/21. Please make arrangements asap as to how to get there, and take time off work if needed. You are welcome to invite friends, as each new friend will further decrease the cost of our already cheap hotel room.\n\n"
        }
    ]
}