{
    "thread": "https://www.facebook.com/messages/archived/t/210770206286",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        },
        {
            "name": "David Earl Smith",
            "description": "Lives in Flagstaff, Arizona",
            "url": "From Peoria, Arizona"
        }
    ],
    "messages": [
        {
            "from": "David",
            "time": "2009-11-23T00:51:00.000Z",
            "message": "\nDavid\nK so who should we NOT invite? Joe because he'll rape us? Or are we cool with that? Travis because of sibling awkwardness? Or are we cool with that? Danielle because of getting chopped up into little pieces? Or are we cool with that?\n\nKeifer cause he's ashamed of his small penis? Or are we cool with that?\n\n"
        },
        {
            "from": "Brian",
            "time": "2009-11-23T00:51:00.000Z",
            "message": "Brian\nLOL, let's hold off on Joe for now.  Travis might be boring, but at least he doesn't complain much.  If we get two rooms, that would solve the sibling awkwardness problem.  But we would have to have a bigger group this time, which isn't outside the realm of possibilities.  Keifer can come, and I don't mind him not being naked, Joanna might hinder any elicit activity though.  And absolutely do not invite Danielle.  She is always awkward, and very annoying.\n"
        },
        {
            "from": "David",
            "time": "2009-11-23T04:37:00.000Z",
            "message": "\nDavid\nI was joking about Danielle.  So who for sure to invite?\n"
        },
        {
            "from": "Brian",
            "time": "2009-11-23T05:48:00.000Z",
            "message": "Brian\nSteve Arcas, Michael Brooks, hotties, some chicks that Heather knows.\n"
        },
        {
            "from": "Jessica",
            "time": "2009-12-27T22:39:00.000Z",
            "message": "\nJessica\nAre we inviting backup boy/girl friends? Because I know someone who would be awesome for the party!\n"
        },
        {
            "from": "Brian",
            "time": "2009-12-28T01:59:00.000Z",
            "message": "Brian\nOnly if Elyse can come without Steve, lol.\n"
        },
        {
            "from": "Jessica",
            "time": "2009-12-28T04:26:00.000Z",
            "message": "\nJessica\nAs you wish, my dear! As I mentioned before, I was thinking in the idiom of 'hotties' as put forth by you. And only females is a double standard, which I reject\n"
        },
        {
            "from": "David",
            "time": "2009-12-30T05:54:00.000Z",
            "message": "\nDavid\nMale hotties is cool. We're supposed to bring someone for Heather to jump.\nAnd I feel like I'm missing something here. Who is it we're suggesting we invite? And I suppose we could invite Elyse, but I doubt she'd come without Steve.\n\n"
        },
        {
            "from": "Jessica",
            "time": "2009-12-30T23:19:00.000Z",
            "message": "\nJessica\nA friend of mine from high school that I recently reconnected with. Really fun guy, great to have at a party. I'm teasing Brian about backup boyfriends, because of his backup girlfriends. And he is a hottie, but unfortunately, due to later text exchanges that suggest a little more than normal attraction, I think it would be awkward to invite him along.\n\n"
        }
    ]
}