{
    "thread": "https://www.facebook.com/messages/archived/t/291126472500",
    "participants": [
        {
            "name": "Abe Pralle",
            "description": "Partner at Kati Vegan Thai",
            "url": "Partner at Plasmaworks"
        },
        {
            "name": "Ben Liszewski",
            "description": "Followed by 10 people",
            "url": "https://www.facebook.com/ben.liszewski"
        }
    ],
    "messages": [
        {
            "from": "Meaghan",
            "time": "2010-01-13T23:04:00.000Z",
            "message": "\nMeaghan\nHello Everyone!\n\nAs we all know, our beloved ACM club was given a really generous grant to build and program a robot by the CS department. It continues to be a fantastic idea, however, the progress on the robot has slowed to a halt and nothing is being done.\n\nBy not completing the robot, or even creating a little progress at all, we are making ACM a laughing stock among the other engineering clubs who, as it's been pointed out to me, have been able to finish a wide variety of projects, and is severely hurting our chances at future funding and other generous contributions from the CS department, like room 105.\n\nI've figured out that no one actually wants to build the robot anymore, and that the people who were interested in it have graduated and have left the club with a several thousand dollar liability that we can't hand off to anyone. People don't want to work on it for the following reasons:\n\n1. It's a huge project and no one has the time to commit to it\n2. No one is confident enough in their technical skills to build it\n3. No one wants their name on it if it fails or sucks.\n\nSo, in order to combat these problems I've come up with the idea of \"Robot Building Days!\" (catchier name coming soon)\n\nThe idea is to advertise one weekend a month where anyone with any degree of skill and from any major, ACM member or not, can come to room 105 and contribute to building a robot! They can work on the hardware, the software, the ideas, or just anything that needs to be worked on really, while snacking on free food and learning valuable skills. They can work as much or as little as they like and they're not liable for any failures.\n\nWhat I need are experienced and incredibly talented technical people to come in ONE day the entire semester, and help these people assemble the robot. The degree of participation you contribute is up to you, it can range from actually building it to sitting on the couch and answering questions. I just need someone to guide the noobs in their attempt at robot building.\n\nI don't need more commitment right now other than \"I would be willing to do this once, on a saturday or sunday (whatever you want) this semester.\"\n\nPlease let me know if you are interested or willing to help get us out of this mess, if you're willing to do it more than once, and if you require further convincing (a.k.a. bribe). Also, if you know someone else who might be interested, send them my way. \n\nONE day for the ENTIRE semester, when it's most convenient for YOU.\n\nPlease help.\n\n-Meaghan\n"
        },
        {
            "from": "Brian",
            "time": "2010-01-14T00:05:00.000Z",
            "message": "Brian\nI would be willing to help a couple of times. I am also available at the helpdesk (225) for answering technical questions throughout the week.\n"
        },
        {
            "from": "Steven",
            "time": "2010-01-14T15:08:00.000Z",
            "message": "\nSteven\nI heard that Ryan M. wanted to get it done too. If he can get the drivers on there, then I can write some lower level functions that will allow the robot to be programmed easier. I'm able to work on it Mondays and Fridays after 3pm.\n\n"
        },
        {
            "from": "Meaghan",
            "time": "2010-01-14T15:08:00.000Z",
            "message": "\nMeaghan\nthat would be great, any progress at all would be amazing\n\n"
        },
        {
            "from": "David",
            "time": "2010-01-16T22:54:00.000Z",
            "message": "\nDavid\nNow that I'm actually on Facebook (and not from my phone) I shall officially reply that I am interested in helping. I'll be happy to help with more than one event, and may require that bribe, depending upon what it is. \n\n"
        }
    ]
}