{
    "thread": "https://www.facebook.com/messages/archived/t/378489345494909",
    "participants": [
        {
            "name": "Alison Sullivan",
            "description": "Studied at The University of Arizona",
            "url": "Studied at Saint louis college of pharmacy"
        },
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Ryan",
            "time": "2012-03-01T20:25:00.000Z",
            "message": "\nRyan\nOK, friends.  It’s that time of year again.  I’m starting to come up with ridiculous ideas for what to do on my birthday.  I just learned about an even on my birthday weekend (weekend of July 28th-9th) called “California Extreme” (www.caextreme.org).  In short, it is an event where a huge amount of classic arcade game and pinball machine collectors come together, set their machines on free to play, and let people go nuts.  There are also speakers and other assorted events.  Looking at the list from last year, there were probably in excess of 500 machines at the event.  \n\nMy goal is to go for the weekend (plus possibly the Friday before and / or Monday afterwards), hang out in California (probably go to the beach at least once), drink a lot, and play a shitload of arcade games.  If this sounds like fun, I want YOU to join me in this adventure.  Read on below.\n\nFor those of you that are still with me, consider this an interest check.  Now for the details:  The event itself is $60 for the weekend (Saturday and Sunday).  Considering I’ve spent more in arcades in the span of a few hours, this seems pretty sweet.  It takes place at the Hyatt Regency Santa Clara, and a block of rooms are reserved for the event at a rate of $87 a night.  Hyatt Regencies are usually pretty spacious, so with 2 queen beds and possibly couch / air mattress room, I figure we could fit a car’s worth of people in each room pretty comfortably.  That brings rooms to about $20 a person, per night.  \n\nThe only costs aside from this I foresee are going to be splitting gas, food, and booze / entertainment.   I’m expecting the total cost to be between $200 and $250 for 3 days-ish.\n\nNow, what I need from you:  Let me know if you are interested.  If so, what days do you want to go?  4 day weekend?  3 day (adding either Friday or Monday)? Just two?  Let me know when you think you’ll be able to commit one way or the other, so I can start thinking about room reservations.  That’s really all the planning that is required.  Tickets will go up for pre-sale soon, but you can also get them at the door for the same price (just with a longer line).\n\nI'm probably forgetting to send this to a bunch of people; if you can think of someone I forgot to send this to, or someone you'd like to invite, pass it along.  Hopefully this idea pans out, this looks like it could be a lot of fun.  Hope to see you all there!\n"
        },
        {
            "from": "Teresa",
            "time": "2012-03-02T01:55:00.000Z",
            "message": "\nTeresa\nHi Ryan, this sounds quite enticing, especially as a CA resident. But I have already committed to Defcon\n\n"
        },
        {
            "from": "Brian",
            "time": "2012-03-02T01:55:00.000Z",
            "message": "Brian\nOh yeah, same here.\n"
        },
        {
            "from": "Ryan",
            "time": "2012-03-02T01:55:00.000Z",
            "message": "\nRyan\n...fucking defcon.\n"
        },
        {
            "from": "Ryan",
            "time": "2012-03-02T01:55:00.000Z",
            "message": "\nRyan\nThere goes that plan, since 3/4 of the people I would invite will be at defcon. re-assessing plans, then.\n\n"
        },
        {
            "from": "",
            "time": "2012-03-04T06:13:00.000Z",
            "message": "Joanna Street left the group."
        },
        {
            "from": "Michael",
            "time": "2012-03-04T16:51:00.000Z",
            "message": "\nMichael\nLooks pretty sweet,  but yeah Defcon \n\n"
        },
        {
            "from": "",
            "time": "2012-03-04T20:16:00.000Z",
            "message": "Tommy Petrola left the group."
        }
    ]
}