{
    "thread": "https://www.facebook.com/messages/archived/t/379389681082",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        },
        {
            "name": "Brian Koegle",
            "description": "Partner at Poole & Shaffery, LLP",
            "url": "Studied Economics and Psychology at The Ohio State University"
        }
    ],
    "messages": [
        {
            "from": "Wendy",
            "time": "2010-03-06T11:59:00.000Z",
            "message": "\nWendy\nHey guys, this message was sent to me from Jim so I am passing it on to you all. PLease pass this on to others I have missed. Let me know what works for you all.\nWendy\n\n\nFrom Jim:\nHey there, I have been working on a new date for the reunion due the conflict with the (Lee) wedding. \nI was considering taking a poll to see what date would work best. My thinking was this. We could do it 4th of July weekend again or right after Thanksgiving on the weekend of December 4th and 5th. July 4th is on a Sunday this year. So, assuming Saturday would be the main event day, it would be on July 3rd. Using that same logic December 4th would be the other date. I usually advertise 2 days. Saturday and Sunday.\nOne thing to note is the relatives in Ireland have expressed an interest in coming. I have relayed all the information above to them and am awaiting a response. I also left open the possibility of leaving the dates as is, that being August 6,7, and 8th.\nIf you could ask around that would be a huge help. None of the dates above are set in stone either. My summer and fall are pretty wide open at this point\nSee if you can get any feedback for me. Thanks.\n\n"
        },
        {
            "from": "C.p.",
            "time": "2010-03-06T15:55:00.000Z",
            "message": "\nC.p.\nA chat with the cousins is looking like July 4th is going to work best for them.\nSo, just think - you will get to me the relations from Ireland!\nI sent Jim a message about this.\nI shall be in Ireland in two weeks for a visit - so I shall let you know more after that.\n\nTake care.\n\nC.P.\n\n"
        }
    ]
}