{
    "thread": "https://www.facebook.com/messages/archived/t/595723130589983",
    "participants": [
        {
            "name": "pencil\nEdit Nickname\nBrian Cullinan\n(Megamind)",
            "description": "Quasi-dimensional Being at Earth",
            "url": "Followed by 30 people"
        }
    ],
    "messages": [
        {
            "from": "Facebook User",
            "time": "2010-11-25T05:35:00.000Z",
            "message": "\nFacebook User\nI'm realizing that the Monday after Thanksgiving may still be a travel day for some people. If it would work better for people, we can move it to Tuesday. Monday doesn't have any special significance and I would like as many people to come as possible.\n\nAll of you please let me know if Tuesday would work better or worse for you.\n\n-- Jessica\n"
        },
        {
            "from": "Facebook User",
            "time": "2010-11-29T01:58:00.000Z",
            "message": "\nFacebook User\nPlease note that the party has been officially moved to Tuesday.\n"
        },
        {
            "from": "Facebook User",
            "time": "2010-11-30T08:53:00.000Z",
            "message": "\nFacebook User\nUm, guys, I have terrible news. So, Dave has decided he has a shit-ton of work to do and it may be hard to convince him to come out at all Tuesday night.\n\nSeriously.\n\nAnd, since it is true that he has a shit-ton of work to do, I would feel guilty tricking him into it.\n\nSo, uh, it's looking like this bitch may have to move to later in the week. For reals. \n\nIt is still possible, though, that he may be able to come out Tuesday night, after all. I have expressed to him that I would like to receive such information as soon as possible.\n\nI would greatly appreciate all of your flexibility in this matter and am greatly regretful of the turn this all has taken. Please let me know what days would be best in the likely event of another rescheduling. Thursday is best for me, but Wednesday or sometime over the weekend would work as well.\n\nGod damn.\n"
        },
        {
            "from": "Facebook User",
            "time": "2010-11-30T19:48:00.000Z",
            "message": "\nFacebook User\nI have confirmed with David plans to come hang out tonight!  It's not too late for him to blow me off, but lets get together early enough to surprise him, I will get confirmation from Jessica but 7-8 should be early enough.\n\n"
        }
    ]
}