{
    "thread": "/messaging/thread/5993459082231586816/",
    "participants": [
        {
            "name": "Heather Morton",
            "title": "Sr. Technical Recruiter at Strategic Staffing Solutions",
            "url": "linkedin.com/in/heatheratultimatestaffing",
            "phone": "480-773-6792 (Home)",
            "email": "hmorton@strategicstaff.com"
        }
    ],
    "messages": [
        {
            "from": "Heather Morton",
            "message": "Urgent  .Net Position\nhmorton@vaco.com",
            "time": "2015-04-13T12:00:00.000Z"
        },
        {
            "from": "",
            "message": "",
            "time": "2017-10-06T20:04:00.000Z"
        },
        {
            "from": "Heather Morton",
            "message": ">On May 14/2015 1:04PM, Brian Cullinan wrote:\n>Thank you for your interest, \n> \n> I have been developing software since I was only 11 years old. I started in VB4 and explored .Net since it's inception. Later I honed my skills on the web with PHP and JavaScript. I enjoy all forms of software development and computer administration. In previous positions a 6 month salary review has worked well, as it gives us both a chance to show what we are made of, without breaking the bank. I have a lot of experience with start-ups, so I am no stranger to bringing new products and technologies to market in a controlled environment. I would enjoy a change to meet more of the team. For reference, I would be looking in the ballpark of $180k. Thank you. \n> \n> -Brian \n> \n> On 4/13/15 7:06 PM, Heather M. wrote: \t \n> --------------------\n> Hi Brian,\n> \n> I came across your profile and I was very impressed by your background. I have a direct-hire . Net position located in Chandler. Please let me know if you or anyone you know would be interested in the position. I look forward to hearing from you. \n> \n> \n> Required qualifications\n> •\t5+ years of experience developing applications in C# .NET\n> •\tSenior-level experience in the following areas:\n> o\tVisual Studio (2010, 2012, or 2013)\n> o\tMobile Application Development \n> o\tASP.NET MVC\n> o\t.NET Framework version 4.0 or greater\n> •\tExperience developing in the presentation, business logic, and data access tiers\n> •\tExperience in a Microsoft-centric development environment \n> •\tBachelor of Science degree in related field or equivalent experience \n> •\tAbility to work in a dynamic environment with fast paced development life cycles and changing requirements\n> •\tAbility to effectively communicate complex technical concepts in easily understood business terms\n> •\tAbility to work effectively with other teams and vendors\n> •\tAbility to create clear, concise, and accurate documentation\n> •\tProactive style showing the motivation to respond quickly to business needs\n> •\tStrong desire to learn and apply the latest technologies\n> \n> Desired Technical Skills:\n> •\t2+ years of experience developing applications in iOS, Android, or Xamarin\n> •\tOpenGL ES experience a plus\n> •\tExperience developing e-commerce applications\n> •\tProfessional Microsoft training and certifications\n> \n> Additional Skills & Competencies:\n> •\tExcellent interpersonal and organization skills\n> •\tMust be a self-starter who requires minimal supervision \n> •\tAbility to come up with the best solution for given requirements\n> Ability to provide reasonably accurate estimates for projects\n> \n> \n> \n> \n> Heather Morton\n> Sr. Technical Recruiter\n> 3131 E Camelback Rd Suite 212\n> Phoenix, AZ 85016\n> \nhmorton@vaco.com",
            "time": "2017-10-06T20:04:00.000Z"
        },
        {
            "from": "Heather Morton",
            "message": "hmorton@vaco.com",
            "time": "2017-10-06T20:35:00.000Z"
        },
        {
            "from": "",
            "message": "If you get into some bigger picture positions please feel free to write me again.",
            "time": "2017-10-06T20:41:00.000Z"
        }
    ]
}