{
    "thread": "/messaging/thread/6047895449023635456/",
    "participants": [
        {
            "name": "Thomas Blondi",
            "title": "Chief Revenue Officer, Coolfire Solutions",
            "url": "linkedin.com/in/thomasblondi",
            "phone": "",
            "email": "tomblondi@cox.net"
        }
    ],
    "messages": [
        {
            "from": "",
            "message": "I have a friend and he somehow comes upon these business ideas.  He keeps talking about ESRI and Uberfying the freight industry and I thought you said you were involved with something about delivery and fulfillment out of the pacific northwest but now in Phoenix.  Does any of that sound familiar?",
            "time": "2017-10-30T00:17:00.000Z"
        },
        {
            "from": "Thomas Blondi",
            "message": "Yep... It's called deliver it.",
            "time": "2017-10-30T00:18:00.000Z"
        },
        {
            "from": "",
            "message": "This guy wants to use ESRI to find people who need a delivery close to your \"Google Maps\" route and allow someone who is traveling to pick up someone else's package and deliver to the destination only if it is close to your route.  Do you think it would be worth making a connection?  He said they have applied for the ESRI Start Up competition for free software for 3 years.  Part of their application is verifying that there are no competitors, but I thought they could join forces.",
            "time": "2017-10-30T00:18:00.000Z"
        },
        {
            "from": "",
            "message": "He is kind of a pussy.  As soon as I mentioned someone else working on innovating shipping, he shut me down immediately.  \"No one else is doing this, don't tell anyone about it because its such an amazing idea.\"  More importantly, how to you put people together to build something \"innovative\" with that attitude?  How do you manage your way around it?  Everyone thinks their idea is THE GREATEST EVER, but we know that 1000 other people out of 7 billion had the exact same idea.  Innovation is just a minor logical progression, but its found by putting effective people together.  How do you manage this from my position?  He also asked me to help write the software interface, so he literally has nothing but thinks he has everything.",
            "time": "2017-10-30T00:18:00.000Z"
        },
        {
            "from": "",
            "message": "https://www.linkedin.com/in/brian-houston-8074a47",
            "time": "2017-10-30T21:19:00.000Z"
        },
        {
            "from": "Thomas Blondi",
            "message": "yep....he's been trying to get that thing going for years. Lloyd helped him a bit but he stopped paying Lloyd so he left...dangerous territory...your assessment is spot on, Brian.",
            "time": "2017-10-30T21:46:00.000Z"
        },
        {
            "from": "",
            "message": "Mindset is everything - Bill Gates",
            "time": "2017-10-30T21:50:00.000Z"
        }
    ]
}