{
    "thread": "/messaging/thread/6185202539332460544/",
    "participants": [
        {
            "name": "Joshua Grosso",
            "title": "Software Developer at Axosoft",
            "url": "linkedin.com/in/joshuagrosso",
            "phone": "",
            "email": "jgrosso1@asu.edu"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "time": "2017-09-23T21:52:00.000Z",
            "message": "Nice job moving up! Axosoft should be excellent!\n"
        },
        {
            "from": "Me",
            "time": "2017-09-23T21:52:00.000Z",
            "message": "What have you been up to?\n"
        },
        {
            "from": "Me",
            "time": "2017-09-23T21:52:00.000Z",
            "message": "Are they still doing Free Lunch Friday? I haven't seen anything on eventbrite.\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-09-26T14:38:00.000Z",
            "message": "Good to hear from you! I love Axosoft... it's a great place to spend my time before I apply to college next year (I decided to take 3 gap years, which would make me 18 when I attend).\nNowadays, they cater Mondays and Wednesdays; just out of curiosity, how'd you know about Free Lunch Fridays (did you use to work there)?\nWhat are you up to these days (how's StudySauce)?\nBy the way, sorry for the delayed reply; I was out of town until last night.\n"
        },
        {
            "from": "Me",
            "time": "2017-09-26T17:02:00.000Z",
            "message": "No problem buddy. I saw you looked at my profile because I'm using the LinkedIn trial period. Everything at dynamynd look accurate and not too padded? ;) I use to go to FLF, heard about from another CEO friend. Got laid off from study sauce. Schools move too slow for startups so he's putting it on the back burner. No hard feelings, just a little annoyed I have to apply for jobs now. 3 gaps years sounds amazing. If this is what you want to do it is just as good as a high school experience. You're ahead of your time! I am trying not to rush in to any jobs. Interviews would be fun though. I had this idea to write a script and form a few different versions of a cover letter and manage my network on linked in using automation and IBM LanguageAlchemy. I would probably apply to 1000 places. We'll see. Glad you like axosoft, the chief there is awesome.\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-09-27T00:00:00.000Z",
            "message": "Oops... didn't mean to send that.... (never used that before)\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-09-27T00:00:00.000Z",
            "message": "(ASIDE: I wonder why LinkedIn provides built-in gifs?)\n"
        },
        {
            "from": "Me",
            "time": "2017-09-27T00:06:00.000Z",
            "message": "Lol nice. I didn't know it did that either.\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-09-27T00:16:00.000Z",
            "message": "Anyways, let me know if LinkedIn Premium is worth it :)\nInterestingly, I don't think the free lunches are open anymore (I think it's only for Axosoft employees). I really like Axosoft (and the GitKraken team in particular); are you thinking of applying there?\nSorry to hear about StudySauce.... I was worried when I resigned from Dynamynd that I wouldn't find another position right away, but a programmer I met at a meetup (Functional First Phoenix) recommended me for an internship, and I'm so much happier there. So, I'm sure something even better will come along for you too!\nI'm really enjoying being able to do what I love all day and learning from other programmers (and I'm learning a tremendous amount about the real world), so I agree that it's been a really great experience. Also, this way I'll be the same age as all the other freshmen when I start college....\nThe cover letter and text analysis idea sounds great, and I hope you get some cool offers (it does seem like a definite advantage being able to apply to a much larger number of companies than if you were to do it all manually).\nJust out of curiosity, do you ever go to meetups? Functional First Phoenix is a good one if you're interested in learning about functional programming... Also, in case it's not already on your radar, Desert Code Camp is coming up soon; maybe I'll see you there?\nB\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-09-27T00:16:00.000Z",
            "message": "*By chief, do you mean Lawdan or Hamid Shojaee? (Either way, they're great people!)\n"
        },
        {
            "from": "Me",
            "time": "2017-09-27T00:22:00.000Z",
            "message": "I was never inspired to pay for LinkedIn either. Still not pretty sure. I think I've met Lawden but he wouldn't remember me. I'll have to check out functional first Phoenix. I used to go to OWASP meetings at the school. You should definitely go to those if you want to learn more about application security. They were huge for me I've just been so out of it because I worked from home all the time. I sent axosoft a resume but these things can take months.\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-09-27T00:52:00.000Z",
            "message": "Sounds good! Keep in touch, and maybe I'll see you at FFP!\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-09-27T00:52:00.000Z",
            "message": "I'll look into OWASP... thanks for mentioning it!\n"
        },
        {
            "from": "Me",
            "time": "2017-10-07T00:45:00.000Z",
            "message": "Would you work at General Dynamics or HEAT Software or Orion Health or PNNL or Amazon?\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-10-07T01:41:00.000Z",
            "message": "Amazon's done some really cool stuff recently (I'm not familiar with the others, apart from General Dynamics).... So in a perfect world, I'd choose Amazon ;)\n"
        },
        {
            "from": "Me",
            "time": "2017-10-07T02:13:00.000Z",
            "message": "Ha. PNNL is probably the best choice for education if you are in to research. Amazon works people like dogs, but I think they would be a good choice too. General Dynamics is always doing something cool, and Orion is out of New Zealand, possible trip opportunity, and they are coordination treatment plans for health directly with doctors. Healthcare needs disruption. I think all of these are disruptive. I'll work on my contact at Amazon.\n"
        },
        {
            "from": "Me",
            "time": "2017-10-10T19:56:00.000Z",
            "message": "Meeting tomorrow?\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-10-10T20:21:00.000Z",
            "message": "Oh, I forgot Functional First Phoenix was tomorrow! I'll definitely be there... it'll be cool to catch up!\n"
        },
        {
            "from": "Me",
            "time": "2017-10-10T20:23:00.000Z",
            "message": "Yeah, good times. I have so much more information for you :)\n"
        },
        {
            "from": "Me",
            "time": "2017-10-20T00:35:00.000Z",
            "message": "What do you think of this? Too colorful?\n"
        },
        {
            "from": "Me",
            "time": "2017-10-21T04:51:00.000Z",
            "message": "Can I introduce you to a recruiter?\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-10-22T21:07:00.000Z",
            "message": "For Quick Starts (to use some KOLBE terminology), I'm sure they'd absolutely love it (my mom, for example, thinks color-coding like this is really easy to understand and helps it stand out); personally, I'm not a Quick Start, so I find it a bit overwhelming ;) However, depending on your audience, I'd think they might think it's really clear and clever (if nothing else, it'll certainly set your resume apart from the rest and show your creativity).\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-10-22T21:07:00.000Z",
            "message": "Thank you so much for thinking of me... while I'm very happy at Axosoft, I'm sure it wouldn't hurt to get a sense of what's out there for the future!\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-10-22T21:07:00.000Z",
            "message": "By the way, not sure if you're familiar with it, but Startup Weekend seems cool (there's an event in Phoenix in November)... like a hack-a-thon but for the entire product development spectrum (at least, that's how I understood it from the webpage).\n"
        },
        {
            "from": "Me",
            "time": "2017-10-23T01:09:00.000Z",
            "message": "Lol, it'd OK to call it a startup ;)\n"
        },
        {
            "from": "Me",
            "time": "2017-10-23T01:09:00.000Z",
            "message": "Cool I'll check out startup weekend.\n"
        },
        {
            "from": "Me",
            "time": "2017-10-23T01:09:00.000Z",
            "message": "How many interviews have you done? I've been turned down for 16 positions last week, it's been awesome. These people are saving me from so much headache. I thought you might like to get a few more under your belt. When I get a job from one of these people I will pick out the best one and recommend you. It's good experience to try and justify your abilities to others since a resume is not always enough.\n"
        },
        {
            "from": "Me",
            "time": "2017-10-24T23:13:00.000Z",
            "message": "Possible offer from mindspree.com (Vincent Benjamin) and Arizona Kidney (Decton IT). Assuming talking to recruiters is a huge waste of time, the best part about it is sticking to your convictions and learning terminology and different career directions. You don't have to do anything you don't want to do.\n"
        },
        {
            "from": "Me",
            "time": "2017-10-28T16:52:00.000Z",
            "message": "Did you talk to recruiter? I am working on something $1b more awesome than that. What is your phone number?\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-10-28T16:53:00.000Z",
            "message": "I haven't gotten the chance to talk to Dustin yet... do you think he'll be available this weekend? My phone number is (480) 363-2434.\n"
        },
        {
            "from": "Me",
            "time": "2017-10-28T17:20:00.000Z",
            "message": "Yes, he should pick up this weekend. I am not giving him your phone number. My boss works at Cruise Automation, Google car competitor just got bought by GM, I will try to get you an interview and you can dissect their micro-controllers and LIDAR cameras. They were looking for someone entry level anyways, I haven't heard back.\n"
        },
        {
            "from": "Me",
            "time": "2017-11-08T20:08:00.000Z",
            "message": "Finally getting closer to offers, where would you work, EdTech, Social Marketing, or Charles Schwab?\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-02-25T02:22:00.000Z",
            "message": "Sorry for the delayed reply! How's your search going? (In regards to your question, I'm not entirely sure... it would probably depend on the details of each)\n"
        },
        {
            "from": "Me",
            "time": "2017-02-25T02:37:00.000Z",
            "message": "Oh, I'm never offended. I know you're busy. Got an offer at swiftpage, should be pretty cool. How's class? Want to come to dinner with a bunch of computer scientists Mar 10th?\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-02-25T04:02:00.000Z",
            "message": "Wow, I would love to... unfortunately, I'll be in Budapest (literally)! Good to hear you got an offer from Swiftpage; do you think you're going to take it?\nMy Axosoft internship is going very well and I've recently gotten involved in research at ASU as well.\nWhat's the occasion for dinner? Sounds fun....\n"
        },
        {
            "from": "Me",
            "time": "2017-02-25T06:13:00.000Z",
            "message": "Dinner will be a regular occurrence, I'll remind you for the next one. Good, Axo is going well. I've accepted the offer. I worked at Charles Schwab for two months it sucked. The culture their was I was not allowed to talk to anyone and my managers acted like they had a really big problem but it have a very simple solution.\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-02-27T14:11:00.000Z",
            "message": "Sorry, didn't see this message until now! Sorry you didn't enjoy Charles Schwab (that didn't sound like fun)... hopefully Swiftpage will turn out better!\n"
        },
        {
            "from": "Me",
            "time": "2017-03-15T23:20:00.000Z",
            "message": "Just got a message for a new hire at dynamynd. What state was development in when you left?\n"
        },
        {
            "from": "Joshua Grosso",
            "time": "2017-03-16T12:32:00.000Z",
            "message": "We had just finished it and had been live for about a month... there were some scalability issues, but I don't know what happened because I left soon after.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-09T18:17:00.000Z",
            "message": "Congrats on the new job!\n"
        },
        {
            "from": "Me",
            "time": "2017-07-10T21:15:00.000Z",
            "message": "Congrats on your work anniversary!\n"
        }
    ]
}