{
    "thread": "/messaging/thread/6185200080241377280/",
    "participants": [
        {
            "name": "Dale Moberg",
            "title": "Independent Consultant",
            "url": "linkedin.com/in/dale-moberg-5aaba",
            "phone": null,
            "email": "dale.moberg@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "",
            "message": "Dale, can you introduce me to Scott? \nhttps://www.linkedin.com/in/scottholden",
            "time": "2017-10-05T21:36:00.000Z"
        },
        {
            "from": "Dale Moberg",
            "message": "",
            "time": "2017-10-05T23:09:00.000Z"
        },
        {
            "from": "",
            "message": "All of those.",
            "time": "2017-10-05T23:09:00.000Z"
        },
        {
            "from": "",
            "message": "I can provide examples for most of those. Misting and temperature and humidity control over IoT. Finger tracked touch surface using OpenCV, rebuilt entire radio station from ground up for A/V, wrote iOS app and back end content management system for \nstudysauce.com\n (2500+ users).",
            "time": "2017-10-05T23:15:00.000Z"
        },
        {
            "from": "Dale Moberg",
            "message": "Can you arrange all of the things under IOT? That may get you an interview. Shot gun approach might be interpreted as lack of focus on career objectives. How about a reference saying IOT and its applications (to mobile, web, interfaces and notifications)?  Once you get to talk they can match you to their internal needs....",
            "time": "2017-10-05T23:32:00.000Z"
        },
        {
            "from": "",
            "message": "Yeah IoT would be accurate, I should rearrange my profile on LinkedIn?",
            "time": "2016-09-24T12:00:00.000Z"
        },
        {
            "from": "",
            "message": "Would Scott Holden be interested in walking me through some things?  I thought my resume looked kind of nice.",
            "time": "2017-10-05T00:59:00.000Z"
        },
        {
            "from": "Dale Moberg",
            "message": "I am uncertain how much a recruiter gets involved in doing that.They generally are looking to build a list for their customers, HR departments.\nI will try an IOT angle on an introduction. Good luck",
            "time": "2017-10-05T10:58:00.000Z"
        },
        {
            "from": "",
            "message": "",
            "time": "2016-10-02T12:00:00.000Z"
        },
        {
            "from": "Dale Moberg",
            "message": "Hi Brian.  Here is an introduction to Scott Holden. Scott-Brian is interested in opportunities involving IOT and web applications -- I am hoping you can help him out!",
            "time": "2017-10-05T18:23:00.000Z"
        },
        {
            "from": "",
            "message": "Thank you!",
            "time": "2016-10-03T12:00:00.000Z"
        },
        {
            "from": "",
            "message": "Gail referred me to Scott too.  What a brilliant impression he's made!",
            "time": "2017-10-05T18:12:00.000Z"
        }
    ]
}