{
    "thread": "/messaging/thread/6193844124198723585/",
    "participants": [
        {
            "name": "Dale Moberg",
            "title": "Independent Consultant",
            "url": "linkedin.com/in/dale-moberg-5aaba",
            "phone": null,
            "email": "dale.moberg@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "",
            "message": "Had a technical interview at Orion despite the referral they still have not emailed me back.  This is rudeness for the second time I have reached out.  I hope you apply somewhere new soon, \"[happy employees make the best candidates]\" - Lou Adler  :)",
            "time": "2017-10-04T18:05:00.000Z"
        },
        {
            "from": "Dale Moberg",
            "message": "Sorry to hear of your troubles with HR. Relatively few people are asked for tech interviews. That means you go a shot.  It could be that the position is not perfect for you or that someone else looks better on paper or maybe they have not made up their mind. And so on. Orionhealth is far from an ideal place to work in many ways, and their HR program had almost everyone quit eruing the last reorganization. I have been working remotely from NY the last month. Just got back. Sorry for delays.",
            "time": "2017-10-04T22:33:00.000Z"
        },
        {
            "from": "",
            "message": "I've already been declined without explanation. I am sorely lacking feedback.",
            "time": "2017-10-04T01:31:00.000Z"
        },
        {
            "from": "Dale Moberg",
            "message": "Congrats on the new role! Hope you're doing well.",
            "time": "2017-10-04T18:01:00.000Z"
        },
        {
            "from": "",
            "message": "Ha, generic! :P I am going to write an AI to do that better. Thank you!",
            "time": "2017-10-04T18:03:00.000Z"
        },
        {
            "from": "Dale Moberg",
            "message": "hey Brian The hostility and sarcasm are uncalled for. I have no idea what position you applied for but it is conceivable that it is one that you would fail at without extensive java skills or background in biomedical informatics. I am not a hiriing or HR person and I am not consulted very often (only when candidates have PhDs) on hiring. So get it out of your head that I could have helped you and failed you in some way. Thank you.",
            "time": "2017-11-04T01:41:00.000Z"
        },
        {
            "from": "",
            "message": "Very interesting. I was more excited that I am not the only one that just clicks the send with LinkedIn when I see those suggestions with people's updates. I am still trying to figure out how social networking thing works. I understood what you are expressing from your previous message. But more importantly now I understand how much this weighs on your mind. I will never stop job hunting again. Even though I can make it through the next few months, just by speaking to people hiring I can gain insight in to their ambitions and absorb new information faster. If you detected any hostility it is from the hiring process in general. They are not asking hard enough questions nor do these questions exercise a person's cognitive abilities. I feel sorry for Orion because using Java and Indian workers is depriving them of advanced talent.",
            "time": "2017-11-04T01:41:00.000Z"
        },
        {
            "from": "",
            "message": "A world without sarcasm sounds boring because it's more honest and takes less time to understand someone.",
            "time": "2017-11-04T01:41:00.000Z"
        },
        {
            "from": "",
            "message": "Sounds to me like you wish you could do more. I feel that every day and I am 30? Years younger.",
            "time": "2017-11-04T01:41:00.000Z"
        },
        {
            "from": "",
            "message": "\"[couldn't have helped]\" will never sit well with me. Not for my gain, I really don't care, everything will happen as it is anyways. I am worried about your mindset.",
            "time": "2017-10-04T02:03:00.000Z"
        },
        {
            "from": "Dale Moberg",
            "message": "Rodriguez",
            "time": "2017-10-04T02:03:00.000Z"
        },
        {
            "from": "Dale Moberg",
            "message": "Tldr",
            "time": "2017-10-04T02:15:00.000Z"
        },
        {
            "from": "",
            "message": "Same same",
            "time": "2017-10-04T02:15:00.000Z"
        },
        {
            "from": "",
            "message": "+1 all of my skills?",
            "time": "2017-10-04T02:47:00.000Z"
        }
    ]
}