{
    "thread": "/messaging/thread/6193938426488774656/",
    "participants": [
        {
            "name": "Sarah Hallahan",
            "title": "Manager, Technical Talent Aquisition",
            "url": "linkedin.com/in/sarahjeanhallahan",
            "phone": null,
            "email": "sarah.hallahan@adroll.com"
        }
    ],
    "messages": [
        {
            "from": "",
            "message": "",
            "time": "2017-10-05T00:19:00.000Z"
        },
        {
            "from": "",
            "message": "",
            "time": "2017-10-05T00:19:00.000Z"
        },
        {
            "from": "",
            "message": "Thanks for the connect!",
            "time": "2017-10-05T00:21:00.000Z"
        },
        {
            "from": "Sarah Hallahan",
            "message": "",
            "time": "2017-10-05T00:25:00.000Z"
        },
        {
            "from": "",
            "message": "I think screening could be handled by AI asking questions about a person instead of the long application with many fields. I am just expressing what I do. By asking questions I help recruiters learn about me and in turn learn what is important to them. It was more in reference to my own practice. But that is a sign you took it so personally ;) What is your experience with recruiting software?",
            "time": "2017-10-05T00:25:00.000Z"
        },
        {
            "from": "",
            "message": "What do you think of this?",
            "time": "2016-10-19T12:00:00.000Z"
        },
        {
            "from": "",
            "message": "",
            "time": "2017-10-05T22:45:00.000Z"
        },
        {
            "from": "Sarah Hallahan",
            "message": "",
            "time": "2017-10-05T17:49:00.000Z"
        },
        {
            "from": "",
            "message": "Sure I became interested in this conversation because of your job function stated on linked in \"building the recruiting function\". Maybe I don't understand what that means but I was just wondering if you had considered the option of using chatbots for recruiting? Do you think my resume is too colorful?",
            "time": "2017-10-05T18:13:00.000Z"
        },
        {
            "from": "Sarah Hallahan",
            "message": "Ah - I have to update my headline. Perhaps optimising is a better word for now. To be honest, haven't thought of chatbots. I've noticed a trend of people preferring to be on the phone with people from our company to learn more and get a sense of vibe and culture. With regard to the colours, it was eye-catching but understanding the key and how you're using the color schema takes quite a few seconds. it doesn't help for a quick scan if that makes sense.",
            "time": "2017-10-05T18:32:00.000Z"
        },
        {
            "from": "",
            "message": "That makes sense.  How have you optimized?  I see a lot of problems.  Like just the other day I was screened out because I answered a combined question on whether I am able to relocate.  Are you reading PDFs in an OCR way?  I guess I initially started this thread with the thinking that every company wants to ask questions based on what I know or talk about what their company does, very few recruiters actually ask what do I want to accomplish.",
            "time": "2017-10-05T18:34:00.000Z"
        },
        {
            "from": "Sarah Hallahan",
            "message": "My first couple of questions for anyone is 1) why are they interested in chatting and what do they want to gain form the call and then 2) if they could craft their ideal role and write their own JD, what would it be. I want to make sure what people want is aligned with what we can offer. Not many recruiters fill roles with a view to retention and best fit. As a candidate, speaking to a recruiter who cares about your interests is a good way to weed out good recruiters from those focused on just filling roles. Unfortunately good recruiters are hard to find and as a result so many hiring practices in companies are very flawed. We're not perfect either but we're working on it.",
            "time": "2017-10-05T18:57:00.000Z"
        },
        {
            "from": "",
            "message": "Wow. I wish more people had your insight. Good questions.",
            "time": "2017-10-05T18:59:00.000Z"
        },
        {
            "from": "Sarah Hallahan",
            "message": "I'm glad you like them :-) Let me know if there's ever anything recruiting related that I can give you more insight on :-)",
            "time": "2017-10-05T05:31:00.000Z"
        },
        {
            "from": "",
            "message": "Do you use Bullhorn?",
            "time": "2017-10-05T05:56:00.000Z"
        },
        {
            "from": "Sarah Hallahan",
            "message": "Tried it briefly - wasn't impressed",
            "time": "2017-10-05T16:31:00.000Z"
        },
        {
            "from": "",
            "message": "What do you use at work?",
            "time": "2017-10-05T16:43:00.000Z"
        }
    ]
}