{
    "thread": "/messaging/thread/6194938161769046016/",
    "participants": [
        {
            "name": "Jessa Vatistas",
            "title": "Founder / Technology Sniper Recruiter; Strategic Talent Acquisition & Growth Ops",
            "url": "linkedin.com/in/jessavatistas",
            "phone": null,
            "email": "jessa@moxierecruiting.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "time": "2017-10-20T18:36:00.000Z",
            "message": "Congrats on the anniversary! You have a really awesome job title. I would love to know more. What do you do in NLP? Do you like Darren Brown?\n"
        },
        {
            "from": "Me",
            "time": "2017-10-20T18:36:00.000Z",
            "message": "Would you have a use for someone like this?\n"
        },
        {
            "from": "Jessa Vatistas",
            "time": "2017-03-17T17:03:00.000Z",
            "message": "Wizard's lives matter!\n"
        },
        {
            "from": "Jessa Vatistas",
            "time": "2017-03-17T17:03:00.000Z",
            "message": "Hey Brian, have a few rare local job opportunities in development right now. Want to hear about them? Get right back to me if so because I'm scheduling interviews now. And, happy St Patty's! 🍀\n"
        },
        {
            "from": "Me",
            "time": "2017-03-22T18:38:00.000Z",
            "message": "How are the jobs?\n"
        },
        {
            "from": "Jessa Vatistas",
            "time": "2017-03-22T22:19:00.000Z",
            "message": "They are all awesome. Want to check them out? Superbly fit for a wizard like yourself. There's one company in particular I think you'd find interesting.. the PHP developer role (don't worry about the Ruby if you don't use it)\n"
        },
        {
            "from": "Me",
            "time": "2017-03-22T22:21:00.000Z",
            "message": "I've done a little Ruby.\n"
        },
        {
            "from": "Jessa Vatistas",
            "time": "2017-03-22T23:27:00.000Z",
            "message": "Do you want to look into any of these opportunities?\n"
        },
        {
            "from": "Jessa Vatistas",
            "time": "2017-03-22T23:27:00.000Z",
            "message": "Or want more info on any?\n"
        },
        {
            "from": "Me",
            "time": "2017-03-22T23:31:00.000Z",
            "message": "I couldn't download the PDF yet. I just started here at swiftpage so it might be a little while, I just like talking to people.\n"
        },
        {
            "from": "Jessa Vatistas",
            "time": "2017-03-23T00:24:00.000Z",
            "message": "Oh ok, no worries. Making strong connections that could be of potential benefit in the future is what it's all about. Kinda sucks for me (my line of work), but it makes me happy to hear that so many people are happy with their jobs/employers. That's how it should be. How'd you get the job at Swift btw? Their recruiter, 3rd party recruiter, apply online?\n"
        },
        {
            "from": "Me",
            "time": "2017-03-23T00:35:00.000Z",
            "message": "Robert half\n"
        },
        {
            "from": "Me",
            "time": "2017-03-23T00:35:00.000Z",
            "message": "I met her over LinkedIn and told her no one likes working with me. Of course I like this new job and they really like me. It will be fun when they figure out what I am capable of.\n"
        },
        {
            "from": "Jessa Vatistas",
            "time": "2017-03-23T05:37:00.000Z",
            "message": "..and what would that be\n"
        },
        {
            "from": "Me",
            "time": "2017-03-24T15:41:00.000Z",
            "message": "This week I built a prototype for a new purchase page, not I just have to sell it to the marketing product manager. I solved 4 critical issues on another legacy code base. One guy from work started asking me for help and new information, so I am learning to be a good leader. Today, I'll probably start a new side business, finish my prototype buy funnel for work, help DevOps manage the influx of pull requests, review my notes from last week and make sure they make it in to the prototype.\n"
        },
        {
            "from": "Me",
            "time": "2017-03-24T15:41:00.000Z",
            "message": "How did your week turn out?\n"
        }
    ]
}