{
    "thread": "/messaging/thread/6195694924411789314/",
    "participants": [
        {
            "name": "Michelle Walsh",
            "title": "Senior Talent Acquisition Advisor | Recruitment Consultant | Headhunter | Global Technology",
            "url": "linkedin.com/in/walshmichelle",
            "phone": "+1 514 566 8600 (Work)",
            "email": "mwalsh123@sympatico.ca"
        }
    ],
    "messages": [
        {
            "from": "Michelle Walsh",
            "message": "Hi Brian - Thank you. I see that you just started at your job.  How's that going?  Maybe you can recommend a Full Stack Developer for my small online services client?  They are looking for someone with Java experience, working in an agile environment.  It is the first IT role that I have ever recruited for...so please overlook any mistakes I make in describing the role.  The client has a dominant lead in their niche service offering.  The team is young and super positive.  Finding like-minded team members is important for them.  If you have any ideas would love to hear back from you.  Have a great weekend!  Michelle",
            "time": "2017-10-05T20:39:00.000Z"
        },
        {
            "from": "",
            "message": "I am actually on the market again. This job was 3 years ago and it was totally awesome the entire time.",
            "time": "2017-10-05T01:10:00.000Z"
        },
        {
            "from": "Michelle Walsh",
            "message": "Hi Brian - Great.  I just sent you job details to your gmail address.  If it sounds like it would be of interest to you please send your CV in reply to the e-mail and we will schedule a call this week.  thank you - Michelle",
            "time": "2017-10-05T12:42:00.000Z"
        },
        {
            "from": "",
            "message": "I haven't seen a job description.  Sorry I meant to send this last night with the last message.  Here is an updated copy of my resume:",
            "time": "2017-10-05T16:58:00.000Z"
        },
        {
            "from": "Michelle Walsh",
            "message": "Hi Brian - I sent it to \nmegamindbrian@gmail.com\n which is the address on your profile.  But let's see if I can copy and paste it here!  I think you have a great profile for our client.  Would you be available to speak tomorrow, Monday?  I would like to call you at 11 a.m. or 12 noon Phoenix time if that works for you.  thanks! Michelle",
            "time": "2017-10-05T16:58:00.000Z"
        },
        {
            "from": "Michelle Walsh",
            "message": "",
            "time": "2017-10-05T21:51:00.000Z"
        },
        {
            "from": "",
            "message": "I am available at 12 tomorrow.",
            "time": "2016-10-24T12:00:00.000Z"
        },
        {
            "from": "",
            "message": "I am not a Java developer though so it doesn't look like this position will fit.  Thank you anyways.",
            "time": "2017-10-05T00:06:00.000Z"
        },
        {
            "from": "Michelle Walsh",
            "message": "aha.  thank you for your feedback.  I'll let you know if we have something else suitable. have a great week.",
            "time": "2017-10-05T14:05:00.000Z"
        }
    ]
}