{
    "thread": "/messaging/thread/6195285825635311616/",
    "participants": [
        {
            "name": "Antonio Rios",
            "title": "Information Technology Professional",
            "url": "linkedin.com/in/antonioriosjr",
            "phone": null,
            "email": "antonio.rios.jr@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "",
            "message": "Thanks for connecting!",
            "time": "2017-10-04T17:34:00.000Z"
        },
        {
            "from": "Antonio Rios",
            "message": "Hi Brian, you are welcome. Thanks for the request. Hey if you don't mind me asking what made you want to connect with me in linkedin? Are you just connecting with NAU students majoring in computer science or did some of my skills stand out? Thanks, I really appreciate your feedback.",
            "time": "2017-10-04T18:12:00.000Z"
        },
        {
            "from": "",
            "message": "You look like a genius. Are you working for the school as well as attending? NAU is a great place, we are thinking to move back. I would be happy to help more with your profile if you want.",
            "time": "2017-10-04T18:12:00.000Z"
        },
        {
            "from": "",
            "message": "Here is my latest resume.  It is different direction from the typical, so don't take it as a good idea, I am still testing it on recruiters and employers so I can keep you updated.",
            "time": "2017-10-04T18:15:00.000Z"
        },
        {
            "from": "Antonio Rios",
            "message": "I've heard that a lot from friends that I must be some kind of genius, but I honestly don't feel like a genius. Looking at your profile and resume you are the one that looks more like a genius than me you have an extensive amount of skills which looks very impressive. You have way more experience in the areas that I'm interested and I want to work in. I was working for NAU last semester but I moved back to my hometown Yuma, Az. I would definitely like some help improving my profile. I've also been updating my resume, but I haven't test it on recruiters. I like your layout it looks clean, however, I don't understand the Years color section. What does the colors represent?",
            "time": "2017-10-04T18:15:00.000Z"
        },
        {
            "from": "Antonio Rios",
            "message": "",
            "time": "2017-10-04T18:31:00.000Z"
        },
        {
            "from": "",
            "message": "Your resume looks really nice, kind of similar with the 2 column format.",
            "time": "2016-10-23T12:00:00.000Z"
        },
        {
            "from": "",
            "message": "I like the one page format, I think that is the way to go.",
            "time": "2016-10-23T12:00:00.000Z"
        },
        {
            "from": "",
            "message": "This recruiter at Signature Consultants I know is looking for a Java developer if you feel like working in Phoenix.",
            "time": "2016-10-23T12:00:00.000Z"
        },
        {
            "from": "",
            "message": "He bought me dinner.  That was nice.",
            "time": "2016-10-23T12:00:00.000Z"
        },
        {
            "from": "",
            "message": "I like how your resume is half cover letter, that might make more sense, maybe I could reduce my experience based on the job.  Do you know anyone in Phoenix looking for a job?",
            "time": "2017-10-04T23:22:00.000Z"
        },
        {
            "from": "Antonio Rios",
            "message": "Yes, my ex-coworker and friend Matthew Cornell is looking for a System Admin job in Phoenix. He relocated to Tempe, Az like a month or two ago and is looking for a job. He is pretty good with power-shell and overall system administration. I think he is currently helping out a friend with creating some custom vagrant boxes for some wordpress websites that his friend supports. He is pretty smart and has like over 5 or more years of experience dong system administration tasks and tech support for the Arizona Western College Help Desk department.",
            "time": "2016-10-25T12:00:00.000Z"
        },
        {
            "from": "Antonio Rios",
            "message": "At the moment I'm not looking to relocate to Phoenix, but maybe after I'm done with the bachelors degree I might start applying in the Phoenix area.",
            "time": "2017-10-04T05:28:00.000Z"
        },
        {
            "from": "",
            "message": "Would you be able to create a message and include us both?  I have had some success with recruiters getting me face-to-face interviews pretty quickly.",
            "time": "2017-10-04T01:47:00.000Z"
        },
        {
            "from": "Antonio Rios",
            "message": "Hi Brian, sorry for the late reply. I spoke with my friend Matthew and he doesn't have a LinkedIn account. The only thing he gave me was his email address \nMatthew.Cornell@outlook.com\n. Sorry for the inconvenience.",
            "time": "2017-10-04T20:39:00.000Z"
        },
        {
            "from": "",
            "message": "No trouble I was going to pick my best recruiter and refer him. I'll trade resumes if he wants.",
            "time": "2017-10-04T20:53:00.000Z"
        }
    ]
}