{
    "thread": "/messaging/thread/6203224828141453312/",
    "participants": [
        {
            "name": "'Stephan Brewer, CPA, CTRS, JSM Tax",
            "title": "President at Legacy Tax & Resolution Services & He's The Taxman",
            "url": "linkedin.com/in/stephanbrewercpa",
            "phone": "800-829-7483 (Work)",
            "email": "taxguru@hesthetaxman.com"
        }
    ],
    "messages": [
        {
            "from": "'Stephan Brewer, CPA, CTRS, JSM Tax",
            "time": "2017-11-12T15:20:00.000Z",
            "message": "Happy birthday!\n"
        },
        {
            "from": "Me",
            "time": "2017-11-12T18:20:00.000Z",
            "message": "Brilliant! Thank you :)\n"
        },
        {
            "from": "'Stephan Brewer, CPA, CTRS, JSM Tax",
            "time": "2017-11-13T18:37:00.000Z",
            "message": "You're welcome! BTW are you interested in networking through LinkedIn with some people that may be able to refer you new business or provide important connections?\n\nStephan\n"
        },
        {
            "from": "Me",
            "time": "2017-11-13T18:42:00.000Z",
            "message": "Yes absolutely! That is my whole objective. Making positive change is taking me too long. I would love some recommendations. Lots of wheels turning at once. I am learning more about changing policy. I just accepted a job to advance my knowledge of computer security. My wife is going to school for medical aesthetics and runs our Airbnb business. I've done more than most with construction materials and horticulture. What are you thinking?\n"
        },
        {
            "from": "'Stephan Brewer, CPA, CTRS, JSM Tax",
            "time": "2017-11-13T23:05:00.000Z",
            "message": "I would like to introduce to Jayson Hoffer. Jayson Hoffer is a guy you need to meet. Jayson and I have passed 80 referrals back and forth in the past few months. As one of my Referral Partners, we continually helping each other. If you want more clients, he will go through his database to see who he can connect you with. The guy is a wiz with LinkedIn Networking. He will show you some tricks on linkedin.com to generate a massive amount of referrals. He meets over a 1000 people a year for at least an hour to two hours to help them build their business. All he asks is to return his calls and let him show you what he does. He will even see if he can be a client of yours if there is a fit. Meeting with him has generated me already around 40 new potential clients and referral partners. \n\nAs part of our Connector Outreach, we show people how to grow their business and increase their income. We feel if we show you just the tip of the iceberg of what we can do, you will need more of our service. Jayson will help you as long as you make the effort to connect with him, stay in touch, and keep communicating for more referrals. It is in your best interest to connect with him, whatever it takes. He is not just an insurance guy but also a financial advisor so he has higher end clients he can refer you. Jayson’s number is 480-948-6115 and his cell is 480-518-0747 \n\nStephan\n"
        },
        {
            "from": "Me",
            "time": "2017-11-13T23:15:00.000Z",
            "message": "Thank you. I'll reach out tomorrow around noon.\n"
        },
        {
            "from": "Me",
            "time": "2017-11-18T05:35:00.000Z",
            "message": "Jayson is a genius.\n"
        },
        {
            "from": "'Stephan Brewer, CPA, CTRS, JSM Tax",
            "time": "2017-11-18T11:02:00.000Z",
            "message": "Yes he is.\n"
        },
        {
            "from": "Me",
            "time": "2018-01-24T00:40:00.000Z",
            "message": "Congrats on your work anniversary!\n"
        },
        {
            "from": "'Stephan Brewer, CPA, CTRS, JSM Tax",
            "time": "2017-03-05T18:38:00.000Z",
            "message": "Brian,\n\nThank you kindly for viewing my profile. Let me know if there is anything I can do to help you, your organization or someone you know.\n\nSince you are reaching out to me or perhaps even accepted my invitation, you are actively trying to network. As such there are some people you absolutely need to know. These are the people that love to give and receive referrals. These are people that have had a tremendous impact on my success, just by knowing them. Send me a message and I will start making some introductions.\n\nWe also offer an opportunity to become a member of our Affiliate Network where if a referred client engages our services, the Affiliate receives an affiliate compensation of 15% of the gross fee collected. In this case we have an Affiliate Site that is used to make the introduction and allows you to track results of submission and projected payouts.\n.\n\nStephan H. Brewer, CPA, CTRS, JSMc Tax\n\nOffices in Chandler, Scottsdale and Ahwatukee, Arizona\nLas Vegas, Reno and Henderson in Nevada\nSan Antonio, Dallas/Fort Worth and Houston in Texas\nSalt Lake City in Utah\nAlbuquerque In New Mexico\nNew York City in NY\nChicago in IL\nPhiladelphia in PA\nAtlanta in GA\nBoston in MA\nRutherford in NJ\n\nHelping clients all over the world!\nwww.LegacyTaxResolutionServices.com\nmailto:Stephan@hesthetaxman.com\n\nArizona Local Phone: 480-907-6644\nNevada Local Phone: 702-659-9015\nNew Mexico Local Phone: 505-796-6076\nTexas Local Phone: 469-546-9557\nUtah Local Number: 385-355-3223\nNew York Number: 718-732-4177\nChicago Number: 404-566-7930\nPhiladelphia Number: 215-795-3776\nBoston Number: 617-993-0044\nRutherford, NJ Number: 201-450-9700\n\nToll Free 800-829-7483 800-TAX-SITE\nFax 480-248-1588\n"
        },
        {
            "from": "Me",
            "time": "2017-03-05T18:44:00.000Z",
            "message": "Thanks\n"
        },
        {
            "from": "'Stephan Brewer, CPA, CTRS, JSM Tax",
            "time": "2017-03-08T14:44:00.000Z",
            "message": "Congrats on the new job!\n"
        },
        {
            "from": "Me",
            "time": "2017-03-08T18:39:00.000Z",
            "message": "Thank you!\n"
        }
    ]
}