{
    "thread": "/messaging/thread/6209110062955327488/",
    "participants": [
        {
            "name": "Toni Gurrieri",
            "title": "Senior Recruiter/Strategic Accounts at Solu Technology Partners",
            "url": "linkedin.com/in/tonigurrieri",
            "phone": null,
            "email": null
        }
    ],
    "messages": [
        {
            "from": "Toni Gurrieri",
            "message": "Full Stack .Net Developer opportunity in Scottsdale...\n\nHi Brian, \n\nI came across your information today while running a search for .Net Developers and was wondering if you might be on the market for new opportunities. I have a client in the Scottsdale area looking for a mid to senior-level .Net full stack Developer on a 3 month contract to hire basis. The contract portion will last 3 months and then will become permanent. This company offers a very good base salary and benefits.\n\nBenefits:\n\nBonus Structure: This is a % of their base salary, on avg it was 10% of their eligible salary. They received a check in March every year. Merit Increase: this is a written appraisal of their performance and also factors in cost of living adjustments. For the past 30 years they have paid out these increases.\n\nProfit Sharing: This is a corporate payout based on the performance of W.R Berkeley as a whole. This is historically and on average 10-11% of their eligible salary. They are not eligible for profit sharing until they have worked 1,000hours. This amount then goes directly into their 401K. There is also no cap on the profit share amount. \n\nIf this is something you would be interested in hearing more about, please feel free to call me anytime or let me know the best time to reach out to you. \n\nIf this isn’t something you are interested in, but may know someone in your network that would be interested, please feel free to forward my contact information. Let them know to mention your name and if we get them an offer, there is a referral fee in it for you! \n\nThank you and hope to hear back soon.\n\nRegards,\nToni\n\nToni Gurrieri, Senior Recruiter \n480-266-8829 | tgurrieri@solutechnology.com\n",
            "time": "2017-11-28T12:00:00.000Z"
        }
    ]
}