{
    "thread": "/messaging/thread/6212633996254334976/",
    "participants": [
        {
            "name": "Wayne Back",
            "title": "CEO Mahogany Run Delivery, Inc.- Investor & Entrepreneur",
            "url": "linkedin.com/in/wayne-back-9365a77",
            "phone": "858-578-6800 (Work)",
            "email": "wayne@mahoganyrun.net"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2017-12-08T14:29:00.000Z"
        },
        {
            "from": "Wayne Back",
            "message": "Your welcome!\n",
            "time": "2017-12-08T15:42:00.000Z"
        },
        {
            "from": "Me",
            "message": "What are you working on?\n",
            "time": "2017-12-08T15:50:00.000Z"
        },
        {
            "from": "Wayne Back",
            "message": "As little as possible... how about you?\n",
            "time": "2017-12-09T07:45:00.000Z"
        },
        {
            "from": "Me",
            "message": "As much as possible! ;) Couple projects going on. A meditation site and access management automation. Just found a guy that needs a marketing site, and another guy that could build it quick so if I connect the two I'll have made my first sale as a consulting company since I don't have time for 3 projects at once. I don't want to get overwhelmed until I see the success of the current two.\n",
            "time": "2017-12-09T15:13:00.000Z"
        },
        {
            "from": "Wayne Back",
            "message": "That sounds great. I was kidding of course, but I've been running my business 16 years... very stable. Technology is the biggest challenge for me. All the facebook page, web site maintenance kind of stuff. Being a small company to stay current is expensive and requires a lot of my time to periodically contract someone to align with our business and market image. Good thing is our customer base doesn't search for our services online much. I don't spend a lot of time on linked in. \n\nYour a very smart guy... 7 languages... I barely know one lol. Good luck with your projects!\n",
            "time": "2017-12-09T18:40:00.000Z"
        },
        {
            "from": "Me",
            "message": "Thank you! You too!\n",
            "time": "2017-12-11T01:11:00.000Z"
        },
        {
            "from": "Wayne Back",
            "message": "With the crazy market now and investing I don't have to work anymore. I just need a good oops director to keep the company going. Then again to find someone like me they typically don't need a job.... lol\n",
            "time": "2017-12-12T08:11:00.000Z"
        },
        {
            "from": "Me",
            "message": "Perfect! I know hardly anything about the stock market. But I too see a lot of volatility. How do we fix the future, because this is taking too long?\n",
            "time": "2017-12-12T13:18:00.000Z"
        }
    ]
}