{
    "thread": "/messaging/thread/6213092127166001152/",
    "participants": [
        {
            "name": "Kyle Burnett",
            "title": "CTO, Co-Founder of Allbound // GCU Adjunct",
            "url": "linkedin.com/in/kyleburnett",
            "phone": "602-628-3261 (Home)",
            "email": "kburnett@allbound.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2017-12-09T20:49:00.000Z"
        },
        {
            "from": "Kyle Burnett",
            "message": "Hey Brian. Are you looking for a new gig by chance? Or just growing the network? Either way, I'd welcome the chance to chat. I'm looking to hire and also to help get our community of devs connected in general. My schedule is pretty good over the next 2 weeks if you have an opening for a coffee meet up.\n",
            "time": "2017-12-21T17:00:00.000Z"
        },
        {
            "from": "Me",
            "message": "Yes! I would love to get coffee. I am free anytime after 3 most days and the two holidays. What part of town are you in, I could come your direction on Saturday if you want?\n",
            "time": "2017-12-21T17:05:00.000Z"
        },
        {
            "from": "Kyle Burnett",
            "message": "We're in downtown PHX. Where are you? I'm open afternoons as well. How's Monday or Tuesday next week?\n",
            "time": "2017-12-21T17:52:00.000Z"
        },
        {
            "from": "Me",
            "message": "Monday next week is good. I have that day off if you aren't busy for the holiday. We live in North Scottsdale, but I've been making the drive every day so it's no big deal.\n",
            "time": "2017-12-21T17:53:00.000Z"
        },
        {
            "from": "Kyle Burnett",
            "message": "I live in N. Phx so I could meet ya up north. Have you been to Modern Grove on Tatum?\n",
            "time": "2017-12-21T18:17:00.000Z"
        },
        {
            "from": "Me",
            "message": "Not yet.\n",
            "time": "2017-12-21T18:19:00.000Z"
        },
        {
            "from": "Kyle Burnett",
            "message": "How's 6 work for you Monday? They've got a good menu; I'll buy dinner if that time works for you.\n",
            "time": "2017-12-21T20:34:00.000Z"
        },
        {
            "from": "Me",
            "message": "6 sounds perfect. I'll bring my wife and she's really sneaky with paying for dinner.\n",
            "time": "2017-12-21T20:40:00.000Z"
        },
        {
            "from": "Kyle Burnett",
            "message": "LOL. I totally get it. I come from a family of tab fighters. My wife loves this place so she might join us on her way home from work. We'll see. Sending the cal invite now. Looking forward to it.\n",
            "time": "2017-12-21T21:04:00.000Z"
        },
        {
            "from": "Me",
            "message": "Thank you for the dinner invite! Let's talk soon and invite more nerds! :D\n",
            "time": "2017-12-27T03:37:00.000Z"
        },
        {
            "from": "Me",
            "message": "Want to go to dinner tonight? There is going to be a get together with some geniuses I met at True Food at Scottsdale quarter tonight at 6\n",
            "time": "2018-01-06T14:24:00.000Z"
        }
    ]
}