{
    "thread": "/messaging/thread/6217366770500587520/",
    "participants": [
        {
            "name": "Richard (Rick) Swanson",
            "title": "CEO @Resumoto | Lean Startup Mentor",
            "url": "linkedin.com/in/richardswanson",
            "phone": "480-463-4632 (Mobile)",
            "email": "richard@resumo.to"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "time": "2017-12-21T15:55:00.000Z",
            "message": "Thank you for connecting!\n"
        },
        {
            "from": "Richard Swanson",
            "time": "2017-12-21T15:59:00.000Z",
            "message": "My pleasure.\n\nPlease tell me more about your work with veterans.\n\nWould some autofill software that would assist in the process of applying for jobs be something that would be useful to the veterans you are helping?\n"
        },
        {
            "from": "Me",
            "time": "2017-12-21T16:14:00.000Z",
            "message": "My last boss was a young veteran. I've been thinking a lot about using AI more in the staffing industry. Every time I see someone begging with a veteran sign I feel like we should be doing more to help. I am experiencing first hand that corporate America lacks an essential part of life. The only thing in this world that is not a waste of time is educating and improving life for some other person, hopefully younger than myself.\n"
        },
        {
            "from": "Richard Swanson",
            "time": "2017-12-21T18:07:00.000Z",
            "message": "I agree. AI is the way of the future for hiring and recruiting... and for employees to find their dream job.\n\nI am rolling out a beta for \"autofill for job applications\" next month. Do you know anyone that would like to be a beta tester?\n"
        },
        {
            "from": "Me",
            "time": "2017-12-21T18:11:00.000Z",
            "message": "I'll test it! And my wife will be looking for a job as soon as she is done with school.\n"
        },
        {
            "from": "Me",
            "time": "2017-12-21T18:52:00.000Z",
            "message": "Thanks for endorsing me for Software Development!\n"
        },
        {
            "from": "Me",
            "time": "2018-01-11T15:47:00.000Z",
            "message": "Hows the AI coming along?\n"
        },
        {
            "from": "Richard Swanson",
            "time": "2018-01-12T07:42:00.000Z",
            "message": "I am working diligently on it.\n\nAny chance you would have time for a 15 minute call to ask some questions. I think your technical background and what seems to be an understanding of the problem space would make your opinions quite valuable to me.\n\nI am struggling with the age old problem... \"ship it\" or wait. I tend to be too much of a perfectionist and need an outside voice of reason.\n\nIs that you? If so, do you have 15 minutes to spare for a skype or hangouts call today?\n"
        },
        {
            "from": "Me",
            "time": "2018-01-12T12:56:00.000Z",
            "message": "Sure any time after 3 MST. 4804660856\n"
        },
        {
            "from": "Richard Swanson",
            "time": "2018-01-12T16:31:00.000Z",
            "message": "Awesome. I will call between 4 and 4:30 MST.\n\nThank you, Brian.\n"
        },
        {
            "from": "Me",
            "time": "2018-01-13T18:35:00.000Z",
            "message": "Another interview https://www.styr.com the one thing I liked from that page and the reason I am forwarding, they say \"help us create a nutrition plan for you\" somewhere in the middle. They are almost admitting it is still being built, but in a way that makes it sounds appealing.\n"
        },
        {
            "from": "Me",
            "time": "2017-03-01T02:48:00.000Z",
            "message": "Congrats on your work anniversary!\n"
        },
        {
            "from": "Me",
            "time": "2017-06-26T03:33:00.000Z",
            "message": "Thank you for connecting! You look smart. How did you get to become CEO?\n"
        },
        {
            "from": "Me",
            "time": "2017-06-26T03:33:00.000Z",
            "message": "History didn't come up, sorry. I thought we already talked. How is the automation App coming?\n"
        },
        {
            "from": "Me",
            "time": "2017-06-26T03:33:00.000Z",
            "message": "Did you decide to release? Can I try it?\n"
        },
        {
            "from": "Me",
            "time": "2017-06-26T03:33:00.000Z",
            "message": "I am thinking to go back to school. What made you choose Standford? I was thinking MIT?\n"
        },
        {
            "from": "Richard Swanson",
            "time": "2017-06-26T04:53:00.000Z",
            "message": "If you are going to be studying computer science, MIT is the place to go.\n\nBest of luck to you.\n"
        }
    ]
}