{
    "thread": "/messaging/thread/6217382442995630080/",
    "participants": [
        {
            "name": "Penny Stone",
            "title": "Senior Project Manager at ImageTag",
            "url": "linkedin.com/in/penny2129",
            "phone": "317-652-6436 (Mobile)",
            "email": "pennyjillstone@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "time": "2017-12-21T16:58:00.000Z",
            "message": "Thank you for connecting!\n"
        },
        {
            "from": "Penny Stone",
            "time": "2017-12-21T17:01:00.000Z",
            "message": "Hi Brian, you're welcome. Did you have a specific reason for reaching out? Very timely connection. It seems we share similar interests, and I'm working on a side project related to scientific research I think you might be interested in. How did you end up at SOSMethod, is it a startup?\n"
        },
        {
            "from": "Me",
            "time": "2017-12-21T17:08:00.000Z",
            "message": "I would love to hear more about science. I've been thinking a lot about studying the brain but I don't have time for another college degree. Sosmethod.herokuapp.com is the new site I am working on, it's not much now but in the next month we would like to add a virtual reality mode for the meditation experience. What is your side project? It looks like you've had an exceptional career so far. Nice job ;)\n"
        },
        {
            "from": "Penny Stone",
            "time": "2017-12-21T17:31:00.000Z",
            "message": "That's very interesting. I felt the same way about various fields of science, but I couldn't pick just one and dive deep into it, I felt like I'd be missing out in other areas, and going back to school wasn't an option. That's how my side project was born. Now, I am working on changing the way scientific research is funded and the way the public is informed about where their donations go when they give to large charity organizations. There is a lot of money falling through the cracks that could be used to launch new research projects. I'm working with a team at TGen in Phoenix to test viability of the model before I start building a platform to scale it. I get to work with the scientist to understand what they're working on. I even got a tour of the lab! It's fascinating. \n\nSOS Method looks interesting, and what a great application of VR technology- using it for meditation. Makes perfect sense. I've been trying to launch a mixed reality project for Alliance (the company I currently work for full time) for roughly a year, but Alliance is a real estate development and management company, so everything is very traditional and slow moving. Drives me crazy.\n\nWhat side of town are you on? Maybe we could meet for coffee and talk in more detail?\n"
        },
        {
            "from": "Me",
            "time": "2017-12-21T17:41:00.000Z",
            "message": "Tgen is awesome. I've been to their lab and seen their -70 degree freezers for biological weapons grade diseases. I agree with the slow moving part. This is my first job in corporate America. I am surprised at how far behind they are in process improvement. My wife and I live in North Scottsdale and we are always up for coffee. Call or text anytime 4804660856. Fixing this world is taking too long and we have that entrepreneur spirit. It would be nice to get rid of the accountants and make the scientists an empowered mindset.\n"
        },
        {
            "from": "Penny Stone",
            "time": "2017-12-21T20:00:00.000Z",
            "message": "That's really cool! TGen is a neat place, and they're doing important work. Yeah, corporate jobs are tough.. this year at Alliance has been my first experience in a corporate environment too. That sounds great, does your wife also work in technology? Let's try to connect in January, if possible. Would love to hear more about the project you're working on and share some details about the project for TGen as well. Mine is 317-652-6436.\n"
        },
        {
            "from": "Me",
            "time": "2017-12-21T20:19:00.000Z",
            "message": "Awesome. January sounds good. My wife Iga is getting more in to tech. She is getting an aesthetics license to work with skin healing lasers. I look forward to our future meeting ;)\n"
        },
        {
            "from": "Me",
            "time": "2017-12-27T17:12:00.000Z",
            "message": "Happy holidays! :)\n"
        },
        {
            "from": "Me",
            "time": "2018-02-20T23:25:00.000Z",
            "message": "I have found more geniuses to hang out with. I met this guy at a meetup about data visualization biases and he quickly became my best friend.\nhttps://www.linkedin.com/in/aneeshkarve/\n"
        },
        {
            "from": "Penny Stone",
            "time": "2018-02-22T16:38:00.000Z",
            "message": "Interesting.. he used to work for Matterport, which makes a 3D visualization tool for real estate. I've looked into using it for Alliance. Looks like he's in Mountain View, does he spend time down here in Phoenix? Or were you up in his neck of the woods? If makes it down here, I might try to connect with him.\n"
        },
        {
            "from": "Me",
            "time": "2018-02-22T16:41:00.000Z",
            "message": "He lives just around the corner now, maybe he didn't update. I sent you the invite to the next dinner gathering. I'll probably bring my wife and some random friends with.\n"
        },
        {
            "from": "Penny Stone",
            "time": "2018-02-22T16:47:00.000Z",
            "message": "That sounds great, I really appreciate that. Not sure if I gave you my futurevane email, it's pstone@futurevane.com. I will try to make it! I wrapped up the proposal for TGen last night, so I'll be kicking that campaign off in early March, really excited.\n"
        },
        {
            "from": "Me",
            "time": "2018-02-22T16:49:00.000Z",
            "message": "Nice work. I'll send the invite to that email.\n"
        },
        {
            "from": "Penny Stone",
            "time": "2018-02-22T16:49:00.000Z",
            "message": "Thanks, Brian. Looking for to meeting you and your wife!\n"
        },
        {
            "from": "Me",
            "time": "2017-03-11T16:27:00.000Z",
            "message": "Missed you last night, we were absurdly late.\n"
        },
        {
            "from": "Penny Stone",
            "time": "2017-03-13T17:07:00.000Z",
            "message": "Hey Brian! Sorry I couldn't attend Friday night. I hope you all had a great time.\n"
        },
        {
            "from": "Me",
            "time": "2017-03-13T17:14:00.000Z",
            "message": "I almost missed it too. Want to come to the next one? Also there are some good meetups around.\n"
        }
    ]
}