{
    "thread": "/messaging/thread/6217038389229744128/",
    "participants": [
        {
            "name": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "title": "Phx Tech Market Enthusiast | Dev Specialist | Galvanize'r | Personal Brand Mentor | Minnesota Nice ツ",
            "url": "linkedin.com/in/daynaciarfalia",
            "phone": "218-259-4315 (Mobile)",
            "email": "careersuccessbydayna@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "time": "2017-12-20T17:56:00.000Z",
            "message": "Hey Brian - would love to connect if you're up for it! \r\n\r\n- Dayna Ciarfalia (Mathews)\n"
        },
        {
            "from": "Me",
            "time": "2017-12-21T16:57:00.000Z",
            "message": "Sure. I just started at Schwab though. Talking to Erin was efficient, concise, and overall an excellent experience. Thank you for reaching out. How is the Java market? I hear a lot about it but I've never been inspired to dig in to it more. Spring sounds like it's made great strides in getting people excited.\n"
        },
        {
            "from": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "time": "2017-12-21T17:27:00.000Z",
            "message": "Glad to hear you had a great experience with Erin, she's great :) \n\nCongrats on Schwab, I'm sure you'll love it there. \n\nI like to connect more to learn from developers than to recruit them since most I come across aren't really active. \n\nThe Java market seems to be getting hotter and hotter especially with the start-up, small to medium sized SaaS companies - from what I can tell. My perm team works quite a bit with Java roles, but on the contract/C2H side I see more .NET stuff.\n\nI enjoy the bleeding edge JS technology stuff -- Angular, React, Redux - functional programming, etc. Now THAT stuff is fun!\n"
        },
        {
            "from": "Me",
            "time": "2017-12-21T17:29:00.000Z",
            "message": "I agree!\n"
        },
        {
            "from": "Me",
            "time": "2017-12-21T17:29:00.000Z",
            "message": "Let me know if you have any technology questions. I am always here to help.\n"
        },
        {
            "from": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "time": "2017-12-21T17:30:00.000Z",
            "message": "Thank you so much, I appreciate that!\n"
        },
        {
            "from": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "time": "2017-03-08T15:37:00.000Z",
            "message": "Congrats, Brian!! I hear great things about Swiftpage -- I'm sure you will love it! Good luck to you :D\n"
        },
        {
            "from": "Me",
            "time": "2017-03-08T18:36:00.000Z",
            "message": "Thank you!\n"
        },
        {
            "from": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "time": "2017-06-19T22:27:00.000Z",
            "message": "Hey Brian,\n\nHope you're doing well!\n\nWanted to drop in and see how the wizard is doing at Swiftpage? It's only been a few months, but hopefully things are going well!\n\nAlso, since you were in the education space for a time, I wanted to see if you may happen to know any software developers/engineers who may be open to a new perm gig in the Chandler area? I have a large-ish Ed-Tech client who's looking for guys and gals whom are passionate about education to join one of their 7 dev teams. (primarily .NET but they have several teams using Python, opensource tech, etc). \n\nOh, and they're able to pay super well so that's always a positive as well!\n\nHave a great evening!\nDayna\n"
        },
        {
            "from": "Me",
            "time": "2017-06-19T22:31:00.000Z",
            "message": "Strong mind!\n"
        },
        {
            "from": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "time": "2017-06-19T22:36:00.000Z",
            "message": "Haha you're quite good! ;)\n"
        },
        {
            "from": "Me",
            "time": "2017-06-19T22:36:00.000Z",
            "message": "Can I do two jobs at once like the CEO of snap?\n"
        },
        {
            "from": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "time": "2017-06-19T22:37:00.000Z",
            "message": "LOL it's possible...! Has StrongMind approached you already?\n"
        },
        {
            "from": "Me",
            "time": "2017-06-19T22:39:00.000Z",
            "message": "I've had like 20 recruiters ask me about it. I don't think they are actually hiring.\n"
        },
        {
            "from": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "time": "2017-06-19T22:42:00.000Z",
            "message": "Oh really? We met with one of the two dev managers last week and they had filled 7 of 12 roles they had open. Still hiring 5 for a few specific project teams. \n\nI guess they are working with more agencies than they had let on!\n"
        },
        {
            "from": "Me",
            "time": "2017-06-19T22:44:00.000Z",
            "message": "Ha! That's a lot of dev! We're they Indian H1-B?\n"
        },
        {
            "from": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "time": "2017-06-19T22:47:00.000Z",
            "message": "Right!? They're growing like crazy. None are H1 from what I can tell. All perm -- quite a few of them were pulled from Pearson, Vixxo, and GoDaddy from my understanding. The newest dev manager came over from Vixxo and was with GoDaddy before that so that helped I'm sure.\n"
        },
        {
            "from": "Me",
            "time": "2017-06-19T22:47:00.000Z",
            "message": "What platforms are they using?\n"
        },
        {
            "from": "Dayna Ciarfalia (Char-Fall-E-Uh)",
            "time": "2017-06-19T22:52:00.000Z",
            "message": "Mostly .NET but they have a Python/Ruby team as well. Their main priorities are to fill a spot on their monolithic app suite team (.NET & Aurelia) and a spot on another team in which they're doing a .NET integration with opensource software (which was TBD last week). They have an opening on their python/Ruby team as well.\n"
        }
    ]
}