{
    "thread": "/messaging/thread/6217365460371980289/",
    "participants": [
        {
            "name": "Robin Bramman",
            "title": "Sr Brand Consultant | Founder/CEO Brandtini | Women Who Startup #BasecampPhx City Leader | Board Member CO+HOOTS FDN",
            "url": "linkedin.com/in/robinbramman",
            "phone": "623-826-0270 (Mobile)",
            "email": "robin@brandtini.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2017-12-21T15:50:00.000Z"
        },
        {
            "from": "Robin Bramman",
            "message": "Hello Brian, I am curious about why you choose to connect with me, it looks like you have been involved in e-learning and you are a software developer let me know what you are doing now and how we might be able to connect further through our shared interests. Cheers, Robin\n",
            "time": "2017-12-21T16:05:00.000Z"
        },
        {
            "from": "Me",
            "message": "Your profile subheading stood out to me as far as edutainment and thirsty entrepreneurship goes. Speaking of martinis, belvedere is my favorite because it is Polish like my wife. When you need a technologist I am happy to help. :)\n",
            "time": "2017-12-21T16:09:00.000Z"
        },
        {
            "from": "Robin Bramman",
            "message": "Very cool, I am just starting up my new brand essentials e-learning marketplace and I am having fun with the TINI part because it plays off of Bar's, Barista's and Business - which is where we do business 24-7-365. It also plays well with Martini's and Belvedere happens to be my vodka of choice so we are now best of friends and you can tell your wife :) I do not have a CTO for my business as I am in the funding stages with an investor I have worked with in the past. I would be curious to know if you are listed on Angel.co and if you have worked on other startups and what your role was. What are you doing now? Happy that you found me on LinkedIn and it appears we are both in AZ. So, perhaps we will have to do a quick zoom video call to intro with each other and see if we might be a fit in the near future. This is a timely opportunity as I am meeting with the investor next week. Let me know if you care to set up a 30 min virtual zoom call.\n",
            "time": "2017-12-21T16:32:00.000Z"
        },
        {
            "from": "Me",
            "message": "I love working on startups. I am working on sosmethod.herokuapp.com we want to add VR to the meditation experience. I had this idea for a bar, what if all alcohol bottles had RFID and drinks were billed based on weight of the bottle before and after. Might reduce theft from an executive's perspective, but from the bartender perspective it gives them creative freedom to pour however they want without being confined to ounces. Drinking alcohol could be more interactive than just ordering a generic lemon drop and handing out shots. The bar could act like a stock market where after a certain amount is consumed it crashes and drinks are really cheap. I am on angel.co call me anytime 4804660856.\n",
            "time": "2017-12-21T16:43:00.000Z"
        },
        {
            "from": "Robin Bramman",
            "message": "Interesting idea, there is a product I will share with you that you set a glass on and dial in the drink type and it tells you the exact ingredients to add and tells you to stop pouring each item based on weight. I have not purchased it so I am not sure if it really works. Can I get your email and shoot you a zoom request for tomorrow some time? I have a full day planned today. Would very much like to continue the conversation, cheers!\n",
            "time": "2017-12-21T17:10:00.000Z"
        },
        {
            "from": "Me",
            "message": "Megamindbrian@gmail.com I can talk any time after 3 mst.\n",
            "time": "2017-12-21T17:12:00.000Z"
        },
        {
            "from": "Robin Bramman",
            "message": "Sorry about missing our zoom call, I had an emergency with my mom so had to jump and run, I would like to reschedule after the holidays if you are still interested.\nLet me know.\n",
            "time": "2017-12-23T04:10:00.000Z"
        },
        {
            "from": "Me",
            "message": "Hope everything is well! Have a good weekend :)\n",
            "time": "2017-12-23T04:29:00.000Z"
        },
        {
            "from": "Robin Bramman",
            "message": "Hi Brian Cullinan hope you had a good Christmas, mine got a bit disrupted with my mother but she is doing better, thanks for your understanding of why I missed our video chat, perhaps we can reschedule next week? Let me know if there is a good time for you in the new year.\n\nCheers and Happy New Year.\nRobin\n",
            "time": "2017-12-29T18:55:00.000Z"
        }
    ]
}