{
    "thread": "/messaging/thread/6218926925767852032/",
    "participants": [
        {
            "name": "Mayank Prasad",
            "title": "Entrepreneur & Computer Engineer",
            "url": "linkedin.com/in/prasadmayank",
            "phone": "+1 (480) 878-9227 (Mobile)",
            "email": "max@maxEmbedded.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2017-12-25T23:15:00.000Z"
        },
        {
            "from": "Mayank Prasad",
            "message": "Hello Brian,\n\nIt is great to connect with you too! \n\nI am an entrepreneur owning an online marketing business with a growing organization in US & Canada. I work with a lot of professionals, outside of their full-time career. We are looking to expand our business in Phoenix area. Have you thought about diversifying what you currently do and create an additional stream of income through an entrepreneurship venture?\n\nRegards, \nMax Prasad\n",
            "time": "2017-12-26T21:30:00.000Z"
        },
        {
            "from": "Me",
            "message": "I've thought about doing that exact same thing, there is a lot of demand.\n",
            "time": "2017-12-26T21:55:00.000Z"
        },
        {
            "from": "Mayank Prasad",
            "message": "Hello Brian,\n\nThat's great to hear. There's definitely a growing demand for online shopping and services.\n\nWe develop online business for major retailers like Apple, Nike, Macy's, etc in addition to a few exclusive brands. We are expanding our business development team and are in the process of interviewing many entrepreneur-minded people, you being one of them. Would you like to be considered?\n\nRegards,\nMax Prasad\n",
            "time": "2017-12-27T23:47:00.000Z"
        },
        {
            "from": "Me",
            "message": "Sure.\n",
            "time": "2017-12-27T23:57:00.000Z"
        },
        {
            "from": "Mayank Prasad",
            "message": "Hello Brian,\n\nI would like to speak with you for 40 minutes over phone for the first step of interview/discussion. You'll have a better understanding of the business and what we do after our call. What would be a good time for us to schedule this phone discussion - Monday, Jan 2 at 6 pm MST or Tuesday, Jan 3 at 7 pm MST?\n\nRegards,\nMax Prasad\n",
            "time": "2017-12-28T00:36:00.000Z"
        }
    ]
}