{
    "thread": "/messaging/thread/6220031724278083584/",
    "participants": [
        {
            "name": "Carine Dieude",
            "title": "Partner. Entrepreneurship Aficionado. Girls In Tech PHX",
            "url": "linkedin.com/in/carinedieude",
            "phone": "602-773-1488 (Work)",
            "email": "cdieude@altimabusinesssolutions.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2017-12-29T00:25:00.000Z"
        },
        {
            "from": "Carine Dieude",
            "message": "Hello Brian\n\nThank you for the LinkedIn connection and nice to meet you electronically. I make a point to know my connections. What do you specialize in? \n\nMy focus is to take businesses from what's now to what's next. We are a business accelerator firm providing access to capital, financial, strategy, sales and accountability services. \n\nI am a fervent practionner of the 6 degrees of separation theory. It's surprising who people know. How can I help?\n\nCarine Dieudé | Partner – Altima Business Solutions\n",
            "time": "2017-12-29T14:13:00.000Z"
        },
        {
            "from": "Me",
            "message": "Thank you for the executive summary Carine.\n\nI am a software developer who has been working on an EdTech company for the last 3 years. We hit a stopping point waiting on Great Hearts to make a financial commitment. My partner and owner of the company has approached investors before but sounded like he wants to make it on his own until we have a success product with at least one school system. I had to go an get another full time job since we don't want to spend a bunch of time on features until we know it works.\n\nI think with social networks we are down to 3 degrees of Kevin Bacon.\n\nI am applying my skills to some new projects now as this is my first time in true corporate America. It is amazing how slowly things move compared to Lean Startups. I am trying to learn how the overall vision of a long term company makes it in front of their customers.\n\nWe have a little Airbnb business, my wife is an artist and painter going to school for cosmetology and aesthetics. I have a side gig setting up a new marketing site for thesosmethod.com. Lots of irons in the fire but I don't see a way to make my ideas a global resource and live off of it so in the meantime I am trying to learn as much as possible.\n\nAs it turns out, I still get to do whatever I want in corporate America, I just have to convince 3 extra managers first ;)\n",
            "time": "2017-12-29T15:34:00.000Z"
        },
        {
            "from": "Carine Dieude",
            "message": "I am a happy corporate drop out so I can relate! The lean startup methodology is a great framework. Unfortunately it has been dissolved and now the ecosystem experiences a huge gap. That's one of my favorite talks: From MVP to VC. I'll be speaking at Phoenix Startup Week in February. You may want to check it out :-) \nIt's always the same conundrum with starting a business: limited resources, limited skills, limited plans = limited results. Strategic and intentional actions are game changers.\nBest wishes in your endeavor. Let me know if I can help.\n\nI wish you and your family a wonderful new year!\nCarine\n",
            "time": "2017-12-29T17:11:00.000Z"
        }
    ]
}