{
    "thread": "/messaging/thread/6222885189006213120/",
    "participants": [
        {
            "name": "Brian Tyree",
            "title": "Jetpack Bacon Creative, LLC | Owner | Creative Director",
            "url": "linkedin.com/in/brian-tyree-b71054a",
            "phone": null,
            "email": "Brian@jetpackbacon.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2018-01-05T21:24:00.000Z"
        },
        {
            "from": "Brian Tyree",
            "message": "If there is only .017% of Co2 in the atmosphere, how much is required to change global climate, and to what degree? (My science question. You said ask.)\n",
            "time": "2018-01-05T21:37:00.000Z"
        },
        {
            "from": "Me",
            "message": "Lol excellent question! What makes you think CO2 is the only contributor to climate change? Here is one article that claims CO2 content has risen 36% over the last 200 years. So we are at .023 and there are studies claiming the world is 2 degrees hotter this year. At first glance I would say those numbers are pretty devastating to our habitat. http://m.slashdot.org/story/320847\n",
            "time": "2018-01-05T22:18:00.000Z"
        },
        {
            "from": "Brian Tyree",
            "message": "Water vapor is the major contributor to greenhouse effect, making up 80% of the atmosphere. As miniscule as .017% is, I have a hard time believing Co2 has much effect, and man-made Co2 is a fraction of that amount. Scientists and climatologists have no accurate way to measure Co2 from every living organism, forest fire, volcano and underwater fissures expelling co2. Therefore, the scientific method isn't even being used. Some so-called climatologists are reporting findings that are politically based.\n",
            "time": "2018-01-05T22:28:00.000Z"
        },
        {
            "from": "Brian Tyree",
            "message": "Have you seen the PragerU video on YouTube by an atmospheric physicist talking about climate change? I don't have the link, but I tend to agree with his findings.\n",
            "time": "2018-01-05T22:28:00.000Z"
        },
        {
            "from": "Me",
            "message": "I'll check it out! Thank you. Good points too. While I have no problem admitting that mankind could have an effect on climate, if the system were really as volatile as politicians like to make it sound, we probably would have already ruined everything.\n",
            "time": "2018-01-05T23:21:00.000Z"
        },
        {
            "from": "Brian Tyree",
            "message": "True!\n",
            "time": "2018-01-05T23:51:00.000Z"
        },
        {
            "from": "Me",
            "message": "Phoenix use to get snow and my tomatoes are still alive.\n",
            "time": "2018-01-21T18:25:00.000Z"
        },
        {
            "from": "Brian Tyree",
            "message": "After the whole nation endured an Arctic blast, you believe because Phoenix was warner than usual, it means global warming? I went to LA for Christmas and it was much colder than usual. It was the typical Phoenix winter weather or colder.\n",
            "time": "2018-01-21T19:23:00.000Z"
        },
        {
            "from": "Brian Tyree",
            "message": "Did you watch the PragerU video? Which of the three groups are you in?\n",
            "time": "2018-01-21T19:23:00.000Z"
        },
        {
            "from": "Me",
            "message": "I believe it is possible for our species to influence our environment but there is not enough science and validation. None of us really know what we're supposed to be doing on this planet.\n",
            "time": "2018-01-21T19:38:00.000Z"
        },
        {
            "from": "Brian Tyree",
            "message": "I believe the science is there to refute man made climate change, but many ignore it for political and other reasons.\n",
            "time": "2018-01-21T20:28:00.000Z"
        }
    ]
}