{
    "thread": "/messaging/thread/6222042083952246784/",
    "participants": [
        {
            "name": "Kay (Mersereau) McDonald",
            "title": "CEO| Social Entrepreneur | Cause Marketing Expert | Fundraising | Charity Bracelets | Branding Campaigns | Custom Charms",
            "url": "linkedin.com/in/kaymcdonald",
            "phone": "800.615.3120 (Work)",
            "email": "kay@charitycharms.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2018-01-03T13:33:00.000Z"
        },
        {
            "from": "Kay McDonald",
            "message": "Hello Brian,\n\nThanks so much for connecting with me on LinkedIn!. I invite you to visit my website: www.charitycharms.com to learn about our concept: “Changing the World Through the Power of Charms” We create custom charm programs for non-profit organizations, schools, and businesses to raise awareness and funds. The custom charms are used for volunteer and recognition gifts, donation drives, swag bags, cause marketing, special events. They provide a wearable, tangible way for your community to share your message with others.\n\nPlease reach out to me or share my information with anyone if you think we can be of service.\n\n“Charming” Regards, \n\nKay McDonald CEO/Founder Charity Charms\n602.615.3200\nkay@charitycharms.com\n",
            "time": "2018-01-08T20:10:00.000Z"
        },
        {
            "from": "Me",
            "message": "Pretty cool. I like it! But are men really into charms? Who does the metallurgy?\n",
            "time": "2018-01-08T20:42:00.000Z"
        },
        {
            "from": "Kay McDonald",
            "message": "Hello Brian,\n\nWe do custom programs making logos and taglines into wearable bracelets. So not targeting YOU perse, but perhaps a charity or company you engage with:).\n\nRegards,\nKay\n",
            "time": "2018-01-08T21:08:00.000Z"
        },
        {
            "from": "Me",
            "message": "So for example I could order 200 ornaments for sojourner or Maggie's place for patrons of our local church to take from a Christmas tree display if they plan on donating this year?\n",
            "time": "2018-01-08T23:49:00.000Z"
        },
        {
            "from": "Kay McDonald",
            "message": "Hi Brian,\n\nSort of...we would coordinate it through the charity because we are using their logo:)\n",
            "time": "2018-01-09T00:09:00.000Z"
        }
    ]
}