{
    "thread": "/messaging/thread/6224957701567451136/",
    "participants": [
        {
            "name": "Tony Orlando",
            "title": "Senior Technical Recruiter and Proud Gold Sponsor of AITP Atlanta",
            "url": "linkedin.com/in/tonyorlando34",
            "phone": "480-586-7568 (Mobile)",
            "email": "torlando@ehire.com"
        }
    ],
    "messages": [
        {
            "from": "Tony Orlando",
            "message": "It's the Silicon Valley of the Southeast and Less Expensive\n\nHi Brian, \n\nI hope this email finds you well and thank you in advance for your time. After reading your professional profile, I'd like to gauge your interest in relocating to Atlanta, Georgia. \n\nAs you may or may not know, Atlanta has a growing “start-up” community as well as some of the largest companies headquartered here (e.g. Coca-Cola, The Home Depot, UPS, Delta Airlines, etc.). My company, eHire (www.ehire.com), is very active in the Atlanta IT community. We sponsor several IT associations (e.g. PyData Atlanta, Scrum User Group, Atlanta Mobile (Android / iOS) Development, Hadoop, etc.), we've created technology meet-ups (e.g. Atlanta Big Data, Atlanta User Experience (AUX), Geek Warriors, Spring, etc.) and we’re active in bringing new technology companies to Atlanta through our involvement in the Atlanta Chamber of Commerce.\n\nI say all this to simply ask you to think about opening up a discussion around what Atlanta can offer you and your professional career. If my timing to explore the job market isn’t ideal, please keep my information handy for when the timing might be better. If you have any friends / colleagues interested in exploring a technology market synonymous with San Francisco and New York City for half the cost of living, please pass my information along to them. I’d love to have a conversation about Atlanta. \n\nBest Regards,\nTony\n\nTony Orlando\n678-528-4721 | torlando@ehire.com\n",
            "time": "2018-01-11T12:00:00.000Z"
        },
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2018-01-11T14:42:00.000Z"
        }
    ]
}