{
    "thread": "/messaging/thread/6225317581264420864/",
    "participants": [
        {
            "name": "Todd Radwick, DIA",
            "title": "Income Protection Specialist - Radwick Financial Group LLC",
            "url": "linkedin.com/in/todd-radwick-dia-32964260",
            "phone": "509-679-4814 (Mobile)",
            "email": null
        }
    ],
    "messages": [
        {
            "from": "Todd Radwick, DIA",
            "message": "Hello Brian,\n\nI just accepted your invite to connect on LinkedIn. Thanks for the invite!\n\nI was looking through your profile, good stuff. I enjoyed seeing how you use a lot of science/logic in your thinking. I do the same in my work as an insurance and financial adviser; what am I recommending, why, in what particular order, why, etc. \n\nYou remind me of \"Spock\" the logic-only Vulcan in the original TV series \"Star Trek,\" which I grew up with when it came out way before your time. By today's standards, it is backwards, outdated, etc., but it was fun and very cutting edge at the time. \n\nYou sound like an interesting guy. I'd be happy to visit and get acquainted. You can call me on my cell at 509-679-4814. \n\nHave a successful 2017.\n\nTodd\n",
            "time": "2018-01-12T14:29:00.000Z"
        },
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2018-01-12T15:25:00.000Z"
        },
        {
            "from": "Me",
            "message": "I'd love to meet up sometime. Spock is definitely one of my roles models, also Nikola Tesla. Hope you have a great 2017 as well!\n",
            "time": "2018-01-12T15:25:00.000Z"
        },
        {
            "from": "Todd Radwick, DIA",
            "message": "Let's do it. How about today? What looks good for you? You can also use my calendar link and pick 3 or more times that could work. http://www.meetme.so/ToddRadwick\n",
            "time": "2018-01-12T15:41:00.000Z"
        },
        {
            "from": "Todd Radwick, DIA",
            "message": "Hello Brian,\n\nThought I’d circle back. I also just left you a voice message. I had accepted your LinkedIn invite to connect and sent you the note back about “Spock” from Star Trek. \n\nIn any event, as I read through your profile, I couldn’t help but wonder if I might be of service to you. Most of my clients are business professionals like yourself and I tend to relate to them well. \n\nAs an insurance and financial advisor with 22 years experience, this month in January, I help my clients with a strong focus in three areas:\n\n•\tDisability Income Protection, essentially pay-check protection in the event they get sick or hurt and cannot work. If they have a group plan through work, almost always, it’s not enough, and the definitions and language leave a lot to be desired. \n\n•\tLife Insurance, if they have others to protect who rely on them. \n\n•\tTax-Free Retirement Planning, with all gains and zero downside market risk. \n\nWould you be open to getting further acquainted on the phone and exploring some ideas and options and doing a review of your needs?\n\nTodd Radwick, DIA, President\nRadwick Financial Group LLC\ntodd@radwickfinancial.com\nWP (509) 996-3425\nCell (509) 679-4814\nFAX (866) 551-3961\n",
            "time": "2018-01-30T22:31:00.000Z"
        }
    ]
}