{
    "thread": "/messaging/thread/6227270798227365888/",
    "participants": [
        {
            "name": "Peter Burns",
            "title": "Founder at Entrepreneurs Credit Card",
            "url": "linkedin.com/in/peterburnsiii",
            "phone": "602 492 2041 (Work)",
            "email": "peter@hlcostseg.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "time": "2018-01-17T23:50:00.000Z",
            "message": "Thank you for connecting!\n"
        },
        {
            "from": "Peter Burns",
            "time": "2017-04-22T04:44:00.000Z",
            "message": "Hi Brian,\r\n\r\nI am touching base as I migrate my Linkedin CRM over to a new system, and one of the \"features\" of the new system is that I can send out a quick automated update message to you as I import your info. So if we have been speaking about this already I apologize, don't let this message confuse you :)\r\n\r\nI thought this would be the perfect time to update you on the Entrepreneurs Credit Card, which an experienced, well qualified team has worked hard to make a reality.\r\n\r\nThe card is now out of beta testing, and we are approving applications from entrepreneurs daily! \r\n\r\nAn Entrepreneur-friendly finance company has put their reputation behind this card, so if you are looking for money to grow or upgrade an existing business, or for the capital to start your own business, this may be the perfect vehicle for you.\r\n\r\nFind out more at https://info.entrepreneurcardservices.com/get-100K.\r\n\r\nThen go ahead and apply. It only takes a minute, applying will not affect your credit and you will find out how much you pre-qualify for instantly.\r\n\r\nOf course, if you have questions before applying, or if you need more information, I'd love to hear from you.\r\n\r\nSincerely,\r\nPeter Burns\r\nhttps://www.linkedin.com/in/peterburnsiii\r\nhttps://info.entrepreneurcardservices.com/free-report-linkedin\r\nhttps://info.entrepreneurcardservices.com/free-report-linkedin\n"
        },
        {
            "from": "Me",
            "time": "2017-04-27T21:08:00.000Z",
            "message": "I wish I could afford an entrepreneur credit card.\n"
        },
        {
            "from": "Peter Burns",
            "time": "2017-04-27T23:11:00.000Z",
            "message": "It is free...zero interest 12 to 21 months. Then, the best interest available according to the credit worthiness of the applicant. Only payments are 1%-2% of outstanding principle monthlt..which are immediately available because it is a revolving line of credit.\n\nSimply visit www.entcreditcard.com/imagine to see everything and apply to see if you're approved and for how much...in 30 seconds.\n"
        }
    ]
}