{
    "thread": "/messaging/thread/6227214275996377089/",
    "participants": [
        {
            "name": "Tracey Slagle",
            "title": "Technology & Engineering Services",
            "url": "linkedin.com/in/tracey-slagle-718a2790",
            "phone": null,
            "email": "tracey@silverskys.com"
        }
    ],
    "messages": [
        {
            "from": "Tracey Slagle",
            "message": "Senior Network Admin Role FULL TIME\n\nDear Brian, \n\nHello! I have an excellent opportunity with a highly-desired Scottsdale company.\n\nPlease contact me with your resume if you're interested at tracey@silverskys.com\n\n•A minimum of 5 years network infrastructure experience is required.\n•Advanced knowledge of one or more of the following systems: network operating systems, WLAN, cloud environment, network topologies, network hardware, computer operating systems, routing, switching, data privacy, security and telecommunication systems is required.\n•Advanced knowledge of network services availability, performance and security is required.\n•Advanced knowledge of commonly available networking tools is needed.\n•Excellent written and verbal communication, interpersonal and customer service skills are necessary.\n•Working knowledge of Microsoft Office, including skills with Word, Excel and Visio are necessary.\n•The ability to work efficiently and accurately under pressure, meet deadlines and present a professional demeanor is essential.\n•The proven ability to work independently and in a team, multi-task, and manage multiple projects to meet various deadlines simultaneously is required.\n•Customer service skills, including the ability to manage and respond to different customer situations while maintaining a positive and friendly attitude are essential.\n•Proven analytical skills and the ability to lead team/projects are required.\n•Proven ability to motivate self and others is necessary.\n•Maintaining confidentiality, treating others with respect and upholding Company values are key attributes.\n•In addition, organizational and problem solving skills, a can-do attitude and the ability to adjust to changing requirements are essential.\n\nEducational Requirements:\n•This position requires a Bachelor’s Degree with a technical degree or equivalent work experience\n•Cisco Certified Network Professional (CCNP) is required\n\nTracey Slagle\ntracey@silverskys.com\n",
            "time": "2018-01-17T12:00:00.000Z"
        },
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2018-01-17T20:08:00.000Z"
        }
    ]
}