{
    "thread": "/messaging/thread/6229840932083154944/",
    "participants": [
        {
            "name": "Ronen Magid",
            "title": "Technologist. Always up to something.",
            "url": "linkedin.com/in/ronenmagid",
            "phone": null,
            "email": "ronenmagid@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "message": "Thank you for connecting!\n",
            "time": "2018-01-25T02:03:00.000Z"
        },
        {
            "from": "Ronen Magid",
            "message": "Sure\n",
            "time": "2018-01-25T02:16:00.000Z"
        },
        {
            "from": "Ronen Magid",
            "message": "How can I help you?\n",
            "time": "2018-01-25T02:16:00.000Z"
        },
        {
            "from": "Me",
            "message": "Not sure yet. What is hcm/performance?\n",
            "time": "2018-01-25T13:53:00.000Z"
        },
        {
            "from": "Ronen Magid",
            "message": "HCM is Human Capital Management. A space for all HR related software and services. It's a $15B/year market. Performance Management is a subset of the HCM pie. Alone, it's a $1.3B/year market.\n",
            "time": "2018-01-25T14:20:00.000Z"
        },
        {
            "from": "Me",
            "message": "I've been having a lot of ideas regarding that lately. Education is taking too long and on the other end of this technological dark age we are going through, our highly valued jobs as technical workers will turn in to a blue collar less than glamorous career path. I predict in ten years, educating ourselves and others will really be the only thing meaningful left to do. Everything else will be done for us by robots and trained algorithms.\n",
            "time": "2018-01-25T15:15:00.000Z"
        },
        {
            "from": "Me",
            "message": "As far as performance goes. The current tools leave something to be desired. See the problem with management is pretty much everything. It's just management. It doesn't matter how much data you collect, what matters is how we act on that data. So how is management acting on performance data? The approach is all wrong. Data has to be useful to the people the data comes from in order for it to be even a \"subset\" of useful to management. I want to write a service that tells me how much time I spend on LinkedIn in versus how much time I spend working. That data is useful to me because it forces me to justify to myself the time I spend social networking. I am forced to prioritize the utility of the social network in comparison to my utility as an employee. The system as a whole could hold people accountable to how many new skills they learn.\n",
            "time": "2018-01-25T15:15:00.000Z"
        },
        {
            "from": "Ronen Magid",
            "message": "Spying tools have been proven to be a wrong approach and failed financially. They are still used in \"low wage\" environment. Those environment don't interest me. Performagram takes a different approach to analyzing data and gives real valuable insight that no other tool gives.\n",
            "time": "2018-01-25T15:27:00.000Z"
        },
        {
            "from": "Me",
            "message": "Right. I am glad you agree. But I believe the reason the spying tools failed is because it is made for managers not for employees. Who is the insight for with Performagram? Managers or employees?\n",
            "time": "2018-01-25T15:29:00.000Z"
        },
        {
            "from": "Ronen Magid",
            "message": "There are \"self discovery\" tools for people. I use one on my Mac to tell me where I spend my time. But this has no value in the workplace, as proven by the market. Intelligent employees don't want to be micromanaged. They want to be judged by whether they do their work well or not and they don't expect to be criticized for opening Facebook during the work day if they do their work well.\n",
            "time": "2018-01-25T15:53:00.000Z"
        },
        {
            "from": "Ronen Magid",
            "message": "micromanaged = also spied on....\n",
            "time": "2018-01-25T15:53:00.000Z"
        },
        {
            "from": "Me",
            "message": "I just started in corporate America. I am learning pretty quick what micromanage means. Can I come work for you?\n",
            "time": "2018-01-25T17:22:00.000Z"
        },
        {
            "from": "Ronen Magid",
            "message": "Performagram is still in the fundraising stage. It's way too early for anyone to come work for me. It will live or die based on my success at fundraising.\n",
            "time": "2018-01-25T17:25:00.000Z"
        },
        {
            "from": "Me",
            "message": "If you are hungry you can always come for dinner.\n",
            "time": "2018-01-25T17:32:00.000Z"
        }
    ]
}