{
    "thread": "/messaging/thread/6233347537550532608/",
    "participants": [
        {
            "name": "Darrell Kidd",
            "title": "Engineering, Innovation and Entrepreneurship Instructor MET Professional Academy",
            "url": "linkedin.com/in/darrell-kidd-71649546",
            "phone": null,
            "email": "darkidd.01@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "time": "2018-02-03T18:17:00.000Z",
            "message": "Thank you for connecting! Nice to meet someone else passionate about education.\n"
        },
        {
            "from": "Darrell Kidd",
            "time": "2018-02-03T18:27:00.000Z",
            "message": "I teach in a unique high school program and am starting a consulting company to help startups focus on their vision, business model and branding.\n"
        },
        {
            "from": "Me",
            "time": "2018-02-03T18:28:00.000Z",
            "message": "I'm a wealth of useless information. Sent you an email with more material like the interleaving study.\n"
        },
        {
            "from": "Darrell Kidd",
            "time": "2018-02-03T18:28:00.000Z",
            "message": "And it is nice to connect, especially with someone who recognizes that the status quo of the education model needs to be disrupted\n"
        },
        {
            "from": "Me",
            "time": "2018-02-03T18:30:00.000Z",
            "message": "I like working for startups. It's hard for the visioneers to organize their vision and explain it to other sometimes. I've been discouraged from using the word \"disrupt\" by John Batelle's latest post. I want things to improve and there are a lot of people smarter than me working on it already.\n"
        },
        {
            "from": "Darrell Kidd",
            "time": "2018-02-03T18:48:00.000Z",
            "message": "It depends on the context of 'disrupt'. In order to improve something, it is necessary to challenge the status quo, a disruption if you will. Visionaries are not always great leaders (i.e., Steve Jobs). They need to know how to inspire their team, not how to motivate it. They also need to be looking good for talent that can answer their questions, allow the team to follow their curiosity (it may move away from the core vision, but provide something that is tangent to or supports that vision down the road). And the biggest step in developing a solution is changing the view from \"Why hasn't some one done something about this?\" To\"Why haven't I done something about this?\" Show your passion, and like minded and sometimes smarter people will be inspired and rally to your cause.\n"
        },
        {
            "from": "Me",
            "time": "2018-02-03T18:54:00.000Z",
            "message": "I love the way you articulate this.\n"
        },
        {
            "from": "Me",
            "time": "2018-02-03T18:54:00.000Z",
            "message": "You're a genius btw. I think everyone is a genius they just haven't fully realized it.\n"
        },
        {
            "from": "Darrell Kidd",
            "time": "2018-02-03T19:15:00.000Z",
            "message": "I appreciate your thinking so, but I am only a humble servant trying to make the world a better place one student/startup a time.\n"
        },
        {
            "from": "Me",
            "time": "2018-02-10T05:12:00.000Z",
            "message": "Congrats on the new job!\n"
        },
        {
            "from": "Me",
            "time": "2018-02-12T15:21:00.000Z",
            "message": "I just met this guy the other day he wants to make some headway on EdTech. I thought you guys could both benefit from a conversation. https://www.linkedin.com/in/zeusrz\n"
        },
        {
            "from": "Darrell Kidd",
            "time": "2018-02-12T15:23:00.000Z",
            "message": "Thanks for the introduction. I will reach out to him\n"
        },
        {
            "from": "Me",
            "time": "2018-02-12T16:03:00.000Z",
            "message": "Yeah friend of a friend I care about a lot. Smart guy, he wants to take EdTech 10 steps forward.\n"
        },
        {
            "from": "Darrell Kidd",
            "time": "2018-02-12T16:17:00.000Z",
            "message": "Very cool. I look forward to connecting with him\n"
        },
        {
            "from": "Me",
            "time": "2017-04-05T22:54:00.000Z",
            "message": "Congrats on your work anniversary!\n"
        },
        {
            "from": "Darrell Kidd",
            "time": "2017-04-05T22:59:00.000Z",
            "message": "Thanks\n"
        }
    ]
}