{
    "thread": "/messaging/thread/6234500059589808128/",
    "participants": [
        {
            "name": "Kathleen French",
            "title": "Metro Market Manager at Robert Half Technology",
            "url": "linkedin.com/in/kathleen-french-88148411",
            "phone": "",
            "email": "kathleen_french@hotmail.com"
        }
    ],
    "messages": [
        {
            "from": "Kathleen French",
            "time": "2018-02-06T12:00:00.000Z",
            "message": "Direct Hire Opportunities!\n\nHi Brian, \n\nI wanted to reach out regarding multiple opportunities that I currently have and see if you might be interested in looking for a new direct hire role? And if not, would you happen to know anyone that is looking?\n\nI would love to connect with you either way :) Below are just a few positions I am currently looking to fill. \n\nLet me know your thoughts and hope you are having a great Monday after the Super Bowl!!!!\n\nMagento Developer - paying up to $120k\n.Net Developer - $100k - $110k\nJava Developer - $90k - $140k\n\nKathleen French\nkathleen.french@rht.com\n602-224-2486\n"
        },
        {
            "from": "Me",
            "time": "2018-02-06T23:00:00.000Z",
            "message": "Thank you for connecting.\n"
        },
        {
            "from": "Me",
            "time": "2018-02-06T23:00:00.000Z",
            "message": "What company?\n"
        },
        {
            "from": "Kathleen French",
            "time": "2018-02-07T03:59:00.000Z",
            "message": "Thank you! Are you currently looking? The .Net is with Swift Page:) The .Net is partly remote, unlimited PTO, really laid back atmosphere and over in Scottsdale. They are looking with someone that has 5 + years of .Net, 3 years of JavaScript, CSS, HTML and codes in C#. MVC, ASP.Net and Zuora experience. They are conducting interviews this week, would you be interested in me submitting your resume? Or is there something else you are looking for that I can start keeping my eyes open for?\n"
        },
        {
            "from": "Me",
            "time": "2018-02-07T18:06:00.000Z",
            "message": "Honestly it's a pretty big drag to work with me. I have a whole lot of failure under my belt and nothing to show for it except a house, wife, and happy puppies. I'd rather they hire 10 other people to do my job. I am more interested in my own self development than in a company's. People don't understand the words I am saying to them when they talk to me. I have no evidence that people like working with me and there is a lot of apathy towards informing me on things that matter to them. I can't even say I have \"work\" friends because they never hang out with me outside at work. Most importantly, no one cares what I think. It's a battle between trying to be helpful and communicate my ideas towards a project and no one caring. Oh and I tend to minimize other people's problems like it's not big deal. Might be related to no one caring to talk to me.\n"
        },
        {
            "from": "Kathleen French",
            "time": "2018-02-07T18:50:00.000Z",
            "message": "Hi Brian,\n\nThank you so much for your honesty. That is okay, we can find you something. I would rather talk to you either in person or over the phone so I can get an idea of options? Some companies actually prefer they put their head down and work, other companies want that team factor. There is something out there for all of us, don't let the past issues get in the way of you finding somewhere you will love. My cousin actually works for Robert Half as well and he HATES people, it is so funny to me. He is in Technology and cannot stand when people talk to him. He is in the perfect department because they really do not have to deal with people very often...and let me tell you, my cousin is not good at acting like he cares about people. I love it though, cracks me up!\n"
        },
        {
            "from": "Me",
            "time": "2018-02-07T18:55:00.000Z",
            "message": "Haha. That is probably the most positive response I could have expected. I actually like working with people a lot I just wish they were honest with me and themselves. My last boss told me \"I had no idea you were feeling this way\". So I am trying to be more honest with my feelings. 4804660856 I'm available anytime after 4.\n"
        },
        {
            "from": "Me",
            "time": "2018-02-07T18:55:00.000Z",
            "message": "MST\n"
        },
        {
            "from": "Kathleen French",
            "time": "2018-02-07T19:47:00.000Z",
            "message": "Haha, I am a very positive person:) I will give you a call after 4pm then. And it sounds like people are just being overly sensitive. I am a very blunt person, can't do sensitive, haha!\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-25T12:00:00.000Z",
            "message": ".Net Position\n\nHi Brian, \n\nI have a Client looking to hire a Full Stack .Net Developer, with the position more focused on the Frontend paying around $105k plus up to a 20% bonus. \n\nAre you looking or do you happen to know anyone searching for a new opportunity? Either way, I would love to keep in touch:) I am over all of our Technology and Creative/Marketing Services for Contract and Direct Hire.\n\nPlease keep my information and reach out anytime! Have a wonderful evening:)\n\nKathleen French\nkathleen.french@rht.com\n602-224-2486\n"
        },
        {
            "from": "Me",
            "time": "2017-04-25T01:46:00.000Z",
            "message": "Wow that sounds great!!\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-25T15:46:00.000Z",
            "message": "OH NO! I did not mean to send that to you, hahah. When are we doing happy hour? Are we ever going to celebrate?\n"
        },
        {
            "from": "Me",
            "time": "2017-04-25T17:14:00.000Z",
            "message": "Tonight at kodo sushi?\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-25T17:36:00.000Z",
            "message": "I can't tonight...I have my son...what about tomorrow night? We are going to the Biltmore area for a happy hour and then I am free!\n"
        },
        {
            "from": "Me",
            "time": "2017-04-25T17:37:00.000Z",
            "message": "I love Biltmore area. I'll check with my wifey\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-26T00:28:00.000Z",
            "message": "YESSSS, let's do it!!! I will need a drink for sure:) What are your favorite spots out in the Biltmore area?\n"
        },
        {
            "from": "Me",
            "time": "2017-04-26T00:33:00.000Z",
            "message": "Merc bar, Sofia Loren is a good drink.\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-26T19:10:00.000Z",
            "message": "Haha!!! Ok, talk to your wifey...and lets shoot for next Wednesday?\n"
        },
        {
            "from": "Me",
            "time": "2017-04-26T19:13:00.000Z",
            "message": "Next Wednesday at Merc bar?\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-26T20:14:00.000Z",
            "message": "SURE! Let's do this!\n"
        },
        {
            "from": "Me",
            "time": "2017-04-26T20:48:00.000Z",
            "message": "Probably can't be there until 6 I'll put it on the calendar.\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-26T21:25:00.000Z",
            "message": "Brandon wants to know if your roommate is coming? HAHA\n"
        },
        {
            "from": "Me",
            "time": "2017-04-26T21:26:00.000Z",
            "message": "Yeah our friend Abe, my wife wants to introduce you. He is a forensic scientist. Who is Brandon?\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-26T22:12:00.000Z",
            "message": "My partner was possibly going to come. You spoke with him silly!!! Who is Abe? Is this your roommate?\n"
        },
        {
            "from": "Me",
            "time": "2017-04-26T22:16:00.000Z",
            "message": "Just a friend. No more roommates!\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-26T22:22:00.000Z",
            "message": "Oh yay!!! I need Abe's last name, so we can look him up!\n"
        },
        {
            "from": "Me",
            "time": "2017-04-27T04:33:00.000Z",
            "message": "https://www.linkedin.com/in/abasinanwary/\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-28T01:12:00.000Z",
            "message": "Haha, thank you Brian!!!\n"
        },
        {
            "from": "Me",
            "time": "2017-04-28T01:14:00.000Z",
            "message": "What if I wanted to keep interviewing? For confidence reasons...\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-28T01:26:00.000Z",
            "message": "NOOOOOOO, what is wrong?\n"
        },
        {
            "from": "Me",
            "time": "2017-04-28T01:26:00.000Z",
            "message": "Nothing.\n"
        },
        {
            "from": "Kathleen French",
            "time": "2017-04-28T01:27:00.000Z",
            "message": "Can I call you right now?\n"
        },
        {
            "from": "Me",
            "time": "2017-04-28T01:28:00.000Z",
            "message": "Ok\n"
        }
    ]
}