{
    "thread": "/messaging/thread/6234887817403604992/",
    "participants": [
        {
            "name": "Robert Ardell",
            "title": "Co-Founder & Managing Partner",
            "url": "linkedin.com/in/robertardell",
            "phone": "9493004668 (Mobile)",
            "email": "robert@kore1.com"
        }
    ],
    "messages": [
        {
            "from": "Robert Ardell",
            "time": "2018-02-08T12:00:00.000Z",
            "message": "Fulltime Senior Front End Role/ Web Dev- Largest Winery in the World?\n\nI see you're interested in other opportunities? I'm hoping that's still the case as I think your background would fit in quite nicely with E&J Gallo's Creative team as a Sr. Front End Developer. I acknowledge the fact that you're nowhere near local, so this would require relocation (they are not open to remote). On a positive note, they would provide an upfront stipend for relocation. \n\nThey were recently awarded top 10 in culture in the nation (and put work/life balance at the top of their core values). This position would report up to the digital design director- and you'd be working along side a few other UX Designers/ FE developers. \n\nIf you're the least bit interested I'd love to connect further and hopefully make an introduction. Their process is super straight forward; two phone screens, then a paid trip out to the Gallo Mothership for a day of interviews!\n\nRobert Ardell\n9493004668 | robert@kore1.com\n"
        },
        {
            "from": "Me",
            "time": "2018-02-08T00:33:00.000Z",
            "message": "Sounds excellent! I love wine :)\n"
        },
        {
            "from": "Robert Ardell",
            "time": "2018-02-08T00:39:00.000Z",
            "message": "haha Beautiful. What's your email so I can have my partner Jim reach out to set up a call? He's running point on this particular position.\n"
        },
        {
            "from": "Me",
            "time": "2018-02-08T00:59:00.000Z",
            "message": "Megamindbrian@gmail.com\n"
        }
    ]
}