{
    "thread": "/messaging/thread/6235130919066312704/",
    "participants": [
        {
            "name": "Brent B. Barth CLU, ChFC",
            "title": "Vice-President & Executive Recruiter",
            "url": "linkedin.com/in/brentbarth",
            "phone": null,
            "email": null
        }
    ],
    "messages": [
        {
            "from": "Brent B. Barth CLU, ChFC",
            "time": "2018-02-08T12:00:00.000Z",
            "message": "Senior Software Development Engineer Position Opportunity for You to Explore in the Phoenix Area (PLEASE RESPOND TO THIS MESSAGE)\n\nDear Brian, \n\nMy name is Brent Barth, and I am an Executive Recruiter with BIZJOBZ, LLC, a national executive search firm.\n\nI am contacting you as I viewed your profile on LinkedIn, since you are in my network, and you have listed career opportunities under \"Contact For\" on your profile. I don’t know if you are interested in considering new career options at this point, but if you are, I am looking to fill an important Senior Software Development Engineer position which is located near you in the Phoenix area.\n\nOur Client is a leading global distributor of countless products to billions of customers.\n\nThis position leads to tremendous career opportunities within a rapidly expanding corporation. A highly competitive compensation plan is offered as well as a full benefit package. This is a full-time employment opportunity.\n\nIf you would like to explore this opportunity and learn more about it, please reply to this email by sending me your preferred email address so that I can forward a detailed position description to you. If you wish, please let me know the best way and time to contact you as well.\n\nOn the other hand, should you not wish to explore this opportunity, but you know of someone else who might be a good fit, please let me know so that I can reach out to him or her – or you can forward this email to them for their consideration.\n\nFeel free to view my LinkedIn profile at www.linkedin.com/in/brentbarth Additionally, please connect with me if you wish.\n\n(AS A PROFESSIONAL COURTESY, I ASK THAT YOU EITHER ACCEPT OR DECLINE THIS INMAIL TO YOU)\n\nBrent\n\nBrent Barth CLU, ChFC\nVice-President and Executive Recruiter\nBizJobz, LLC, a National Executive Search Firm\n480-332-7845\nbrent@bizjobz.com\n"
        },
        {
            "from": "Me",
            "time": "2018-02-08T17:07:00.000Z",
            "message": "Thank you for connecting!\n"
        },
        {
            "from": "Brent B. Barth CLU, ChFC",
            "time": "2018-02-08T17:58:00.000Z",
            "message": "Brian,\nMy pleasure.\nIf you would like to consider this position, just send me your email address, and I will send you a detailed position description for you to review.\nAll the best,\nBrent\n"
        },
        {
            "from": "Me",
            "time": "2018-02-08T18:01:00.000Z",
            "message": "Megamindbrian@gmail.com\n"
        }
    ]
}