{
    "thread": "/messaging/thread/6237790056728317952/",
    "participants": [
        {
            "name": "Jacqui Breger",
            "title": "EXECUTIVE DIRECTOR/VP Of MARKETING - Dedicated to Excellence! Marketing strategy, brand awareness & business strategy.",
            "url": "linkedin.com/in/jacqui-breger-6011b710",
            "phone": "6026708487 (Mobile)",
            "email": "miraclesandmarvels@cox.net"
        }
    ],
    "messages": [
        {
            "from": "Me",
            "time": "2017-02-16T00:30:00.000Z",
            "message": "Thank you for connecting!\n"
        },
        {
            "from": "Jacqui Breger",
            "time": "2017-07-06T05:44:00.000Z",
            "message": "Hi Brian, I noticed that you work for Swiftpage and I have just applied for the Senior Director of Marketing position. Do you have any additional info you could share with me or any suggestions that may help me land this position? It sounds like it would be exactly what I am looking for and Swiftpage sounds like just the type of company I would be proud to promote and represent at any and every opportunity!\n\nThanks again for your help!\n\nWarmly,\n\nJacqui exactly\njacqui.breger@gmail.com\n"
        },
        {
            "from": "Me",
            "time": "2017-07-07T14:06:00.000Z",
            "message": "Hey, sorry I forgot to respond. Swiftpage is an awesome place to work. They have free snacks, everyone is super nice, the place is well lit, I appreciate the option for natural sunlight. The office is great. There is a lot of development happening. Did you get a response for the application? Any interview lined up?\n"
        },
        {
            "from": "Jacqui Breger",
            "time": "2017-07-07T14:13:00.000Z",
            "message": "Hi Brian,\n\nThat's great to hear and the position matches my credentials and experience as if it were written just for me! I haven't gotten a response yet to my application - is there anyone in particular I should follow up with? I would really like to pursue this further as I think it would be a great fit both ways, not to mention that the office is located less then 10 minutes from where I live! \n\nThanks so much for your help! \n\nWarmly,\n\nJacqui\n"
        },
        {
            "from": "Jacqui Breger",
            "time": "2017-07-20T01:02:00.000Z",
            "message": "Hi Brian, \n\nI just completed round one of the interview process and the more I learn about Swiftpage the more excited and interested I am! I am so impressed with the company philosophy and culture! I like that they care and are dedicated towards social responsibility, I believe in their product and their work hard/ play hard philosophy. I applaud their dedication towards growth and the overall vision of the company! \n\nI know I will bring the global perspective, experience, skills and passion to the Senior Director of Marketing position that is needed to help realize the company's vision for the marketing department! I am so excited for this opportunity and I know I must be the most enthusiastic candidate they have, so hopefully the hiring team will see this and I will be able to join you soon! \n\nBtw, how large is the staff in the Scottsdale office?\n\nThanks again for all your insight and help! \n\nWarmly,\n\nJacqui\n"
        }
    ]
}