{
    "thread": "/messaging/thread/6239455411292905472/",
    "participants": [
        {
            "name": "Yulia Bondar",
            "title": "BUX is hiring! On the lookout for Back-end Developers, Mobile Developers and Product Designers!",
            "url": "linkedin.com/in/yuliabondar",
            "phone": "+6127068517 (Mobile)",
            "email": "juliyabondar@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "Yulia Bondar",
            "time": "2018-02-20T12:00:00.000Z",
            "message": "New challenges with Booking.com?\n\nHi Brian, \n\nHope you’re having the great day!\n\n\nI came across your profile and I was keen on connecting with you and see if you would be interested to dive deep in Europe programming life-style and in hearing about an opportunity with Booking.com in the heart of Netherlands, Amsterdam. \n\nI wanted to reach out to you specifically because you clearly have a polyglot mindset - have knowledge of few programming languages, with strong experience with algorithms, data structures and distributed systems. \n\nAs you might know, we are the market leader in online hotel reservations, with an average of 1.2 million room bookings made every single day and we are still continuing to rapidly grow. Booking.com is now the 3rd largest e-commerce site in the world behind only Amazon and Alibaba. The biggest our challenge is handling with Big Data and Scalability.\n\nI specifically wanted to reach out to you as it seems you have quite broad experience with various programming languages. Here at booking our hackers use Perl in 80% of our code, however having experience with Perl isn't a necessity. We tend to look for developers who are technically agnostic with a polyglot mindset and your experience seems to be exactly what we would look for. \nWe are a great place to work in terms of technical challenges and we offer full relocation support to make you comfortable.\n\nWould you be interested to hear more?\nRegards,\nYulia\n\nYulia Bondar\n+380980209821 | juliyabondar@gmail.com\n"
        },
        {
            "from": "Me",
            "time": "2018-02-20T15:39:00.000Z",
            "message": "Thank you for connecting!\n"
        }
    ]
}