{
    "thread": "/messaging/thread/6239977560231407616/",
    "participants": [
        {
            "name": "Aaron Burris",
            "title": "Corporate Recruiter at Epiq",
            "url": "linkedin.com/in/aaronburrista",
            "phone": "(913) 621-9424 (Work)",
            "email": "aburris@epiqsystems.com"
        }
    ],
    "messages": [
        {
            "from": "Aaron Burris",
            "time": "2018-02-22T12:00:00.000Z",
            "message": "Networking - Software Development - NEW Projects\n\nBrian, \n\nEpiq continues to expand our teams in the Software & Product Development space and with that comes the need for high level, intelligent, and passionate people to create new, expand current, and improve our best in class products. We can only do this by networking with and reaching out to an individual like yourself in an effort to tell people about the continued opportunity we have here.\n\nWe believe in using the best and newest technology to create our products from scratch and with our agile methods we believe team unity and high level communication will continue to make Epiq a top development shop in Phoenix and beyond. Our Product Development groups are hiring people to help support several new projects for our various lines of business throughout the country. This includes all levels of Software Engineering, Quality Assurance, and Product Owner/BA\n\nI appreciate your time reading this and should you have any interest in learning more about Epiq or the fantastic teams and opportunities please follow the link provided below OR reach out to me directly by phone or email. If for some reason you are happy in your current situation we are happy to hear that too and it is great to see all the talent and great companies that the Phoenix area has. I would welcome the chance to network with you in the future and should you need any help please do not hesitate to ask!\n\nLink:\nhttps://epiqsystems.wd5.myworkdayjobs.com/Epiq_Careers \n\n***NOTE: Many of the roles for these new teams are not yet posted so if you do not see them on our career site yet. I am more than happy to tell you more about them via a phone call in an effort to be proactive while the opportunities are being posted for applicants.***\n\nHave a fantastic day!\n\nAaron Burris\nEpiq\nCorporate Recruiter\nOffice: (913) 621-9424 | Mobile: (913) 291-8768\naburris@epiqsystems.com\n"
        },
        {
            "from": "Me",
            "time": "2018-02-22T01:23:00.000Z",
            "message": "Thank you for connecting!\n"
        },
        {
            "from": "Aaron Burris",
            "time": "2017-03-01T18:55:00.000Z",
            "message": "Brian,\n\nThank you as well! If you are interested and possible open to a call to discuss this new project and the opportunities associated with it I would be happy to do so. Let me know what time might work best and I will do my best to accommodate that need.\n\nThank you,\n\nAaron Burris\naburris@epiqsystems.com\n(913) 621-9424\n"
        },
        {
            "from": "Me",
            "time": "2017-03-01T20:22:00.000Z",
            "message": "What company?\n"
        },
        {
            "from": "Aaron Burris",
            "time": "2017-03-01T20:24:00.000Z",
            "message": "Our company name is Epiq DTI we are based in Atlanta but have offices throughout the US. \n\nThank you,\n\nAaron Burris\n"
        },
        {
            "from": "Me",
            "time": "2017-03-01T20:41:00.000Z",
            "message": "The jobs you are recruiting for is Epiq?\n"
        },
        {
            "from": "Aaron Burris",
            "time": "2017-03-01T20:42:00.000Z",
            "message": "Yes...I work with the internal, corporate, recruiting team for Epiq DTI\n\nThank you,\n\nAaron Burris\n"
        }
    ]
}