{
    "thread": "/messaging/thread/6247856182069915648/",
    "participants": [
        {
            "name": "Siddharth Gosalia",
            "title": "Data Analytics Enthusiast | Machine Learning and Business Intelligence Fanatic | Data Science Graduate Student",
            "url": "linkedin.com/in/siddharthgosalia",
            "phone": "+1 (315) 515-2466 (Mobile)",
            "email": "gosaliasiddharth27@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "Siddharth Gosalia",
            "time": "2017-03-15T19:03:00.000Z",
            "message": "Hello Brian! I am a student at Syracuse University and I am scheduled to interview with Dynamynd Inc. this Friday for the position of Research and Analytics Intern. Since you have already worked at Dynamynd, it would be great to connect with you to know more about your experience with the company.\n"
        },
        {
            "from": "Siddharth Gosalia",
            "time": "2017-03-15T19:17:00.000Z",
            "message": "Hi Brian! Thanks for the prompt acceptance to my connection request. As mentioned earlier, I am scheduled to interview with Dynamynd Inc. this Friday for the position of Research and Analytics Intern. I would be glad if you could share your experience working with the company, the work environment, and culture. I look forward to your reply. Thanks!\n"
        },
        {
            "from": "Me",
            "time": "2017-03-15T19:21:00.000Z",
            "message": "The people at dynamynd are incredibly sweet. Really wonderful on a personal level, they are empathetic and caring and want everyone that uses their product and employees to grow and be happy. Kathy is an angel, if she is still their product manager. With that said, you should be very clear about your expectations for payment and project goals. Make sure you have a strict timeline and you stick to it.\n"
        },
        {
            "from": "Siddharth Gosalia",
            "time": "2017-03-15T19:43:00.000Z",
            "message": "Thanks for the information. From your experience, it seems that the open-cultured work environment at Dynamynd is exactly what I am looking for. Also, I couldn't find much information about the company online. From what I know, it is a very small start-up company founded in 2015 by Kathy Kolbe, who is also the founder of Kolbe Corp. I am not sure if the year is correct as you had worked for the company back in 2013, which makes me believe I have incorrect information regarding when exactly was the company founded.\n"
        },
        {
            "from": "Me",
            "time": "2017-03-15T19:47:00.000Z",
            "message": "I changed the date of my work so it doesn't overlap on my timeline, I worked there in 2015.\n"
        },
        {
            "from": "Siddharth Gosalia",
            "time": "2017-03-15T21:11:00.000Z",
            "message": "Oh! Got it. To the best of my knowledge, the company specializes in developing software and applications pertaining to self-assessment and human instinct. Correct me if I am wrong. I couldn't find much information online about what does the company do, and the company website is still under development, which is why I reached out to you. I apologize for bugging you with questions.\n"
        },
        {
            "from": "Me",
            "time": "2017-03-15T23:18:00.000Z",
            "message": "That sounds right to me. It is a personality career assessment. There isn't much online because their product is in development, so all the links are kept secret except for the pilot programs they are working on. It was a while ago.\n"
        },
        {
            "from": "Siddharth Gosalia",
            "time": "2017-03-16T00:08:00.000Z",
            "message": "That was valuable information. I appreciate your inputs. Thank you once again!\n"
        },
        {
            "from": "Siddharth Gosalia",
            "time": "2017-04-05T02:00:00.000Z",
            "message": "Hello Brian, Hope you are doing good. I am glad to share with you that after clearing two rounds of interviews, I just received the internship offer (verbal offer) from Dynamynd today. However, I have some concerns before accepting the offer. They are paying me $15/hour. I am not sure if that's the average pay rate they offer to all interns. I personally feel the pay rate is a bit low. Also, they haven't mentioned anything about accommodation yet (I am yet to receive the official offer letter). But being a start-up company, I don't think they will provide me accomodation. After doing some research on the internet, I apparently learned that Scottsdale is a pretty expensive place to live in. In light of these factors, I feel I should negotiate with them regarding the pay rate. Do you have any idea of how much do they normally pay the itnerns? Also, what would be the approximate cost of living in Scotsdalle? I would appreciate your thoughts on this. I look forward to your reply. Thanks!\n"
        }
    ]
}