{
    "thread": "/messaging/thread/6247890021957844992/",
    "participants": [
        {
            "name": "Veronica Barcelo",
            "title": "Sr. IT Recruiter at The ProSource Group",
            "url": "linkedin.com/in/veronicabarcelo",
            "phone": null,
            "email": null
        }
    ],
    "messages": [
        {
            "from": "Veronica Barcelo",
            "time": "2017-03-15T12:00:00.000Z",
            "message": "Veronica Barcelo- Software Engineers\n\nHi Brian, \n\nI hope this email finds you doing well. My name is Veronica Barcelo and I work at The ProSource Group. I ran across your profile today. \n\nOne of our top clients in the San Diego, CA area is looking to bring on Back-end Software Engineers with experience in \"either\" ( C# or Scala or Java). Solid experience with AWS and python scripting. (Cloud)\n\nThis is a contract to hire full time role in San Diego, CA . Once converted our client offers candidates a benefits package- client covers 100% cost of medical benefits for employee and family, offers stock options etc.\n\nI wanted to see if you would be interested in hearing more about this opportunity?\nIf so, please reply back with a copy of your resume and we can schedule a time to talk for a brief conversation and an email address so I may email formal job role. \n\nP.S. If this opportunity is not right for you, but you know of someone that might be interested in the role, please feel free to share my contact information with them. Thank you for taking time out of your day to read this email. I truly appreciate it.\n\nI like your background and I hope to hear from you!\n\nVeronica Barceló- Sr. Recruiter \nvbarcelo@theprosourcegroup.com\nDirect: 619-391-7461\nCell: 619-319-0909\n"
        },
        {
            "from": "Me",
            "time": "2017-03-15T23:19:00.000Z",
            "message": "I can do all of that but I can only talk to hiring managers and direct team members.\n"
        },
        {
            "from": "Veronica Barcelo",
            "time": "2017-03-15T23:46:00.000Z",
            "message": "Okay I have sent your Linkedin profile Justin Williams and Lance Klem won't be back till Monday. They will follow up. Thanks Veronica\n"
        },
        {
            "from": "Me",
            "time": "2017-03-16T00:04:00.000Z",
            "message": "Thank you!\n"
        }
    ]
}