{
    "thread": "/messaging/thread/6252492467103506432/",
    "participants": [
        {
            "name": "Lauretta (Laurie) (Ongaro) Zerga",
            "title": "Business Advisor | Executive Coach | Business Consultant | Keynote Speaker | Trainer | Executive Development",
            "url": "linkedin.com/in/lauriezerga",
            "phone": "510-326-3618 (Mobile)",
            "email": "laurie.lauretta@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "Lauretta (Laurie) Zerga",
            "time": "2017-03-28T14:12:00.000Z",
            "message": "Thanks for connecting, how can I support you today? Laurie Zerga\n"
        },
        {
            "from": "Me",
            "time": "2017-03-28T14:17:00.000Z",
            "message": "When your boss at a large financial institution tells you that we will be using scrum for project management, then never holds a sprint planning meeting and you realize they don't know anything about agile, what should you do, risk your job and tell them they are doing it wrong, or risk your job and remain disempowered and demoralized?\n"
        },
        {
            "from": "Lauretta (Laurie) Zerga",
            "time": "2017-03-28T14:43:00.000Z",
            "message": "None of the above, I would hold a meeting 1) thank them for great decision, 2) identify opportunity to leverage scrum more effectively for faster roi, 3) ask to support leading scrum meetings. It's unlikely I would risk my job in this format and I wouldn't be sitting around disempowered. I refuse to live life disempowered, I never put myself in that situation when I was in corporate. And by embracing change and promoting it, I got promoted for it. In one company early in my career that it didn't work, I just left for a higher paying job. Now I am a business coach and consultant I support leaders to empower their employees.\n"
        },
        {
            "from": "Lauretta (Laurie) Zerga",
            "time": "2017-03-28T14:43:00.000Z",
            "message": "Want to find out more? Schedule a Complimentary 30-Minute Booming Business with Balance session TODAY!\nhttp://www.scheduleyou.in/Gyz2f5sU6\n"
        },
        {
            "from": "Me",
            "time": "2017-03-28T14:51:00.000Z",
            "message": "I am afraid I let the project manager assert dominance over me and my goals\n"
        },
        {
            "from": "Me",
            "time": "2017-03-28T14:51:00.000Z",
            "message": "Nobody cares what I think.\n"
        },
        {
            "from": "Lauretta (Laurie) Zerga",
            "time": "2017-03-28T15:29:00.000Z",
            "message": "Flip the negative self talk, \"I have something positive and valuable to offer\" or I used to sometimes think, \"somebody cares what I think and values it - I will find them.\" How would one of these thoughts feel? instead of \"Nobody cares what I think\"\n"
        },
        {
            "from": "Me",
            "time": "2017-03-28T15:50:00.000Z",
            "message": "I read that the best managers fill their employees with fail and success but too much of either can have negative effects. I see a lot of people who don't excercise their critical thinking skills because they are focused on one repetitive task for years. You and I have that creative mindset. I am just trying to find insight in to how to earn people's trust in my \"title\" since people rely so heavily on it. Will I ever convince people that I'm a wizard?\n"
        },
        {
            "from": "Lauretta (Laurie) Zerga",
            "time": "2017-03-28T20:42:00.000Z",
            "message": "Why do you feel a need to convince people you are a wizard? Titles are somewhat irrelevant. It's what you do, the results, and how people feel around you that builds trust.\n"
        },
        {
            "from": "Me",
            "time": "2017-03-28T21:01:00.000Z",
            "message": "I agree with you. But I've been in a conversation where the train of thought was completely halted and I was asked \"who are you representing?\" As in what consulting agency was I from. I don't even know what I can do that is useful to others, I just know I've been pushed so hard as to never feel job satisfaction and I don't know where to look for that business partner that can appreciate my ability to use a hammer on a keyboard and make a working web app come out.\n"
        },
        {
            "from": "Lauretta (Laurie) Zerga",
            "time": "2017-03-29T16:29:00.000Z",
            "message": "Would you like my support? Please set up a complimentary phone call, I can help you. http://www.scheduleyou.in/Gyz2f5sU6 Perhaps, I can help you put some structure around what you do and develop a clear message. I do this for my clients all the time. If you can't find a time that works, call 877-836-3569\n"
        },
        {
            "from": "Lauretta (Laurie) Zerga",
            "time": "2017-04-06T19:11:00.000Z",
            "message": "Thank you so much for your time last week. I left a message earlier this week. Did you make a decision or do you need further information about how coaching works? Laurie\n"
        },
        {
            "from": "Me",
            "time": "2017-04-06T19:14:00.000Z",
            "message": "I talked to the wifey. We don't really have the money for this.\n"
        }
    ]
}