{
    "thread": "/messaging/thread/6260200880453279744/",
    "participants": [
        {
            "name": "Donald Lappe",
            "title": "Technical Recruiter at Meridian Technologies",
            "url": "linkedin.com/in/donald-lappe-00852428",
            "phone": "",
            "email": "dlappe@meridiantechnologies.net"
        }
    ],
    "messages": [
        {
            "from": "Donald Lappe",
            "time": "2017-04-18T12:00:00.000Z",
            "message": "Sugar CRM - Senior Application Lead\n\nHi Brian, \n\nI currently have a Senior Application Lead position with Gartner Medical Research. Are you open to new opportunities? This position is in Stamford, CT.\n\nHappy to send JD if interested or if a fit for someone in your network.\n\nThanks!\n\nDonald Lappe\ndlappe@meridiantechnologies.net\n"
        },
        {
            "from": "Me",
            "time": "2017-04-27T21:09:00.000Z",
            "message": "Wow sugar crm, that is exciting...\n"
        },
        {
            "from": "Donald Lappe",
            "time": "2017-05-02T12:51:00.000Z",
            "message": "Hey Brian,\n\nMy apologies for the late response - was having issues with my Linkedin Recruiter account. Sending along the JD for the SugarCRM position with Gartner.\n\nSr. Application Lead \nWhen you join Gartner, you’ll be part of a fast-growing team that helps the world become smarter and more connected. We’re the leader in our industry, achieving double-digit growth by helping clients make the right decisions with business and technology insights they can’t find anywhere else. Our associates enjoy a collaborative work environment, exceptional training and career development — as well as unlimited growth potential. If you like working with a generous, supportive, high-performing team, Gartner is where you want to be. \nAbout this role: \nCoordinates and leads application development activities in all areas of the development lifecycle. Under limited supervision is able to exercise judgment in ensuring involvement of senior team leaders when necessary. Has in-depth knowledge of the principals, theories, practices, and techniques for leading the activities related to planning, managing and implementing application development projects and programs. \nWhat you’ll do: \n• Architecting, Designing, Implementing, Unit testing, Integration testing and supporting software applications and services \n• Lead the review and analysis of business requirements to create technical specifications \n• Drive architecture and technical design discussions \n• Direct multiple technology-based projects and staff in support of STG \n• Responsible for the development of strategic and tactical planning of technology and people resources necessary for successful completion of several large-scale projects. \n• Direct technical activities to Estimate, Plan, Design, Build, Test, and Migrate solutions into production\n"
        },
        {
            "from": "Donald Lappe",
            "time": "2017-05-02T12:51:00.000Z",
            "message": "• Direct analysis on and shape business requirements to determine technical design \n• Evaluate developers following project completion identifying strengths and areas for development via a formal, written performance appraisal. \n\nWhat you’ll need: \n\n• Bachelor or Master's degree in Computer Science or equivalent experience in the field of software development. \n• 8 - 10 years of experience in software development which includes Web based application development experience. \n• A proven track record of experience in leading the designing and deployment of large-scale solutions. \n• Experience in all phases of a systems development lifecycle \n• Excellent software development and object-oriented design fundamentals with a strong background in architecting software applications \n• Experience implementing and deploying SugarCRM as an enterprise solution \n• Java, PHP JavaScript, HTML and SQL Experience with a relational database. \n• ReactJS/Angular, Twitter Bootstrap, CSS 3.0 experience is a plus \n• Excellent verbal and written communication skills \n\nWho you are: \n• Motivated, high-potential performer, with demonstrated ability to influence and lead \n• Strong communicator with excellent interpersonal skills \n• Able to solve complex problems and successfully manage ambiguity and unexpected change \n• Teachable and embracing of best practices and feedback as a means of continuous improvement \n• Consistently high achiever marked by perseverance, humility and a positive outlook in the face of challenges\n\nCan do $90/hr for the contract portion, intention is to roll perm at $150k. Let me know what you think!\n"
        },
        {
            "from": "Me",
            "time": "2017-05-04T04:22:00.000Z",
            "message": "Do they have unlimited paid time off?\n"
        },
        {
            "from": "Donald Lappe",
            "time": "2017-05-04T11:56:00.000Z",
            "message": "Unfortunately I don't have all the info in terms of PTO, etc. when the position rolls Perm. Each group within Gartner is different. That would be a good conversation for the initial phone call with the team.\n\nI wish I could give more info than what I have, but we work within a vendor neutral system that only allows limited access to the managers. I can only work with the JD and info they provide initially and bring the best talent I can to the table.\n\nWould you be interested in discussing further?\n"
        }
    ]
}