{
    "thread": "/messaging/thread/6262354762394583040/",
    "participants": [
        {
            "name": "Brian Patterson",
            "title": "Sr. Talent Acquisition Consultant at Xtreme Consulting Group, Inc.",
            "url": "linkedin.com/in/briangpatterson",
            "phone": "",
            "email": "Brian@Xtremeconsulting.com"
        }
    ],
    "messages": [
        {
            "from": "Brian Patterson",
            "time": "2017-04-24T12:00:00.000Z",
            "message": "How is everything at MindSpree? I have various Direct Hire Senior and Mid-Level Software Development Engineer jobs at an education software client in Chandler, AZ.\n\nDear Brian, \n\nI ran across your profile on LinkedIn and it looks like you have done some really great things at MindSpree related to Software Development. \n\nWe have 10+ year relationships with a majority of our clients and we have a leading technology education software and online learning/digital curriculum client in Chandler, AZ that has various Senior and Mid-Level Direct Hire Software Development Engineer employment opportunities. Not sure if you are ready for your next play, but was wondering if you know of anyone in your network with similar skills who may be looking. \n\nThis client is a Microsoft Shop (.Net Javascript, Node, Angular), has a collaborative environment and promotes work life balance with a full gym on site, lots of free lunches, casual dress (jeans, shorts, etc.) flexible work hours and the ability to work from home when needed. \n\nBelow are a few additional details: \n• Experience with at least one modern language, multiple strongly preferred (e.g. C#, Ruby, Python, Java, JavaScript) \n• Knowledge of full development stack (e.g. UX, Web, API, Data, Business Logic) \n• Awareness of web development best practices (e.g. MVC, REST, JavaScript) \n• Involvement with Open Source projects, preferred. \n• Experience with NoSQL, Big Data, or Machine Learning technologies desirable. \n• Passion for Education is a must; experience in Ed-Tech helpful, but not required. \n\nI specialize in helping professionals in your field connect with some of the top companies in the area. Would you have 5 to 10 minutes to discuss? \n\nPlease feel free to contact me or to forward my contact info to your friends and colleagues that may be interested in these opportunities. Thanks so much in advance for your help! I look forward to hearing from you. In the meantime, I wish you every personal and professional success. \n\nThanks,\n\nBrian Patterson | Sr. Talent Acquisition Consultant \nXtreme Consulting Group, Inc \nBrian@xtremeconsulting.com\nDirect 602.977.7210 | Cell 602.315.8663\n"
        },
        {
            "from": "Me",
            "time": "2017-04-24T19:27:00.000Z",
            "message": "I can tell this is automated because I didn't actually do anything at mindspree, it's just on my profile to make the company look bigger and well supported.\n"
        },
        {
            "from": "Brian Patterson",
            "time": "2017-04-24T19:39:00.000Z",
            "message": "Hi Brian, thank you for the reply. I had assumed based on your profile \nthat you had architected a system for connecting tutors with students. The \nclient who is looking to hire additional Software Engineers has been \nblazing a trail in online secondary education for nearly 15 years. If you \nknow of anyone who may be interested in hearing more about these \nopportunities please let me know. Thanks,\n\n\n\n\n\nBrian Patterson | Sr. Talent Acquisition Consultant\n\nXtreme Consulting Group, Inc. | Phoenix, AZ\n\nDirect 602.977.7210 | Cell 602.315.8663 \n\n\n\n[mail Logo] <http://www.xtremeconsulting.com/> \n[mail-Logo-facebook-center] <https://www.facebook.com/XtremeCGI> \n[mail-Logo--linkedin-center]\n<http://www.linkedin.com/company/xtremeconsulting?trk=hb_tab_compy_id_125705> \n[mail-Logo-twitter-center] <https://twitter.com/XtremeCGI>\n"
        },
        {
            "from": "Me",
            "time": "2017-04-27T20:12:00.000Z",
            "message": "I was already submitted to StrongMind. Is that who this is with?\n"
        },
        {
            "from": "Brian Patterson",
            "time": "2017-04-27T20:27:00.000Z",
            "message": "Thank you for the reply Brian. Yes, was it from someone else from Xtreme \nConsulting or another agency that submitted you? I am not findin you in \nour candidate system so it was probably another agency. Please email me \nyour current resume in MS word format and let me know your compensation \nrequirements as I may have other opportunities that may also be of interest \nto you. Thanks,\n\n\n\nBrian Patterson | Sr. Talent Acquisition Consultant\n\nXtreme Consulting Group, Inc. | Phoenix, AZ\n\nDirect 602.977.7210 | Cell 602.315.8663 \n\n\n\n[Email Logo] <http://www.xtremeconsulting.com/> \n[Email-Logo-facebook-center] <https://www.facebook.com/XtremeCGI> \n[Email-Logo--linkedin-center]\n<http://www.linkedin.com/company/xtremeconsulting?trk=hb_tab_compy_id_125705> \n[Email-Logo-twitter-center] <https://twitter.com/XtremeCGI>\n"
        },
        {
            "from": "Me",
            "time": "2017-04-27T21:07:00.000Z",
            "message": "They already turned me down. I don't think they are hiring. They just do interviews so they can justify hiring H1B visas. They have to be able to \"prove no one else is qualified\".\n"
        },
        {
            "from": "Me",
            "time": "2017-04-27T21:07:00.000Z",
            "message": "And no one is qualified because no American is going to blindly follow instructions without asking why are we doing this? Like Indians will.\n"
        },
        {
            "from": "Brian Patterson",
            "time": "2017-04-27T21:10:00.000Z",
            "message": "Thanks Scott, please email me your resume and compensation requirements and \nI will see what else I have at other clients that may be of interest to \nyou. Thanks, Brian brian@xtremeconsulting.com\n\n\n\nBrian Patterson | Sr. Talent Acquisition Consultant\n\nXtreme Consulting Group, Inc. | Phoenix, AZ\n\nDirect 602.977.7210 | Cell 602.315.8663 \n\n\n\n[Email Logo] <http://www.xtremeconsulting.com/> \n[Email-Logo-facebook-center] <https://www.facebook.com/XtremeCGI> \n[Email-Logo--linkedin-center]\n<http://www.linkedin.com/company/xtremeconsulting?trk=hb_tab_compy_id_125705> \n[Email-Logo-twitter-center] <https://twitter.com/XtremeCGI>\n"
        },
        {
            "from": "Me",
            "time": "2017-04-27T21:11:00.000Z",
            "message": "Wow your recruit-bot is on a role ;)\n"
        },
        {
            "from": "Brian Patterson",
            "time": "2017-04-27T21:15:00.000Z",
            "message": "Your linked in replies go straight to my work email in box and I am sitting \nat my desk right now. J \n\n\n\nBrian Patterson | Sr. Talent Acquisition Consultant\n\nXtreme Consulting Group, Inc. | Phoenix, AZ\n\nDirect 602.977.7210 | Cell 602.315.8663 \n\n\n\n[Email Logo] <http://www.xtremeconsulting.com/> \n[Email-Logo-facebook-center] <https://www.facebook.com/XtremeCGI> \n[Email-Logo--linkedin-center]\n<http://www.linkedin.com/company/xtremeconsulting?trk=hb_tab_compy_id_125705> \n[Email-Logo-twitter-center] <https://twitter.com/XtremeCGI>\n"
        },
        {
            "from": "Me",
            "time": "2017-04-27T21:16:00.000Z",
            "message": "I was thinking to get in to recruiting. How do you tell a unicorn from a false positive?\n"
        },
        {
            "from": "Brian Patterson",
            "time": "2017-06-27T12:00:00.000Z",
            "message": "Are you ready for your next play? I have a direct hire Front End Developer Employment opportunity in Scottsdale that may interest you.\n\nDear Brian, \n\nI ran across your profile on LinkedIn. Your profile indicates you are open to opportunities. It looks like you have done some really great things in Software development. We have 10+ year relationships with a majority of our clients and I have a leading software development client in Scottsdale, AZ that has an immediate direct hire employment opportunity for Front End Developer that I would like to discuss with you. This developer will be responsible for designing and developing changes and new features to our client’s workforce optimization product suite.\n\nLocated in North Scottsdale this client offers a competitive compensation package that includes generous group benefits, including medical, dental, vision, health savings accounts, flexible spending accounts, disability, life and AD&D insurance, paid-time off, tuition reimbursement, employee referral program, flexible hours, comfortable dress code, and even offers insurance for your pets.\n\nI specialize in helping professionals in your field connect with some of the top companies in the area and I was hoping to learn more about your interests, the types of opportunities you're looking for and to see if I know of any other current openings that line up with what you want to do. \n\nWould you have 5 to 10 minutes tomorrow to discuss? \n\nThanks\n\nBrian Patterson | Sr. Talent Acquisition Consultant \nXtreme Consulting Group, Inc \nBrian@xtremeconsulting.com\nDirect 602.977.7210 | Cell 602.315.8663\n"
        },
        {
            "from": "Me",
            "time": "2017-06-27T01:21:00.000Z",
            "message": "Yeah sure, what company? Call anytime.\n"
        },
        {
            "from": "Brian Patterson",
            "time": "2017-06-27T01:31:00.000Z",
            "message": "Hi Brian, thank you the reply. The company is DVS analytics.\n\n\n\nOne of DVS Analytics core software products is Encore workforce optimization software which automates processes to create high levels of customer satisfaction and improve performance. Encore workforce optimization provides contact centers with comprehensive recording, analytics, and quality and workforce management for industry compliance, KPI improvement, and more. With the industry’s best ROI, thousands of contact centers place their trust in Encore solutions.\n\n\n\n\n\nWhat is the best number to reach you at?\n\n\n\nThanks,\n\n\n\nBrian Patterson | Sr. Talent Acquisition Consultant\n\nXtreme Consulting Group, Inc. | Phoenix, AZ\n\nDirect 602.977.7210 | Cell 602.315.8663 \n\n\n\n[Email Logo] <http://www.xtremeconsulting.com/> [Email-Logo-facebook-center] <https://www.facebook.com/XtremeCGI> [Email-Logo--linkedin-center] <http://www.linkedin.com/company/xtremeconsulting?trk=hb_tab_compy_id_125705> [Email-Logo-twitter-center] <https://twitter.com/XtremeCGI>\n"
        }
    ]
}