{
    "thread": "/messaging/thread/6263051113566658560/",
    "participants": [
        {
            "name": "Joe Barry",
            "title": "Sr Technical Recruiter at IMPACT Technology Recruiting",
            "url": "linkedin.com/in/josephbarry",
            "phone": "",
            "email": "joebarry2575@yahoo.com"
        }
    ],
    "messages": [
        {
            "from": "Joe Barry",
            "time": "2017-04-26T12:00:00.000Z",
            "message": ".Net & Web Developement opportunities in Phoenix\n\nI hope you are well. I am reaching out to let you know that I currently have many options available for your review. I have contract, contract-to-hire, and direct hire options to satisfy every need.\n\nBelow is a sample. Please send a Word formatted resume to jbarry@go-impact.com to learn more about anything listed.\n\n•\tFront End Developer – Scottsdale – Direct Hire\n•\t.Net Developer – Phoenix – AZ Department of Education\n•\tSr. .Net Developer – Phoenix – AZ Secretary of State\n• UI Developer - Phoenix - Maricopa County Superior Court\n• Web Applications Developer III – Phx (Near Sky Harbor Airport) – Direct Hire\n•\tInteractive Application Developer – Scottsdale - Prizelogic\n•\t.Net Developer – Scottsdale - Prizelogic\n•\tSenior .Net Developer – Scottsdale - Prizelogic\n•\tFull Stack Developer – Scottsdale - HealthiestYou\n\nBest Regards,\n\nJoe Barry \nIMPACT Technology Recruiting | jbarry@go-impact.com\n"
        },
        {
            "from": "Me",
            "time": "2017-04-26T17:59:00.000Z",
            "message": "What companies?\n"
        },
        {
            "from": "Me",
            "time": "2017-04-26T17:59:00.000Z",
            "message": "Nvm had to open the full message. I've already been submitted at most of those.\n"
        },
        {
            "from": "Me",
            "time": "2017-04-27T20:11:00.000Z",
            "message": "I think they are just interviewing so they can justify to some hypothetical lawyer that they need to hire H1B visas because no one here is \"qualified\". Which is because no American wants to work on their stupid project without asking questions as to why are we doing this? You don't get that kind of honest expression from people starving for money.\n"
        }
    ]
}