{
    "thread": "/messaging/thread/6267845369334497280/",
    "participants": [
        {
            "name": "JD Frank",
            "title": "Account Executive/Technical Recruiter at Prosum",
            "url": "linkedin.com/in/jd-frank-171237b7",
            "phone": "",
            "email": ""
        }
    ],
    "messages": [
        {
            "from": "JD Frank",
            "time": "2017-05-09T12:00:00.000Z",
            "message": "Hiring: Direct Hire - Software Developer - Tempe, AZ\n\nHello Brian,\n\nI hope you are doing well. I came across your profile and wanted to see if you are still entertaining job opportunities. We are searching for a Sr. Software Engineer for one of our startup clients in Tempe, AZ. This is a direct hire position with a starting salary of $90k. I included the full job description below. We are currently in the process of scheduling interviews. If you are interested, please let send me an updated resume and let me know a good time and number to reach you at today. Thanks! \n\nJob Description:\tThe major purpose of the Sr Software Engineer is to design, develop, and architecture software, write code and develop assigned application, maintain and support product and team.\n\nJob Duties:\n- Programming new features and updates to product. Programming based on acceptance criteria for feature using javascript, html, css, sql, cfml, php, coldfusion, jquery, node.js and cfscript. Evaluate the requirements of the story, complete research for technical implications, programming, testing on hardware, hand off code to team member for code review, complete changes based on feedback from code review, submit to QA, and work with QA to resolve any defects until feature meets acceptance criteria. Handle more complex tasks. \n- Use the following software: sublime text, sql server management studio, various web frameworks, git. \n- Responsible for supporting other developers on issues and questions.\n- Planning the features and design for product\n- Using the Scrumwise program, participate in daily meetings with product team which include: daily review of work, defining goals, reviewing the backlog, prioritizing features, grooming the stories, defining the acceptance criteria then assign tasks for the 2 week Sprint, review how the Sprint went and how it can be improved.\n\nJD Frank\njd.frank@prosum.com\n"
        },
        {
            "from": "Me",
            "time": "2017-05-09T23:02:00.000Z",
            "message": "What company?\n"
        },
        {
            "from": "JD Frank",
            "time": "2017-05-09T23:08:00.000Z",
            "message": "I can go over the details of the position with you over the phone if you like. Please feel free to give me a call at 602-540-6988. Thanks Brian!\n"
        },
        {
            "from": "JD Frank",
            "time": "2017-05-11T17:33:00.000Z",
            "message": "Good morning Brian, hope all is well. Checking in to see if you wanted to chat about that Sr. Software Dev position today. Let me know. Thanks!\n"
        },
        {
            "from": "Me",
            "time": "2017-05-11T18:25:00.000Z",
            "message": "What company?\n"
        },
        {
            "from": "JD Frank",
            "time": "2017-05-11T18:29:00.000Z",
            "message": "Its a ticketing software company based in Tempe, AZ. I can go over additional details with you over the phone if you have any interest.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-11T18:43:00.000Z",
            "message": "Is this gingerbread shed?\n"
        },
        {
            "from": "JD Frank",
            "time": "2017-05-11T18:44:00.000Z",
            "message": "It sure is. Have you already applied with them?\n"
        },
        {
            "from": "Me",
            "time": "2017-05-11T18:45:00.000Z",
            "message": "No. That wasn't so hard was it?\n"
        },
        {
            "from": "JD Frank",
            "time": "2017-05-11T18:47:00.000Z",
            "message": "Just wanted to chat with you over the phone, Brian. We have a couple positions that align with your skillset.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-11T18:48:00.000Z",
            "message": "Right, but every recruiter refuses to tell me the name of the company because... I'll establish some sort of bias? I'll apply and go around them? Why?\n"
        },
        {
            "from": "JD Frank",
            "time": "2017-05-11T18:54:00.000Z",
            "message": "Yeah, id say its typically the latter. If its a contract role and the recruiter doesn't tell you name of the company that's a red flag. But with FTE's, I prefer going over the position details over the phone.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-11T18:56:00.000Z",
            "message": "Dang. Has that ever happened to you? That sucks. The first interview I had I asked the interviewer if she would consider cutting out the recruiter to gain some sort of insight to her loyalties. She said that would be unfair. I've never actually considered it, but I hear it happens.\n"
        },
        {
            "from": "JD Frank",
            "time": "2017-05-11T18:56:00.000Z",
            "message": "We have two openings with Gingerbread for the Sr. Software Engineer role and they are looking to schedule interviews for next week.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-11T18:58:00.000Z",
            "message": "I'll interview but I am happy at my current job. Now sure though. I might be too disruptive to fit in to the corporate world anymore. I feel like every time I bring something up I am being distracting. There is just no way for me to fully document all of my relevant skills.\n"
        },
        {
            "from": "JD Frank",
            "time": "2017-05-11T19:02:00.000Z",
            "message": "Well, Gingerbread is a small company with a startup atmosphere. Might be a good fit for you and your disruptiveness.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-11T19:30:00.000Z",
            "message": "I had an interview with Michael Murray for digit.co in San Francisco and he said because they are a start up they can't afford to make any more mistakes like hiring me. He also looked at me like I killed his cat. I think I will stick with a company that has a budget from now on.\n"
        }
    ]
}