{
    "thread": "/messaging/thread/6269926907542933504/",
    "participants": [
        {
            "name": "Alexander Gildenberg",
            "title": "Head of Software Engineering and Product Management for Consumer Electronics at Amazon",
            "url": "linkedin.com/in/alexandergildenberg",
            "phone": "314-600-5467 (Mobile)",
            "email": "alexgild@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "Alexander Gildenberg",
            "time": "2017-05-15T12:00:00.000Z",
            "message": "Sr. Software Engineer opportunity with Amazon Retail\n\nDear Brian, \n\nI am an Engineering Leader managing 70+ dev team for Amazon Consumer Electronics Technology team. \nI am looking for Sr. Software Engineers to join my team in Seattle or Denver. Relocation to either of these locations is required. \nGreat team vibe, interesting projects in retail/eCommerce space and great comp too.\n\nMy profile has links to some of the projects my team launched last and this year; there are also some high visibility secret initiatives in eCommerce space that we are hiring for. \n\nIf you are interested to proceed, please reply back along with your updated resume to myself (agilden@amazon.com) and my recruiting partner, Thao Diep (thaodiep@amazon.com). If you were already contacted by other Amazon team, but still interested in CETech, please lets us know.You always have an option to choose which team to join in Amazon! \n\nLooking forward to hearing from you,\n\nAlex Gildenberg,\nHead of Engineering, Consumer Electronics Tech\n"
        },
        {
            "from": "Me",
            "time": "2017-05-15T17:35:00.000Z",
            "message": "Ok I replied over email.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-15T17:35:00.000Z",
            "message": "I'd love to work for Amazon but I can tell companies are having a hard time \"digesting\" my disruptive skill-set.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-15T17:35:00.000Z",
            "message": "I'm currently designing a new UX for the payment portal for ACT! The internet's most exclaimed CRM for over 30 years! Exciting right? ;) I am learning the importance of small businesses.\n"
        },
        {
            "from": "Alexander Gildenberg",
            "time": "2017-05-15T17:49:00.000Z",
            "message": "that's ok, we hire only disruptive folks.\n"
        }
    ]
}