{
    "thread": "/messaging/thread/6271267605210816512/",
    "participants": [
        {
            "name": "Hoseine Wu Yue Pak",
            "title": "Global Talent Acquisition Specialist at UnitedHealth Group",
            "url": "linkedin.com/in/hoseine-wu-yue-pak-4ba1b5a7",
            "phone": "",
            "email": ""
        }
    ],
    "messages": [
        {
            "from": "Hoseine Wu Yue Pak",
            "time": "2017-05-19T12:00:00.000Z",
            "message": "Empower Lives with us as a Consultant in Phoenix, Arizona or Telecommute!\n\nDear Brian, \n\nUnitedHealth Group continues to make a difference as we invent the future of Healthcare and we are excited to discover you or someone you know who is enthusiastic in being involved in the modernization of global health. We are offering you, your life's best work.(SM)\n\nUAT Business Consultant - Phoenix, AZ or Telecommute – Job #716757\n\nA career at UnitedHealth Group means adding value to the health care system.\n\nRequirements include:\n-Bachelor’s degree (in Business, Health Administration, related field preferred) or equivalent work experience\n-5+ years of experience in Business Analysis and / or UAT Testing; including some experience with large platform implementations\n-Intermediate level of proficiency with Excel, Access and PowerPoint\n\nComplete job descriptions can be found on our website.\n\nConsider your future and apply here: http://uhg.hr/BopsAZli \n\nPlease apply directly through the careers website and a recruiter will review your resume promptly.\n\nJoin us and let your excellence shine through in doing your life’s best work.(SM)\n\nNeed assistance applying? Contact HR Direct at 1-800-561-0861, 7:00 am - 7:00 pm CST. When prompted, say, \"RECRUITMENT SERVICES\".\n\nBest regards,\nHoseine Wu Yue Pak\nGlobal Talent Acquisition Specialist\nUnitedHealth Group\n"
        },
        {
            "from": "Me",
            "time": "2017-05-19T13:43:00.000Z",
            "message": "Sorry, no consulting because then the company doesn't pay healthcare or care about me personally. I don't want the manager to think I am not a part of the team.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-19T13:43:00.000Z",
            "message": "Kind of weird for a healthcare company to not want to pay for healthcare right?\n"
        }
    ]
}