{
    "thread": "/messaging/thread/6272808325222588417/",
    "participants": [
        {
            "name": "Brent Booth",
            "title": "National Resource Manager at Signature Consultants",
            "url": "linkedin.com/in/brent-booth-097746a5",
            "phone": "",
            "email": ""
        }
    ],
    "messages": [
        {
            "from": "Brent Booth",
            "time": "2017-05-23T12:00:00.000Z",
            "message": "Help- DevOps Engineer\n\nHi Brian, \n\nI hope all is well. I came across your profile and thought you may be just the right person that could help me out with the project I am working on. One of my large clients in the Phoenix, AZ area is in need of Devops engineers that are eager to learn different technologies versus being siloed in one particular area. This will begin as a contract position but the folks they're looking for must be able to convert FTE. Please let me know if anyone comes to mind and I can provide more info!\n\n-Brent\n\nBrent Booth\n(413) 454-8736 | bbooth@sigconsult.com\n"
        },
        {
            "from": "Me",
            "time": "2017-05-23T15:51:00.000Z",
            "message": "Really? Learning different technologies as a contractor? I am pretty sure a contracting employer does not care how much I learn and just wants me to do the job I am hired for. If you want to attract real talent they need to feel cared for. That means paying them decently, pay for healthcare since it's the elderly generations invention anyways. Offer paid vacation as a part of people's mental health. This country has taken a turn for the worse when it comes to how we treat employees and the way you put it is false advertising.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-23T15:51:00.000Z",
            "message": "I am depending on you to make a difference in this world. That means sticking up for what is right and wrong and telling employers that this position is a hard sell unless they change their terms. I need you to help me reverse the 18 hour work days plus side gigs just to live decently. Americans are working their souls to death.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-23T15:51:00.000Z",
            "message": "And I've heard every argument. Just because our work is more technical than my grandfather's generation as opposed to physical does not make it easier or less draining.\n"
        },
        {
            "from": "Me",
            "time": "2017-05-23T22:36:00.000Z",
            "message": "Nothing? You don't want to point out my flaws in reasoning?\n"
        },
        {
            "from": "Brent Booth",
            "time": "2017-05-25T21:50:00.000Z",
            "message": "Hi Brian,\n\nI apologize for the delayed response. I took your initial messages as a sign of disinterest so I did not want to bother you with any additional details that may make it seem as though I was hoping to sell you on a poor opportunity. With that being said, these positions are offered as a contract to hire, or a direct FTE opportunity. In the event that you would be interested in the C2H path, you would be eligible to enroll in Signature Consultants' full benefits package. The only difference from being a FTE is that you would not have any paid vacation. There are four open positions for this Devops position at SkyTouch Technologies. They have gone through some big changes recently and are revamping their team in search of folks that are looking to learn new technologies and grow with the company. If you are interested at all in talking about this more, please let me know and I will be happy to set something up with you\n"
        }
    ]
}