{
    "thread": "/messaging/thread/6275379729596063745/",
    "participants": [
        {
            "name": "Halley Burd",
            "title": "Talent Engagement Business Partner at Orion Health",
            "url": "linkedin.com/in/halleyburd",
            "phone": "",
            "email": ""
        }
    ],
    "messages": [
        {
            "from": "Halley Burd",
            "time": "2017-05-30T12:00:00.000Z",
            "message": "Full Stack Developer | Scottsdale AZ | Orion Health\n\nHi Brian, \n\nPlease excuse the indirect approach, I came across your profile on LinkedIn and we are very interested in your experience. \n\nAs a brief introduction, Orion Health is an award-winning provider of healthcare information technology advancing population health and precision medicine solutions for personalized care across the entire health community. We place huge value on our employees' career goals and actively promote learning and development opportunities, mentorship and growth.\n\nOur team in Scottsdale is currently experiencing growth while working on some exciting projects, and I thought you might be interested in learning more about a career opportunity with us. \n\nWe are looking for the best Software Professionals in the country to join our team in Scottsdale, AZ. Looking at your credentials I am very interested in speaking with you about your skills, goals, and interests. \n\nRead more about the role here: https://ohrecruit.orionhealth.com/careers/JobDetail/Full-Stack-Developer-Analytics-Scottsdale/2030\n\nIt would be great to speak with you to understand if this was something you may be interested in now or for the future.\n\nDo you have a mobile number that I can catch you on for a quick chat? \n\nKind regards, \nHalley Burd - American living the dream in New Zealand\n(480) 450 6858\n\nHalley Burd\n021 534 139\nhalley.burd@orionhealth.com\n"
        },
        {
            "from": "Me",
            "time": "2017-05-30T20:35:00.000Z",
            "message": "Orion only hires Indians. Not worth your time.. ;)\n\n \n"
        },
        {
            "from": "Halley Burd",
            "time": "2017-05-30T22:39:00.000Z",
            "message": "Hi Brian,\nThank you for coming back to me so quickly.\nIf you would like to chat in more detail about this opportunity, please provide your mobile number. \nKind regards,\nHalley\n"
        }
    ]
}