{
    "thread": "/messaging/thread/6278326575276658689/",
    "participants": [
        {
            "name": "Joe Pierce",
            "title": "Technical Recruiter at Microsoft",
            "url": "linkedin.com/in/jlgpierce",
            "phone": "",
            "email": "v-josepi@microsoft.com"
        }
    ],
    "messages": [
        {
            "from": "Joe Pierce",
            "time": "2017-06-07T12:00:00.000Z",
            "message": "Opportunity to Interview at Microsoft - Vancouver BC\n\nHi Brian, \n\nWould you have any interest in interviewing at Microsoft? I know you're probably busy, so we've come up with an expedited interview process. On Friday, July 14th, we will be hosting an interview session to hire multiple Software Engineers at different levels of seniority Microsoft's Movies & TV Team at our Vancouver, BC location. Some of the best parts of this process are that you are evaluated individually and they often make offers to upwards of 50% of the candidates that interview. You will know if you have an offer the business day following your interview!\n\nBasic Qualifications:\n- Computer Science, Engineering, or other technical degree\n- At least 2-8 years’ experience writing code with C++ or C# (Java also acceptable)\n- Applied knowledge of digital media application development and related formats\n- Canadian Work Authorization or able to obtain a TN Visa\n\nIf interested, please reply to me and I'll let you know how to quickly register. If it's not the right fit or the right time, maybe you would be interested in looking at other options.\n\nIf you have any questions, please feel free to contact me. I’m looking forward to hearing from you!\n\nBest regards,\n\nJoe Pierce\nMicrosoft\n\nJoe Pierce\nTechnical Recruiter at Microsoft\nv-josepi@microsoft.com\n"
        },
        {
            "from": "Me",
            "time": "2017-06-07T21:38:00.000Z",
            "message": "I'd love to! And by golly M$ needs me. I question the correctness of everything. Why does running Malwarebytes cause windows to freeze daily?\n"
        },
        {
            "from": "Joe Pierce",
            "time": "2017-06-07T23:11:00.000Z",
            "message": "Hi Brian,\n\n\n\nThank you for your reply. I’m not sure I’d be the person to handle those \nquestions, but we’re definitely looking for great software engineers. J\n\n\n\nHere’s what we’ll need to do to get the process started.\n\n1. Please go to the following link to get registered: \nhttps://wdgvancouver.splashthat.com\n<https://wdgvancouver.splashthat.com> . Please be sure to select my\nname as the person that you are working with while registering.\n2. Once you’ve registered, you will a pop up will direct you to the\ncareers page. Please APPLY for the posted position as well.\n3. Once you’ve registered and applied, we will set up a 15-20 minute\ntime to go over the details. \n\n\n\nMicrosoft will setup travel and accommodations in addition to reimbursing \nfor qualified expenses during the trip. \n\n\n\nIf you have any questions, please feel free to reach out to me. \n\n\n\nThank you,\n\n\n\nJoe Pierce\n\nMicrosoft Engineering Talent Acquisition\n\nv-josepi@microsoft.com <mailto:v-josepi@microsoft.com>\n\n(425) 421-7383\n\n\n\n[cid:image001.jpg@01D28DE9.88857630]\n"
        },
        {
            "from": "Me",
            "time": "2017-06-07T23:46:00.000Z",
            "message": "Nope! That last part sounds like a scam.\n"
        },
        {
            "from": "Joe Pierce",
            "time": "2017-06-07T23:53:00.000Z",
            "message": "HI Brian,\n\n\n\nThank you for your concern, but I’m not sure what you’re referring to as \nfar as a scam. Microsoft setting up travel and accommodations, and \nreimbursing for qualified expenses (meals, transportation, etc.)? I have a \nMicrosoft e-mail address, so probably wouldn’t be here long if I was \nscamming. J\n\n\n\nHere’s a brief overview of our events if this helps. \n\n1. You would need to register and apply for the event.\n2. We will review your application and set up a 15-20 minute time to go\nover the details.\n3. You’ll need to take our Online Technical Screen (OTS). The OTS is a\ncoding assessment that you would need to take on your own time. It\nconsists of 2-3 coding problems that you will need to complete in C,\nC++, C# or Java (whichever is your strongest language) within a 60\nminute timeframe.\n4. Pass the OTS and we'll invite you in to interview day with the team\nin Vancouver! It consists of a total of four 1:1 technical\ninterviews that last 45 minutes each. \n5. You'll find out if you have an offer on the following business day \n\n\n\nWe will also fly you in, provide accommodations, and reimburse other \nqualified expenses such as meals and transportation. \n\n\n\n\n\nJoe Pierce\n\nMicrosoft Engineering Talent Acquisition\n\nv-josepi@microsoft.com <mailto:v-josepi@microsoft.com>\n\n(425) 421-7383\n\n\n\n[cid:image001.jpg@01D28DE9.88857630]\n"
        },
        {
            "from": "Me",
            "time": "2017-06-08T00:23:00.000Z",
            "message": "What is wdgvancouver.splashthat.com <http://splashthat.com> ?\n\nIf I was going to start a company collecting people's personal information \nI would say the exact same thing.\n"
        },
        {
            "from": "Me",
            "time": "2017-06-08T00:23:00.000Z",
            "message": "https://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=207687114\n<https://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=207687114>\n"
        },
        {
            "from": "Me",
            "time": "2017-06-08T00:23:00.000Z",
            "message": "That doesn't have anything to do with Microsoft.\n"
        },
        {
            "from": "Me",
            "time": "2017-06-08T00:23:00.000Z",
            "message": "You should remove (contract) from your profile.\n"
        },
        {
            "from": "Me",
            "time": "2017-06-08T00:23:00.000Z",
            "message": "You've been doing this a long time. What have you seen?\n"
        },
        {
            "from": "Joe Pierce",
            "time": "2017-06-08T15:47:00.000Z",
            "message": "HI Brian,\n\n\n\nSplashthat is the event management site we use. The only real personal \ninformation it collects is what’s already on your resume. No different \nthan LinkedIn or any job board. WDG (wdgvancouver.splashthat.com) is the \nacronym for Windows and Devices Group which is the parent division of the \nMovies & TV Team. If you want to sign up, please feel free. \n\n\n\nThank you,\n\n\n\nJoe Pierce\n\nMicrosoft Engineering Talent Acquisition\n\nv-josepi@microsoft.com <mailto:v-josepi@microsoft.com>\n\n(425) 421-7383\n\n\n\n[cid:image001.jpg@01D28DE9.88857630]\n"
        },
        {
            "from": "Joe Pierce",
            "time": "2017-06-09T16:50:00.000Z",
            "message": "Hi Brian,\n\n\n\nIf you’re interested in the event, but don’t want to register through the \nregistration page, just fill this out and return it with a copy of your \nresume. Also, you would need to submit an application at the posting page \non our careers site. \nhttps://careers.microsoft.com/jobdetails.aspx?ss=&pg=0&so=&rw=1&jid=286859&jlang=en&pp=ss\n<https://careers.microsoft.com/jobdetails.aspx?ss=&pg=0&so=&rw=1&jid=286859&jlang=en&pp=ss>\n\n\n\nThank you,\n\n\n\nJoe Pierce\n\nMicrosoft Engineering Talent Acquisition\n\nv-josepi@microsoft.com <mailto:v-josepi@microsoft.com>\n\n(425) 421-7383\n\n\n\n[cid:image001.jpg@01D28DE9.88857630]\n"
        },
        {
            "from": "Me",
            "time": "2017-06-09T17:06:00.000Z",
            "message": "What if I just sneak in to it?\n"
        }
    ]
}