{
    "thread": "/messaging/thread/6280817877759127552/",
    "participants": [
        {
            "name": "Katie Gane",
            "title": "Professional Recruiter at Insight Global",
            "url": "linkedin.com/in/katiegane",
            "phone": "",
            "email": ""
        }
    ],
    "messages": [
        {
            "from": "Katie Gane",
            "time": "2017-06-14T12:00:00.000Z",
            "message": "Software Developer Opportunity - WILL PAY RELOCATION AND SPONSOR H1-B VISAS\n\nI recently came across your LinkedIn profile, and wanted to speak with you about a Permanent Opening as a Senior Software Developer with Honeywell in the midtown Atlanta area. Honeywell has a great work environment, including team-building activities such as regular catered lunches and happy hours. This being said, you do have to work on-site, however, unlike many other employers, they offer unlimited paid-time-off to encourage a good business-personal life balance. After reviewing your previous experience and skillset on Linkedin, I think you could be a great fit for one of these positions. When you have a moment, please call me at the office at 404-335-7277. I hope you have a wonderful day, and I look forward to hearing from you! \n\nHoneywell\nAtlanta, GA\nFullstack Developers - Mid-Senior Level \nDIRECT HIRE!!\nHoneywell will pay for relocation if needed) \nInterview Time: Saturday, June 24th \nHoneywell can sponsor H1B Visas! \n\n\n\nQualifications\n•\tMid-Senior-Lead level candidates ONLY (no Jr. Level)\n•\tHiring for Java or C#/ .Net Developers – Full Stack from front-middle-back\n•\tAZURE- not required (can have any Cloud-based SaaS environment), but highly preferred since this is currently in Honeywell’s environment \n•\tIoT Hub or Event Hub, or Service Fabric experience needed (all features within Azure)\n•\tStrong focus on backend services and messaging software (such as RabbitMQ, MsgMQ, ect.)\n•\tDO NOT want candidates who consider themselves Full Stack Developers. The need to be strong in one specific area and have depth, not broad technology experience.\n•\tThese openings will be across multiple business units, such as Aerospace, Home-Connected Technologies, ect. Need to be able to fit into any of the business units at Honeywell and not specific to just one.\n\nKatie Gane\nProfessional Recruiter at Insight Global\nktgane@gmail.com\n"
        }
    ]
}