{
    "thread": "/messaging/thread/6283329108411842561/",
    "participants": [
        {
            "name": "Mark Campbell",
            "title": "Technical Recruiter at IMPACT Technology Recruiting",
            "url": "linkedin.com/in/mark-campbell-8376679",
            "phone": "602.300.0384 (Mobile)",
            "email": "mcampbell@go-impact.com"
        }
    ],
    "messages": [
        {
            "from": "Mark Campbell",
            "time": "2017-06-21T12:00:00.000Z",
            "message": "DevOps Opportunities / Phoenix, AZ\n\nBrian, \n\nI hope this message finds you doing well. I am actively seeking to fill multiple DevOps roles in the Phoenix area. These positions are direct hire opportunities that offer an extremely strong compensation package, to include a sign-on bonus. \n\nIf you would be interested in discussing, please give me a call at 480.307.9002 at your earliest convenience. In the event you are not currently in the market, please pass on my contact information as I can offer a $1k referral bonus should anyone you recommend be placed via IMPACT.\n\nThanks for your consideration and I look forward to hearing from you!\n\nMark Campbell\nTechnical Recruiter at IMPACT Technology Recruiting\n602.300.0384\n"
        },
        {
            "from": "Me",
            "time": "2017-06-21T16:28:00.000Z",
            "message": "What companies? Strong mind?\n"
        },
        {
            "from": "Me",
            "time": "2017-06-21T16:28:00.000Z",
            "message": "You don't have a profile picture so I don't know if you are real.\n"
        },
        {
            "from": "Mark Campbell",
            "time": "2017-06-21T16:36:00.000Z",
            "message": "Hi Brian, thanks for your response. I apologize, but yes, I am real. I work out of our Scottsdale office located on the 101 and Scottsdale Road. I have several positions available to include many opportunities at Choice Hotels, Pegasus and Prizelogic. Let me know if you have a couple of minutes to chat and we can narrow down roles that best fit your financial parameters. Thanks again!\n"
        },
        {
            "from": "Me",
            "time": "2017-06-21T16:37:00.000Z",
            "message": "I make 95 but I have an expensive European wife. Not really sure how to be more productive. Programming is really time consuming.\n"
        },
        {
            "from": "Mark Campbell",
            "time": "2017-06-21T16:48:00.000Z",
            "message": "Sounds like we may need to try and get you a raise. I do have some contract opportunities that pay $60 per hour, would you consider that if it was the right opportunity?\n"
        },
        {
            "from": "Me",
            "time": "2017-06-21T16:57:00.000Z",
            "message": "No, contract suck. They treat contractors like they aren't a part of the team, and exclude them from important decisions.\n"
        },
        {
            "from": "Mark Campbell",
            "time": "2017-06-21T17:05:00.000Z",
            "message": "Totally understand. Would you like to explore the DevOps direct hires at Choice, they pay around $105k - $120k depending on experience and I can throw in a sign-on bonus. Looking for someone who has some AWS experience, development background is a positive.\n"
        },
        {
            "from": "Me",
            "time": "2017-06-21T17:11:00.000Z",
            "message": "Can I work for two companies like Evan Spiegel?\n"
        },
        {
            "from": "Mark Campbell",
            "time": "2017-06-21T17:21:00.000Z",
            "message": "I think Evan has things figured out.\n"
        }
    ]
}