{
    "thread": "/messaging/thread/6288735179431297024/",
    "participants": [
        {
            "name": "Kate (Phinney) Grochowski",
            "title": "B2B Marketeer | Creative Strategist | Sales Enablement Advocate",
            "url": "linkedin.com/in/kategrochowski",
            "phone": "941-330-6120 (Mobile)",
            "email": "kategrochowski@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "Kate Grochowski",
            "time": "2017-07-06T14:28:00.000Z",
            "message": "Hi Brian. It's a bummer we couldn't connect at IoT World in May. While there, we met with key leaders to discuss all things IoT. I thought you might be interested in the product of those key discussions, a 5-part video series featuring executives from T-Mobile, Autodesk, Buddy Platform, Ciklum, and more. You can check it out here: http://bit.ly/2tOHK0I.\n"
        },
        {
            "from": "Me",
            "time": "2017-07-06T15:00:00.000Z",
            "message": "Do you think there will be a big market for people that want reliable machines not connected to the internet? For example how many dishwashers are sold then discarded because they \"don't do a good job\"? Why don't we fix the dishwasher before adding internet to it?\n"
        },
        {
            "from": "Kate Grochowski",
            "time": "2017-07-06T16:36:00.000Z",
            "message": "I do actually. I think in the coming years we will see a massive gap between those who want everything connected to the internet and those who want nothing connected. My guess it will be rare to find someone in the middle who wants a little bit of both. What do you think?\n"
        },
        {
            "from": "Me",
            "time": "2017-07-07T14:08:00.000Z",
            "message": "Well I like having my phone connected to the internet, but what if my dryer was in the middle of a DDOS and stayed on so long my clothes catch fire? IoT is just another buzzword silicon valley VCs are trying to shove down our throats.\n"
        }
    ]
}