{
    "thread": "/messaging/thread/6289083491623727104/",
    "participants": [
        {
            "name": "Amit Patel",
            "title": "Recruitment Team Lead with WilsonHCG Retained by Avanade",
            "url": "linkedin.com/in/amitpatel8",
            "phone": "",
            "email": ""
        }
    ],
    "messages": [
        {
            "from": "Amit Patel",
            "time": "2017-07-07T12:00:00.000Z",
            "message": "We need your expertise at Avanade - Seattle\n\nDear Brian, \n\nI am an attained recruiter for Avanade- a leading digital innovator partnered with Microsoft and Accenture - seeking a talented.NET Developers/ Sr. Developers / Consultants / Sr.Consultants to join their company in the Seattle area, with experience in the Cloud. \n\nLoved reading through your profile! Your background and experience are exactly what we are looking for! \n\nWhy consider Avanade?\n\n• Training Magazine: 2015 Top 125 Global Training Organizations - Awarded in 2010, 2011, 2012, 2013, 2014, 2015, 2016 \n• Computer World Magazine: Top 100 Places to Work in IT - 2015, 2014, 2013, 2011 \n• Check out our website to learn more about us: https://www.avanade.com/en-ca \n\nIf interested, I’d love to set up a time to speak further about your experience and the opening we have here. Please Select the time that works best for you directly in my calendar using this link: https://calendly.com/amit-patel-1\n\nAmit Patel\nRecruitment Consultant Team Lead - Avanade\n647-494-7662 | 804-977-9439 | amit.patel@wilsonhcg.com\n"
        },
        {
            "from": "Me",
            "time": "2017-07-08T03:34:00.000Z",
            "message": "That's way nicer than Dubai!\n"
        },
        {
            "from": "Amit Patel",
            "time": "2017-07-10T13:58:00.000Z",
            "message": "hello Brian, \n\nthank you for responding. is there a time and number i can call you so that we can chat a little bit more about the position?\n"
        },
        {
            "from": "Me",
            "time": "2017-07-10T14:00:00.000Z",
            "message": "I'd rather Microsoft hire 10 Indians to do they same job, they have the savings and it's a good place to learn.\n"
        },
        {
            "from": "Amit Patel",
            "time": "2017-07-10T14:30:00.000Z",
            "message": "hey brian, \n\ni'm a little confused. i take it you are not interested in the position?\n"
        },
        {
            "from": "Me",
            "time": "2017-07-10T14:45:00.000Z",
            "message": "What position?\n"
        },
        {
            "from": "Amit Patel",
            "time": "2017-07-10T14:51:00.000Z",
            "message": "this is a position in Seattle for Avanade it is full time, and we are looking for strong consultant - sr. consultant cloud developers.\n"
        },
        {
            "from": "Me",
            "time": "2017-07-10T19:39:00.000Z",
            "message": "Oh sorry. No consulting. I don't want the boss to think I am not a part of the team.\n"
        },
        {
            "from": "Amit Patel",
            "time": "2017-07-10T19:46:00.000Z",
            "message": "hello Brian, \n\ni think you may have the term consulting wrong with this position. you would actually be full time permanet salaried employee of Avanade, and would be a consultant to their clients. so the boss or the team would not think you are an contractor what so ever.\n"
        }
    ]
}