{
    "thread": "/messaging/thread/6290677223448018945/",
    "participants": [
        {
            "name": "Chantelle Jones",
            "title": "Client Lead & Sr. Tech Recruiter at VitalSource IT",
            "url": "linkedin.com/in/chantellenjones",
            "phone": "",
            "email": ""
        }
    ],
    "messages": [
        {
            "from": "Chantelle Jones",
            "time": "2017-07-11T12:00:00.000Z",
            "message": "Amazon Career Opportunities - Various Locations!\n\nHi Brian, \n\nHave you ever considered a career at Amazon? Roles at Amazon are available in almost every aspect of engineering from distributed systems development, to data mining and machine learning, to natural language processing, to mobile development, to search optimization, to just about everything.\n\nWe work with a wide variety of teams in in several different locations as well. Right now, we have opportunities available in the following locations:\n\n- Seattle, WA \n- Sunnyvale, CA \n- Santa Cruz, CA\n- Irvine, CA\n- Austin, TX\n- Dallas, TX\n- Boulder, CO\n- Phoenix, AZ\n- Detroit, MI\n- New York City, NY\n- Toronto, ON\n\nAmazon offers a robust relocation package for this process as well as world-class compensation, a hefty sign-on bonus, great benefits, and stock options! \n\nBased off your profile, it looks like you could be a good fit for one or more of these roles. Are you interested in learning more about these opportunities? If you are, just let me know the best time and phone number to reach you at so that we can discuss the details.\n\nI look forward to hearing from you soon! \n\n\n**Your time is valuable to me - please select the \"not interested\" option if this is not a good fit. And if you are not open to these locations, please let me know your preferred areas so I can keep you in mind for future opportunities. Thanks!**\n\nThank you,\nChantelle Jones\nchantelle@vitalsourceIT.com\n"
        },
        {
            "from": "Me",
            "time": "2017-07-11T23:57:00.000Z",
            "message": "Amazon doesn't hire people like me.\n"
        },
        {
            "from": "Chantelle Jones",
            "time": "2017-07-12T21:52:00.000Z",
            "message": "Hi Brian,\n\nI'm interested to hear why you think you are not a good fit for Amazon. From the looks of your profile, your experience appears to align well with the type of candidate Amazon hires. Have you been through the interview process before?\n\nChantelle\n"
        },
        {
            "from": "Me",
            "time": "2017-07-18T18:58:00.000Z",
            "message": "Yes. And they told me to read their book if I ever expected to get hired there. I haven't read it yet.\n"
        },
        {
            "from": "Me",
            "time": "2017-07-18T18:58:00.000Z",
            "message": "Plus I don't want to be worked to the bone.\n"
        }
    ]
}