{
    "thread": "/messaging/thread/6293162960286203904/",
    "participants": [
        {
            "name": "Erick Falconi",
            "title": "Technical Recruiter at Atrilogy Solutions Group",
            "url": "linkedin.com/in/erickfalconi",
            "phone": "602-888-0395 (Work)",
            "email": "efalconi@atrilogy.com"
        }
    ],
    "messages": [
        {
            "from": "Erick Falconi",
            "time": "2017-07-18T12:00:00.000Z",
            "message": "Still in the hunt?\n\nHi Brian, \n\nSaw you might be looking for something new and wanted to touch base. Curious what you are ideally looking for in a new role/organization and what are some of the \"pain-points\" you've been dealing since leaving Study Sauce.\n\nI saw you might be looking into more of a leadership role and I've been working on a Director of Engineering position here in Scottsdale, which led me to your profile. If you are open to new opportunities, I hope to connect and see if we could work together now or down the road.\n\nHope all is well,\n-Erick Falconi\n\nErick Falconi\nTechnical Recruiter at Atrilogy Solutions Group\n602-888-0395 | efalconi@atrilogy.com\n"
        },
        {
            "from": "Me",
            "time": "2017-07-20T22:16:00.000Z",
            "message": "Any relation to the Batman mob crime Lord?\n"
        },
        {
            "from": "Erick Falconi",
            "time": "2017-07-20T22:26:00.000Z",
            "message": "I lived that life once... but that Bat made life too difficult!\n\nHey Brian,\n\nThanks for the joke, today has been crazy and I needed something to laugh at. Saw you may have been looking for something new and wanted to touch base. That Director role on-hold until their team gets through a few interviews, but still interested to learn about you and ideally what you'd be looking for in a new role?\n\nWasn't sure if you were looking for more leadership or wanted to stay pretty hands-on, but look forward to connecting and possibly working together now or down the road.\n\nCheers,\n-Erick\n"
        },
        {
            "from": "Me",
            "time": "2017-07-20T23:03:00.000Z",
            "message": "Can I be a leader and be hands on?\n"
        },
        {
            "from": "Me",
            "time": "2017-07-20T23:03:00.000Z",
            "message": "Evan Spiegel can do it so can I!\n"
        },
        {
            "from": "Erick Falconi",
            "time": "2017-07-25T18:25:00.000Z",
            "message": "Ha! Love it!\n\nWe're in a holding pattern with one of our clients that was looking for a hands-on Director of Engineering (React/Node) but they want to get through the rest of the candidates presented before they add anyone else to the mix. \n\nWe should know more in a week or two, but if no offer is extended, I'll definitely be following up.\n\nWe do have a senior software engineer position within that same stack, but not sure how much Leadership would be available. Again, most good companies understand to put leaders in the right types of roles, but we can connect about the role/client and see if it could be a fit?\n\nCheers,\n-Erick\n"
        },
        {
            "from": "Me",
            "time": "2017-07-25T18:26:00.000Z",
            "message": "Sure. I've kind of hit the glass cieling.\n"
        },
        {
            "from": "Erick Falconi",
            "time": "2017-07-25T18:32:00.000Z",
            "message": "Already?!?! Didn't you just start like 4 months ago? I'll email you the description we have and let me know if you'd like to chat about the role/company in greater detail.\n"
        },
        {
            "from": "Erick Falconi",
            "time": "2017-07-25T18:32:00.000Z",
            "message": "MegaMindBrian, Awesome\n"
        },
        {
            "from": "Erick Falconi",
            "time": "2017-07-25T18:32:00.000Z",
            "message": "Just sent you the description, have a lunch at noon so I'll be heading out soon. I can take a call when im driving if you have some time\n"
        },
        {
            "from": "Me",
            "time": "2017-07-25T18:35:00.000Z",
            "message": "Ha. I came in at the top. Don't use your phone while driving ;D\n"
        },
        {
            "from": "Erick Falconi",
            "time": "2017-07-25T18:36:00.000Z",
            "message": "Bluetooth helps, but yeah look over the material and let me know if a call is needed :)\n"
        },
        {
            "from": "Me",
            "time": "2017-07-25T18:40:00.000Z",
            "message": "Lol social skills. I am disqualified because I have Asperger's. I wonder if that will ever go to court for discrimination. Probably not.\n"
        },
        {
            "from": "Erick Falconi",
            "time": "2017-07-25T18:43:00.000Z",
            "message": "We usually see something like this, \"sense of humor, ability to talk to non-technical members of the org, etc.\" \n\nYou probably could make a case on that and a lot of hiring practices we see working with a range of clients. Let me know if you have any interest in chatting. \n\n:)\n"
        }
    ]
}