{
    "thread": "/messaging/thread/6295263941949943808/",
    "participants": [
        {
            "name": "Jason Monkelien",
            "title": "Recruiter at Princeton Information",
            "url": "linkedin.com/in/jasonmonkelienatbeckandcompany",
            "phone": "",
            "email": "jmonkelien@gmail.com"
        }
    ],
    "messages": [
        {
            "from": "Jason Monkelien",
            "time": "2017-07-24T12:00:00.000Z",
            "message": "Lucrative .Net Software Engineer Roles with Angular\n\nGood Morning Brian,\n\nI came across your profile this morning and it looks like you could be a great fit for a few roles that I am working on in Phoenix for a 5+ year contract, based on your work with Swiftpage, Study Sauce, and Epic Research and Diagnostics. I have multiple roles open at multiple levels, and I have attached a sample description below. I would greatly appreciate it if you could call me at your earliest convenience at 571-612-3946, or email me with some times that you would be available for a brief phone conversation, and the best number to reach you. Thanks in advance for your time Brian and I look forward to hearing from you!\n\n.Net/AngularJS Application Developer:\nWe are looking for exceptional full stack developers to join our client's talented application development team located in Phoenix, AZ in support of one of their Healthcare IT contracts. Interested candidates should have direct experience with ADLC and come from a full stack application development background.\n\nRequirements: \n•\t3+ years of experience in Back End .Net application development\n•\t1+ years of experience in Front End AngularJS development\n•\tAbility to code complex .Net applications\n•\tAbility to speak confidently and concisely to personal skill set and resume\n•\tFamiliarity with a number of web-based applications including point of sale, case management, records management, profile management, etc...\n•\tMust be eligible to obtain a Public Trust Clearance (Generally this requires US Citizenship or Greencard Holder status, as few exceptions are made for alternative work authorizations)\n\nRegards,\nJason Monkelien\n\n571-612-3946\njmonkelien@princetoninformation.com\n"
        }
    ]
}