{
    "thread": "https://www.facebook.com/messages/archived/t/8160266556",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2016-08-16T17:20:00.000Z",
            "message": "Brian\nGreetings,\n\nHere is the problem with your statement, \"Stop complaining about the system, it gave you the candidate that you wanted.\"  This is simply 100% untrue and we can prove it even with very generalized math.  There is about 40% participations of eligible Americans to vote.  Almost half of those are voting for Trump or Hillary just so that the other person does not win.  That means the headline \"Worst approval rating in history\" is probably true since that only leaves about 10% of people voting for the candidate because they actually like what they stand for.  After watching your documentary and watching you call old people to beg for money made me feel sick.  You are the problem with the system, as well as everyone else who admits there is a problem and stands idly by.  There is a concept you should learn called Wisdom of the Crowd, there is a PBS video about it:  https://www.youtube.com/watch?v=r-FonWBEb0o\n\nThe system is not producing candidates that can solve EVERY problem.  But I fear the system is not producing a candidate that can just solve ONE problem and properly think it though.  You are a narcissist just like me, except the difference between me and every politician is that I don't automatically think every idea I have is the right solution.  Sometimes you have to prove things work on a small scale before they are written into law on the big scale.  Please get the money out of politics so that we can all make a better informed decision.  If you do not make this your goal, please quit now so we don't have to hear from you anymore.  Sincerely - Every Republican.\n\nNOVA scienceNOW | Wisdom of the Crowds | PBS\nhttp://www.pbs.org/nova/sciencenow Ask enough people to estimate something, and the average of all their guesses will get you surprisingly close to the right...\nyoutube.com\n\n"
        },
        {
            "from": "Brian",
            "time": "2016-08-16T17:20:00.000Z",
            "message": "Brian\nJust because Hillary got more votes, does not mean she is the candidate the country wants.\n\n"
        }
    ]
}