{
    "thread": "https://www.facebook.com/messages/t/abe.pralle",
    "participants": [
        {
            "name": "Abe Pralle",
            "description": "Partner at Kati Vegan Thai",
            "url": "Partner at Plasmaworks"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2010-09-18T21:27:00.000Z",
            "message": "Brian\nHey,\nI totally meant to come give everyone a proper goodbye last night, but Joe was being a total SPAZ.  Bunch of weird stuff leading up to me taking off early, but I had a good time.  It was great to hang out with you again, I enjoy our conversions.  I hope to see you again soon.  We are doing a movie thing outside of David's new place each week, and obviously the BBQs, we could set one up at your place maybe when Ryan is back in town.  And I am planning a Hawaiian themed party this semester with dinner beforehand (good friends only).  I am going to start decorating soon.\n\nThanks for the hospitality!\n"
        },
        {
            "from": "Abe",
            "time": "2010-09-18T21:27:00.000Z",
            "message": "\nCool - yeah Joe's a spazzy guy.  It was good to see you and we'll definitely have to hang out more this semester!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-02T15:45:00.000Z",
            "message": "Brian\nI just got laid off from full time to part time, no hard feelings from boss, just external factors. How are things looking on your side of the world?\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-02T15:45:00.000Z",
            "message": "\nThat's a good opportunity to shift into something new! Things are good with me, just working on some new games.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-02T15:45:00.000Z",
            "message": "Brian\nThat is awesome. I always loved that plasmaworks class. I think about it with the educational app I have been working on.\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-02T15:45:00.000Z",
            "message": "\nThanks, glad to hear!  What kind of app are you working on?\nOr in other words tell me a little more about it!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-02T15:45:00.000Z",
            "message": "Brian\nStudy sauce in iOS store code \"demo\", it's like flashcards but reminds you of specific cards if you get it wrong or right.\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-02T15:45:00.000Z",
            "message": "\nNice!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:54:00.000Z",
            "message": "Brian\nCan you do me a favor?\nMessage Travis and tell him he looks really smart today?\nlol\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "\nAh... I'm good, thanks\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "Brian\nHmm. dang.  This would have been really funny.\nI must be ahead of my time.\n\nThere is so much noise on the internet from the media I thought if people are going to be using it they might as well be having a personal conversation and saying nice things instead of spreading other stuff.\nFriends are easier, but I've been meeting strangers, there are some serious geniuses everywhere, I hope they are realizing all their ambitions.  I am asking them about it.\nOne guy is talking about starting a wooden car shop on an island and has a \"million dollar software idea\" for me\nJust a though.  Thank you for your time.  You are a brilliant man! \n\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "\nGood idea!  So good in fact...\nhttps://www.steadymouse.com/\nSteadyMouse - Hand Tremor Mouse Accessibility Software\nThe SteadyMouse Project - Mouse Accessibility Software for People with Essential Tremor\nsteadymouse.com\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "Brian\nI will send him that.\nlol this is like a game of internet wide \"simpsons did it\"\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "\nhehe\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "Brian\nlol \"Crap...\"\nOh well, at least he can focus.\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "\nMy secret to achieving my ambitions is just to do what I love every day - and pursue my dreams even if other people don't think they're feasible or worthwhile.  Because then \"success\" isn't something that happens when I reach some goal; \"success\" is something I have every day as I am able spend time on what I enjoy.  And success in other, more conventional terms just comes out of that naturally.  My two cents!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "Brian\nI agree completely\nWe have achieved equanimity\nCan I troll people with positive messages?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "Brian\nI had an interview at PNNL that's is pretty awesome. How does everyone else measure your success?\nHopefully with more than 2 cents \n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "\nDoesn't matter, none of us need to prove anything to anyone else.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "Brian\nIt's not about proof. It's about inspiration.\nWhat is Bill Gates actually do because all I see him do is walk around and talk. How do you measure his efforts?\n*what does\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "\nNothing I worry about!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "Brian\nI'm not worried, I'm inspired.\nI realized that I realized my own ambition, and counseling people I can help them realize their own ambitions. So many people are asleep. Letting opportunity slip past them.\nWhat are you working on?\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "\nMy new Rogue programming language, Rogue Plasmacore game programming framework, and two different games for Plasamworks.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "Brian\nAwesome. can I try it? Are you going to work harder on it now?\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "\nHarder than when, haha?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "Brian\n\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "\nRogue is currently Mac and Linux only.  Plasmacore currently only compiles on Mac and only targets iOS, so you'd need to be set up with Xcode and an iOS emulator at least.\nHere's Rogue:\nhttps://github.com/AbePralle/Rogue\nAbePralle/Rogue\nRogue Programming Language\ngithub.com\nYou can find Plasmacore and PlasmacoreDemos on the same GitHub account.  I haven't quite \"announced\" them yet because I'm working on changing the Plasmacore \"asset manager\" before I do.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "Brian\nI have a Mac now. Can I be in your club? \n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:03:00.000Z",
            "message": "\nSure!  Cool kids club. \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:56:00.000Z",
            "message": "Brian\nLol agree.\nIn terms of spreading compliments. How do you prove the goodwill hasn't made it back to me?\nI've been tracking time and conversation with Google calendar. My new game involves the entire internet. Too big to take on?\nMake them think they are special momentarily and see if it improves their day versus the regular noise on the internet. Distractions are important!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:56:00.000Z",
            "message": "Brian\nInteresting data point. I played this game with two other people and now one of them wants to hang out today. Coincidence or projecting confidence?\n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:56:00.000Z",
            "message": "\nThey say what goes around comes around... \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:56:00.000Z",
            "message": "Brian\nI am making go around.\n*it\nLet me know if you notice anything strange. \n"
        },
        {
            "from": "Abe",
            "time": "2016-10-11T23:56:00.000Z",
            "message": "\nOkay\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:56:00.000Z",
            "message": "Brian\nLOL I already convinced one friend I am an AI from playing my compliment game.\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-14T05:04:00.000Z",
            "message": "Brian\nI can see the future.\n"
        },
        {
            "from": "Brian",
            "time": "2017-05-07T17:49:00.000Z",
            "message": "Brian\nWouldn't it be cool to make a text scroller 3D? https://github.com/rastapasta/mapscii\nrastapasta/mapscii\n🗺 MapSCII - Braille & ASCII map renderer for your console => telnet mapscii.me\ngithub.com\n"
        },
        {
            "from": "Abe",
            "time": "2017-05-07T17:49:00.000Z",
            "message": "\nNeat!\n"
        },
        {
            "from": "Brian",
            "time": "2017-05-07T17:49:00.000Z",
            "message": "Brian\nI love UX, I am designing a new sales and subscription portal for Act!.\nWhat are you up to?\n"
        },
        {
            "from": "Abe",
            "time": "2017-05-07T17:49:00.000Z",
            "message": "\nLots of projects!  Right now I'm fixing my bitmap resizing algorithm in Plasmacore so that blending a totally transparent \"black\" pixel with a non-transparent neighbor doesn't add a black tint to the resulting pixel.\n"
        },
        {
            "from": "Brian",
            "time": "2017-05-08T04:46:00.000Z",
            "message": "Brian\nUsing HSL for blending not RGB?\n"
        },
        {
            "from": "Abe",
            "time": "2017-05-08T06:34:00.000Z",
            "message": "\nRGB; the tweak is based around the alpha channel\n"
        },
        {
            "from": "Brian",
            "time": "2017-06-29T16:01:00.000Z",
            "message": "Brian\nhttp://www.imdb.com/title/tt3967856/\nOkja (2017)\nDirected by Joon-ho Bong. With Tilda Swinton, Paul Dano, Seo-Hyun Ahn, Jake Gyllenhaal. Meet Mija, a young girl who risks everything to prevent a powerful, multi-national company from kidnapping her best friend - a massive animal named Okja.\nimdb.com\n\n"
        }
    ]
}