[
    {
        "comments": [],
        "description": "Linda Kay  shared  The Dodo 's  video .",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/AgendaLinda?hc_ref=ARQ5mAtzVLR738h130HSxBQ9Q9tEFb1QLnuVATXo2Lt6Pk2Y9qrZHDmgQdS22uen1KQ",
            "https://www.facebook.com/thedodosite/?hc_ref=ARQ5mAtzVLR738h130HSxBQ9Q9tEFb1QLnuVATXo2Lt6Pk2Y9qrZHDmgQdS22uen1KQ",
            "/thedodosite/videos/1025357334265608/?hc_ref=ARQ5mAtzVLR738h130HSxBQ9Q9tEFb1QLnuVATXo2Lt6Pk2Y9qrZHDmgQdS22uen1KQ"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/484087368644361",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "I used to be the first, but as I grew older, I became the second.",
                "from": "https://www.facebook.com/burgerboy21?fref=ufi&rc=p Danny Niederberger",
                "time": "January 14 at 10:24pm"
            },
            {
                "content": "my mom is first one (\"YAY!!! SNOWBALLS!!! SNOW ANGELS!!! SNOWMEN!!! SLEDDING!!! ICESKATING!!!\") i am the 2nd (i will leave my house when the universe starts behaving again)",
                "from": "https://www.facebook.com/carisa.passalacqua?fref=ufi&rc=p Carisa Passalacqua",
                "time": "January 15 at 3:42pm Edited"
            },
            {
                "content": "I think the second doesn't want to go cause he's not keen on being seen out with that coat and boots on damaging his street cred.",
                "from": "https://www.facebook.com/ann.sivitter?fref=ufi&rc=p Ann Sivitter",
                "time": "January 15 at 5:34pm"
            },
            {
                "content": "OMG, that little dog is sooo Marco. He looks out the door and sees the snow and I practically have to drag  him outside. He will pee and head back towards the house and will actually not poo for a day if it means he can get out of the snow faster.  That face when you ask if he wants to play in the snow. LOL",
                "from": "https://www.facebook.com/laverne.kent?fref=ufi&rc=p LaVerne Robinson Kent",
                "time": "January 20 at 10:06am Edited"
            },
            {
                "content": "I love the snow, so I'm definitely dog #1. Except, last winter I slipped on the ice and busted my ass. So, I think I'm gradually and unintentionally transforming into dog #2.",
                "from": "https://www.facebook.com/profile.php?id=100011108675297&fref=ufi&rc=p Donna McKinley",
                "time": "January 15 at 1:27am"
            },
            {
                "content": "Kate Plakina   Fritz Helder   Sheldon McIntosh  you know my African black ass is not even represented in this example! I'm the dog staring out the window  😂 ",
                "from": "https://www.facebook.com/starving.y.full?fref=ufi&rc=p Cédric K Gasaïda",
                "time": "January 15 at 10:03pm"
            },
            {
                "content": "Evelyn Rivera  the second dog is like Bella Ami!!!  She is a fair weather girl. If weather is good, she's out there. If there's a drop of rain......no way!!  She will drag her paws no matter what you do. What a princess!!",
                "from": "https://www.facebook.com/trudy.eberlebuck?fref=ufi&rc=p Trudy Eberle-Buck",
                "time": "January 26 at 12:13am"
            },
            {
                "content": "Anyone that knows me, knows which one i am lol.  Audrey: \"My toes are numb.\" ... See More",
                "from": "https://www.facebook.com/christine.kenyon.10?fref=ufi&rc=p Christine Kenyon",
                "time": "January 18 at 5:51pm"
            },
            {
                "content": "As a child, I was the first dog  🐶 , my brother, Ron, and I would play in the snow  ❄️   ❄️ ❄️   ☃️ ❄️ ❄️ ❄️ ☃️ and go sledding.  It was fun to shovel snow off our driveway & sidewalks.  Mom would fix hot cocoa for us.  😊 . As I got older, I started disliking  ❄️ ❄️ ❄️ ❄️ ❄️  and after getting married  👰🏼  and living in the country, I disliked it even more, due to blowing and drifting!!!!  So now I am like the second dog  🐶 !!!",
                "from": "https://www.facebook.com/sherryl.kersten?fref=ufi&rc=p Sherryl Engelkes Kersten",
                "time": "January 15 at 11:01pm Edited"
            },
            {
                "content": "OMG. Am laughing so hard. My response is dependant on the combo of freezing rain/snow combo.  Fine- my car is not equipped with ice skates - I'll stay home.",
                "from": "https://www.facebook.com/QuickJackSandi?fref=ufi&rc=p Sandra Elwood",
                "time": "January 14 at 10:55pm"
            },
            {
                "content": "My darling Susan, you of all people know which one I am! 😂  The only reason I did not go for a walk in the fresh deep snow last Saturday morning around two am, was because you were not here to go with me and pull me out of the snow drifts. I was afraid no one would find my body until June 2017! 😱 💃🏻 🎶 ",
                "from": "https://www.facebook.com/marybstinson?fref=ufi&rc=p Mary B. Stinson",
                "time": "January 17 at 6:57am"
            },
            {
                "content": "I am like a previous poster - when I was young it was great going out without a coat and no gloves throwing snowballs until my hands were blue. Then as I got older I felt the cold more easily. Now its gloves woolly pully and thick coat before sticking my head out the door!",
                "from": "https://www.facebook.com/paulhughes3915?fref=ufi&rc=p Paul Hughes",
                "time": "January 26 at 4:58pm"
            },
            {
                "content": "So true! I'm the second one! And so is my chihuahua! She HATES the snow! If it's coming down hard she won't even go outside until my husband clears a path for her! Even then she has to be carried out to go and carried back in! A real Princess!",
                "from": "https://www.facebook.com/Kzekaj8?fref=ufi&rc=p Kathleen Bepler-Zekaj",
                "time": "January 29 at 12:31am Edited"
            },
            {
                "content": "Definitely I'm the second type. Here in Portland we have had school cancelled for 9 days already. I'm terrified to leave my apartment because there is no snow/I e removal. Suppose to have floods tomorrow. Such fun",
                "from": "https://www.facebook.com/jazzysueb?fref=ufi&rc=p Sue Barnes",
                "time": "January 18 at 4:37am"
            },
            {
                "content": "Are those 'doggie' boots he has on?  If so, that's probably why he's afraid..... for lack of a better word.......to try to walk.",
                "from": "https://www.facebook.com/profile.php?id=100010994163418&fref=ufi&rc=p Arline Curtin Schroeher",
                "time": "January 15 at 1:13am"
            },
            {
                "content": "Dan Timko , I still maintain that you'd have more of the lattertude (latter attitude, obviously, hahaha) if you didn't spend winters in AZ",
                "from": "https://www.facebook.com/profile.php?id=12436705&fref=ufi&rc=p Tiffany Dowling",
                "time": "January 14 at 11:52pm"
            },
            {
                "content": "Yes that is definitely me the second one. I have spikes on my boots and I just ordered a winter walking stick from amazon lol",
                "from": "https://www.facebook.com/diane.gleason.5?fref=ufi&rc=p Diane Gleason",
                "time": "23 hrs"
            },
            {
                "content": "I'm probably the second. I hate it when its too cold, not as much as when its too hot. But Autumn is my favorite season, followed by spring. We don't even really need winter or summer  😂 😂 ",
                "from": "https://www.facebook.com/jenelle.doughty?fref=ufi&rc=p Jenelle Arredondo",
                "time": "November 7 at 4:30pm"
            },
            {
                "content": "I remember putting boots on two of my dog.  I would get one finished and start the second .  By the time I was done,the first dog had to be shoed again.  I let them go play and when I got them inside I realized several boots were missing and so I had to go out and find the boot. The dog I have now loves snow and catching snowflakes on his tongue.  He's a happy boy!",
                "from": "https://www.facebook.com/bonnie.colby.9?fref=ufi&rc=p Bonnie Colby",
                "time": "March 18 at 3:12am"
            },
            {
                "content": "Yep. I'm all over that snow. When my kids were small we made a pile of snow balls and waited for their dad to get home from work!  We ended up getting the worst of the snowball fight!  My kids are now 47 and 51 😳 ",
                "from": "https://www.facebook.com/sharonporterfieldmiddleton?fref=ufi&rc=p Sharon Porterfield-Middleton",
                "time": "November 7 at 10:48pm"
            },
            {
                "content": "How come one is free to explore and play. Can feel it has a choice and the other is on a leash. I wouldn't be comfortable feeling forced to go out. Rather than getting used to it and introduced to it slowly!  Encouraged not rushed",
                "from": "https://www.facebook.com/sharon.spangler.142?fref=ufi&rc=p Sharon Spangler",
                "time": "February 13 at 2:32pm"
            },
            {
                "content": "Yolanda   LlJuna   - Lljuna I think I about your recent trip to Chi-Town looking at this.  One of you was not bothered by the frigid temps and one of you couldn't, walk, talk, or breathe.",
                "from": "https://www.facebook.com/lanetra.daniel?fref=ufi&rc=p LaNetra Lynn Daniel",
                "time": "January 28 at 10:01am"
            },
            {
                "content": "#1 was Zack.  He missed the snow in Chicago. When we had a good snow, he went to our neighbors' and asked Marie (wife) if Robert (husband) could come out and play!  They played most of the day!!",
                "from": "https://www.facebook.com/rebecca.zajicek?fref=ufi&rc=p Rebecca Zajicek",
                "time": "21 hrs"
            },
            {
                "content": "That 2nd pooch would be me..yep...snowshoes epic fail yesterday when trying to fake that I was a snow bunny..hate snow, hate winter, where's my kayak, paddleboard, and outdoor swimming!",
                "from": "https://www.facebook.com/dandasana?fref=ufi&rc=p Maryanne Mac Mahon Ford",
                "time": "March 15 at 2:38pm"
            },
            {
                "content": "Barbara Longley  I just finished TANGLED IN TIME..AWESOME... When is the next one coming out? Is it about Grayce, or Mereidith. One last question, will Boann have an adventure?",
                "from": "https://www.facebook.com/robindburkhart?fref=ufi&rc=p Robin Burkhart",
                "time": "16 hrs"
            },
            {
                "content": "Sorry to be the voice of pedantry, but isn't that two types of dog in the winter? Not people? As a people I think I know a little about this sort of thing. And Winter. All I need now is a sense of humour.",
                "from": "https://www.facebook.com/vince.fitter?fref=ufi&rc=p Vince Fitter",
                "time": "February 3 at 10:20pm"
            },
            {
                "content": "Definitely the second. Frigid winds, ice, sleet, snow, and  I do not and \"never will\" have a good relationship. Nor do I care to develop one  😂 . Now, on the flip side, I'm the best of friends with balmy temps and sapphire blue skies  😀 !",
                "from": "https://www.facebook.com/profile.php?id=100010231961136&fref=ufi&rc=p Kimberley Heath",
                "time": "Yesterday at 3:14pm Edited"
            },
            {
                "content": "In real snow I'm like the dog for a day and then that's it lol... Maybe two days if we can fit in building a really huge snowman family then I'm up to the challenge of the cold  😂 😂 ",
                "from": "https://www.facebook.com/tammy.copsetta?fref=ufi&rc=p Tammy Copsetta",
                "time": "3 hrs"
            },
            {
                "content": "Definitely the lab  😄 ... I meet a lot of the second kind when I have to drive through the first snow though.  Move it! You have a 4WD SUV, get the lead out! Lol",
                "from": "https://www.facebook.com/MarieClose?fref=ufi&rc=p Marie Close Worrick",
                "time": "January 14 at 11:59pm"
            },
            {
                "content": "I do hate being cold...but I don't really like being stuck in October for the entire season either.  What happened to our winter? Lol!!",
                "from": "https://www.facebook.com/jessica.sykes.90?fref=ufi&rc=p Jessica Sykes",
                "time": "January 16 at 3:56pm"
            },
            {
                "content": "Jenny Martinez    Yve Icabalceta  reminds me of that Saturday morning...the rest of the crew happy to snowboard/ ski...and Yve scared/ worried for her life  😂 ",
                "from": "https://www.facebook.com/jazmina.lopez.75?fref=ufi&rc=p Lopez Jaz",
                "time": "January 28 at 3:19pm"
            },
            {
                "content": "Amyee Sheahen  this is literally us when you took me to the snow. You twirling around and me running back to the car cus it was too cold  😂 😂 😂 ",
                "from": "https://www.facebook.com/bec.nielsen.5?fref=ufi&rc=p Bec Nielsen",
                "time": "January 15 at 12:52pm"
            },
            {
                "content": "Colleen Callais  first one is Hal! Second is so Nola. I’m pretty sure I’ve already tagged you in this last year.  🤣  I think of Nola every time I see this.",
                "from": "https://www.facebook.com/vicki.drozdsestak?fref=ufi&rc=p Vicki Drozd Sestak",
                "time": "Yesterday at 2:31am"
            },
            {
                "content": "Albert  Mikey would actually be the excited one while I would have to drag Chula because you know she hates all things water and cold lol  😂 ",
                "from": "https://www.facebook.com/j.ramirez.robinson?fref=ufi&rc=p Jessica Ramirez Robinson",
                "time": "November 6 at 2:14pm"
            },
            {
                "content": "The one being drug in the snow../ in fact there was a dog walking in our ice storm in little rubber boots shivering, sliding, and generally looking miserable  - I think I'm that...",
                "from": "https://www.facebook.com/beverly.gorman.73?fref=ufi&rc=p Beverly Gorman",
                "time": "January 17 at 3:11am"
            },
            {
                "content": "If it's snow philip is turning flips and even the actual spins don't  bother him. Me I hibernate definitely would not find me driving a car unless absolutely emergency",
                "from": "https://www.facebook.com/profile.php?id=100004524908406&fref=ufi&rc=p Linda D. Williams",
                "time": "January 24 at 5:47am"
            },
            {
                "content": "Well I'd rather be the second one but have to shovel the snow have to clean off my car have to take the dogs for a walk. But I'm not liking when they're much anymore!!!",
                "from": "https://www.facebook.com/profile.php?id=100004242888580&fref=ufi&rc=p Rose Carvo",
                "time": "11 hrs"
            },
            {
                "content": "I'm both, depends on the day. Figures. I used to have one of each dog: snow nut and snow hater. Only have the hater left. Lost my snow nut 3 yrs ago.",
                "from": "https://www.facebook.com/angelina.brown.984991?fref=ufi&rc=p Angelina Brown",
                "time": "November 7 at 11:12pm"
            },
            {
                "content": "As a child growing up with my siblings, we would sled ride and ice skate all winter long . So #1 dog was me at one time. Now I am #2 dog, not loving it so much!",
                "from": "https://www.facebook.com/denna.siciliano.3?fref=ufi&rc=p Denna Siciliano",
                "time": "November 7 at 11:33am"
            },
            {
                "content": "Thanks for the laugh  Jack Feinstein ! The dog being dragged cracked me up!  So sorry to hear about your dog's passing. They truly become one of the family. I hope she went peacefully with no pain.",
                "from": "https://www.facebook.com/MelissaFriedmanPhotography?fref=ufi&rc=p Melissa Friedman",
                "time": "January 26 at 11:08pm"
            },
            {
                "content": "I’d be the second one had I not moved from Nebraska to Southern California 19 years ago! (But I’m the first one for skiing!)",
                "from": "https://www.facebook.com/jennifer.schumaker.14?fref=ufi&rc=p Jennifer Schumaker",
                "time": "November 6 at 8:42pm"
            },
            {
                "content": "When I was younger I loved to get out in the snow but since I've gotten older I'm like no way I'm staying inside and just enjoy looking at it lol",
                "from": "https://www.facebook.com/profile.php?id=100006808789408&fref=ufi&rc=p Beverly Hammar",
                "time": "23 hrs"
            },
            {
                "content": "Sadly, I'm the first one.  However, I do love snowy days, and now having grandkids I confess to loving a snowball fight with them.",
                "from": "https://www.facebook.com/alliemae47?fref=ufi&rc=p Alice Hall",
                "time": "Yesterday at 3:40am"
            },
            {
                "content": "So a chimp playing with a vr headset to which he can take off anytime is more upsetting to the dodo then a dog getting forced dragged into the snow to which they can't actually escape.. to me i think both videos are funny and you need to stop being 2 faced dodo.",
                "from": "https://www.facebook.com/stephanie.johnson.923?fref=ufi&rc=p Stephanie Johnson",
                "time": "February 8 at 3:24pm"
            },
            {
                "content": "I am absolutely the second one. I hate winter! I can't stand to be cold. I hibernate whenever possible until the world gets nice and warm again.",
                "from": "https://www.facebook.com/brueggemanntami?fref=ufi&rc=p Tami Brueggemann",
                "time": "November 6 at 6:21am"
            },
            {
                "content": "My Tess LOVES the snow, I do as well.  Likes having snow thrown at her face. Put boots on her, and guaranteed she wouldn't move.  She would feel like she was being punished.",
                "from": "https://www.facebook.com/k9kats?fref=ufi&rc=p Karen Hendrickson",
                "time": "March 15 at 3:32am"
            },
            {
                "content": "Since you guys said you like dog videos be prepared to be tagged often because that's all I watch  😁   Hannah Medler   Adrian Cochren",
                "from": "https://www.facebook.com/allie.buehne?fref=ufi&rc=p Allie Buehne",
                "time": "10 hrs"
            },
            {
                "content": "I have to be dragged out and so does my honey bunny neither one of us like like the cold we just rather stay inside with the electric blanket and watch the snow and then she likes to bark at the let the Thunder inside the house",
                "from": "https://www.facebook.com/profile.php?id=100008948656931&fref=ufi&rc=p Lyndy Simpson",
                "time": "January 27 at 5:55pm"
            },
            {
                "content": "I used to be the first. Now, I am the second. I don't even want to go skiing when invited. I feel bad when my kids want to play in the snow and I try to find ways to get out of it.",
                "from": "https://www.facebook.com/molly.payne.982?fref=ufi&rc=p Molly Payne",
                "time": "January 15 at 4:42pm"
            },
            {
                "content": "The second doesn't want to go because it's cold as an iceberg outside.  That's why God invented caves and men build houses with fireplaces in them.",
                "from": "https://www.facebook.com/wayne.kester.37?fref=ufi&rc=p Wayne Kester",
                "time": "January 18 at 5:59pm"
            }
        ],
        "description": "The Dodo Which one are you? Kate Plakina Fritz Helder Sheldon McIntosh Evelyn Rivera Dan Timko Yolanda LlJuna Barbara Longley Jenny Martinez Yve Icabalceta Amyee Sheahen Colleen Callais Albert Jack Feinstein Hannah Medler Adrian Cochren",
        "participants": [
            "https://www.facebook.com/thedodosite/?ref=nf&hc_ref=ARStyv-UIlJCiNS4t9oVEv3X9EuBZ8VOQ8659-Q8rYQVx5n8w-wkwVDt8ukeYl9tMes",
            "https://www.facebook.com/burgerboy21?fref=ufi&rc=p",
            "https://www.facebook.com/carisa.passalacqua?fref=ufi&rc=p",
            "https://www.facebook.com/ann.sivitter?fref=ufi&rc=p",
            "https://www.facebook.com/laverne.kent?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011108675297&fref=ufi&rc=p",
            "https://www.facebook.com/starving.y.full?fref=ufi&rc=p",
            "https://www.facebook.com/ekaterina.vp?hc_location=ufi",
            "https://www.facebook.com/fritz.helder.1?hc_location=ufi",
            "https://www.facebook.com/sheldon.mcintosh.12?hc_location=ufi",
            "https://www.facebook.com/trudy.eberlebuck?fref=ufi&rc=p",
            "https://www.facebook.com/Evybaby1?hc_location=ufi",
            "https://www.facebook.com/christine.kenyon.10?fref=ufi&rc=p",
            "https://www.facebook.com/sherryl.kersten?fref=ufi&rc=p",
            "https://www.facebook.com/QuickJackSandi?fref=ufi&rc=p",
            "https://www.facebook.com/marybstinson?fref=ufi&rc=p",
            "https://www.facebook.com/paulhughes3915?fref=ufi&rc=p",
            "https://www.facebook.com/Kzekaj8?fref=ufi&rc=p",
            "https://www.facebook.com/jazzysueb?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010994163418&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=12436705&fref=ufi&rc=p",
            "https://www.facebook.com/dan.timko.16?hc_location=ufi",
            "https://www.facebook.com/diane.gleason.5?fref=ufi&rc=p",
            "https://www.facebook.com/jenelle.doughty?fref=ufi&rc=p",
            "https://www.facebook.com/bonnie.colby.9?fref=ufi&rc=p",
            "https://www.facebook.com/sharonporterfieldmiddleton?fref=ufi&rc=p",
            "https://www.facebook.com/sharon.spangler.142?fref=ufi&rc=p",
            "https://www.facebook.com/lanetra.daniel?fref=ufi&rc=p",
            "https://www.facebook.com/yolanda.daniel.58?hc_location=ufi",
            "https://www.facebook.com/lljuna.grennellweir?hc_location=ufi",
            "https://www.facebook.com/rebecca.zajicek?fref=ufi&rc=p",
            "https://www.facebook.com/dandasana?fref=ufi&rc=p",
            "https://www.facebook.com/robindburkhart?fref=ufi&rc=p",
            "https://www.facebook.com/barlongley?hc_location=ufi",
            "https://www.facebook.com/vince.fitter?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010231961136&fref=ufi&rc=p",
            "https://www.facebook.com/tammy.copsetta?fref=ufi&rc=p",
            "https://www.facebook.com/MarieClose?fref=ufi&rc=p",
            "https://www.facebook.com/jessica.sykes.90?fref=ufi&rc=p",
            "https://www.facebook.com/jazmina.lopez.75?fref=ufi&rc=p",
            "https://www.facebook.com/jenAYE05?hc_location=ufi",
            "https://www.facebook.com/Yve415?hc_location=ufi",
            "https://www.facebook.com/bec.nielsen.5?fref=ufi&rc=p",
            "https://www.facebook.com/amyee.sheahen?hc_location=ufi",
            "https://www.facebook.com/vicki.drozdsestak?fref=ufi&rc=p",
            "https://www.facebook.com/colleen.callais?hc_location=ufi",
            "https://www.facebook.com/j.ramirez.robinson?fref=ufi&rc=p",
            "https://www.facebook.com/albi956?hc_location=ufi",
            "https://www.facebook.com/beverly.gorman.73?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100004524908406&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100004242888580&fref=ufi&rc=p",
            "https://www.facebook.com/angelina.brown.984991?fref=ufi&rc=p",
            "https://www.facebook.com/denna.siciliano.3?fref=ufi&rc=p",
            "https://www.facebook.com/MelissaFriedmanPhotography?fref=ufi&rc=p",
            "https://www.facebook.com/jack.feinstein?hc_location=ufi",
            "https://www.facebook.com/jennifer.schumaker.14?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100006808789408&fref=ufi&rc=p",
            "https://www.facebook.com/alliemae47?fref=ufi&rc=p",
            "https://www.facebook.com/stephanie.johnson.923?fref=ufi&rc=p",
            "https://www.facebook.com/brueggemanntami?fref=ufi&rc=p",
            "https://www.facebook.com/k9kats?fref=ufi&rc=p",
            "https://www.facebook.com/allie.buehne?fref=ufi&rc=p",
            "https://www.facebook.com/hannah.medler.1?hc_location=ufi",
            "https://www.facebook.com/adrian.cochren?hc_location=ufi",
            "https://www.facebook.com/profile.php?id=100008948656931&fref=ufi&rc=p",
            "https://www.facebook.com/molly.payne.982?fref=ufi&rc=p",
            "https://www.facebook.com/wayne.kester.37?fref=ufi&rc=p",
            "https://www.facebook.com/burgerboy21?fref=ufi&rc=p",
            "https://www.facebook.com/carisa.passalacqua?fref=ufi&rc=p",
            "https://www.facebook.com/ann.sivitter?fref=ufi&rc=p",
            "https://www.facebook.com/laverne.kent?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011108675297&fref=ufi&rc=p",
            "https://www.facebook.com/starving.y.full?fref=ufi&rc=p",
            "https://www.facebook.com/trudy.eberlebuck?fref=ufi&rc=p",
            "https://www.facebook.com/christine.kenyon.10?fref=ufi&rc=p",
            "https://www.facebook.com/sherryl.kersten?fref=ufi&rc=p",
            "https://www.facebook.com/QuickJackSandi?fref=ufi&rc=p",
            "https://www.facebook.com/marybstinson?fref=ufi&rc=p",
            "https://www.facebook.com/paulhughes3915?fref=ufi&rc=p",
            "https://www.facebook.com/Kzekaj8?fref=ufi&rc=p",
            "https://www.facebook.com/jazzysueb?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010994163418&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=12436705&fref=ufi&rc=p",
            "https://www.facebook.com/diane.gleason.5?fref=ufi&rc=p",
            "https://www.facebook.com/jenelle.doughty?fref=ufi&rc=p",
            "https://www.facebook.com/bonnie.colby.9?fref=ufi&rc=p",
            "https://www.facebook.com/sharonporterfieldmiddleton?fref=ufi&rc=p",
            "https://www.facebook.com/sharon.spangler.142?fref=ufi&rc=p",
            "https://www.facebook.com/lanetra.daniel?fref=ufi&rc=p",
            "https://www.facebook.com/rebecca.zajicek?fref=ufi&rc=p",
            "https://www.facebook.com/dandasana?fref=ufi&rc=p",
            "https://www.facebook.com/robindburkhart?fref=ufi&rc=p",
            "https://www.facebook.com/vince.fitter?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010231961136&fref=ufi&rc=p",
            "https://www.facebook.com/tammy.copsetta?fref=ufi&rc=p",
            "https://www.facebook.com/MarieClose?fref=ufi&rc=p",
            "https://www.facebook.com/jessica.sykes.90?fref=ufi&rc=p",
            "https://www.facebook.com/jazmina.lopez.75?fref=ufi&rc=p",
            "https://www.facebook.com/bec.nielsen.5?fref=ufi&rc=p",
            "https://www.facebook.com/vicki.drozdsestak?fref=ufi&rc=p",
            "https://www.facebook.com/j.ramirez.robinson?fref=ufi&rc=p",
            "https://www.facebook.com/beverly.gorman.73?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100004524908406&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100004242888580&fref=ufi&rc=p",
            "https://www.facebook.com/angelina.brown.984991?fref=ufi&rc=p",
            "https://www.facebook.com/denna.siciliano.3?fref=ufi&rc=p",
            "https://www.facebook.com/MelissaFriedmanPhotography?fref=ufi&rc=p",
            "https://www.facebook.com/jennifer.schumaker.14?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100006808789408&fref=ufi&rc=p",
            "https://www.facebook.com/alliemae47?fref=ufi&rc=p",
            "https://www.facebook.com/stephanie.johnson.923?fref=ufi&rc=p",
            "https://www.facebook.com/brueggemanntami?fref=ufi&rc=p",
            "https://www.facebook.com/k9kats?fref=ufi&rc=p",
            "https://www.facebook.com/allie.buehne?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100008948656931&fref=ufi&rc=p",
            "https://www.facebook.com/molly.payne.982?fref=ufi&rc=p",
            "https://www.facebook.com/wayne.kester.37?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/thedodosite/videos/1025357334265608/",
        "photos": [
            "https://www.facebook.com/photo.php?fbid=10210214639634342&set=p.10210214639634342&type=3",
            "https://www.facebook.com/photo.php?fbid=1597398123620760&set=p.1597398123620760&type=3"
        ]
    },
    {
        "comments": [],
        "description": "Linda Kay  shared a memory. How dare ya Linda Kay  ·  November 7, 2016  ·  Exactly how I feel.",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/AgendaLinda?hc_ref=ARRRRdlfW0BwftHODRR4x6XbdnTWMFJzuor1PqWIDRCtT_kTju1AfGpRNC_Cyxuxzv8",
            "https://www.facebook.com/AgendaLinda?fref=nf"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483566342029797",
        "photos": [
            "https://www.facebook.com/photo.php?fbid=310811085971991&set=a.181682662218168.1073741828.100011293067807&type=3"
        ]
    },
    {
        "comments": [],
        "description": "",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483566342029797",
        "photos": [
            "https://www.facebook.com/photo.php?fbid=310811085971991&set=a.181682662218168.1073741828.100011293067807&type=3"
        ]
    },
    {
        "comments": [
            {
                "content": "Hatred an fear are Trump's weapon of choice, what a hipocrit.",
                "from": "https://www.facebook.com/carlos.pozonieto?fref=ufi Carlos Pozo Nieto",
                "time": "November 7 at 12:34pm"
            }
        ],
        "description": "Linda Kay  shared  NowThis Politics 's  video .",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/AgendaLinda?hc_ref=ARQo2Ci4xtWmXGKWQ3ZRXC76Gn3NrxYTCYE8KZh4i5QbcEhalI_XfVfoG5oT1nmVOFk",
            "https://www.facebook.com/NowThisPolitics/?hc_ref=ARQo2Ci4xtWmXGKWQ3ZRXC76Gn3NrxYTCYE8KZh4i5QbcEhalI_XfVfoG5oT1nmVOFk",
            "/NowThisPolitics/videos/1773876955977120/?hc_ref=ARQo2Ci4xtWmXGKWQ3ZRXC76Gn3NrxYTCYE8KZh4i5QbcEhalI_XfVfoG5oT1nmVOFk",
            "https://www.facebook.com/carlos.pozonieto?fref=ufi",
            "https://www.facebook.com/carlos.pozonieto?fref=ufi"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483474102039021",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "Time to break out the handy \"Mass shooting in US checklist\": 1.  Send thoughts & prayers but not actually do anything useful ✔  2.  Argue over semantics of the term \"assault rifle\" ✔  ... See More",
                "from": "https://www.facebook.com/stuart.webb.505?fref=ufi&rc=p Stuart Webb",
                "time": "November 6 at 6:31pm"
            },
            {
                "content": "Foolish president...Foolish lobbyists...Foolish laws....US use to be a reference point for democracy, sanity and everything good and improvement...look at them today all cos of greediness of some people, and people's interest first instead of nation's good interest",
                "from": "https://www.facebook.com/ekemezie.i.jnr?fref=ufi&rc=p Ifeanyi Jnr Ekemezie",
                "time": "November 6 at 6:27pm"
            },
            {
                "content": "The shooter had an illegal gun because he could not buy one. The shooter ran after being shot at by a guy with a legal weapon. Please tell me again how gun control will work",
                "from": "https://www.facebook.com/logan.brandenburg.94?fref=ufi&rc=p Logan Brandenburg",
                "time": "November 6 at 6:30pm"
            },
            {
                "content": "We must regulate gun's because you can not regulate the people who shoot them  - How can you ? Get rid of rapid fire weapon's from being available in gun shops for starters & make it Illegal for the gun lobby to donate millions of dollar's or any money to presidential candidates like the $30 million given to Trump and all the other's before him.",
                "from": "https://www.facebook.com/paleodietman?fref=ufi&rc=p Ben Middleton",
                "time": "November 6 at 6:28pm"
            },
            {
                "content": "I still love how when it’s a white person they are “mentally ill” or something of the sort (ironic since they want to get rid of the mentally ill restriction on purchasing of firearms), but if there is any shade of brown there is an instant notion of terrorism and the event is politicized.",
                "from": "https://www.facebook.com/dmillard08?fref=ufi&rc=p Dave Millard",
                "time": "November 6 at 6:38pm"
            },
            {
                "content": "Offering thoughts and prayers is an insult to those families who've lost loved ones over the years in this manner. The members of congress who've sold their souls to the NRA, have a special place in hell reserved for them",
                "from": "https://www.facebook.com/profile.php?id=100004318607778&fref=ufi&rc=p Carolyn Stevens",
                "time": "November 6 at 6:30pm"
            },
            {
                "content": "Sad to say but what I've finally learned from Sandy Hook is when these nimrods say 'our thoughts & prayers', what they really mean is 'too bad. sucks to be you.' They just don't care.",
                "from": "https://www.facebook.com/keith.fulton.50?fref=ufi&rc=p Keith Fulton",
                "time": "November 6 at 6:50pm"
            },
            {
                "content": "307 mass shootings this year? Guess we know what Trump is bragging about when he said he accomplished more than Obama in his first time. More hate, more division, more Trump.",
                "from": "https://www.facebook.com/christopherritter?fref=ufi&rc=p Christopher D. Ritter",
                "time": "November 6 at 6:35pm"
            },
            {
                "content": "There is no way of stopping criminals from getting guns! Stop pushing this stupid agenda and tell more people to conceal carry who are law abiding citizens. More good people with guns the harder time the bad people will have mass murdering people.  # gunfreezone   # nosuchthingasgunfreezone   # gunfreezonesdonotwork   # moregoodpeopleneedguns",
                "from": "https://www.facebook.com/BruceAllenBrownII?fref=ufi&rc=p Bruce Brown II",
                "time": "November 6 at 7:14pm"
            },
            {
                "content": "Why is it that Trump sneers even when offering condolences? Nothing he says sounds sincere or heartfelt. I can no longer watch or listen to him. He is a profound phony. Hateful, useless man.",
                "from": "https://www.facebook.com/linda.beynon.58?fref=ufi&rc=p Linda Beynon",
                "time": "November 6 at 6:42pm"
            },
            {
                "content": "The NRA has a death grip on our politicians and so-called potus, that's why it will never change here! Praying will not change the fact that our civilian population is able to run around with assault weapons and kill as many people as they want to kill anywhere and anytime! Face that fact and shut your mouth unless you are willing to take action and do what Australia did in 1996! I dare you!",
                "from": "https://www.facebook.com/Bertale?fref=ufi&rc=p Berta Roseberry",
                "time": "November 6 at 6:28pm"
            },
            {
                "content": "Why would the GOP do anything?? They make money from such things, through gun sales, through GOP followers, and they show the world how compassionate they are with \"moments of silence\" and \"thoughts and prayers\".  What they fail to see is that the modern world outside DC is pointing and laughing at the ignorant Americans.",
                "from": "https://www.facebook.com/stjim3?fref=ufi&rc=p James Gurney",
                "time": "November 6 at 6:30pm"
            },
            {
                "content": "Shootings are actually down. And Chicago has over 500 already. It's just shootings are trending now with the media and we have social media..",
                "from": "https://www.facebook.com/john.dicklignos?fref=ufi&rc=p John Dick Lignos",
                "time": "November 6 at 6:27pm"
            },
            {
                "content": "Get the NRA out of our politics and candidates that accept their money should be voted out! Thoughts and Prayers are NOT going to change the gun culture or the weak laws protecting the American people. They have seen fit to even remove laws that make i ... See More",
                "from": "https://www.facebook.com/dennese.lilleyedgerton?fref=ufi&rc=p Dennese Edgerton",
                "time": "November 6 at 6:33pm"
            },
            {
                "content": "Get off your knees and do something damn it! God helps those that help themselves.....means don't sit around waiting for someone to help you, pull up your boot straps and help yourself. Prayers fix nothing...action does. Of course they have our condolences.....but condolences don't address the problem.",
                "from": "https://www.facebook.com/stephanny.gonzalez.90260?fref=ufi&rc=p Stephanny Gonzalez",
                "time": "November 6 at 6:35pm Edited"
            },
            {
                "content": "I am not worried about professional criminals getting guns I am worried about crazies and children and abusers the everyday Joe and Mary who are getting multi firing weapons way too easily. One trigger pull one shot is all anyone needs for hunting and protection. Stop mass murder",
                "from": "https://www.facebook.com/profile.php?id=100009133488219&fref=ufi&rc=p Marian Clough",
                "time": "November 6 at 7:19pm"
            },
            {
                "content": "That's what Republicans do best.... NOTHING. As long as they are in charge this is what we should expect for our future Americans.",
                "from": "https://www.facebook.com/april.flores.731?fref=ufi&rc=p April Elaine",
                "time": "November 6 at 6:49pm"
            },
            {
                "content": "Not only should pot be legal nationwide but required daily use must be  mandated in place of psych med....never heard of anyone committing murder while stoned...",
                "from": "https://www.facebook.com/profile.php?id=100009874893559&fref=ufi&rc=p Thomas Keene",
                "time": "November 6 at 6:36pm"
            },
            {
                "content": "Neither are Democrats. Your only solutions are total buybacks or banishments that violate citizens' right to due process (even the ACLU had to call you out on that one). Once you have something reasonable and not radical to bring to the table, maybe we'll listen.",
                "from": "https://www.facebook.com/matchboxx2010?fref=ufi&rc=p Josh Edgar",
                "time": "November 6 at 6:29pm"
            },
            {
                "content": "I think its funny how people who are against gun laws right away get all triggered like if people are saying to completely ban guns. I think the idea here would be to increase vetting for who can obtain one. Hows that a bad thing? If you know you have  ... See More",
                "from": "https://www.facebook.com/mauro.f.reyes?fref=ufi&rc=p Mauro Flores Reyes",
                "time": "November 6 at 6:43pm"
            },
            {
                "content": "So the gun laws that are currently in the books couldn't prevent this guy from obtaining weapons, but please do explain how new gun laws would've prevented him from obtaining those weapons  🤔 ...and the guy that had the legal weapon, wasn't he the one that took him down  🤔 ",
                "from": "https://www.facebook.com/frankie.martinez.5220?fref=ufi&rc=p Frank Martinez De Luna",
                "time": "November 6 at 8:22pm"
            },
            {
                "content": "We're already tasking God to prevent conception when women get raped. I mean he's got his hands full! Isn't there something we can do other than pray? And sending our condolences?",
                "from": "https://www.facebook.com/mlozwall?fref=ufi&rc=p Monica Wall Albarran",
                "time": "November 6 at 6:29pm"
            },
            {
                "content": "How many more deaths before we start doing something about this????Are we almost done praying, because that doesn’t seem to be doing quite enough. The killing still goes on.....",
                "from": "https://www.facebook.com/mj.morettarabein?fref=ufi&rc=p MJ Moret Tarabein",
                "time": "November 6 at 6:27pm"
            },
            {
                "content": "Yep their prayers are for the families  but the gun lobby dollars are staying in their pockets.  Mass shootings are probably good business for them. After every shooting gun control comes up wouldnt be surprised if there are extra contributions each time.    We need an investigative journalist to check out timeline of donations and shootings.",
                "from": "https://www.facebook.com/profile.php?id=100009308357031&fref=ufi&rc=p Suzanne Sibilla Hecox",
                "time": "November 6 at 6:42pm Edited"
            },
            {
                "content": "As long as its legal for special interest groups to donate to campaigns. This will keep happening. It’s all about money. They’d rather have their campaigns funded by the NRA than protect everyday human beings. Maybe even a limit as to how much special interest groups could donate. But that won’t happen. Greed. Why not a war on greed?",
                "from": "https://www.facebook.com/michael.mendez29?fref=ufi&rc=p Michael Mendez",
                "time": "November 6 at 6:50pm"
            },
            {
                "content": "Once the GOP decided that the massacre of children at Sandy Hook was not worth threatening their NRA ratings for, the quest for sensible attitudes towards deadly firearms ownership ended.",
                "from": "https://www.facebook.com/tom.ferguson.714?fref=ufi&rc=p Tom Ferguson",
                "time": "November 6 at 7:06pm"
            },
            {
                "content": "Can someone give me just one legitimate reason why regular citizen not active service members need assault weapons. Do are police carry them no do you hunt with them no. I am not against gun ownership.",
                "from": "https://www.facebook.com/dianesamsa.avers?fref=ufi&rc=p Diane Samsa Avers",
                "time": "November 6 at 6:41pm"
            },
            {
                "content": "Look at chicago and dc.  They have the strictest gun laws in the nation and they have the most killings.  Control doesn't work.  I believe that the killer belonged to one of those leftest organizations.  atifa or something like that.  Main stream media won't talk about that.  That was found on his facebook page.  Pray for the people in Texas.",
                "from": "https://www.facebook.com/kennethscott.gulliford?fref=ufi&rc=p Kenneth Scott Gulliford",
                "time": "Yesterday at 12:30pm"
            },
            {
                "content": "Hey Democrats, need I remind you that over 3000 people were murdered in Chicago during Barrack Hussein Obama's Presidency and for a fact Chicago has some of the toughest gun laws in America !!!",
                "from": "https://www.facebook.com/profile.php?id=100009979606177&fref=ufi&rc=p Chuck Roberts",
                "time": "19 hrs"
            },
            {
                "content": "Wait a minute. What are you saying here? You're saying that the Republicans are doing nothing? That is status quo for them. And they'll continue to do nothing as long as they are in the pockets of the NRA. They haven't done anything about health care,  ... See More",
                "from": "https://www.facebook.com/robert.kort.9?fref=ufi&rc=p Robert Kort",
                "time": "November 6 at 8:08pm"
            },
            {
                "content": "gut wrenching.  Im not even from your country but when i hear things like this i hang my head in shame knowing im of the same human race that is capable of doing monstrous things like this.  No action is compliance.",
                "from": "https://www.facebook.com/pagdato?fref=ufi&rc=p Joshua Pagdato",
                "time": "November 6 at 6:32pm"
            },
            {
                "content": "My dad always told me if you just pray but sit on your ass, nothing will happen because God works with those who work with him too. All these bullshit messages from all the US president's about how tragic these events are and America is with you. We ar ... See More",
                "from": "https://www.facebook.com/sharrukina?fref=ufi&rc=p Sharra Malek",
                "time": "November 6 at 7:01pm"
            },
            {
                "content": "Time for guns to be considered a weapon of mass/fast destruction. Guns should only be for war. Not policing or personal protection. And the US government shouldn't be allowed to use guns against Americans. ... See More",
                "from": "https://www.facebook.com/jerrelellerby?fref=ufi&rc=p Jerrel Ellerby",
                "time": "November 6 at 8:39pm"
            },
            {
                "content": "Republicans just keep on killing us and the morons just keep on voting them in.the cycle of self hate is just to hard to break.their religion tells them wait till the after life and of course takes their money and the Republicans pander to their racism ... See More",
                "from": "https://www.facebook.com/profile.php?id=100009745218535&fref=ufi&rc=p Tom Myers",
                "time": "November 6 at 6:57pm"
            },
            {
                "content": "democrats are just as complicit....neither as a whole represent us anymore. Granted the paranoia that Barrack would \"take our guns\" combined with the GOP effort to undermine any meaningful legislating made it hard to address. This admin would be able to push bipartisan legislation fairly easy except thr NRA have DEEP pockets",
                "from": "https://www.facebook.com/david.j.santiago?fref=ufi&rc=p David Santiago",
                "time": "November 6 at 6:51pm Edited"
            },
            {
                "content": "\"Tonight, as my colleagues go to sleep, they need to think about whether the political support of the gun industry is worth the blood that flows endlessly onto the floors of American churches, elementary schools, movie theaters, and city streets. They  ... See More",
                "from": "https://www.facebook.com/nathan.olivas.90?fref=ufi&rc=p Nathan Olivas",
                "time": "November 6 at 6:38pm"
            },
            {
                "content": "Headline should read \"... and Congress is doing nothing.\" Regardless of Republican or Democrat majority,  Congress has done nothing since the Brady Bill expired.",
                "from": "https://www.facebook.com/bill.jeffers.79?fref=ufi&rc=p Bill Jeffers",
                "time": "November 6 at 6:49pm Edited"
            },
            {
                "content": "I posted something about fun control somewhere else and the response was why guns didn't do nothin and one dude straight said he didn't care if this happened every day that it's not gonna infringe his rights that's the mindset of your fellow American now a days",
                "from": "https://www.facebook.com/pierre.boyce?fref=ufi&rc=p Pierre Deandre Boyce",
                "time": "November 6 at 7:54pm"
            },
            {
                "content": "Sometime truth hurts, but truth and facing that truth can begin some much needed movement towards some gun sanity, some being able to feel, deeply and honestly, and to see the horrors of gun violence, of bloody bodies and the pain beyond all pain, of senseless , horrific, slaughter. By averting our eyes, refusing the facts and the truths, we , too, stand guilty.",
                "from": "https://www.facebook.com/margaret.deharpporte?fref=ufi&rc=p Margaret DeHarpporte",
                "time": "November 7 at 2:45am"
            },
            {
                "content": "\"Why aren't they doing anything?!?\" Well. Because the NRA and other Corporations spend Hundreds of Millions \"Lobbying\" senators, so they get what they want  ... See More",
                "from": "https://www.facebook.com/alexander.sackiw?fref=ufi&rc=p Alexander Sackiw",
                "time": "November 6 at 9:13pm"
            },
            {
                "content": "307th? What the hell are you counting? I know for a fact you haven't reported 307 shootings so what about the 300 didn't fit your agenda? Either you withheld information from us or you made that number up and are lying now. Either way so your journalistic duty! Bitches.",
                "from": "https://www.facebook.com/michael.c.cox.3?fref=ufi&rc=p Michael Cody Cox",
                "time": "November 6 at 9:32pm"
            },
            {
                "content": "I’am reading these comments and soooo many people misinformed shooting off their mouths and don’t know anything.  Most don’t even know what semiautomatic means?  There is no way nor will there ever be a way to deter or detect some lunatic that goes off his rocker on a spur of the moment. ... See More",
                "from": "https://www.facebook.com/profile.php?id=1414503764&fref=ufi&rc=p Bert Morgan",
                "time": "November 7 at 1:38am Edited"
            },
            {
                "content": "The democrats and fake new keep saying \" The gun violence\" people cost violence. I've had guns for as long as I've been in the United States It has never crises my mined to even look at my guns that way. And I'm not alone, but the Damn democrats won't stop blaming guns ignorant Goes  long ways with democrats. Keep your guns AMERICA don't trust especially the  government build by democrats.",
                "from": "https://www.facebook.com/tony.bono.790?fref=ufi&rc=p Antonino Petrit Vata",
                "time": "Yesterday at 3:30am"
            },
            {
                "content": "Universal background checks are already in place.   The only \"gun purchase loophole\" is the purchase of long guns in person to person transactions.   There is no way to regulate this.   Get a clue liberals.   It's not the guns that are the problem.   It's the crazy, evil people.",
                "from": "https://www.facebook.com/todd.christensen.549?fref=ufi&rc=p Todd Christensen",
                "time": "November 6 at 6:50pm"
            },
            {
                "content": "Oh yes lets keep those thoughts and prayers coming.  Thoughts and prayers by the barrelful. God forbid we should have some laws and legislation or maybe a simple background check. Yes thoughts and prayers that ought to do it. We'll here's a thought how ... See More",
                "from": "https://www.facebook.com/jane.presti?fref=ufi&rc=p Jane Vaccaro Presti",
                "time": "November 6 at 8:43pm"
            },
            {
                "content": "People are saying that we should make guns illegal so innocent people won't be killed but if that's the case aren't drugs illegal? And still people are using drugs and yes the United States leads all of the countries that are drug user's.  Making guns illegal do you really think that every criminal will give up his illegal weapons? NOT A CHANCE IN HELL.",
                "from": "https://www.facebook.com/ramiro.magallon.3?fref=ufi&rc=p Ramiro Magallon",
                "time": "November 6 at 8:02pm"
            },
            {
                "content": "307 mass shootings... it is a miracle that there are any Americans left.  Of course it has to do with how easy it is to get a weapon.  But that's not the only thing.  Healthcare (especially mental health care ) and education will help prevent these things frim happening.",
                "from": "https://www.facebook.com/Myrte.en.Jauk?fref=ufi&rc=p Myrte Elema",
                "time": "November 6 at 7:19pm"
            },
            {
                "content": "307 shootings and about 318 million Americans. I have about a 0.00000097% chance of getting shot. Think, I’ll take my chances playing the lottery.",
                "from": "https://www.facebook.com/matthew.brink.313?fref=ufi&rc=p Matthew Brink",
                "time": "November 6 at 6:31pm"
            },
            {
                "content": "This is exactly why the last 2 weapon massacres have been done by the left because they know if they shoot up enough people we will eventually pass gun laws. Around the globe countries have passed strict gun laws after mass shootings. They want to win so bad they’re willing to kill for it. Where have we seen this behavior before? I’ll let you fill that one in.",
                "from": "https://www.facebook.com/joseph.tester.3939?fref=ufi&rc=p Joseph E. Tester",
                "time": "November 7 at 3:35am Edited"
            },
            {
                "content": "Why is it such a crazy idea to say we can have \"good guys with guns\" while also saying someone guilty of domestic violence, people with mental disorders who have exhibited dangerous behavior, or people on the \"no fly watch list\" cannot have guns?  Why  ... See More",
                "from": "https://www.facebook.com/leanne.windsor.395?fref=ufi&rc=p Leanne Windsor",
                "time": "November 6 at 8:15pm Edited"
            }
        ],
        "description": "NowThis Politics The Sutherland Springs shooting was the 307th in America this year — and Republicans are still doing nothing",
        "participants": [
            "https://www.facebook.com/NowThisPolitics/?ref=nf&hc_ref=ARReD9h81RcruWjD0ueVuetpUpbeiTbB9r3nPPUXREiKkrCJtI-gSGqQLFQIv8jTlsM",
            "https://www.facebook.com/stuart.webb.505?fref=ufi&rc=p",
            "https://www.facebook.com/ekemezie.i.jnr?fref=ufi&rc=p",
            "https://www.facebook.com/logan.brandenburg.94?fref=ufi&rc=p",
            "https://www.facebook.com/paleodietman?fref=ufi&rc=p",
            "https://www.facebook.com/dmillard08?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100004318607778&fref=ufi&rc=p",
            "https://www.facebook.com/keith.fulton.50?fref=ufi&rc=p",
            "https://www.facebook.com/christopherritter?fref=ufi&rc=p",
            "https://www.facebook.com/BruceAllenBrownII?fref=ufi&rc=p",
            "https://www.facebook.com/linda.beynon.58?fref=ufi&rc=p",
            "https://www.facebook.com/Bertale?fref=ufi&rc=p",
            "https://www.facebook.com/stjim3?fref=ufi&rc=p",
            "https://www.facebook.com/john.dicklignos?fref=ufi&rc=p",
            "https://www.facebook.com/dennese.lilleyedgerton?fref=ufi&rc=p",
            "https://www.facebook.com/stephanny.gonzalez.90260?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009133488219&fref=ufi&rc=p",
            "https://www.facebook.com/april.flores.731?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009874893559&fref=ufi&rc=p",
            "https://www.facebook.com/matchboxx2010?fref=ufi&rc=p",
            "https://www.facebook.com/mauro.f.reyes?fref=ufi&rc=p",
            "https://www.facebook.com/frankie.martinez.5220?fref=ufi&rc=p",
            "https://www.facebook.com/mlozwall?fref=ufi&rc=p",
            "https://www.facebook.com/mj.morettarabein?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009308357031&fref=ufi&rc=p",
            "https://www.facebook.com/michael.mendez29?fref=ufi&rc=p",
            "https://www.facebook.com/tom.ferguson.714?fref=ufi&rc=p",
            "https://www.facebook.com/dianesamsa.avers?fref=ufi&rc=p",
            "https://www.facebook.com/kennethscott.gulliford?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009979606177&fref=ufi&rc=p",
            "https://www.facebook.com/robert.kort.9?fref=ufi&rc=p",
            "https://www.facebook.com/pagdato?fref=ufi&rc=p",
            "https://www.facebook.com/sharrukina?fref=ufi&rc=p",
            "https://www.facebook.com/jerrelellerby?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009745218535&fref=ufi&rc=p",
            "https://www.facebook.com/david.j.santiago?fref=ufi&rc=p",
            "https://www.facebook.com/nathan.olivas.90?fref=ufi&rc=p",
            "https://www.facebook.com/bill.jeffers.79?fref=ufi&rc=p",
            "https://www.facebook.com/pierre.boyce?fref=ufi&rc=p",
            "https://www.facebook.com/margaret.deharpporte?fref=ufi&rc=p",
            "https://www.facebook.com/alexander.sackiw?fref=ufi&rc=p",
            "https://www.facebook.com/michael.c.cox.3?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1414503764&fref=ufi&rc=p",
            "https://www.facebook.com/tony.bono.790?fref=ufi&rc=p",
            "https://www.facebook.com/todd.christensen.549?fref=ufi&rc=p",
            "https://www.facebook.com/jane.presti?fref=ufi&rc=p",
            "https://www.facebook.com/ramiro.magallon.3?fref=ufi&rc=p",
            "https://www.facebook.com/Myrte.en.Jauk?fref=ufi&rc=p",
            "https://www.facebook.com/matthew.brink.313?fref=ufi&rc=p",
            "https://www.facebook.com/joseph.tester.3939?fref=ufi&rc=p",
            "https://www.facebook.com/leanne.windsor.395?fref=ufi&rc=p",
            "https://www.facebook.com/stuart.webb.505?fref=ufi&rc=p",
            "https://www.facebook.com/ekemezie.i.jnr?fref=ufi&rc=p",
            "https://www.facebook.com/logan.brandenburg.94?fref=ufi&rc=p",
            "https://www.facebook.com/paleodietman?fref=ufi&rc=p",
            "https://www.facebook.com/dmillard08?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100004318607778&fref=ufi&rc=p",
            "https://www.facebook.com/keith.fulton.50?fref=ufi&rc=p",
            "https://www.facebook.com/christopherritter?fref=ufi&rc=p",
            "https://www.facebook.com/BruceAllenBrownII?fref=ufi&rc=p",
            "https://www.facebook.com/linda.beynon.58?fref=ufi&rc=p",
            "https://www.facebook.com/Bertale?fref=ufi&rc=p",
            "https://www.facebook.com/stjim3?fref=ufi&rc=p",
            "https://www.facebook.com/john.dicklignos?fref=ufi&rc=p",
            "https://www.facebook.com/dennese.lilleyedgerton?fref=ufi&rc=p",
            "https://www.facebook.com/stephanny.gonzalez.90260?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009133488219&fref=ufi&rc=p",
            "https://www.facebook.com/april.flores.731?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009874893559&fref=ufi&rc=p",
            "https://www.facebook.com/matchboxx2010?fref=ufi&rc=p",
            "https://www.facebook.com/mauro.f.reyes?fref=ufi&rc=p",
            "https://www.facebook.com/frankie.martinez.5220?fref=ufi&rc=p",
            "https://www.facebook.com/mlozwall?fref=ufi&rc=p",
            "https://www.facebook.com/mj.morettarabein?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009308357031&fref=ufi&rc=p",
            "https://www.facebook.com/michael.mendez29?fref=ufi&rc=p",
            "https://www.facebook.com/tom.ferguson.714?fref=ufi&rc=p",
            "https://www.facebook.com/dianesamsa.avers?fref=ufi&rc=p",
            "https://www.facebook.com/kennethscott.gulliford?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009979606177&fref=ufi&rc=p",
            "https://www.facebook.com/robert.kort.9?fref=ufi&rc=p",
            "https://www.facebook.com/pagdato?fref=ufi&rc=p",
            "https://www.facebook.com/sharrukina?fref=ufi&rc=p",
            "https://www.facebook.com/jerrelellerby?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009745218535&fref=ufi&rc=p",
            "https://www.facebook.com/david.j.santiago?fref=ufi&rc=p",
            "https://www.facebook.com/nathan.olivas.90?fref=ufi&rc=p",
            "https://www.facebook.com/bill.jeffers.79?fref=ufi&rc=p",
            "https://www.facebook.com/pierre.boyce?fref=ufi&rc=p",
            "https://www.facebook.com/margaret.deharpporte?fref=ufi&rc=p",
            "https://www.facebook.com/alexander.sackiw?fref=ufi&rc=p",
            "https://www.facebook.com/michael.c.cox.3?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1414503764&fref=ufi&rc=p",
            "https://www.facebook.com/tony.bono.790?fref=ufi&rc=p",
            "https://www.facebook.com/todd.christensen.549?fref=ufi&rc=p",
            "https://www.facebook.com/jane.presti?fref=ufi&rc=p",
            "https://www.facebook.com/ramiro.magallon.3?fref=ufi&rc=p",
            "https://www.facebook.com/Myrte.en.Jauk?fref=ufi&rc=p",
            "https://www.facebook.com/matthew.brink.313?fref=ufi&rc=p",
            "https://www.facebook.com/joseph.tester.3939?fref=ufi&rc=p",
            "https://www.facebook.com/leanne.windsor.395?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NowThisPolitics/videos/1773876955977120/",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "List any law that isn't a complete ban of all guns in existence that would have stopped the Vegas shooter. (Keep in mind that there is already a law that says you can't shoot people)",
                "from": "https://www.facebook.com/keith.tole.1?fref=ufi Keith Tole",
                "time": "November 7 at 9:20am"
            },
            {
                "content": "Yep. That's the one. Ban them all.",
                "from": "https://www.facebook.com/rick.v.leeds?fref=ufi Rick Vance Leeds",
                "time": "November 7 at 9:27am"
            },
            {
                "content": "Why do you want to take our guns?",
                "from": "https://www.facebook.com/TerryFXMurphy?fref=ufi Terry Murphy",
                "time": "November 7 at 9:45am"
            },
            {
                "content": "For crying out loud! Safer gun laws mean, SAFER. It does not mean ban guns. Better gun laws also aplies. Geez !",
                "from": "https://www.facebook.com/carlos.pozonieto?fref=ufi Carlos Pozo Nieto",
                "time": "November 7 at 12:02pm"
            },
            {
                "content": "You'll always have those idiots that will say \"But..they'll find other ways to kill!\". Which is true. But 'Murica makes it way too easy. There's nothing to stop someone from buying a gun, bullets, and shooting a large number of people. Very little effo ... See More",
                "from": "https://www.facebook.com/tator311?fref=ufi Nate Mellentine",
                "time": "November 7 at 12:18pm"
            },
            {
                "content": "They are now reporting that the shooter in Texas should not even been allowed to purchase a gun due to his court marshal and conviction.   The Air Force neglected to enter the conviction into the system.   This is another problem.  The laws we have aren't being applied adequately.   And there are loopholes.",
                "from": "https://www.facebook.com/msquires42?fref=ufi Michael Squires",
                "time": "November 7 at 1:13pm"
            },
            {
                "content": "Nevertheless you gotta be carefully in the Crowd !!!",
                "from": "https://www.facebook.com/mohamet.ali.522066?fref=ufi Mohamet Ali",
                "time": "November 7 at 10:00pm"
            }
        ],
        "description": "Linda Kay Oh my fucking gawd... Did I say we need “safer” gun laws? Holy fucking shit... what a misuse of words!   I am being told I meant to use the word “BETTER” gun laws. Not safer ones. Better ones.  Yep, thats the big difference... we need BETTER gun laws... not safer ones.  Whew! Glad I was set straight on that fuck up.  /Sarcasm off......  So now we can fix the gun laws right? Finally!",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/rick.v.leeds?fref=ufi",
            "https://www.facebook.com/TerryFXMurphy?fref=ufi",
            "https://www.facebook.com/carlos.pozonieto?fref=ufi",
            "https://www.facebook.com/tator311?fref=ufi",
            "https://www.facebook.com/msquires42?fref=ufi",
            "https://www.facebook.com/mohamet.ali.522066?fref=ufi",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/rick.v.leeds?fref=ufi",
            "https://www.facebook.com/TerryFXMurphy?fref=ufi",
            "https://www.facebook.com/carlos.pozonieto?fref=ufi",
            "https://www.facebook.com/tator311?fref=ufi",
            "https://www.facebook.com/msquires42?fref=ufi",
            "https://www.facebook.com/mohamet.ali.522066?fref=ufi"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483414292045002",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "I'm pretty good... For a lefty",
                "from": "https://www.facebook.com/c.m.secular.skaggs?fref=ufi C.M. Skaggs",
                "time": "November 7 at 8:34am"
            },
            {
                "content": "I want to do this. I might someday.  https://youtu.be/XBsr4aT7tmA",
                "from": "https://www.facebook.com/AgendaLinda?fref=ufi Linda Kay",
                "time": "November 7 at 8:38am"
            },
            {
                "content": "DITTO",
                "from": "https://www.facebook.com/raggedyanneski?fref=ufi Annie Coventina",
                "time": "November 7 at 2:05pm"
            },
            {
                "content": "My accuracy varies a lot by weapon.  I’m not such a good shot with my Glock, but I can hit a bullseye at 25 yards with my Taurus .357.",
                "from": "https://www.facebook.com/parrish.s.knight?fref=ufi Parrish S. Knight",
                "time": "November 7 at 2:20pm"
            }
        ],
        "description": "Linda Kay I am a gun owner and enthusiast and I can PROBABLY out shoot you......but I want safer gun laws in my United States of America!!",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/c.m.secular.skaggs?fref=ufi",
            "https://www.facebook.com/AgendaLinda?fref=ufi",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fyoutu.be%2FXBsr4aT7tmA&h=ATMZVyXkCCDIGf_yZIfwbS4EruSP3mI7mA007QEkI2JAnUURfPYqO3sBGlNE4UOLdL_LIoSWNi2_j9V_Xp0cfH5Pz5riB02vIWgbh3fbdVnPiJ5AGCW1GcNW5zuDsH3ZnCWsE_5znsOttpkKJN5am5hGwTAVDqK2fzpTeguqEKOlLJ7wq5yKCDTogAkpTzxCNMpYtaVA5Q9RCuZuTEy5I1LMzyxvpDwSGjMSWwRkipdOoopBqaFt6wPA",
            "https://www.facebook.com/raggedyanneski?fref=ufi",
            "https://www.facebook.com/parrish.s.knight?fref=ufi",
            "https://www.facebook.com/c.m.secular.skaggs?fref=ufi",
            "https://www.facebook.com/AgendaLinda?fref=ufi",
            "https://www.facebook.com/raggedyanneski?fref=ufi",
            "https://www.facebook.com/parrish.s.knight?fref=ufi"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483392355380529",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "",
                "from": "https://www.facebook.com/profile.php?id=100006323565613&fref=ufi Giobani Herrera",
                "time": "November 7 at 7:27am"
            },
            {
                "content": "Cool. What are you doin' for a job ?",
                "from": "https://www.facebook.com/carlos.pozonieto?fref=ufi Carlos Pozo Nieto",
                "time": "November 7 at 12:03pm"
            },
            {
                "content": "I'm on my way to an interview. Let's see how that goes.",
                "from": "https://www.facebook.com/carlos.pozonieto?fref=ufi Carlos Pozo Nieto",
                "time": "November 7 at 12:04pm"
            }
        ],
        "description": "Linda Kay I am back on a regular work schedule, yay me!    Weeeeeeeeeeee.... eeeee... eeee?? I am back on a regular work schedule, yay me!    Weeeeeeeeeeee.... eeeee... eeee??",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/profile.php?id=100006323565613&fref=ufi",
            "https://www.facebook.com/carlos.pozonieto?fref=ufi",
            "https://www.facebook.com/carlos.pozonieto?fref=ufi",
            "https://www.facebook.com/profile.php?id=100006323565613&fref=ufi",
            "https://www.facebook.com/carlos.pozonieto?fref=ufi",
            "https://www.facebook.com/carlos.pozonieto?fref=ufi"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483388762047555",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "No...the problem is that you didn't pay attention to the entire statement.",
                "from": "https://www.facebook.com/keith.tole.1?fref=ufi Keith Tole",
                "time": "November 7 at 7:09am"
            },
            {
                "content": "This is what I wrote...it wasn't an attack or claim that people were trying to outlaw guns...it was a statement that even if guns were outlawed, people would still kill people. \"They do have the same issues we do. People kill people there too. They ha ... See More",
                "from": "https://www.facebook.com/keith.tole.1?fref=ufi Keith Tole",
                "time": "November 7 at 7:12am"
            },
            {
                "content": "You dont need to repeat yourself, I read it the first time.",
                "from": "https://www.facebook.com/AgendaLinda?fref=ufi Linda Kay",
                "time": "November 7 at 7:13am"
            },
            {
                "content": "Now youre talking in circles. Guess we are done here.",
                "from": "https://www.facebook.com/AgendaLinda?fref=ufi Linda Kay",
                "time": "November 7 at 7:14am"
            },
            {
                "content": "Yes you did...then you started a new post about what I said. I made it clear to people that read your new post, what was actually said.",
                "from": "https://www.facebook.com/keith.tole.1?fref=ufi Keith Tole",
                "time": "November 7 at 7:17am"
            },
            {
                "content": "Yes we are...I blame the people that commit the act. You blame the weapon used by the person to commit the act.",
                "from": "https://www.facebook.com/keith.tole.1?fref=ufi Keith Tole",
                "time": "November 7 at 9:03am Edited"
            },
            {
                "content": "Keith, if I may ask, how many mass shootings have there been in countries that have very strict gun control laws? Yes, there are exceptions, Anders Breivik for one but, in general, they lag way, way, way far behind the mass shootings that happen in the U.S!",
                "from": "https://www.facebook.com/james.k.morris.3?fref=ufi James Keith Morris",
                "time": "November 7 at 7:24am"
            },
            {
                "content": "we hear what your leaders are saying https://newrepublic.com/.../its-time-ban-guns-yes-them",
                "from": "https://www.facebook.com/rob.mark.3?fref=ufi Rob Mark",
                "time": "November 7 at 7:25am"
            },
            {
                "content": "\"Guns don't kill people, people with semi-auto's kill a crap load of people!\"",
                "from": "https://www.facebook.com/james.k.morris.3?fref=ufi James Keith Morris",
                "time": "November 7 at 7:27am"
            },
            {
                "content": "I have no idea why I put that in quotes.  :) ",
                "from": "https://www.facebook.com/james.k.morris.3?fref=ufi James Keith Morris",
                "time": "November 7 at 7:28am"
            },
            {
                "content": "every time trump says he wants to vet muslims and make safer immigration laws you hear \"ban all muslims\"  don't you  Linda Kay  ?  be honest.",
                "from": "https://www.facebook.com/rob.mark.3?fref=ufi Rob Mark",
                "time": "November 7 at 7:30am"
            },
            {
                "content": "Rob, all muslims are already extremely vetted and have always been for years! A simple question, how many americans were killed by extremist muslims? Jesus, more children were killed, in America, by other children than Americans killed by islamic terrorists in the last 10 years!",
                "from": "https://www.facebook.com/james.k.morris.3?fref=ufi James Keith Morris",
                "time": "November 7 at 7:47am Edited"
            },
            {
                "content": "I think it's just the law part that's the problem lol idk I'm tired  😝 ",
                "from": "https://www.facebook.com/profile.php?id=100021479418196&fref=ufi James Timothy",
                "time": "November 7 at 7:46am"
            },
            {
                "content": "https://splinternews.com/the-good-guy-with-a-gun-is-a...",
                "from": "https://www.facebook.com/chris.tatler.7?fref=ufi Chris Tatler",
                "time": "November 7 at 8:45am"
            },
            {
                "content": "",
                "from": "https://www.facebook.com/keith.richardson.9638?fref=ufi Keith Richardson",
                "time": "November 7 at 10:12am"
            },
            {
                "content": "It's a knee jerk reaction. Mind control is obvious. Most of those people watch their television for 8+ hours a day.",
                "from": "https://www.facebook.com/robert.lee.5059?fref=ufi Robert Lee",
                "time": "November 7 at 12:10pm"
            },
            {
                "content": "The NRA and GOP have masterd the slippery slope argument first it the machine guns than your hand gun and shot gun than all you good consevative christain mericans will b put in consentration camps and shiria law will b imposed",
                "from": "https://www.facebook.com/edward.claussen.3?fref=ufi Edward Claussen",
                "time": "November 7 at 12:12pm"
            },
            {
                "content": "Guns kill",
                "from": "https://www.facebook.com/peter.yurkins?fref=ufi Thaddeus Yurkins",
                "time": "November 7 at 12:27pm"
            },
            {
                "content": "Guns are designed for killing.",
                "from": "https://www.facebook.com/Imagicka?fref=ufi John Blackthorn",
                "time": "November 7 at 12:28pm"
            },
            {
                "content": "Why not make it the law of the land that everyone, man woman child, Black brown white, Christian Muslim Hindu Buddhist Melanite, carries a concealed gun at all times. Problem solved.",
                "from": "https://www.facebook.com/andrew.rees.7?fref=ufi Andrew Rees",
                "time": "November 7 at 2:34pm Edited"
            },
            {
                "content": "Make safer gun laws for Outlaws, LOL",
                "from": "https://www.facebook.com/edgardo.rivera.98?fref=ufi Edgardo Rivera",
                "time": "Yesterday at 12:43am Edited"
            }
        ],
        "description": "Linda Kay I say “Safer gun laws” and they hear “outlaw all guns” THIS is the problem. Linda Kay",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/AgendaLinda?fref=ufi",
            "https://www.facebook.com/AgendaLinda?fref=ufi",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/james.k.morris.3?fref=ufi",
            "https://www.facebook.com/rob.mark.3?fref=ufi",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fnewrepublic.com%2Farticle%2F125498%2Fits-time-ban-guns-yes-them&h=ATOL1-cbIWdG8V4vegOP6K8bPayeehEDa_QzfXE1R8NiDZpSqEDiBPtQ-MCR6qEz0fLUOePa1KgMJPxasN-huskEJGQg18RDgqgHp-rWtiwc4HKnY0pYDLGwYyCY4Pc_e8Tw8bOEVjSHThroPkyQ4qk9F4d_eyBiwu8Sr7TkLjC_05Z_4U4B-Ydlz_ENrivmHR54A04z98lU77_BALWPkg7Lj58fEQ_JOTaczeL7yWQeX3wqLQiyMK63",
            "https://www.facebook.com/james.k.morris.3?fref=ufi",
            "https://www.facebook.com/james.k.morris.3?fref=ufi",
            "https://www.facebook.com/rob.mark.3?fref=ufi",
            "https://www.facebook.com/AgendaLinda?hc_location=ufi",
            "https://www.facebook.com/james.k.morris.3?fref=ufi",
            "https://www.facebook.com/profile.php?id=100021479418196&fref=ufi",
            "https://www.facebook.com/chris.tatler.7?fref=ufi",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fsplinternews.com%2Fthe-good-guy-with-a-gun-is-a-useless-myth-1820182639%3Futm_source%3Dfacebook%26utm_medium%3Dpartner%26utm_campaign%3Dbeingliberal&h=ATNkWX4ZGoC2cjjxJXsnRWsoSbmUgCHOJi9vIt-WQFvtrNozfX4du2Pi87HputachE_FRgpkyyTNpciL5rH6JiESKPwc3VtgVgqGfMpO-U1BaF1SnbYbGhwEuwhxiMO8NmI-mlhHlZWrVKXQwTB8Q55vFOAJEl3kAMi2ny0u3dHqZPkk6fr8dS7jtAhi56Rd29q_Ficuwfa2j5RdMoODs4ptg1ggfzgCRoym0OhBi3ast8MWatjxyPw6",
            "https://www.facebook.com/keith.richardson.9638?fref=ufi",
            "https://www.facebook.com/robert.lee.5059?fref=ufi",
            "https://www.facebook.com/edward.claussen.3?fref=ufi",
            "https://www.facebook.com/peter.yurkins?fref=ufi",
            "https://www.facebook.com/Imagicka?fref=ufi",
            "https://www.facebook.com/andrew.rees.7?fref=ufi",
            "https://www.facebook.com/edgardo.rivera.98?fref=ufi",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/AgendaLinda?fref=ufi",
            "https://www.facebook.com/AgendaLinda?fref=ufi",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/james.k.morris.3?fref=ufi",
            "https://www.facebook.com/rob.mark.3?fref=ufi",
            "https://www.facebook.com/james.k.morris.3?fref=ufi",
            "https://www.facebook.com/james.k.morris.3?fref=ufi",
            "https://www.facebook.com/rob.mark.3?fref=ufi",
            "https://www.facebook.com/james.k.morris.3?fref=ufi",
            "https://www.facebook.com/profile.php?id=100021479418196&fref=ufi",
            "https://www.facebook.com/chris.tatler.7?fref=ufi",
            "https://www.facebook.com/keith.richardson.9638?fref=ufi",
            "https://www.facebook.com/robert.lee.5059?fref=ufi",
            "https://www.facebook.com/edward.claussen.3?fref=ufi",
            "https://www.facebook.com/peter.yurkins?fref=ufi",
            "https://www.facebook.com/Imagicka?fref=ufi",
            "https://www.facebook.com/andrew.rees.7?fref=ufi",
            "https://www.facebook.com/edgardo.rivera.98?fref=ufi"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483387595381005",
        "photos": [
            "https://www.facebook.com/photo.php?fbid=10214696229016204&set=p.10214696229016204&type=3"
        ]
    },
    {
        "comments": [
            {
                "content": "Damn, I love this woman.",
                "from": "https://www.facebook.com/mamapersoff?fref=ufi Irma Paas Persoff",
                "time": "Yesterday at 5:22am"
            }
        ],
        "description": "Linda Kay  shared  NowThis 's  video . She lived the dream.   # ImSoJelly   # Resist   # WelcomeToTheResistance",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/AgendaLinda?hc_ref=ARTNuU_uS87c5L3eu_9mkmQBwXt6LV5MWFREpRXQ6P20W1eOKfAMFfH7LaLLFUDUQAU",
            "https://www.facebook.com/NowThisNews/?hc_ref=ARTNuU_uS87c5L3eu_9mkmQBwXt6LV5MWFREpRXQ6P20W1eOKfAMFfH7LaLLFUDUQAU",
            "/NowThisNews/videos/1670131966410254/?hc_ref=ARTNuU_uS87c5L3eu_9mkmQBwXt6LV5MWFREpRXQ6P20W1eOKfAMFfH7LaLLFUDUQAU",
            "https://www.facebook.com/mamapersoff?fref=ufi",
            "https://www.facebook.com/mamapersoff?fref=ufi"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483384678714630",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "Ummm, no. Wait, was she on work time or in her work uniform? If the answer to both is No, then she has grounds to sue. That’s the very right I fought for in the military, the right to freedom of speech. The president is an elected civilian and is NOT above the first amendment. If someone wants to flip him off, that’s their right.",
                "from": "https://www.facebook.com/jamye.pankiw?fref=ufi&rc=p Jamye Pankiw",
                "time": "November 7 at 12:08am"
            },
            {
                "content": "The irony that the president can tweet like a damn child and diss anyone and even have a video of him beating up CNN or degrading women without having any consequences but a citizen expresses herself and she gets fired from her job. Ohhh, the god damn irony.",
                "from": "https://www.facebook.com/daniela.villa.524?fref=ufi&rc=p Dan Vil",
                "time": "November 7 at 2:03am Edited"
            },
            {
                "content": "Not all heroes wear capes",
                "from": "https://www.facebook.com/riley.gorski.79?fref=ufi&rc=p Vriska Serket",
                "time": "November 7 at 12:02am"
            },
            {
                "content": "If I owned a company I'd hire her in a heartbeat. Flipping off Trump is the only qualification she needs.  😅 😅 😅 ",
                "from": "https://www.facebook.com/profile.php?id=1014104063&fref=ufi&rc=p Leanne Toohey",
                "time": "November 7 at 12:13am"
            },
            {
                "content": "I'm surprising how people are getting fired for speaking how they feel about trump but nobody got fired when they disrespected and talked about Obama.",
                "from": "https://www.facebook.com/tyre.m.hodges?fref=ufi&rc=p Tyre Mandel Hodges",
                "time": "November 7 at 12:09am"
            },
            {
                "content": "Trump probably saw her through his window and threw a tantrum and called her employer and told them to fire her or something. I wouldn't doubt it.",
                "from": "https://www.facebook.com/ruben.n.munoz?fref=ufi&rc=p Ben Iscariot",
                "time": "November 7 at 12:07am"
            },
            {
                "content": "Isn't she allowed freedom of \"speech\"-- I mean if he can openly grab pussies and incite WW3, shouldn't we all be able to tell that motherfucker to fuck off?  Lady who ever you are, you're my new hero.",
                "from": "https://www.facebook.com/cfergusondesign?fref=ufi&rc=p Cynthia Ann Ferguson",
                "time": "November 7 at 12:52am Edited"
            },
            {
                "content": "Why? If she can get fired for flipping off the world's biggest douchebag, then he should be fired as well. Clearly we don't know how to terminate the wrong people of their jobs in this country.",
                "from": "https://www.facebook.com/naomi.alino?fref=ufi&rc=p Naomi Victoria",
                "time": "November 7 at 12:34am"
            },
            {
                "content": "Government contracted business. Employment contract with code of conduct section. ... See More",
                "from": "https://www.facebook.com/bam.whitney?fref=ufi&rc=p Bam Whitney",
                "time": "November 7 at 12:02am"
            },
            {
                "content": "Job interviewer: what are your best qualities that can benefits our company? JULI: I flipped the bird to Trump! Job interviewer: HOLY SHIT! YOU ARE HIRED, PLEASS DON'T FIRE ME!!!",
                "from": "https://www.facebook.com/IlyesLostAngel?fref=ufi&rc=p Zakaria Benmoulay",
                "time": "November 7 at 12:10am"
            },
            {
                "content": "Interviewer: Do you consider yourself to be someone of high morals? Juli: *shows the picture of her flipping off Trump’s motorcade on her bicycle* Interview: When can you start?",
                "from": "https://www.facebook.com/edgar.gibbons?fref=ufi&rc=p Edgar Gibbons",
                "time": "November 7 at 12:28am"
            },
            {
                "content": "She ought not to have been fired. She's giving her opinion of the worst person on the planet; HE should be fired, not her.",
                "from": "https://www.facebook.com/emily.harris.180?fref=ufi&rc=p Emily Harris",
                "time": "November 7 at 12:12am"
            },
            {
                "content": "I love her already... She did this for me.  Please reinstate her job.  Just ridiculous... This freedom of expression!",
                "from": "https://www.facebook.com/susie.renard?fref=ufi&rc=p Susie Renard",
                "time": "November 7 at 12:20am"
            },
            {
                "content": "But but but I thought America was the land of the free. It’s her right which finger she wants to stick up.  On another note I wouldn’t piss in Trumps mouth if his stomach was on fire.",
                "from": "https://www.facebook.com/ashlee.conrad.7?fref=ufi&rc=p Ashlee Conrad",
                "time": "November 7 at 12:11am"
            },
            {
                "content": "You technically do not have free speech in a workplace they can fire u for anything, i think they did what they thought was necessary. I agree with them",
                "from": "https://www.facebook.com/bo.romero?fref=ufi&rc=p Bo Romero",
                "time": "November 7 at 12:17am"
            },
            {
                "content": "lmfao. I did the same thing to my supervisor while he was driving by my place. The cunt recognized me and called me to his office...........",
                "from": "https://www.facebook.com/1002x?fref=ufi&rc=p Xolani Njabulo",
                "time": "November 7 at 12:01am"
            },
            {
                "content": "How did her bicycle even get that close to the motorcade? Seriously aren’t those areas blocked off to cars, pedestrians and one would think bicycles? I’m calling bullshit.",
                "from": "https://www.facebook.com/trish.flynn.58?fref=ufi&rc=p Trish Flynn",
                "time": "November 7 at 12:06am"
            },
            {
                "content": "I think they were justified in firing her.  I also think another company should hire her and give her the gigantic raise she deserves.",
                "from": "https://www.facebook.com/rob.berg?fref=ufi&rc=p Rob Berg",
                "time": "November 7 at 1:33am"
            },
            {
                "content": "Freedom of expression. No one was hurt. She should not have been fired. Hopefully another better company will reach out to her and hire her and people boycott the company that fired her.",
                "from": "https://www.facebook.com/russell.purser.3?fref=ufi&rc=p Russell Purser",
                "time": "November 7 at 12:15am"
            },
            {
                "content": "She’ll get hired somewhere else just as fast as she got fired. Too many people in this country feel the exact same way she does  🖕🏽 🤷🏽‍♀️ ",
                "from": "https://www.facebook.com/norrisha?fref=ufi&rc=p Norrisha Hall",
                "time": "November 7 at 12:34am"
            },
            {
                "content": "All she did was flip him the bird he is lucky i would have punched him in the face until I could no longer move my arms",
                "from": "https://www.facebook.com/MysterZen?fref=ufi&rc=p Brandon Blakeney",
                "time": "November 7 at 12:11am"
            },
            {
                "content": "What she does off the clock and on her own time has nothing to do with her employer. She isn't wearing work clothes or any type of uniform that even identifies who she works for.",
                "from": "https://www.facebook.com/katja.levi?fref=ufi&rc=p Katja Levi",
                "time": "November 7 at 12:32am"
            },
            {
                "content": "They are concerned with their company's reputation? Really? Well guess what morons, the majority despises the orange POS and that lady rightfully earned a hero status worldwide, and associating your image with him just makes you as despicable! Talk about a pathetic PR move!",
                "from": "https://www.facebook.com/yasser.cheriet?fref=ufi&rc=p Yasser Cheriet",
                "time": "November 7 at 4:37am Edited"
            },
            {
                "content": "It is a damn shame people can't express they thoughts about someone in power and their company makes up an excuse like they did. But athletes can basically give our anthem the finger by kneeling and nothing happens to them. What is this messed up country coming to !",
                "from": "https://www.facebook.com/wendell.jenkins.96?fref=ufi&rc=p Wendell Jenkins",
                "time": "November 7 at 12:07am"
            },
            {
                "content": "Why was she even allowed to get that close to the motorcade? Secret Service should have taken care of this before she got that close. hate she lost her job, but who knows what she may have done that we DONT know about.",
                "from": "https://www.facebook.com/debra.p.thomas?fref=ufi&rc=p Debra Parker Thomas",
                "time": "November 7 at 12:07am"
            },
            {
                "content": "That's up to the employer. Even when hiring people some employers look at your social media account as well. How you carry yourself outside of work affects how enployers see you. This is not new",
                "from": "https://www.facebook.com/angelica.wright.58?fref=ufi&rc=p Angelica Wright Lozito",
                "time": "November 7 at 12:45am"
            },
            {
                "content": "This federal contractor is getting negative press for firing her - they should have left her alone!! Let's all call Akima and demand they either give her her job back or compensate her for leave!!!! Lou Seijido, President e-mail: lou.seijido@akima.com ... See More",
                "from": "https://www.facebook.com/missjenib314?fref=ufi&rc=p Jeni Bee",
                "time": "November 7 at 2:04am Edited"
            },
            {
                "content": "If I was her I would have did the very same thing !!  Trump doesn’t deserve any respect !!   She wasn’t dressed for work riding her bicycle, so what does this have to do with work ???  👎 👎 👎 👎 👎 👎 ",
                "from": "https://www.facebook.com/profile.php?id=100009967783205&fref=ufi&rc=p Maralyn Ikert",
                "time": "November 7 at 12:17am"
            },
            {
                "content": "The First Amendment protects her from government reprisal. It doesn't protect her from her employer's actions..... First Amendment do not help you but Company is the one - fire you...use the company's logo.  but the biker is a strong democratic  !",
                "from": "https://www.facebook.com/chrisguidry47?fref=ufi&rc=p Chris Guidry",
                "time": "November 7 at 12:04am"
            },
            {
                "content": "Seriously people! I'd love the chance to flip this so called President we have the bird. Way to go lady. I think the company you use to work for will regret firing you. Love this lady for her true feelings, which are suppose to be free in this country. Most Americans don't like what trump says or is doing. Has he been fired yet?",
                "from": "https://www.facebook.com/lisa.wabel.94?fref=ufi&rc=p Lisa Wabel",
                "time": "November 7 at 12:45am"
            },
            {
                "content": "Though I’m not a Trump supporter. If you work for a federal contractor and you flip the bird at Trumps motorcade & it goes viral. Maybe you shouldn’t make it your profile picture.  Just Sayin’",
                "from": "https://www.facebook.com/NJMIKEB?fref=ufi&rc=p Michael Barrows",
                "time": "November 7 at 12:19pm"
            },
            {
                "content": "It is obscene  and this behavior and her believing this was an \"opportunity\" to \"say something\" actually shows her adolescent behavior for what it is . . . . basically a stupid move . . . with all due respect to the really smart adolescents on the road!",
                "from": "https://www.facebook.com/pat.somma.7?fref=ufi&rc=p Pat Somma",
                "time": "November 7 at 3:11am"
            },
            {
                "content": "There would have been all kinds of outrage if this had been the Obamas . She would have been called prejudice. There is freedom of speech but what happened to respect ? People were respectful of the Obama’s so the Trumps deserve respect too",
                "from": "https://www.facebook.com/rhonda.christeson?fref=ufi&rc=p Rhonda Christeson",
                "time": "November 7 at 2:02am"
            },
            {
                "content": "Damn, that really sucks. Seems like the company was respectful with the termination, however; I would of never made this my Facebook picture. She should of made another account or something like that. Also, I would not of told my boss and denied that was me if the question ever came up, which I don't think it would have.",
                "from": "https://www.facebook.com/kyle.porter.79?fref=ufi&rc=p Kyle Porter",
                "time": "November 7 at 12:05am"
            },
            {
                "content": "This is not news. People get fired for inappropriate actions that go riral all the time. Remember the woman who made a bad joke on Twitter about getting AIDS just before flying to Africa? Found out she was fired the second she landed.",
                "from": "https://www.facebook.com/tracy.sault?fref=ufi&rc=p Tracy Fennell Sault",
                "time": "November 7 at 12:13am"
            },
            {
                "content": "Kinda messed up President Trump is trying to fix things that 8 years of damage did and because he is bringing to light all the things Obana did whether in front of camera or in secret and President Trump is the bad guy.",
                "from": "https://www.facebook.com/barb.j.butler.9?fref=ufi&rc=p Barb J Butler",
                "time": "November 7 at 3:00am"
            },
            {
                "content": "I say more power to ya girl!  And it's absolute and total BS that she was fired over this.  Hopefully it's a blessing in disguise and she actually gets a better job where they support their employees in having and expressing opinions.",
                "from": "https://www.facebook.com/laura.cain.10?fref=ufi&rc=p Laura Cain",
                "time": "November 7 at 12:49am"
            },
            {
                "content": "Her company is a pile of bullshit and I bet she goes on to something bigger and better in her employment.",
                "from": "https://www.facebook.com/vicki.wunneburger?fref=ufi&rc=p Vicki Wunneburger",
                "time": "November 7 at 12:20am"
            },
            {
                "content": "she should have kept her mouth closed to management if they did not ask. I understand she has the right to express her opinion and I do not find it offensive, but some apparently do.  Such is the world we live in. I got canned for daring to express my concerns as to my safety and having to walk through a deserted and poorly lit area at the place I worked at...a very large cc company with your countries name in it.",
                "from": "https://www.facebook.com/christine.krawec?fref=ufi&rc=p Christine Krawec",
                "time": "November 7 at 12:35am"
            },
            {
                "content": "Thats bs you would loose your job ...it's not against the law to flip off anyone including trump and she wasn't at work or wearing anything that represented her company you can't even see her face ...want to talk about some sensitive fucks  🤔 ",
                "from": "https://www.facebook.com/britney.whitmer?fref=ufi&rc=p Britney Whitmer",
                "time": "November 7 at 3:18am"
            },
            {
                "content": "Pretty unfair when that same boss has a anti liberal, fuck them, etc on his FB and he didn’t get fired. Showing political views in that sort of way isn’t professional at all so why is she fired?",
                "from": "https://www.facebook.com/LightningFeito?fref=ufi&rc=p Katherine Lopez",
                "time": "November 7 at 12:12am"
            },
            {
                "content": "Freedom in America? oh that's right - that's strictly a Hollywood Movie thing - not real life -  # brokennation   # proudlycanadian",
                "from": "https://www.facebook.com/shane.nagel.5?fref=ufi&rc=p Shane Nagel",
                "time": "November 7 at 12:45am"
            },
            {
                "content": "Unfortunately she didnt say anything, just made herself look like an a$$...  And as for being fired its up to the company, federal contractors dont need a bad rep with their main supplier of work lol.... And whrn trump supporters rose against antifa and blm in the beginning liberals sent lots of photos of ppl fron the trump crowd to their employers demanding they be fired. Karmas a bitch aint it",
                "from": "https://www.facebook.com/profile.php?id=100000710800524&fref=ufi&rc=p Joseph Padilla",
                "time": "November 7 at 12:56am"
            },
            {
                "content": "I am having trouble believing she can't get another job offer in a second. I think many people immediately related to this image. We have a President who sexually assaulted women in the past, but she can't be suited for her job because she extended her middle finger on a bike ride?!?  Really?!?",
                "from": "https://www.facebook.com/stacy.hardin.olexy?fref=ufi&rc=p Stacy Hardin Olexy",
                "time": "November 7 at 3:27am"
            },
            {
                "content": "Good!! Just like people that were fired for comments about the Obamas.  You're expected to act professional and not bring a negative light to the company you work for.  I'm sure it's in the pile of HR paperwork she was given.  It's funny that this crap \"news\" page helped get her canned!!  Be proud Now This!!! 😂 😂 😂 😂 😂 ",
                "from": "https://www.facebook.com/mario.depaoli.3?fref=ufi&rc=p Mario DePaoli",
                "time": "November 7 at 12:48am"
            },
            {
                "content": "I don't see what she did wrong. Flipping off one of the biggest problems in America is nothing compared to what he and his tax plan will do to us all who aren't wealthy. Why does he get to keep HIS job but she can't for calling out a bitch as she sees one?",
                "from": "https://www.facebook.com/SommaKilljoy?fref=ufi&rc=p Summer Nichols",
                "time": "November 7 at 1:00am"
            },
            {
                "content": "She had the right to flip him off. The minute she uploaded the pic and made it her profile pic is when she was in the wrong per the social media policy she agreed to abide by. A lot of companies make employees agree to some sort of SM policy. She didn't do herself any favors by telling HR about the photo either. Rather dumb move actually",
                "from": "https://www.facebook.com/chris.joseph.92?fref=ufi&rc=p Chris Joseph",
                "time": "Yesterday at 5:23am"
            },
            {
                "content": "Flipping the bird is free speech but, as a contracted employee she agreed to acceptable conduct within or outside of the workplace so they are within their rights to fire her to protect their image and reputation.",
                "from": "https://www.facebook.com/brock.meigs?fref=ufi&rc=p Brock M Meigs",
                "time": "November 7 at 12:47am"
            },
            {
                "content": "So “this” is violating a social media policy, but making broad assertions about various groups of people, &, well, threatening to start a nuclear war somehow doesn’t violate any sort of Federal government’s social media policy?",
                "from": "https://www.facebook.com/MattyVBoston?fref=ufi&rc=p Matt Vaitiskis",
                "time": "November 7 at 12:59am"
            },
            {
                "content": "She was not 'On the Clock' at the time of the 'Alleged offence' hahahahaha. (wish I could do this to some of the douche bags we have in our govt here.) Whatever happened to 'Freedom of Speech' Is it not in the US Constitution/Bill of Rights? This woman ... See More",
                "from": "https://www.facebook.com/michelle.knowles.3979?fref=ufi&rc=p Michelle Knowles",
                "time": "November 7 at 4:33am Edited"
            }
        ],
        "description": "NowThis This woman was fired after a photo of her flipping off Trump's motorcade went viral",
        "participants": [
            "https://www.facebook.com/NowThisNews/?ref=nf&hc_ref=ARRy9JnTj-6laq8bM40h3GYR_qMoscsDfyIakZXWFkrLGD52luM-LlQ7dHUXyiILHno",
            "https://www.facebook.com/jamye.pankiw?fref=ufi&rc=p",
            "https://www.facebook.com/daniela.villa.524?fref=ufi&rc=p",
            "https://www.facebook.com/riley.gorski.79?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1014104063&fref=ufi&rc=p",
            "https://www.facebook.com/tyre.m.hodges?fref=ufi&rc=p",
            "https://www.facebook.com/ruben.n.munoz?fref=ufi&rc=p",
            "https://www.facebook.com/cfergusondesign?fref=ufi&rc=p",
            "https://www.facebook.com/naomi.alino?fref=ufi&rc=p",
            "https://www.facebook.com/bam.whitney?fref=ufi&rc=p",
            "https://www.facebook.com/IlyesLostAngel?fref=ufi&rc=p",
            "https://www.facebook.com/edgar.gibbons?fref=ufi&rc=p",
            "https://www.facebook.com/emily.harris.180?fref=ufi&rc=p",
            "https://www.facebook.com/susie.renard?fref=ufi&rc=p",
            "https://www.facebook.com/ashlee.conrad.7?fref=ufi&rc=p",
            "https://www.facebook.com/bo.romero?fref=ufi&rc=p",
            "https://www.facebook.com/1002x?fref=ufi&rc=p",
            "https://www.facebook.com/trish.flynn.58?fref=ufi&rc=p",
            "https://www.facebook.com/rob.berg?fref=ufi&rc=p",
            "https://www.facebook.com/russell.purser.3?fref=ufi&rc=p",
            "https://www.facebook.com/norrisha?fref=ufi&rc=p",
            "https://www.facebook.com/MysterZen?fref=ufi&rc=p",
            "https://www.facebook.com/katja.levi?fref=ufi&rc=p",
            "https://www.facebook.com/yasser.cheriet?fref=ufi&rc=p",
            "https://www.facebook.com/wendell.jenkins.96?fref=ufi&rc=p",
            "https://www.facebook.com/debra.p.thomas?fref=ufi&rc=p",
            "https://www.facebook.com/angelica.wright.58?fref=ufi&rc=p",
            "https://www.facebook.com/missjenib314?fref=ufi&rc=p",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.akimaconstruction.com%2Fcontact%2F&h=ATPMvMuzn13Hm3OAxrkPgd4bRWhyhKO2Wv7vA1pywiwlYbzgT3isK-H5uWltj6wm-k1OnLWKnzK3WE_jYaN3YH9vB_baRFDy1CkvHnDQ6L1atL8ImvwSAp3wy1QzCvgybQFa61Yw38KXI_TO_M0Hg9jpoUrLIxa8A79Cq_FoPX29DdlggMvCds2Dsh54N2n5aMcnUEo5W9hjsxCLKZIwnoSTwHBcJWDBDjLGn1m3QoVcTQvShaj2PWZz",
            "https://www.facebook.com/profile.php?id=100009967783205&fref=ufi&rc=p",
            "https://www.facebook.com/chrisguidry47?fref=ufi&rc=p",
            "https://www.facebook.com/lisa.wabel.94?fref=ufi&rc=p",
            "https://www.facebook.com/NJMIKEB?fref=ufi&rc=p",
            "https://www.facebook.com/pat.somma.7?fref=ufi&rc=p",
            "https://www.facebook.com/rhonda.christeson?fref=ufi&rc=p",
            "https://www.facebook.com/kyle.porter.79?fref=ufi&rc=p",
            "https://www.facebook.com/tracy.sault?fref=ufi&rc=p",
            "https://www.facebook.com/barb.j.butler.9?fref=ufi&rc=p",
            "https://www.facebook.com/laura.cain.10?fref=ufi&rc=p",
            "https://www.facebook.com/vicki.wunneburger?fref=ufi&rc=p",
            "https://www.facebook.com/christine.krawec?fref=ufi&rc=p",
            "https://www.facebook.com/britney.whitmer?fref=ufi&rc=p",
            "https://www.facebook.com/LightningFeito?fref=ufi&rc=p",
            "https://www.facebook.com/shane.nagel.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000710800524&fref=ufi&rc=p",
            "https://www.facebook.com/stacy.hardin.olexy?fref=ufi&rc=p",
            "https://www.facebook.com/mario.depaoli.3?fref=ufi&rc=p",
            "https://www.facebook.com/SommaKilljoy?fref=ufi&rc=p",
            "https://www.facebook.com/chris.joseph.92?fref=ufi&rc=p",
            "https://www.facebook.com/brock.meigs?fref=ufi&rc=p",
            "https://www.facebook.com/MattyVBoston?fref=ufi&rc=p",
            "https://www.facebook.com/michelle.knowles.3979?fref=ufi&rc=p",
            "https://www.facebook.com/jamye.pankiw?fref=ufi&rc=p",
            "https://www.facebook.com/daniela.villa.524?fref=ufi&rc=p",
            "https://www.facebook.com/riley.gorski.79?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1014104063&fref=ufi&rc=p",
            "https://www.facebook.com/tyre.m.hodges?fref=ufi&rc=p",
            "https://www.facebook.com/ruben.n.munoz?fref=ufi&rc=p",
            "https://www.facebook.com/cfergusondesign?fref=ufi&rc=p",
            "https://www.facebook.com/naomi.alino?fref=ufi&rc=p",
            "https://www.facebook.com/bam.whitney?fref=ufi&rc=p",
            "https://www.facebook.com/IlyesLostAngel?fref=ufi&rc=p",
            "https://www.facebook.com/edgar.gibbons?fref=ufi&rc=p",
            "https://www.facebook.com/emily.harris.180?fref=ufi&rc=p",
            "https://www.facebook.com/susie.renard?fref=ufi&rc=p",
            "https://www.facebook.com/ashlee.conrad.7?fref=ufi&rc=p",
            "https://www.facebook.com/bo.romero?fref=ufi&rc=p",
            "https://www.facebook.com/1002x?fref=ufi&rc=p",
            "https://www.facebook.com/trish.flynn.58?fref=ufi&rc=p",
            "https://www.facebook.com/rob.berg?fref=ufi&rc=p",
            "https://www.facebook.com/russell.purser.3?fref=ufi&rc=p",
            "https://www.facebook.com/norrisha?fref=ufi&rc=p",
            "https://www.facebook.com/MysterZen?fref=ufi&rc=p",
            "https://www.facebook.com/katja.levi?fref=ufi&rc=p",
            "https://www.facebook.com/yasser.cheriet?fref=ufi&rc=p",
            "https://www.facebook.com/wendell.jenkins.96?fref=ufi&rc=p",
            "https://www.facebook.com/debra.p.thomas?fref=ufi&rc=p",
            "https://www.facebook.com/angelica.wright.58?fref=ufi&rc=p",
            "https://www.facebook.com/missjenib314?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009967783205&fref=ufi&rc=p",
            "https://www.facebook.com/chrisguidry47?fref=ufi&rc=p",
            "https://www.facebook.com/lisa.wabel.94?fref=ufi&rc=p",
            "https://www.facebook.com/NJMIKEB?fref=ufi&rc=p",
            "https://www.facebook.com/pat.somma.7?fref=ufi&rc=p",
            "https://www.facebook.com/rhonda.christeson?fref=ufi&rc=p",
            "https://www.facebook.com/kyle.porter.79?fref=ufi&rc=p",
            "https://www.facebook.com/tracy.sault?fref=ufi&rc=p",
            "https://www.facebook.com/barb.j.butler.9?fref=ufi&rc=p",
            "https://www.facebook.com/laura.cain.10?fref=ufi&rc=p",
            "https://www.facebook.com/vicki.wunneburger?fref=ufi&rc=p",
            "https://www.facebook.com/christine.krawec?fref=ufi&rc=p",
            "https://www.facebook.com/britney.whitmer?fref=ufi&rc=p",
            "https://www.facebook.com/LightningFeito?fref=ufi&rc=p",
            "https://www.facebook.com/shane.nagel.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000710800524&fref=ufi&rc=p",
            "https://www.facebook.com/stacy.hardin.olexy?fref=ufi&rc=p",
            "https://www.facebook.com/mario.depaoli.3?fref=ufi&rc=p",
            "https://www.facebook.com/SommaKilljoy?fref=ufi&rc=p",
            "https://www.facebook.com/chris.joseph.92?fref=ufi&rc=p",
            "https://www.facebook.com/brock.meigs?fref=ufi&rc=p",
            "https://www.facebook.com/MattyVBoston?fref=ufi&rc=p",
            "https://www.facebook.com/michelle.knowles.3979?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NowThisNews/videos/1670131966410254/",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "And shouldn't an all powerful deity overrule the whole prayer factor? Is Jesus like a vampire, he's only allowed in if somebody tells him so? Doesn't sound all powerful to me.",
                "from": "https://www.facebook.com/kurtis.kage?fref=ufi Kurtis Kage",
                "time": "November 6 at 8:14pm"
            },
            {
                "content": "It’s proof prayer doesn’t work",
                "from": "https://www.facebook.com/peter.yurkins?fref=ufi Thaddeus Yurkins",
                "time": "November 6 at 8:23pm"
            },
            {
                "content": "Prayers are best at home...",
                "from": "https://www.facebook.com/tim.fritz.921?fref=ufi Tim Fritz",
                "time": "November 6 at 8:51pm"
            },
            {
                "content": "Not in schools",
                "from": "https://www.facebook.com/tim.fritz.921?fref=ufi Tim Fritz",
                "time": "November 6 at 8:51pm"
            },
            {
                "content": "As I posted else where and got shit for it...they were such good christians and god loved them so much ,he sent a messenger to hasten thembto his side with an.early death..they must have been so joyous when the bullets started flying...ah yes, the lord is calling us to his side..heaven is ours..thank you lord..if not..they never really believed...its only logical.",
                "from": "https://www.facebook.com/transientfantasy?fref=ufi Jason Stephan Wales",
                "time": "November 6 at 8:53pm Edited"
            },
            {
                "content": "That's how you explain it.. 😉 😋 👍 ",
                "from": "https://www.facebook.com/transientfantasy?fref=ufi Jason Stephan Wales",
                "time": "November 6 at 8:53pm"
            },
            {
                "content": "jesus lured them there to slaughter them like fish in a barrel, god is now terrorist status",
                "from": "https://www.facebook.com/peter.yurkins?fref=ufi Thaddeus Yurkins",
                "time": "November 6 at 8:59pm"
            },
            {
                "content": "",
                "from": "https://www.facebook.com/peter.yurkins?fref=ufi Thaddeus Yurkins",
                "time": "November 6 at 8:59pm"
            },
            {
                "content": "Oh mother fucking snap!!",
                "from": "https://www.facebook.com/paul.scoville.9?fref=ufi Paul Scoville",
                "time": "November 6 at 9:01pm"
            },
            {
                "content": "It's just part of it idk lol crazy shit",
                "from": "https://www.facebook.com/profile.php?id=100021479418196&fref=ufi James Timothy",
                "time": "November 6 at 10:09pm"
            },
            {
                "content": "With this particular shooting, they are giving that argument a rest. I think it is very important that we remind them of that argument today.",
                "from": "https://www.facebook.com/joe.zamecki.7?fref=ufi Joe Zamecki",
                "time": "November 6 at 10:11pm"
            },
            {
                "content": "Quite frankly I think that shit is Shadow factions Within our government... If you haven't noticed there's a big push to take away our gun rights immediately after every one of these shootings. I'm not scared of the lone shooter... I'm more scared of my government than any crazy mother fucker on the street.",
                "from": "https://www.facebook.com/soulrebelyell?fref=ufi سكوت مكليندن",
                "time": "November 6 at 10:30pm"
            },
            {
                "content": "The only answer they will give you is the one that fits their narrative.",
                "from": "https://www.facebook.com/TADS73?fref=ufi Todd Delsanto",
                "time": "November 6 at 10:36pm"
            },
            {
                "content": "The music made them do it... The devil made them do it LOL",
                "from": "https://www.facebook.com/soulrebelyell?fref=ufi سكوت مكليندن",
                "time": "November 6 at 10:59pm"
            },
            {
                "content": "God works in mysterious ways.",
                "from": "https://www.facebook.com/robert.lee.5059?fref=ufi Robert Lee",
                "time": "November 7 at 12:04am"
            },
            {
                "content": "Well I think this proves, along with the poisonous snakes, that Baptists aren't the true religion and God, if he were real, doesn't care about them.",
                "from": "https://www.facebook.com/Imagicka?fref=ufi John Blackthorn",
                "time": "November 7 at 1:49am"
            },
            {
                "content": "",
                "from": "https://www.facebook.com/taicc.transportamericacoop?fref=ufi Steve Racinowski",
                "time": "November 7 at 1:59am"
            },
            {
                "content": "shared LOL",
                "from": "https://www.facebook.com/JD5DAD?fref=ufi David Dale",
                "time": "November 7 at 3:02am"
            },
            {
                "content": "Good point",
                "from": "https://www.facebook.com/edward.claussen.3?fref=ufi Edward Claussen",
                "time": "November 7 at 12:14pm"
            },
            {
                "content": "god wanted more angels obviously  😂 😂 ",
                "from": "https://www.facebook.com/rob.mark.3?fref=ufi Rob Mark",
                "time": "November 7 at 6:23pm"
            },
            {
                "content": "YESSSSSSS",
                "from": "https://www.facebook.com/paul.hoffmaster.9?fref=ufi Paul Hoffmaster",
                "time": "November 7 at 7:54pm"
            },
            {
                "content": "It's a false argument to begin with.  Organized prayer is not allowed in schools but each student can pray to himself and that being the case, I guess we can assume that prayer is ineffective.",
                "from": "https://www.facebook.com/charles.larsen.96?fref=ufi Charles Larsen",
                "time": "November 7 at 8:48pm"
            }
        ],
        "description": "Linda Kay If school shootings are because we no longer allow organized prayer in them,   how do you explain why a CHURCH would be shot up??? If school shootings are because we no longer allow organized prayer in them,   how do you explain why a CHURCH would be shot up???",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/kurtis.kage?fref=ufi",
            "https://www.facebook.com/peter.yurkins?fref=ufi",
            "https://www.facebook.com/tim.fritz.921?fref=ufi",
            "https://www.facebook.com/tim.fritz.921?fref=ufi",
            "https://www.facebook.com/transientfantasy?fref=ufi",
            "https://www.facebook.com/transientfantasy?fref=ufi",
            "https://www.facebook.com/peter.yurkins?fref=ufi",
            "https://www.facebook.com/peter.yurkins?fref=ufi",
            "https://www.facebook.com/paul.scoville.9?fref=ufi",
            "https://www.facebook.com/profile.php?id=100021479418196&fref=ufi",
            "https://www.facebook.com/joe.zamecki.7?fref=ufi",
            "https://www.facebook.com/soulrebelyell?fref=ufi",
            "https://www.facebook.com/TADS73?fref=ufi",
            "https://www.facebook.com/soulrebelyell?fref=ufi",
            "https://www.facebook.com/robert.lee.5059?fref=ufi",
            "https://www.facebook.com/Imagicka?fref=ufi",
            "https://www.facebook.com/taicc.transportamericacoop?fref=ufi",
            "https://www.facebook.com/JD5DAD?fref=ufi",
            "https://www.facebook.com/edward.claussen.3?fref=ufi",
            "https://www.facebook.com/rob.mark.3?fref=ufi",
            "https://www.facebook.com/paul.hoffmaster.9?fref=ufi",
            "https://www.facebook.com/charles.larsen.96?fref=ufi",
            "https://www.facebook.com/kurtis.kage?fref=ufi",
            "https://www.facebook.com/peter.yurkins?fref=ufi",
            "https://www.facebook.com/tim.fritz.921?fref=ufi",
            "https://www.facebook.com/tim.fritz.921?fref=ufi",
            "https://www.facebook.com/transientfantasy?fref=ufi",
            "https://www.facebook.com/transientfantasy?fref=ufi",
            "https://www.facebook.com/peter.yurkins?fref=ufi",
            "https://www.facebook.com/peter.yurkins?fref=ufi",
            "https://www.facebook.com/paul.scoville.9?fref=ufi",
            "https://www.facebook.com/profile.php?id=100021479418196&fref=ufi",
            "https://www.facebook.com/joe.zamecki.7?fref=ufi",
            "https://www.facebook.com/soulrebelyell?fref=ufi",
            "https://www.facebook.com/TADS73?fref=ufi",
            "https://www.facebook.com/soulrebelyell?fref=ufi",
            "https://www.facebook.com/robert.lee.5059?fref=ufi",
            "https://www.facebook.com/Imagicka?fref=ufi",
            "https://www.facebook.com/taicc.transportamericacoop?fref=ufi",
            "https://www.facebook.com/JD5DAD?fref=ufi",
            "https://www.facebook.com/edward.claussen.3?fref=ufi",
            "https://www.facebook.com/rob.mark.3?fref=ufi",
            "https://www.facebook.com/paul.hoffmaster.9?fref=ufi",
            "https://www.facebook.com/charles.larsen.96?fref=ufi"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483238465395918",
        "photos": [
            "https://www.facebook.com/photo.php?fbid=10211986291266501&set=p.10211986291266501&type=3",
            "https://www.facebook.com/photo.php?fbid=1454895767891483&set=p.1454895767891483&type=3"
        ]
    },
    {
        "comments": [
            {
                "content": "Such a simple fact. And yet how hard is that for some to understand?",
                "from": "https://www.facebook.com/jessica.l.berkel?fref=ufi Jessica L.A. Berkel",
                "time": "November 6 at 5:30pm"
            },
            {
                "content": "explain to me the part about how banning guns does not conflict with \"you cant ban guns\" again please.   i mean its so simple.  yet i still cant quite grasp it",
                "from": "https://www.facebook.com/rob.mark.3?fref=ufi Rob Mark",
                "time": "November 6 at 5:42pm"
            },
            {
                "content": "so is there a conflict between regulating deadly religions such as islam and the first amendment?  because it would seem to be the same exact issue.",
                "from": "https://www.facebook.com/rob.mark.3?fref=ufi Rob Mark",
                "time": "November 6 at 5:44pm"
            },
            {
                "content": "The problem isn't the laws...its getting people to follow the law. There is a law that says killing is illegal...but he killed people. Laws aren't the problem, neither are guns. People are the problem. People are always the problem.",
                "from": "https://www.facebook.com/keith.tole.1?fref=ufi Keith Tole",
                "time": "November 7 at 6:47am"
            },
            {
                "content": "Facts",
                "from": "https://www.facebook.com/mohamet.ali.522066?fref=ufi Mohamet Ali",
                "time": "November 7 at 7:32am"
            },
            {
                "content": "Ban assault to start. I own guns I want much stronger laws and requirements to get one. Also I do not need an assault rifle",
                "from": "https://www.facebook.com/peter.yurkins?fref=ufi Thaddeus Yurkins",
                "time": "November 7 at 1:06pm"
            },
            {
                "content": "Keith Tole , you continually make comments about laws that aren't followed.  The thing you seem to neglect to observe is that most of those are laws are not always ones that gun purchasers violate.   What about gun sellers?",
                "from": "https://www.facebook.com/msquires42?fref=ufi Michael Squires",
                "time": "November 7 at 8:06pm Edited"
            },
            {
                "content": "Unless you are a Republican.",
                "from": "https://www.facebook.com/msquires42?fref=ufi Michael Squires",
                "time": "November 7 at 8:06pm"
            }
        ],
        "description": "Linda Kay There is no conflict between safer gun laws and the 2nd Admendment. There is no conflict between safer gun laws and the 2nd Admendment. Keith Tole",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/jessica.l.berkel?fref=ufi",
            "https://www.facebook.com/rob.mark.3?fref=ufi",
            "https://www.facebook.com/rob.mark.3?fref=ufi",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/mohamet.ali.522066?fref=ufi",
            "https://www.facebook.com/peter.yurkins?fref=ufi",
            "https://www.facebook.com/msquires42?fref=ufi",
            "https://www.facebook.com/keith.tole.1?hc_location=ufi",
            "https://www.facebook.com/msquires42?fref=ufi",
            "https://www.facebook.com/jessica.l.berkel?fref=ufi",
            "https://www.facebook.com/rob.mark.3?fref=ufi",
            "https://www.facebook.com/rob.mark.3?fref=ufi",
            "https://www.facebook.com/keith.tole.1?fref=ufi",
            "https://www.facebook.com/mohamet.ali.522066?fref=ufi",
            "https://www.facebook.com/peter.yurkins?fref=ufi",
            "https://www.facebook.com/msquires42?fref=ufi",
            "https://www.facebook.com/msquires42?fref=ufi"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483199005399864",
        "photos": []
    },
    {
        "comments": [],
        "description": "‎ John Kratochvil ‎   to   Linda Kay I think you'll love this:  ",
        "participants": [
            "https://www.facebook.com/john.kratochvil.94?fref=nf",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fimgur.com%2Fgallery%2FeoOfp&h=ATPcR_7cAhC8OyQWLlVf9uf88yzuG91yvlQ8_XNFUmVpGlA3re3awztAM9Jq9CrBo-P0SC-5f8yBetP7GeFPxqpS1LKncaFUm2EGxi3lZY1iD3fYVy-OdyqFCLItxEX8Hho8JR6PioVk88zaw1LfXWP4FIU0Yk8rEbPxCB52Fa2pjYeIcBRgetX1NBNeF9IvcfnVLJtFQyztP2hwZl_8Xw1KE593i-RgL11C9SwjuV8-w6fUMXG3vzt74GvCSRdW4rLDxZkPCjDvzjnRedAm5g"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483671115352653",
        "photos": []
    },
    {
        "comments": [],
        "description": "‎ John Kratochvil ‎   to   Linda Kay https://imgur.com/gallery/TVNdf",
        "participants": [
            "https://www.facebook.com/john.kratochvil.94?fref=nf",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fimgur.com%2Fgallery%2FTVNdf&h=ATNSZPhPOqzqGxco_B7wHewJ9rKcSRysmictT05NAcStBP-91UyvJyxE_VEgtRgSnEwKgzO3Z--giJ_O5BFlXB9R4zXM_bCBMQAmWUNyNw1qiO-NywmH7b3p4o4RKLWvOpujBzsdcYrbV1o2Qwv8NsXsDTQo-ytBlH3Wr2aR_z95X8kSmzYaq8u74o-PCuhzFr8SuP0iv8TXb1hauYsz-NoPYP3jQfvLLYhNJ8S-E1g-grMNYScHCGXT0soi471knIZKUnZMASa9g33wU5ld1g"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483254975394267",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "Thanks for the invite.",
                "from": "https://www.facebook.com/AgendaLinda?fref=ufi Linda Kay",
                "time": "November 6 at 7:23pm"
            }
        ],
        "description": "‎ Guiseppe D'angelico ‎   to   Linda Kay Welcome!  :-)",
        "participants": [
            "https://www.facebook.com/guiseppe.dangelico?fref=nf",
            "https://www.facebook.com/AgendaLinda?fref=ufi",
            "https://www.facebook.com/AgendaLinda?fref=ufi"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/483048258748272",
        "photos": []
    },
    {
        "comments": [],
        "description": "‎ Tim Fritz ‎   to   Linda Kay Ok,Thank you for sharing your thoughts on the subject, your mature!",
        "participants": [
            "https://www.facebook.com/tim.fritz.921?fref=nf"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/482938565425908",
        "photos": []
    },
    {
        "comments": [],
        "description": "Linda Kay  shared  NowThis Politics 's  video .",
        "participants": [
            "https://www.facebook.com/AgendaLinda?fref=nf",
            "https://www.facebook.com/AgendaLinda?hc_ref=ARResRsbxAfL45WJryLGF0NwVGcLZMazJzbfCFwwz5TB-XH3_VZ5cnFcnGZfmQIvZXA",
            "https://www.facebook.com/NowThisPolitics/?hc_ref=ARResRsbxAfL45WJryLGF0NwVGcLZMazJzbfCFwwz5TB-XH3_VZ5cnFcnGZfmQIvZXA",
            "/NowThisPolitics/videos/1770130089685140/?hc_ref=ARResRsbxAfL45WJryLGF0NwVGcLZMazJzbfCFwwz5TB-XH3_VZ5cnFcnGZfmQIvZXA"
        ],
        "post": "https://www.facebook.com/AgendaLinda/posts/482721522114279",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "For help singing up, call 800-318-2596",
                "from": "https://www.facebook.com/NowThisPolitics/?rc=p NowThis Politics",
                "time": "November 6 at 1:19am"
            },
            {
                "content": "As a Canadian with free health coverage I just don't understand why your government doesn't want it's citizens to have affordable health care. And I Really don't understand why so many of your citizens don't seem to want it either.",
                "from": "https://www.facebook.com/bradleykbowes?fref=ufi&rc=p Brad Bowes",
                "time": "November 3 at 3:57pm"
            },
            {
                "content": "A matter of fact, all Obama's accomplishments are already pissing off the pumpkin spice commander in tweeting.  # Hater   # Envious",
                "from": "https://www.facebook.com/profile.php?id=100006607056447&fref=ufi&rc=p Barbara Wright",
                "time": "November 3 at 4:21pm Edited"
            },
            {
                "content": "I qualified for Medicaid through Obamacare in 2015.  It was the first time I had insurance in 9 years.  I hope when I go to renew this year that everything goes well.   😔 ",
                "from": "https://www.facebook.com/XTheOtakuX?fref=ufi&rc=p Ashley Reed",
                "time": "November 3 at 2:52pm"
            },
            {
                "content": "bullcrap, it was already extremely high cost, nobody could afford it, then to top it off business had to stop giving employees fulltime hours because they were required to offer healthcare and they couldn't afford it. So people lost hourly pay, still could not afford health insurance and got fined every year for not having it. Funny how they don't interview the people who had to live with this sham of a healthcare.",
                "from": "https://www.facebook.com/michelle.cammarata.9?fref=ufi&rc=p Michelle Mckenney",
                "time": "November 3 at 2:35pm"
            },
            {
                "content": "Reading through these comments makes it evident that most people commenting do not understand how the ACA, or insurance in general, works. The ignorance is astounding.",
                "from": "https://www.facebook.com/melissabrooke09?fref=ufi&rc=p Melissa Rushton",
                "time": "November 3 at 4:19pm"
            },
            {
                "content": "Maybe we can get Trump to run for President of some other country and run that country into the ground.",
                "from": "https://www.facebook.com/carol.hanrahan.3?fref=ufi&rc=p Carol Hanrahan",
                "time": "November 3 at 3:02pm"
            },
            {
                "content": "Love how it’s so “affordable” when even though my dad works at the VA, we still can’t even get it or get help from them. Oh yeah and he served in the military for 6 years, but I guess since he’s not illegal the government doesn’t care 👌🏻 ",
                "from": "https://www.facebook.com/tyler.sheehan.77?fref=ufi&rc=p Tyler Sheehan",
                "time": "November 3 at 2:56pm"
            },
            {
                "content": "My 30 year old son just signed up for coverage through Medica offered to Wisconsin residents near the Twin Cities. He receives a subsidy of $300 per month.  I love Obamacare!",
                "from": "https://www.facebook.com/roysjoberg?fref=ufi&rc=p Roy A. Sjoberg",
                "time": "November 3 at 4:27pm"
            },
            {
                "content": "Due to insurance companies pulling out of my state and county I have 2 options. Insurance through my hospital at $800 per month or coverage through Obama care for under $200. My marketplace premiums are higher but still closer to affordable than my only other option. Thanks TRUMPCARE for ruining my only affordable option. I will be signing up just to piss him off and doing everything I can not to lose it!",
                "from": "https://www.facebook.com/LancesPollyPocket?fref=ufi&rc=p Alyssa Larson Quick",
                "time": "November 3 at 7:40pm"
            },
            {
                "content": "We still need to take out Big Pharma or they will bankrupt obamacare- the reason why insurance premiums are high is we are being overcharged by hospitals by 10 times.",
                "from": "https://www.facebook.com/daniel.yuhasz.3?fref=ufi&rc=p Daniel Yuhasz",
                "time": "November 3 at 3:53pm"
            },
            {
                "content": "How can anybody think that what the POTUS is doing to Obama care is right!!?? Working in healthcare, I see the repercussions of people NOT having insurance does!! I can't believe Americans actually  voted for this president!!! Did you think he would make it better?!? He just made so much more difficult families!!!",
                "from": "https://www.facebook.com/judee1960?fref=ufi&rc=p Judith Richardson",
                "time": "November 3 at 3:56pm"
            },
            {
                "content": "Nowthis politics: Literally nothing but biased political views and half assed videos that do nothing to further anyones knowledge of anything political. Y'all need to stop beating this dead horse and actually talk about political issues that aren't \"hurdur Trumps a big meany weeny poo\"",
                "from": "https://www.facebook.com/robert.paigebodeau?fref=ufi&rc=p Robert Paige-Bodeau",
                "time": "November 3 at 3:32pm"
            },
            {
                "content": "We pay $600 per month for private healthcare for a family of four.  Used to pay less for this before Obamacare.  I have to LOL at the tards saying \"Thanks Trumpcare\".  Dumb asses really think Trump is driving up the cost?  Obama had it going up before he left office and trending up still even after.  Trump really has nothing to do with this other than repeal and replace.  Please do.  The people deserve better.",
                "from": "https://www.facebook.com/MoxZ21?fref=ufi&rc=p Cyndi Hannahs",
                "time": "November 4 at 7:45pm"
            },
            {
                "content": "Trump did NOT drive up the rates Obama did this to be able to penalize Americans that could no longer avoid the  premiums and deductibles. Get your facts straight before you make yourself look like an idiot! Every year it was meant to go up that is what Obamacare was from the beginning.",
                "from": "https://www.facebook.com/sandy.arrington.102?fref=ufi&rc=p Sandy Arrington",
                "time": "November 5 at 11:18am"
            },
            {
                "content": "I moved from the US to Portugal and absolutely LOVE the Universal healthcare here. You Americans are being screwed big time. It’s shocking how much better this system is.",
                "from": "https://www.facebook.com/profile.php?id=100016361220751&fref=ufi&rc=p Dwight Miller",
                "time": "November 3 at 6:07pm"
            },
            {
                "content": "The reason many citizens faced high payments under the ACA was their State would not fund it even with help from the federal government  and that was usually because they had a Republican Governor. Just like here in Florida crooked Scott would not fund the ACA",
                "from": "https://www.facebook.com/jeanette.kelly.169?fref=ufi&rc=p Jeanette Kelly",
                "time": "November 3 at 8:42pm"
            },
            {
                "content": "Yeah since my $975 per month premium and my $14,300 deductible is such a fantastic deal, I just can’t thank Obama enough for making it more expensive to take care of my family than it does to own a home... I’m so grateful!!! No it’s total BS. All of it!",
                "from": "https://www.facebook.com/george.palmeriv?fref=ufi&rc=p George Palmer",
                "time": "November 4 at 1:27pm"
            },
            {
                "content": "You do realise that the healthcare in Britain isn't seen as a taxation in Britain is separate to that of general tax. It's under \"social insurance\".  It's not free, but I don't have to worry that if I have a stroke whether I can afford the hospital or not. Could someone please explain why so many Americans are anti a British/Canadian/French system because it confuses me as to why anyone wouldn't want that?",
                "from": "https://www.facebook.com/sarah.austin.967806?fref=ufi&rc=p Sarah Austin",
                "time": "November 4 at 8:44am"
            },
            {
                "content": "Some of the comments here make me laugh. We have universal healthcare in the UK, funded by all working people. It's not perfect but it's better than being screwed by insurance companies.",
                "from": "https://www.facebook.com/Jcollins17?fref=ufi&rc=p James Bell",
                "time": "November 5 at 9:21am"
            },
            {
                "content": "I can't afford mt premium now. Even with a subsidy. My subsidy went down twenty dollars and my premium up forty, last year, had to cancel INS. Got to be able to have heat/ electric and food on the table and pay the rent. I also got rid of other things to try and keep in budget. I will not sign up this year.",
                "from": "https://www.facebook.com/kristin.warburton.3?fref=ufi&rc=p Kristin Warburton",
                "time": "November 3 at 3:18pm"
            },
            {
                "content": "They’re neither quality nor affordable. All of the quality carriers have pulled out of the Marketplace, leaving only half-baked insurance companies that most organizations in this country won’t contract with for benefits, and it’s not affordable, because the deductibles are generally huge. Premiums are not all that matter.",
                "from": "https://www.facebook.com/matchboxx2010?fref=ufi&rc=p Josh Edgar",
                "time": "November 3 at 5:09pm"
            },
            {
                "content": "Yeeeeeh... I'm gonna stick with the NHS thanks... a service that fixes me at the point of care, and allows me to get back on my feet as soon as possible; without putting me and my family into a financial crisis. So that I can then go back to work, pay  ... See More",
                "from": "https://www.facebook.com/alex.richardson.92754?fref=ufi&rc=p Reece Richardson",
                "time": "November 5 at 11:30am"
            },
            {
                "content": "900 bucks a month for Obamacare. Thanks Obama! You're the best! Still broke, still uninsured, still being slowly killed by diabetes, and still don't want the American people to be taxed for healthcare. I don't want any part of anyone's social medicine.",
                "from": "https://www.facebook.com/wes.baldwin.56?fref=ufi&rc=p Wes Baldwin",
                "time": "November 3 at 6:29pm"
            },
            {
                "content": "This is pathetic and the smear campaign yhe left has against him for absolutely no reason is just pathetic and the reason 1 your side is losing and 2 yalls side wont rise to power for another 30 years hell im an independent and i see this smh yall need some damn help",
                "from": "https://www.facebook.com/stone.mclinden?fref=ufi&rc=p Stone Mclinden",
                "time": "November 3 at 3:59pm"
            },
            {
                "content": "This is horrid. I've never had to worry about healthcare costs for any moment. Because it's paid for his taxes. You're ill you book an appointment with a GP. If it's serious you're sent to a hospital, you're not charged a penny because you've already p ... See More",
                "from": "https://www.facebook.com/matthew.almond.31?fref=ufi&rc=p Matthew Almond",
                "time": "November 3 at 4:36pm"
            },
            {
                "content": "The fact that he's trying so hard to undermine the law that is Obama Care isn't that an impeachable offense right there cuz he's lying straight up about it.  I knew it would be bad with Trump as president but I never knew it would be this bad.",
                "from": "https://www.facebook.com/brian.moser3?fref=ufi&rc=p Brian Moser",
                "time": "November 3 at 6:53pm"
            },
            {
                "content": "Thank you for this info. I have an angry face; not at you, but at the Resident, who is doing everything in his power to take away health insurance from millions of people who were finally able to have health insurance in this country.",
                "from": "https://www.facebook.com/diane.scholle?fref=ufi&rc=p Diane Scholle",
                "time": "November 3 at 4:26pm"
            },
            {
                "content": "Sorry, but Trump wasn’t the one who made prices skyrocket. They were doing that much before Trump. And it’s not affordable at all... $1000 a month for a married couple plus a $5000 deductible? Yeah. Not even. Sticking with COBRA and paying for that from my husband’s previous job is the same monthly price without the deductible. That’s sad. I’m no Trump supporter. But I AM a supporter of truth.",
                "from": "https://www.facebook.com/clearopacity?fref=ufi&rc=p Michelle Ann",
                "time": "November 4 at 11:19pm Edited"
            },
            {
                "content": "Well, now I'm done with you guys. You are literally encouraging people to sign up for something that the government passed as a (tax) law that forces (ahem, requires) people to purchase. Yeah, that's pro-liberty; lets piss off Trump by telling people to enroll in the very thing they're otherwise required to purchase by force of law. Screw you!  # TaxationIsTheft  and Obamacare is a tax law!",
                "from": "https://www.facebook.com/aj.ashiyama?fref=ufi&rc=p AJ Oatsvall",
                "time": "November 4 at 12:33am"
            },
            {
                "content": "One of the main problems is private investors dictating our healthcare. If taxes were actually used for the American people this issue would drastically be reduced.",
                "from": "https://www.facebook.com/jason.leggett.566?fref=ufi&rc=p Jason Leggett",
                "time": "November 3 at 3:54pm"
            },
            {
                "content": "Obama Care is great!!! U until you try and use it. 4 week wait to get an appointment that takes Obama care. They just tell you to go to the emergency room if it's life or death.  It sucks",
                "from": "https://www.facebook.com/jacob.felton.79?fref=ufi&rc=p Jacob Felton",
                "time": "November 3 at 7:46pm"
            },
            {
                "content": "If Obamacare is so great how come there are people exempted to it ( like obama !!!and his family , law makers- like schumer , sanders , pelosi, Maxine waters , etc etc  , and some certain groups .... if Obamacare is so great how come the deductibles ar ... See More",
                "from": "https://www.facebook.com/rex.cabrera.14?fref=ufi&rc=p Rex Cabrera",
                "time": "November 5 at 3:38am"
            },
            {
                "content": "I  go to mexico as a mexican to get health care... Usa prices are ridiculous.  I feel so bad and so sorry for the american people  who don´t have money to get  their coverage. God bless you all and hopefully you can find the money  to pay for this. Praying  for all of u",
                "from": "https://www.facebook.com/ale.ln.alv?fref=ufi&rc=p Leön Alexändrä",
                "time": "November 4 at 4:14am Edited"
            },
            {
                "content": "Almost p***ed my pants laughing at this video. Got to say that most of my clients that lost their healthcare plans & have seen 65% increases in premiums & 150% increases in their deductible, some will have to pay upwards of 30-40k (including their deductible) before they see any benefit, (used to pay about 23k). Remember your insurance will go down by 2,500 & you can keep plan and doctor, too.  😂 😂 😂 ",
                "from": "https://www.facebook.com/britt.ponte?fref=ufi&rc=p Britt W Ponte",
                "time": "November 4 at 11:01pm Edited"
            },
            {
                "content": "No one is going to buy health insurance because that is why they voted Republican and voted for Trump, to get rid of the Affordable Healthcare Act or Obamacare.  People are going back to having no insurance and Emergency rooms will become their doctors ... See More",
                "from": "https://www.facebook.com/m.loveall.7?fref=ufi&rc=p Marcia Loveall",
                "time": "November 3 at 7:21pm"
            },
            {
                "content": "All of the greedy insurance companies is why we don’t have single payer system. One company only made $12billion instead of the 18 billion it had projected.  Boo hoo for them only a $12billion profit. They probably paid their executives millions",
                "from": "https://www.facebook.com/lesli.neebe?fref=ufi&rc=p Lesli Weitkemper Neebe",
                "time": "November 3 at 9:53pm"
            },
            {
                "content": "No matter what health insurance you decide to get that should be your choice and people should sign up for Obama care ONLY if they feel it will benefit them. Don't sign up for this to pisses trump off in the end you could only be hurting yourself not h ... See More",
                "from": "https://www.facebook.com/nicole.urban.372?fref=ufi&rc=p Nicole Urban",
                "time": "November 4 at 2:44am"
            },
            {
                "content": "So what’s the excuse for the other eight years that the costs for Americans went up?! I can’t stand Trump but you’ve got to be able to pinpoint a fluff piece when you see one and this is by and large a fluff piece full of heavy partisan leaning language. Just as bad as Fox.",
                "from": "https://www.facebook.com/logan.bourland?fref=ufi&rc=p Logan Bourland",
                "time": "November 4 at 6:52pm"
            },
            {
                "content": "Also my dad may not be alive if it wasn't for Obamacare . He didn't want to be on it but his health concerns forced him to take it and although he hates it I am so incredibly glad he got it with a pre existing condition that may have killed him had we not gotten him to the ER that day",
                "from": "https://www.facebook.com/kristina.lynn.125?fref=ufi&rc=p Kristina Ingerson",
                "time": "November 4 at 12:15pm"
            },
            {
                "content": "Middle class people pay for the Obama Care people .... Look at you taxes on your paycheck people !!!!NY is a terrible state to live here taxes till I die !!!!! No kids no help no head of house hold.... just single middle class man suffers ... While ever one else gets ins for $20",
                "from": "https://www.facebook.com/frankie.hotaling?fref=ufi&rc=p Frankie Hotaling",
                "time": "November 3 at 7:29pm"
            },
            {
                "content": "I can't afford health insurance. My husband and I were told we make 3 dollars over the limit. In the end it is cheaper for us to pay out of pocket for my regular doctor visits, monthly meds, and pay the fine at the end of the year than it would be to pay for monthly insurance after you see how much you spend in a year. And even if I got insurance everywhere wants outrageous copays.",
                "from": "https://www.facebook.com/rachelfaylynn?fref=ufi&rc=p Rachel McCool Singh",
                "time": "November 4 at 2:13am"
            },
            {
                "content": "I can't wait for Obama care to be finished. Maybe then our insurance we pay through work will go down. It was $700/month and went up to $1500 thanks to Obama care. We struggle...not rich!",
                "from": "https://www.facebook.com/joanne.pease?fref=ufi&rc=p Joanne Fazzi Pease",
                "time": "November 6 at 11:57am"
            },
            {
                "content": "I'm 26, I exercise, eat healthy, and make just enough to make ends meet most of the time. I was quoted $230. Lucky my work offers insurance or I wouldn't have it. Now tell me what's wrong with this picture when a member of one of the lowest user groups can't afford it?",
                "from": "https://www.facebook.com/jarred.geis?fref=ufi&rc=p Jarred Geis",
                "time": "November 4 at 2:58pm Edited"
            },
            {
                "content": "Premium Costs are going up 40% 2018. Another insurance company is pulling out of Utah. Only 2 remain in the entire state that still provide single payer insurance. Since ACA's inception when Obama forced it on us, the government has not paid its promis ... See More",
                "from": "https://www.facebook.com/launa.buck?fref=ufi&rc=p Launa Marie Buck",
                "time": "November 6 at 6:00pm Edited"
            },
            {
                "content": "Hey guys! Im working for an insurance company that sells health insurance for just $60 a month. This plan is compliant with the Affordable Care Act, so you won’t fined by the Government for lack of insurance. If you have any questions or want some more information, feel free to message me!",
                "from": "https://www.facebook.com/dano.josipovich?fref=ufi&rc=p Dano Josipovich",
                "time": "November 5 at 7:57am"
            },
            {
                "content": "Blame Trump all you want...the rise in premiums with Obamacare was happening before he even took office.  It's a terrible system that was shoved down our throats before anyone even had a chance to read the damn thing.  Make no mistake about it, the lie ... See More",
                "from": "https://www.facebook.com/danny.cameron.733?fref=ufi&rc=p Danny Cameron",
                "time": "November 7 at 10:29am"
            },
            {
                "content": "This is absolute rubbish to tell your people or to be an organization you have no idea what the ramifications are for you to go out and publicly tell people to undermine that the leader put before them especially a man who claims to be God fearing just ... See More",
                "from": "https://www.facebook.com/warren.and.sarah?fref=ufi&rc=p Warren Sarah Nichter",
                "time": "November 4 at 11:08am"
            },
            {
                "content": "I had Obamacare . The first year it was sooo cheap and great coverage . The next year it was still pretty decent , $40'more a month $0 deductible!!!! That was incredible! I got .50'cent raise and my premium and deducible went way up, I ended up With my works awful Insurance for $300 a month when I was paying $160 the first yer $200 the next . Luckily now ... See More",
                "from": "https://www.facebook.com/kristina.lynn.125?fref=ufi&rc=p Kristina Ingerson",
                "time": "November 4 at 12:14pm"
            },
            {
                "content": "In the spirit of transparency-- you guys should report that it's not accepted by most doctors. I tried this under Obama and there were no doctors willing to accept it.  Don't take my word for it-- call providers yourself before you buy!  Seriously.",
                "from": "https://www.facebook.com/elizabeth.kirkpatrick.980?fref=ufi&rc=p Elizabeth Kirkpatrick",
                "time": "11 hrs"
            }
        ],
        "description": "NowThis Politics Here's how you can piss off Trump while helping yourself at the same time",
        "participants": [
            "https://www.facebook.com/NowThisPolitics/?ref=nf&hc_ref=ART3tT6aw2TwS8B_qN5vpuhe0J-w_isPjqcpCN1h02DIeCq0VxaSRqLuhw5HQZRB8Ys",
            "https://www.facebook.com/NowThisPolitics/?rc=p",
            "https://www.facebook.com/bradleykbowes?fref=ufi&rc=p",
            "https://www.facebook.com/bradleykbowes?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100006607056447&fref=ufi&rc=p",
            "https://www.facebook.com/XTheOtakuX?fref=ufi&rc=p",
            "https://www.facebook.com/michelle.cammarata.9?fref=ufi&rc=p",
            "https://www.facebook.com/haley.frey.21?fref=ufi&rc=p",
            "https://www.facebook.com/melissabrooke09?fref=ufi&rc=p",
            "https://www.facebook.com/carol.hanrahan.3?fref=ufi&rc=p",
            "https://www.facebook.com/tyler.sheehan.77?fref=ufi&rc=p",
            "https://www.facebook.com/EliGotSwag?fref=ufi&rc=p",
            "https://www.facebook.com/roysjoberg?fref=ufi&rc=p",
            "https://www.facebook.com/LancesPollyPocket?fref=ufi&rc=p",
            "https://www.facebook.com/daniel.yuhasz.3?fref=ufi&rc=p",
            "https://www.facebook.com/judee1960?fref=ufi&rc=p",
            "https://www.facebook.com/robert.paigebodeau?fref=ufi&rc=p",
            "https://www.facebook.com/MoxZ21?fref=ufi&rc=p",
            "https://www.facebook.com/sandy.arrington.102?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100016361220751&fref=ufi&rc=p",
            "https://www.facebook.com/jeanette.kelly.169?fref=ufi&rc=p",
            "https://www.facebook.com/george.palmeriv?fref=ufi&rc=p",
            "https://www.facebook.com/sarah.austin.967806?fref=ufi&rc=p",
            "https://www.facebook.com/Jcollins17?fref=ufi&rc=p",
            "https://www.facebook.com/kristin.warburton.3?fref=ufi&rc=p",
            "https://www.facebook.com/matchboxx2010?fref=ufi&rc=p",
            "https://www.facebook.com/alex.richardson.92754?fref=ufi&rc=p",
            "https://www.facebook.com/wes.baldwin.56?fref=ufi&rc=p",
            "https://www.facebook.com/stone.mclinden?fref=ufi&rc=p",
            "https://www.facebook.com/matthew.almond.31?fref=ufi&rc=p",
            "https://www.facebook.com/brian.moser3?fref=ufi&rc=p",
            "https://www.facebook.com/diane.scholle?fref=ufi&rc=p",
            "https://www.facebook.com/clearopacity?fref=ufi&rc=p",
            "https://www.facebook.com/aj.ashiyama?fref=ufi&rc=p",
            "https://www.facebook.com/jason.leggett.566?fref=ufi&rc=p",
            "https://www.facebook.com/jacob.felton.79?fref=ufi&rc=p",
            "https://www.facebook.com/rex.cabrera.14?fref=ufi&rc=p",
            "https://www.facebook.com/ale.ln.alv?fref=ufi&rc=p",
            "https://www.facebook.com/britt.ponte?fref=ufi&rc=p",
            "https://www.facebook.com/m.loveall.7?fref=ufi&rc=p",
            "https://www.facebook.com/lesli.neebe?fref=ufi&rc=p",
            "https://www.facebook.com/nicole.urban.372?fref=ufi&rc=p",
            "https://www.facebook.com/logan.bourland?fref=ufi&rc=p",
            "https://www.facebook.com/kristina.lynn.125?fref=ufi&rc=p",
            "https://www.facebook.com/frankie.hotaling?fref=ufi&rc=p",
            "https://www.facebook.com/rachelfaylynn?fref=ufi&rc=p",
            "https://www.facebook.com/joanne.pease?fref=ufi&rc=p",
            "https://www.facebook.com/jarred.geis?fref=ufi&rc=p",
            "https://www.facebook.com/launa.buck?fref=ufi&rc=p",
            "https://www.facebook.com/dano.josipovich?fref=ufi&rc=p",
            "https://www.facebook.com/danny.cameron.733?fref=ufi&rc=p",
            "https://www.facebook.com/warren.and.sarah?fref=ufi&rc=p",
            "https://www.facebook.com/kristina.lynn.125?fref=ufi&rc=p",
            "https://www.facebook.com/elizabeth.kirkpatrick.980?fref=ufi&rc=p",
            "https://www.facebook.com/NowThisPolitics/?rc=p",
            "https://www.facebook.com/bradleykbowes?fref=ufi&rc=p",
            "https://www.facebook.com/bradleykbowes?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100006607056447&fref=ufi&rc=p",
            "https://www.facebook.com/XTheOtakuX?fref=ufi&rc=p",
            "https://www.facebook.com/michelle.cammarata.9?fref=ufi&rc=p",
            "https://www.facebook.com/haley.frey.21?fref=ufi&rc=p",
            "https://www.facebook.com/melissabrooke09?fref=ufi&rc=p",
            "https://www.facebook.com/carol.hanrahan.3?fref=ufi&rc=p",
            "https://www.facebook.com/tyler.sheehan.77?fref=ufi&rc=p",
            "https://www.facebook.com/EliGotSwag?fref=ufi&rc=p",
            "https://www.facebook.com/roysjoberg?fref=ufi&rc=p",
            "https://www.facebook.com/LancesPollyPocket?fref=ufi&rc=p",
            "https://www.facebook.com/daniel.yuhasz.3?fref=ufi&rc=p",
            "https://www.facebook.com/judee1960?fref=ufi&rc=p",
            "https://www.facebook.com/robert.paigebodeau?fref=ufi&rc=p",
            "https://www.facebook.com/MoxZ21?fref=ufi&rc=p",
            "https://www.facebook.com/sandy.arrington.102?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100016361220751&fref=ufi&rc=p",
            "https://www.facebook.com/jeanette.kelly.169?fref=ufi&rc=p",
            "https://www.facebook.com/george.palmeriv?fref=ufi&rc=p",
            "https://www.facebook.com/sarah.austin.967806?fref=ufi&rc=p",
            "https://www.facebook.com/Jcollins17?fref=ufi&rc=p",
            "https://www.facebook.com/kristin.warburton.3?fref=ufi&rc=p",
            "https://www.facebook.com/matchboxx2010?fref=ufi&rc=p",
            "https://www.facebook.com/alex.richardson.92754?fref=ufi&rc=p",
            "https://www.facebook.com/wes.baldwin.56?fref=ufi&rc=p",
            "https://www.facebook.com/stone.mclinden?fref=ufi&rc=p",
            "https://www.facebook.com/matthew.almond.31?fref=ufi&rc=p",
            "https://www.facebook.com/brian.moser3?fref=ufi&rc=p",
            "https://www.facebook.com/diane.scholle?fref=ufi&rc=p",
            "https://www.facebook.com/clearopacity?fref=ufi&rc=p",
            "https://www.facebook.com/aj.ashiyama?fref=ufi&rc=p",
            "https://www.facebook.com/jason.leggett.566?fref=ufi&rc=p",
            "https://www.facebook.com/jacob.felton.79?fref=ufi&rc=p",
            "https://www.facebook.com/rex.cabrera.14?fref=ufi&rc=p",
            "https://www.facebook.com/ale.ln.alv?fref=ufi&rc=p",
            "https://www.facebook.com/britt.ponte?fref=ufi&rc=p",
            "https://www.facebook.com/m.loveall.7?fref=ufi&rc=p",
            "https://www.facebook.com/lesli.neebe?fref=ufi&rc=p",
            "https://www.facebook.com/nicole.urban.372?fref=ufi&rc=p",
            "https://www.facebook.com/logan.bourland?fref=ufi&rc=p",
            "https://www.facebook.com/kristina.lynn.125?fref=ufi&rc=p",
            "https://www.facebook.com/frankie.hotaling?fref=ufi&rc=p",
            "https://www.facebook.com/rachelfaylynn?fref=ufi&rc=p",
            "https://www.facebook.com/joanne.pease?fref=ufi&rc=p",
            "https://www.facebook.com/jarred.geis?fref=ufi&rc=p",
            "https://www.facebook.com/launa.buck?fref=ufi&rc=p",
            "https://www.facebook.com/dano.josipovich?fref=ufi&rc=p",
            "https://www.facebook.com/danny.cameron.733?fref=ufi&rc=p",
            "https://www.facebook.com/warren.and.sarah?fref=ufi&rc=p",
            "https://www.facebook.com/kristina.lynn.125?fref=ufi&rc=p",
            "https://www.facebook.com/elizabeth.kirkpatrick.980?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NowThisPolitics/videos/1770130089685140/",
        "photos": []
    }
]