{
    "thread": "https://www.facebook.com/messages/archived/t/alex.childers.777",
    "participants": [
        {
            "name": "Alex Childers",
            "description": "Studied Applied Management at Northern Arizona University",
            "url": "Studied Interior Design at Northern Arizona University"
        }
    ],
    "messages": [
        {
            "from": "Alex",
            "time": "2005-09-30T09:10:00.000Z",
            "message": "\nscavenger hunt saturday night 9-11 u in?\n"
        },
        {
            "from": "Brian",
            "time": "2005-10-01T07:08:00.000Z",
            "message": "Brian\nmaybe\n"
        },
        {
            "from": "Alex",
            "time": "2005-10-01T17:45:00.000Z",
            "message": "\nu know u want to! java at 9...be there lol\n"
        },
        {
            "from": "Alex",
            "time": "2005-10-04T07:09:00.000Z",
            "message": "\nNo Send Backs! TAG UR IT!!!! this is so scary. send this to 15 people in the next 143 mins. when you are done press F6 and your crushes name will appear on the screen in big letters. this is scary cuz it works!!!! if you break the chain you will have problems with relationships for the next 5 years\n"
        },
        {
            "from": "Brian",
            "time": "2005-10-04T21:00:00.000Z",
            "message": "Brian\nI was wondering how long it would take for these damn stupid little games to start.\n"
        },
        {
            "from": "Alex",
            "time": "2005-10-04T23:20:00.000Z",
            "message": "\nyes they suck i know but u love me so it's ok!  lol\n"
        },
        {
            "from": "Alex",
            "time": "2005-10-06T00:43:00.000Z",
            "message": "\ni think ur a dork lol\n"
        },
        {
            "from": "Alex",
            "time": "2009-08-05T06:49:00.000Z",
            "message": "\nSo I have to say, I'm kind of curious, why the sudden friend request?  I haven't talked to you in like, what, three years?  Definitely not trying to sound like a bitch, I was just curious.  How're things going?  You still in Flag?\n"
        },
        {
            "from": "Brian",
            "time": "2009-08-05T19:52:00.000Z",
            "message": "Brian\nI'm good, I think I saw you in the friend suggestion because other people I am friends with are friends with you.  I usually add all people I know or have met, not necessarily good friends with.  Still living in Flagstaff about to start my 5th year, doing pretty well.  How are you?\n"
        },
        {
            "from": "Alex",
            "time": "2009-08-06T06:21:00.000Z",
            "message": "\nI'm alright, still in Flag as well.  Ditto on the 5th year part, but luckily it's the last so I can be done finally!  Can't wait to leave Flag though, I absolutely dread having pretty much nothing to do.  Oh, by the way, way jealous of all the traveling!\n"
        },
        {
            "from": "Brian",
            "time": "2009-08-06T06:21:00.000Z",
            "message": "Brian\nYeah, it's been great; sick of planes though. Flagstaff is pretty low key.  I'm glad to see I'm not the only one taking it easy on the degree progress.  Good luck with your last year!\n"
        },
        {
            "from": "Alex",
            "time": "2009-08-06T06:21:00.000Z",
            "message": "\nYeah you too!  I'm definitely a fan of taking my time school-wise. haha\n\n"
        }
    ]
}