{
    "thread": "https://www.facebook.com/messages/archived/t/amanda.kapp",
    "participants": [
        {
            "name": "Amanda Kapp",
            "description": "Studied at Northern Arizona University",
            "url": "Went to Washington High School, Phoenix, AZ"
        }
    ],
    "messages": [
        {
            "from": "Amanda",
            "time": "2010-12-06T02:38:00.000Z",
            "message": "\nlol, yes now i understand your halloween costume. very funny - the eyeliner is a nice touch\n"
        },
        {
            "from": "Brian",
            "time": "2010-12-06T02:38:00.000Z",
            "message": "Brian\nHaha, I did it myself.  Maybe a little bit too well.  It was a fun night, have a good rest of the evening Friday?\n"
        },
        {
            "from": "Amanda",
            "time": "2010-12-06T02:38:00.000Z",
            "message": "\nNice work - your facial expression is very convincing. Yes, Friday was pretty funny. A friend was showing off her new line of dresses at Sundara, although when I got there everyone just seemed to be working - there wasn't an actual event going on which I thought was odd. And then at the Greenroom there was not a dance performance as far as I could tell, however I did have the benefit of seeing a highly entertaining fashion show - imagine about 250 yards of tulle (you know - what tutus are made out of) and a LOT of feathers - several ostriches worth. Did you make it for the music?\n"
        },
        {
            "from": "Brian",
            "time": "2010-12-06T02:38:00.000Z",
            "message": "Brian\nWow, that like a crazy fashion show!  I did make it there for music, it was pretty awesome!  Not as great as last week, but definitely some great music.  They have really added a lot of cool lighting to that place in the last year.\n"
        },
        {
            "from": "Amanda",
            "time": "2010-12-17T02:19:00.000Z",
            "message": "\nCongrats on graduation tomorrow! A diploma with a little snow on top to boot. I forgot I am going to the Nutcracker tomorrow night - sorry to miss. What is this deathstar? Is that your house? Funny, we had friends who called their house The Mothership. Must be a theme there. Cheers!\n"
        },
        {
            "from": "Brian",
            "time": "2010-12-17T02:24:00.000Z",
            "message": "Brian\nHaha.  Yes, The Death Star is the nickname David M and I came up with when we first moved in.  I make it into a location on Google Maps.  Thanks for the well wishes!  We should hang out sometime!\n"
        },
        {
            "from": "Amanda",
            "time": "2010-12-17T05:58:00.000Z",
            "message": "\nWe should! I am not sure what your Flagstaff time line is but let me know if you are around: 526-0583\n"
        },
        {
            "from": "Brian",
            "time": "2011-01-04T08:50:00.000Z",
            "message": "Brian\nWoo! First Friday! Are you going out? We should remind everyone of tacos at Charlie's and Electric Kingdom at Green Room!\n"
        },
        {
            "from": "Amanda",
            "time": "2011-01-05T02:40:00.000Z",
            "message": "\nBrian Cullinan! \n\nHello, how are you? How were your holidays? Mine were good - warm in Tucson and Phoenix and then up here in time for the weather to dip below freezing - elevation is shocking. \n\nThank you for the reminder about First Friday. I think this Friday is actually a friend's birthday so the evening agenda may be up to her, however I will let her know and we will see where we end up. \n\nHmmmmmm, well, (since the last thing I did was send you my phone number) I should probably mention (and I have to say it is with some sadness that I have to report this to you because you are nice, smart and have this very amazing smile) that I started seeing someone over the break. I know you and I weren't dating or anything but the thought had certainly crossed my mind (perhaps more than once) and so I thought I might mention it.\n\nAnyway, I look forward to bumping into you at taco night...or Safeway for that matter  I should also say that I have enjoyed your music recommendations on FB - since I don't usually listen to techno it is refreshing to hear some new sounds. I may have to use some of these when it is my turn to teach at dance.\n\nBe well, Amanda\n"
        },
        {
            "from": "Brian",
            "time": "2011-01-05T03:53:00.000Z",
            "message": "Brian\nHolidays were great!  I had a ton of fun with family and friends.  I've been out partying a lot since graduation, but I've since been back to Flagstaff to work on projects.  The elevation will definitely get to you.  I haven't adjusted well to the cold this year, but I spent all day yesterday skiing, so hopefully that will help.\n\nThanks for the heads up on your relationship status.  You are very sweet, and also very attractive on many levels.  Now I kind of feel bad for not calling  The thought crossed my mind on multiple occasions too! \n\nI am glad you like the music.  I like electronica because there are so many unique noises, and a big part of enjoying the sound, I think, is how the reverberations feel.  Let me know how the dance teaching goes!\n\nHope to see you Friday, and good luck with the new guy!\n\n-Brian\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-25T04:05:00.000Z",
            "message": "Brian\nHi\n"
        },
        {
            "from": "Amanda",
            "time": "2012-01-25T04:05:00.000Z",
            "message": "\nhey there\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-25T04:05:00.000Z",
            "message": "Brian\nHows life?\n"
        },
        {
            "from": "Amanda",
            "time": "2012-01-25T04:05:00.000Z",
            "message": "\nlife is great - how about you?\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-25T04:05:00.000Z",
            "message": "Brian\nPeachy.\nBuying a house.  Totally excited about that.\n"
        },
        {
            "from": "Amanda",
            "time": "2012-01-25T04:05:00.000Z",
            "message": "\noh that's fantastic!\ndown in the valley?\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-25T04:05:00.000Z",
            "message": "Brian\nhttp://www.phoenixrealestateguy.com/idx/mls-4697105-6934_e_sandra_terrace_scottsdale_az_85254\n"
        },
        {
            "from": "Amanda",
            "time": "2012-01-25T04:05:00.000Z",
            "message": "\noooo - shiney big kitchen\nhuge yard\nKenney says you are part of a new brainstorming group\nbuilding LED cubes and other modern feats of amazement\n\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-25T04:05:00.000Z",
            "message": "Brian\nHopefully.  I am no electrical engineer.  But I think the programming challenge will be fun, and it might motivate me to take an EE class.\nCan't really say much until it's accomplished.\n"
        }
    ]
}