{
    "thread": "https://www.facebook.com/messages/archived/t/AmayaTokemi",
    "participants": [
        {
            "name": "Rebecca Marie\n(Mrs Dreamstress)",
            "description": "Lives in Phoenix, Arizona",
            "url": "From Las Vegas, Nevada"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2011-09-11T06:50:00.000Z",
            "message": "Brian\nI'd volunteer btw, but you never texted me back about dinner   and I'm not goth.\n"
        },
        {
            "from": "Rebecca",
            "time": "2011-09-11T06:50:00.000Z",
            "message": "\n...dinner... oh yea! I did forget! Sorry lol.\nI don't necessarily need anyone goth, just one who's open minded. But I'm picky, and you and I don't know eachother well enough yet.\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-11T18:05:00.000Z",
            "message": "Brian\nTrue story.  What do you mean by open minded?  I mean, obviously I can assume what you mean, but I'm curious to know what your example of open minded is.  I pretty much like to do everything with friends.  I like going out, I went to a bunch of electronic shows this year, I like to stay in an watch movies, I like to cook, I like to go camping, I love skiing.\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-11T21:10:00.000Z",
            "message": "Brian\nI am pretty picky too, but I'd like someone to hang out with. \n"
        },
        {
            "from": "Rebecca",
            "time": "2011-09-11T23:03:00.000Z",
            "message": "\nSee, that's awesome! I like all that stuffs. What I mostly mean by open minded is - I obviously have several \"goth\" friends, and plenty of ones who aren't, but I don't need anyone bashing on either of the groups. I have such a variety of friends because I am so open minded. Y'know?\n\nYea we can hang out. Probably not this week, I'm oober busy. Bleh.\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-12T01:53:00.000Z",
            "message": "Brian\nHaha, I get it.  I was just teasing anyways.  Everyone I've met so far seems pretty interesting.\n"
        },
        {
            "from": "Rebecca",
            "time": "2011-09-12T01:53:00.000Z",
            "message": "\nSilly, don't tease \n"
        },
        {
            "from": "Brian",
            "time": "2011-11-22T01:12:00.000Z",
            "message": "Brian\n\n"
        },
        {
            "from": "Rebecca",
            "time": "2011-11-22T01:12:00.000Z",
            "message": "\nHi Brian\n\n"
        }
    ]
}