{
    "thread": "https://www.facebook.com/messages/archived/t/amy.root.7",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2010-08-10T04:27:00.000Z",
            "message": "Brian\nHi!  What have you been up to all this time?\n"
        },
        {
            "from": "Amy",
            "time": "2010-08-12T14:07:00.000Z",
            "message": "\nSorry!  My puppy has been sick so thats been taking up all my time.  Nothing new to report.  Work is..well work!\n\nWut about you?\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-12T23:49:00.000Z",
            "message": "Brian\nJust been working on projects. Building a new website for the college. Still working on my own website for accessing music and videos online. Loving the outdoors and perfect weather right now.\n"
        },
        {
            "from": "Brian",
            "time": "2011-02-19T20:37:00.000Z",
            "message": "Brian\nhttp://www.youtube.com/watch?v=pCCg9sVblNA\n\nHer Majesty & The Wolves - Glaciers (Roksonix Remix)\nBackground image Courtesy of http://www.hameed.deviantart.com Sick remix by Roksonix here and its been given away as a free download! Cheers guys! Free Download http://soundcloud.com/360remixes/her-majesty-the-wolves-glaciers-roksonix-remix-3/s-l636j http://www.facebook.com/roksonix http://www.my\ngdata.youtube.com\n\n"
        },
        {
            "from": "Amy",
            "time": "2011-03-24T02:09:00.000Z",
            "message": "\nBrian,\n\nThat story about that guy who took advantage of me in college, well I had a guy who fit his discretion perfectly as a client.\nThe client got hard and hit on me during the session.  After he left, I had a full blown nervous break-down.  I cried and started shaking and nearly threw up.  I finished me shift then came home and cried.\nThat's why I didn't talk to you yesterday because when things like that happen I shut down.  I'm ok now but it really shook me up.  I wanted to tell you because I can talk about it now.  You mean a lot to me an I wanted to tell you.\n"
        },
        {
            "from": "Brian",
            "time": "2011-03-24T04:57:00.000Z",
            "message": "Brian\nOh baby! That sounds awful. I am sorry you had such a horrible day. I didn't take it personally; you not talking to me. But knowing that I wish you had called me or something, I am here for you. You are so sweet, and you deserve better, you should be happy  I didn't want to jump the gun, but I think you should apply for a new job, maybe consider the many resorts out here. There are tons of spas out here, and I always think it would be a great experience to move around. I'll send you more later. Or call you, I can't really express everything I am thinking online like this.  I miss you. Look forward to coming out to see me, we are going to have to much fun!\n"
        },
        {
            "from": "Brian",
            "time": "2011-05-02T17:12:00.000Z",
            "message": "Brian\nAmy,\n\nListen to this: http://www.youtube.com/watch?v=ZFb2OHzkFfY\n\nI wish I had told you this when you asked me what darkness I had in my life.  Jessie and I broke up in May, but we were still hooking up whenever we could.  She had sex with another guy, but I got past it, I could easily forgive her because we were technically broken up, but I was still very much in love with her.  In August we met for DefCon and hooked up there too.\n\nLater in August, I had a party and a bunch of friends and I got together and took ecstasy.  I explained how it felt and the side effects to everyone, it was all very comfortable and felt good.  One of the side effects is second day depression, because your body has to replenish endorphins.\n\nThe day after the party I left for a trip to Utah with my family.  I wanted to stay with Jessie and be with her on Sunday.  We couldn't talk easily because she lost her cell phone.  Sunday rolled around and we were in a movie theater when the depression set in hard and fast.  I couldn't stand it, I started sweating and having cold and hot flashes.  I had to get out of there.\n\nI went and tried to call all the friends I was with the Friday before.  Most of them didn't answer.  I warned them about being extra tolerant and compassionate to each other so they wouldn't fight from the depression.  I finally got in touch with Jessica after David wouldn't pick up for me.  I asked where Jessie was, and apparently she had left town without telling anyone where she was going.  She left towards Sedona and Prescott, and I had no way of getting in touch with her.  Of course I worried about all the horrible things that could happen.\n\nI thought about her the rest of the night.  That night I cried for hours.  It was the saddest I think I have ever been.  I knew that she was going down to be with Mike.  I could feel it.  And as soon as I got back, he told me about it because they couldn't live with the guilt, even for a minute.  The girl I loved had hooked up with my best friend again.\n\nI made a promise to myself that weekend.  I would never put another drug in my body if it meant never having to feel that much pain again.  I wanted to see a therapist.  Needless to say, last fall was a hard last semester for me.  My life was changing quickly.  I had to graduate and find a job.  I chose to be friends with Jessie over turning away from all of my friends in order to get past it.  Working out everyday really helped with the depression.\n\nThe other thing I learned from the experience was that an intimate, loving friendship was more valuable than any amount of sex.  That song helped me get through the weekend.\nI know I can be pretty intense sometimes.  And I am amazed at your ability to tolerate it.\nI wish I could hold you. \n\nDeadmau5 - I Remember\nSince I was surprised that so many people comment on that other video of this song that I put up a long long time ago. I decided to upload a new one .. with ...\nyoutube.com\n\n"
        },
        {
            "from": "Brian",
            "time": "2011-07-06T04:39:00.000Z",
            "message": "Brian\n\n\nhttps://bjcullinan.com/Share/Downloads/TV/\n\nhttps://bjcullinan.com/Share/Downloads/Media/TV/\nIndex of /Share/Downloads/TV\nbjcullinan.com\n"
        },
        {
            "from": "Brian",
            "time": "2011-07-16T19:55:00.000Z",
            "message": "Brian\n\n"
        },
        {
            "from": "Amy",
            "time": "2011-08-25T21:24:00.000Z",
            "message": "\nBrian,\n\nI am going through a really hard time right now.  sorry i didn't tell you about it sooner but I kept hoping that it would get better.  I hit rock bottom about 2 weeks ago.  It started with MAJOR panic attacks and now i am seriously depressed with thoughts of suicide.  I don't act on the suicide thoughts but they are still there.  My boss has me on a 2 week break from work hoping I can figure out whats wrong and deal with it. I got my medicine adjusted and I am seeing a councler and I'm hoping for the best! Sorry I haven't talked in a while but when I am like this, I don't like to talk about it.  I hope that things are going well for you and Ill talk to you soon!\n\nAmy\n"
        },
        {
            "from": "Brian",
            "time": "2011-08-25T21:24:00.000Z",
            "message": "Brian\nThat sounds horrible?  I wish there was something I could do to help   I am here if you need to talk about it.  Was is just the panic attack or is there more to it?  I remember your FB message one step forward two steps back, is that related?\n"
        },
        {
            "from": "Amy",
            "time": "2011-08-25T21:24:00.000Z",
            "message": "\nIt started out as a panic attack then led to something more.  I havent been doing well for some time.  I don't know if it's just stress that has made me like this or what but I know that I will over come this.\n"
        },
        {
            "from": "Brian",
            "time": "2011-08-25T21:24:00.000Z",
            "message": "Brian\nI think you will too.  Life is so stressful at time.\n*times\n"
        },
        {
            "from": "Amy",
            "time": "2011-08-25T21:24:00.000Z",
            "message": "\nI miss you!\n"
        },
        {
            "from": "Brian",
            "time": "2011-08-25T21:24:00.000Z",
            "message": "Brian\nI miss you too\n"
        },
        {
            "from": "Amy",
            "time": "2011-09-02T01:24:00.000Z",
            "message": "\nUpdate- I am seeing a councler on a regular basis, my mess have been adjusted and most days I'm fine. It's the hard days that we are trying to get rid of. \nHow are you?!  Haven't talked to you in a while. How is stiewatch going?  Did you ever do your eval?\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-02T01:24:00.000Z",
            "message": "Brian\nAndrew mentioned the evaluation today, I'll get it eventually and it will be prorated.\nI have been pretty good.  Really busy.\nGoing to UK Thursdays tonight to listen to some dubstep.\nI am glad to hear you are seeing a counselor.\n"
        },
        {
            "from": "Amy",
            "time": "2011-09-02T01:24:00.000Z",
            "message": "\nI'm glad you are doing good.  Miss talking to you.  Have fun listening to Dubstep!\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-02T01:24:00.000Z",
            "message": "Brian\nThanks!\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-11T02:56:00.000Z",
            "message": "Brian\nGlad to hear to had a good day. \n"
        },
        {
            "from": "Amy",
            "time": "2011-09-12T18:12:00.000Z",
            "message": "\nMy good day was short lived.\n\nThe back story; \nMy friends at the Gahanna clinic are awesome!  I trust them with almost everything.  Since I didn't go to a normal college, in my mind, working at Gahanna was like going to college.  My co-workers and I would go out, confide in each other..point is we did everything friends would do.\n\nWhen I was hired in Westerville and when my days over there were hard, I'd stop by Gahanna (where I used to work) and talk with my friends. They would ask me how I was doing and I told them that things were different and what was bothering me.  I always talked to the same people about what was going on in Westerville like who I liked and who I didn't like, the different rules and protocols and about my bosses.  I shared in confidence (because every time Id say something, Id tell them 'whatever I say, stays between us and they would agree') how I really felt about Westerville. \n\nNow \nthe owner of Westerville bought the Gahanna clinic and everything I said about Westerville came out.  I was called into my bosses office and she told me that every thing I said about Westerville came into light. She offered to send me back to Gahanna and make things right or I could quit.  I dont know what to do.  I don't think I can go back to Gahanna and work with people I don't trust.  Brian, Im so lost.  I get the I screwed up but I don't know what to do.  \nSorry to vent but I wanted to tell you.  \ni miss you and we should skype sometime soon \n"
        },
        {
            "from": "Brian",
            "time": "2011-09-12T19:42:00.000Z",
            "message": "Brian\nOh no.  That sounds awful.  I think you should do what you need, if that means keeping the job, but assume everything you say is public information and don't trust them anymore.  That's the problem with getting so personal with co-workers.\n"
        },
        {
            "from": "Amy",
            "time": "2011-10-11T03:07:00.000Z",
            "message": "\nI know we haven't talked in a while but I just wanted to let you know that I still think of you.  I wonder how you are doing and how work is and everything. I don't know if you are seeing someone or not but I wanted to let you know that I still care for you and that I still love you.  If you are seeing someone then I wish you the best and I'm sorry if this make you feel uncomfortable I just wanted to let you know.\n\nThinking of you\nAmy\n\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-11T05:48:00.000Z",
            "message": "Brian\n  I think of you too.  I am not seeing anyone.  Just trying to get use to this town.  Stressed out about work.  Still not making what I want to, haven't gotten a review or anything.  Still pretty lonely.  I am on-line all the time and always available to text.  I am sorry things just fizzled out.  It's hard to keep up with someones life when they are 2000 miles away   Miss you.  \n"
        }
    ]
}