{
    "thread": "https://www.facebook.com/messages/archived/t/angelm1971",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2016-10-08T20:36:00.000Z",
            "message": "Brian\nThank you for the connect!\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:36:00.000Z",
            "message": "\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:36:00.000Z",
            "message": "Brian\nI just leveled up.  I love physics.  Can I ask you something I've been wondering for a while?\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:36:00.000Z",
            "message": "\nYes\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:36:00.000Z",
            "message": "Brian\nIf I was in the 3rd dimension traveling at the speed of light, and everything I see would look two dimensional because the light around we would looked stationary.  How would I perceive the 3rd dimension if everything looks flat?  Faster than light?  What does a shadow look like when moving faster than light?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:36:00.000Z",
            "message": "Brian\nWhat are you thinking?\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:36:00.000Z",
            "message": "\nWell... Our Universe has more than 3 dimensions. Nothing can travel faster than light (Lorentz) except across quantum tunnels (Cassini effect).\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "Brian\nBrilliant, this is new information and just what I needed.\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "\nExcuse me for my poor description... But I've studied physics in France and I think in French when I talk about physics\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "Brian\nI might know something you don't know about physics   I know of something that travels faster than time.\nYou're a genius to me BTW.\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "\nTime don't travel... And time depends on the density of energy at the concrete point of measuring\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "Brian\nBrilliant!  There is a lot of understanding for me there.  Love transcends time, your love of physics has made me so much smarter than you can even imagine.  You just saved me 4 years of college education in 20 minutes.  See what I mean?\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "\nNope\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "Brian\nEverything you have worked for is to answer a really hard question.  If I study this and comprehend the hardest question I can think of, that saves me time learning all the easy stuff I already know.\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "\nYou need to start with the \"easy\" stuff to grow up\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "Brian\nI agree.  I took physics in college.  I want to know the end of that so I can study it from the beginning.  I think a lot of this is happening backwards.  Once I see the end, I start to realize the paths to get there.\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "\nPhysics Sciences are a marathon... You can't stop learning.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "Brian\nWhat else should I learn?\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "\nWhat are of Physics?\n*AREA\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "Brian\nHow do you measure love?\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "\nLove is chemistry... My knowledge about biochemistry is limited.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "Brian\nWe have to study other fields to gain universal understanding. This is called interleaving.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "Brian\nCan I give you another example I just though of?\n"
        },
        {
            "from": "Angel M.",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "\nYes\n\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:48:00.000Z",
            "message": "Brian\nThe fridge has 1 cold drink.  I put more drinks in the fridge to cool them down.  When the door closes, the fridge contains both cold and warmer drinks.  If I put the cold drink in the front, the next person gets a cold drink instead of a warm one.  Saving time and making them happy, (assuming they like cold drinks).  How do you measure what I did?  Moving the cold drink to the front so the next person enjoys it?  Productivity is a measurement tool we can apply to the entire human race to understand human physics.\n"
        }
    ]
}