{
    "thread": "https://www.facebook.com/messages/t/bartlett.marilyn",
    "participants": [
        {
            "name": "Marilyn J Bartlett",
            "description": "",
            "url": "https://www.facebook.com/bartlett.marilyn"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2012-01-02T06:31:00.000Z",
            "message": "Brian\nFeeling better?\n"
        },
        {
            "from": "Marilyn",
            "time": "2012-01-02T16:49:00.000Z",
            "message": "\nMUCH! But I lost two weeks time!!! I had planned to clean/organize my home office - nothing done!  So I have lots to do for the next week - organize, get my taxes in order, plan new class assignments, load my stuff on BlackBoard, etc!! AND I want to get out and play after sleeping for so long!!! I got up Christmas eve and cooked for Christmas dinner - that was it!!! Well, thanks for asking. How's by you??\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-02T18:54:00.000Z",
            "message": "Brian\nI had a great Christmas with the family, then I went to LMFAO in Vegas for New Years Eve with a girl I like.\n"
        },
        {
            "from": "Marilyn",
            "time": "2012-01-02T18:54:00.000Z",
            "message": "\nVegas must have been fun!!!!\nBrian, it is time to visit your grandmother. She isn't feeble or anything, but I can see her slowing down a lot. From now on, every day is a gift! I now check on her twice a day - morning and night.\n\nJack is coming in the next couple of days as Susie needs her other foot operated on. This is going to be an ordeal and Susie will milk it for all the attention she can get. It is just a day procedure so she is going to be a lot of work for Bert.  I expect she'll be laid up for about three  weeks then rehab. Jack will probably stay one week, then I'll step back in to help her.\n\nMike is planning to visit over her birthday and stay an extra week. \nI'd say that whenever you can come would be great. AND you can stay at our house and use my little Accura if you want. Just plan to come.\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-02T18:54:00.000Z",
            "message": "Brian\nI will plan something.  I have trouble getting days off of work because it is a start-up, but my year review should be coming up and I can raise some issues I have.  I may just end up taking a month off and jumping ship.  Would March be good?\n"
        },
        {
            "from": "Marilyn",
            "time": "2012-01-02T18:54:00.000Z",
            "message": "\nYes - perfect. When you call her, You can tell her I asked you when you were planning to visit and you were thinking about March. Then pointedly ask her if it would be easier on her if you stayed with us. Be bold.\nWould you be coming alone or bringing what's her name?? (you just called her \"girl.\" LOL)\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-02T18:54:00.000Z",
            "message": "Brian\nhaha.  My friend Jennifer.  I will ask her about it today.  Our relationship is very platonic, so I will have to let you know.\n"
        },
        {
            "from": "Brian",
            "time": "2015-05-20T18:34:00.000Z",
            "message": "Brian\nWill you come visit us in AZ?  We have extra rooms and we are building a studio apartment.\n"
        },
        {
            "from": "Marilyn",
            "time": "2015-05-21T06:07:00.000Z",
            "message": "\nI would love to come visit. But for now, I can't. It isn't easy traveling with Uncle Paul. His dementia is getting worse.\nBetween the paraplegia and right now he is very angry (belligerent) everything is difficult.\nI'm trying hard to keep him on an even keel, but everything is a fight. Oh and he can't/won't acknowledge the dementia either - that makes it tough too.\nWhen we get to Texas, maybe we can take a trip.\n"
        },
        {
            "from": "Brian",
            "time": "2015-05-22T01:03:00.000Z",
            "message": "Brian\nAww.  I miss you guys.  He always was a stubborn Cullinan.\nAre you going to Jim's reunion?\n"
        },
        {
            "from": "Marilyn",
            "time": "2015-05-22T01:03:00.000Z",
            "message": "\nMaybe!\n"
        },
        {
            "from": "Brian",
            "time": "2015-05-22T01:03:00.000Z",
            "message": "Brian\nWe will probably miss it.  Saving up vacation days so we can go to Switzerland next year.  Just built a hot tub in to the ground.  Adding a studio apartment to rent out to the house to help with the mortgage.  Life with Iga is amazing.\nI always appreciate your political voice even if I come across as a menace.\n"
        },
        {
            "from": "Brian",
            "time": "2016-01-27T16:10:00.000Z",
            "message": "Brian\nHey Marilyn.  Since you are in education I thought now would be a good time to tell you.  I have been working in Ed-Tech for a few years with this really great guy.  We are working on an app called Study Sauce that uses spaced-repetition to help you remember things.  We recently started working with Great Hearts of AZ, but this are going so enjoyably well with the app we would like to expand our efforts soon.  If you get a chance, check out our demo in the Apple App store, the registration code is \"demo\"\n"
        },
        {
            "from": "Marilyn",
            "time": "2016-01-27T16:10:00.000Z",
            "message": "\nI will. Thanks.\n"
        },
        {
            "from": "Brian",
            "time": "2016-01-28T06:22:00.000Z",
            "message": "Brian\nNo, thank you. We plan to add support for college students soon. But you can get the idea of the limitless applications from the demo.\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-11T22:58:00.000Z",
            "message": "Brian\nCome visit.\n\n"
        }
    ]
}