{
    "thread": "https://www.facebook.com/messages/archived/t/brian.korsedal",
    "participants": [
        {
            "name": "Brian Korsedal",
            "description": "Lives in Tuburan, Cebu, Philippines",
            "url": "Engaged to Gina Brigoli"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2015-03-03T16:52:00.000Z",
            "message": "Brian\nDawid referred me, I would love to build a bird house out of a dome like this.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T16:52:00.000Z",
            "message": "\nWhat is your budget?  Steel ain't free.\nHow big of a bird house?\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T16:52:00.000Z",
            "message": "Brian\nProbably at least 12 ft by 12 ft and 12 to 16 ft high.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T16:52:00.000Z",
            "message": "\nO.K.  Your budget on the project would be?\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T16:52:00.000Z",
            "message": "Brian\nNot sure if it should be exactly a dome or some sort of egg shape with a tapered base.  I hope I could spend $400 on materials.\nI would love to help put it together and could find more people to help.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T16:52:00.000Z",
            "message": "\nCome by my house, 501 N 14th street.  I have one in my front yard that I'll sell you for $400.  It's approximately what you are looking for.  Should work.  We can throw it on a trailer and drop it off as a whole unit.\nHit me up before you come over.\n619-495-3740\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "Brian\nCool thanks I would love to check it out.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "\nThis one but without the cover.\nYou'll have to figure out a door for it.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "Brian\nAwesome, and I will cover it in chicken wire.  Are you think the tear drop shape is the one?\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "\n$400 is a bit low for us, but I have that one built in my front yard and I want to get rid of it, so I am willing to give you a deal.  I think it will suit your needs and it's a good deal for you, so I think you'll be happy.\nWe can do other things, but I can't give you a deal on custom work.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "Brian\nYeah, cool.  Plus I can share all the cool things we add to it.  Have you ever built a bird cage before?\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "\nNot yet.  I heard it was a good market.  But we have been super busy.  If you want to build custom bird cages with us, we'd love to work together.\nBut we don't have the bandwidth to build them and market them.\nWe try to partner with people.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "Brian\nYeah definitely.  I will share it with everyone and see if I can find some more buyers.  I want to visit a bunch of community gardens around town where they grow organic vegetables, they usually raise birds and bunnies and that kind of stuff too.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "\nCool. \n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "Brian\nCool, I have already budgeted for some projects for this week, can I come by and next weekend around the 15th and possibly buy and transport the stucture?\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "\nWe'll be around.  Most likely the structure will still be here.  We can't promise that.  You'll need a trailer to move it.  We have a trailer and as long as it's local, we don't mind transporting it.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "Brian\nOk cool.  I live in north scottsdale by scottsdale road and bell/frank lloyd wright.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-03T17:04:00.000Z",
            "message": "\nCool.  That's not far.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "Brian\nI got paid this week.  Do you still have the teardrop sculpture for sale?  Want to bring it up to Scottsdale and I will give you the money?\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "Brian\nOr should I come visit first?\nI meant to come to your lighting event last weekend but I spent the whole day moving my parents appliances.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "\nI can bring it by tomorrow.  You have cash, right?\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "Brian\nYup, perfect!\n6934 E Sandra Ter\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "\nWill it be in your front or back yard?\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "Brian\n85254, right by the Fronk Lloyd Wright statue.\nBack yard but I have a big gate.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "\nAwesome.  Exactly what I was going to ask.  \n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "Brian\nSweet, looking forward to it \nin case you want to call you got my text 480-466-0856 but we will be around all day.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "\nI\nI'll figure out a good time and let you know.  A bunch of friends are coming over and we are having a late night party.\nSo it will probably be later in the day.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "Brian\nok cool!  That's fine.  Fun times, I have the feeling this is going to be the start of something great.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-14T23:12:00.000Z",
            "message": "\nSweet.  \n"
        },
        {
            "from": "Brian",
            "time": "2015-03-15T19:30:00.000Z",
            "message": "Brian\nI am ready whenever you are.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-15T19:30:00.000Z",
            "message": "\nWe shroomed most of last night.\nWe are getting moving now.  Packing up the structure.  Probably over there in about 1 hr or 1hr 30min.  You have cash on hand?\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-15T21:27:00.000Z",
            "message": "Brian\nYes, cash is on hand.  I will save it for the 23rd.\nSounds like a fun party!\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T05:56:00.000Z",
            "message": "Brian\nOn part 130 built the whole thing by myself.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T05:56:00.000Z",
            "message": "Brian\nWhat kind of wire are you using in this?  https://scontent.xx.fbcdn.net/hphotos-prn2/t31.0-8/1167495_522103554528798_531498060_o.jpg\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T15:36:00.000Z",
            "message": "\nExpanded metal lath, but you are probably better off using chicken wire.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T16:45:00.000Z",
            "message": "Brian\nYeah it looks sharp.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T16:45:00.000Z",
            "message": "\nYea, it's for stucco.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T16:45:00.000Z",
            "message": "Brian\nWhat were you building?  I saw one that looked like a turtle fighting pit in your photos.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T16:45:00.000Z",
            "message": "\nha ha, which one?\nThe one with the expanded metal lath?  That was our 4th prototype.  It has some issues.  We are going to make it into a shady thing and string up hammocks and a garden inside it, eventually.\nIt's just sitting on the side of the house right now.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T16:45:00.000Z",
            "message": "Brian\nThere is one with cans and bottles around the base of it.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T16:45:00.000Z",
            "message": "\nThat's a little earthship we built in the backyard.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T16:45:00.000Z",
            "message": "Brian\nI have so many ideas of things to build.  Have you seen these umbrellas with the C shaped stand and holder.  What if we built one 3 times as big and hung a honeycomb shaped chillout room with a big mattress in the middle instead of an umbrella.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T16:45:00.000Z",
            "message": "\nYea, it's all very possible.  \n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:29:00.000Z",
            "message": "Brian\nIts done.  One more connect to make is really hard.\nI forgot to place the hook bolts strategically\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:29:00.000Z",
            "message": "\nCan you send me a pic?\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:29:00.000Z",
            "message": "Brian\nYeah!  I need a break and then I will send it.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:29:00.000Z",
            "message": "\nSome of them stack really bizarre in this one.  Some of the code malfunctioned.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:29:00.000Z",
            "message": "Brian\nhaha I should have known!\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:29:00.000Z",
            "message": "\nYea, we fixed it now, this is an old one.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:29:00.000Z",
            "message": "Brian\nI found one that the label was reversed but It was obvious what direction it goes.\nMe building it wasn't as hot as this: https://scontent.xx.fbcdn.net/hphotos-xpa1/t31.0-8/10845628_10155467098030643_5129211237968849586_o.jpg\nguarantee\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:31:00.000Z",
            "message": "Brian\nguarantee\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:31:00.000Z",
            "message": "\nha ha\nYea, cute girls.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:31:00.000Z",
            "message": "Brian\n\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:31:00.000Z",
            "message": "Brian\n\n\n\nI'll send you more when I have the fence on it and lights and plants hanging everywhere.\nIs this one of your main sources of income or just a hobby?\nI suspect if you build then from the bottom up the structure will droop too much and the last pieces will be too hard to get in.\nAlso what is the tinsel strength on the pipe, do you know how much weight this thing could hold?  Probably at least a ton since its all triangles.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-16T21:31:00.000Z",
            "message": "\nit can hold a lot of weight. I am a semi-retired computer chip designer. This stuff will hopefully be making money sooner or later. I might start flipping houses. Looking into it. I'very taken too much acid to really fit into the corporate world anymore.\nBottom up builds require ladders. It gets tough building in the air. Top down is much faster.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-17T05:01:00.000Z",
            "message": "Brian\nGood idea.  I would love to flip houses.  I can fix all kinds of stuff myself.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-17T21:29:00.000Z",
            "message": "Brian\nShould I tighten these bolts down at all?  I built the whole thing only thumbing them together.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-17T21:29:00.000Z",
            "message": "\nThe tighter, the better.\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-17T21:29:00.000Z",
            "message": "Brian\nok cool\nthis car jack is the same size\n"
        },
        {
            "from": "Brian",
            "time": "2015-03-17T21:29:00.000Z",
            "message": "\nYea, we sometimes use a ture iron when we need a lot of force.\n"
        },
        {
            "from": "Brian",
            "time": "2015-05-25T00:42:00.000Z",
            "message": "Brian\nYou mind if I give you some suggestions on the colorful garden spaceframe craigslist ad?\n"
        },
        {
            "from": "Brian",
            "time": "2015-05-25T00:42:00.000Z",
            "message": "Brian\nYou said you wanted it to be a business so here it goes.  I would lose the wooden pallets completely.  When you combine wood, water, and dirt, you get rot.  That combinations causes all wood to rot, including houses even if the wood is sitting on top of concrete.  Otherwise, the sun shades and metal structure and looks awesome.  It is also awesome if you can built or repair irrigation, but I don't think that service will sell here on it's own because all the Mexicans can do it too.\n"
        },
        {
            "from": "Brian",
            "time": "2015-05-25T00:42:00.000Z",
            "message": "Brian\nIn other news.  I can built and repair hot tubs if you want one.  There are tons on craigslist with problems for like $100 that people have given up on that I can be fixed easily.\n"
        },
        {
            "from": "Brian",
            "time": "2015-05-25T15:49:00.000Z",
            "message": "\nWe do want to get a hot tub.  But we are thinking about using it for an aquaponics setup and having fish in it.  I don't think we want the regular setup with all the checmicals and stuff.\n"
        },
        {
            "from": "Brian",
            "time": "2015-05-25T17:43:00.000Z",
            "message": "Brian\nCool, so save all the extra parts and resell them.\n"
        },
        {
            "from": "Brian",
            "time": "2015-07-11T21:46:00.000Z",
            "message": "\nYou can style your parrot cage like this for shade. I have a friend who could do it. He'd also plant a garden in there to grow off the parrot poop.\nHe trims trees and has LLLOOOTTTT of wood.\n\nHe does seminars on a special type of garden that works good here in PHX. We could have a work shop at your place and use volenteer labor.\n"
        },
        {
            "from": "Brian",
            "time": "2015-07-13T18:02:00.000Z",
            "message": "Brian\nO love it!  What a great idea\n"
        },
        {
            "from": "Brian",
            "time": "2015-07-13T18:02:00.000Z",
            "message": "\nCould you get 10 - 15 neighbors with some pocket change to come out to a seminar to transform your parrot cage into a work of art?  My friend and I are looking to jumpstart business and it would help us.  We'd charge $10 per head to cover cost of time and materials.\nMaybe $20 per head.\n"
        },
        {
            "from": "Brian",
            "time": "2015-07-13T18:02:00.000Z",
            "message": "Brian\nI don't think I have 15 friends here.\n"
        },
        {
            "from": "Brian",
            "time": "2015-07-13T18:02:00.000Z",
            "message": "\nLol.\nHow many do you think you could get?\n"
        },
        {
            "from": "Brian",
            "time": "2015-07-13T18:02:00.000Z",
            "message": "Brian\nMy wife and I will always help our friends out.  Dawid and my friend Chris are pretty reliable.\n"
        },
        {
            "from": "Brian",
            "time": "2015-07-13T18:02:00.000Z",
            "message": "Brian\nI'll talk it over with her and maybe we can come up with some creative way to advertise it.  We are almost finished converting this patio space in to a rental studio apartment, so a lot of income hinges on that.  But next month when everything is rented out, maybe we could sponsor our tenants to learn how to garden and we will trick some other people in to coming over for a party.\n"
        },
        {
            "from": "Brian",
            "time": "2015-07-13T18:02:00.000Z",
            "message": "\n"
        },
        {
            "from": "Brian",
            "time": "2015-11-16T21:54:00.000Z",
            "message": "Brian\nProbably eventually you would have enough shapes you can just snap the ones you want together for the size stage you need.\nDo you take stages to burning man?\n"
        },
        {
            "from": "Brian",
            "time": "2015-11-16T21:54:00.000Z",
            "message": "\nPeople take my art to Burningman.  Sometimes I go.  Sometimes I don't.\n"
        },
        {
            "from": "Brian",
            "time": "2016-03-17T17:45:00.000Z",
            "message": "Brian\n\nBird cage at night\nCovered in hardware cloth and some leaves and sticks\nFeel free to repost at will\n\nStitched it together with steel tie wire.\n\n\n\nMade a cat habitat in the trees too out of chicken wire.\n"
        },
        {
            "from": "Brian",
            "time": "2016-03-17T17:45:00.000Z",
            "message": "Brian\nBird cage at night\nCovered in hardware cloth and some leaves and sticks\nFeel free to repost at will\n\nStitched it together with steel tie wire.\n\n\n\nMade a cat habitat in the trees too out of chicken wire.\n"
        },
        {
            "from": "Brian",
            "time": "2016-06-05T05:42:00.000Z",
            "message": "Brian\nI am building a roller coaster. How involved in this algorithm are you? Could you help me find 2 or 3 standard curves that adjust a layout to fit. So I can build the 10ft sections modularly and it still be entertaining?\nWhat if we adapt your algorithm to take shape of pipe and \"generalize\" the shape so it makes minor adjustments to the design to fit that parameters of the material?\nSo basically all your pipes become interchangeable. And you only have to work with pipe A,B or C\nEach one has a specific purpose but you can make any shape if you make small adjusments to the design.\n"
        },
        {
            "from": "Brian",
            "time": "2016-06-05T15:01:00.000Z",
            "message": "\nIt\nIt's possible, but it would have a really big income stream to justify writing it.\nWe like how our system works and the income stream is starting to shape up, so we are not inclined to change it.\nWe can build you a frame that would support a roller coaster, except you would have to attach rails to it.  It wouldn't be too difficult.\n"
        },
        {
            "from": "Brian",
            "time": "2016-06-05T22:36:00.000Z",
            "message": "Brian\nIt's ok, I'll figure it out.  I am more interested in building something modular that can be disconnected and reconnected easily.\n"
        },
        {
            "from": "Brian",
            "time": "2016-07-09T04:31:00.000Z",
            "message": "Brian\nHow much for arches like the black part in this picture?  Probably as few triangles are structurally possible, and has to support a few 2x4s worth of wood:\n\n"
        },
        {
            "from": "Brian",
            "time": "2016-07-09T20:49:00.000Z",
            "message": "\nWe can make something like those arches.   Probably in the $1000 range.\n\n"
        }
    ]
}