{
    "thread": "https://www.facebook.com/messages/archived/t/christian.mchugh",
    "participants": [
        {
            "name": "Christian McHugh",
            "description": "Works at Dun & Bradstreet",
            "url": "Works at University of North Texas System"
        }
    ],
    "messages": [
        {
            "from": "Christian",
            "time": "2009-08-09T12:43:00.000Z",
            "message": "\nI\"ve just moved to Texas! Kind of crazy since I had a no texas rule. Now working for the University of North Texas in Denton. Wooo\n"
        },
        {
            "from": "Brian",
            "time": "2009-08-09T23:46:00.000Z",
            "message": "Brian\nDude, that sounds like a great adventure!  Kind of out of the blue though isn't it?  How did you leave things at work?  Hope your having a great time!\n"
        },
        {
            "from": "Christian",
            "time": "2009-08-11T03:25:00.000Z",
            "message": "\nHopefully everything at nau is going well. I gave 'em the standard two weeks. But yeah; sorta sudden. I was sending out job apps, but only half-heartily. \n\nIt is sorta a big adventure in that I still don't have a place to stay (made an offer on a house today so we'll see where that goes) and I don't know anyone here  But it does seem to be a hip town, so that can change.\n\nWork-wise everyone seems really great. So hopefully time won't show this to be bad idea.\n\n"
        },
        {
            "from": "Brian",
            "time": "2009-08-11T03:25:00.000Z",
            "message": "Brian\nYeah sounds great!  Have fun man, this is probably the best time in your life to do whatever you feel like!  Keep in touch though, tell me when you are coming back to visit and I'll throw a BBQ for you and all the old guys from work.\n\nI have been in Hawaii for the last week and Europe before that.  I probably will never get another chance like this in my life.  Haven't had time to work on my site, but I guess I am not really missing it.\n\nLooking forward to the new semester, should be pretty fun.\n"
        }
    ]
}