{
    "thread": "https://www.facebook.com/messages/archived/t/cliff.cavanaugh.5",
    "participants": [
        {
            "name": "Cliff Cavanaugh\n(seajay)",
            "description": "Retired",
            "url": "Widowed"
        }
    ],
    "messages": [
        {
            "from": "Cliff",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "\nAccidentally deleted your request. Think I rectified situation hope so. Meant to accept your request.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "Brian\nI have started writing down every \"coincidence\" that I notice, at the end of my life I will be able to prove how my reaction led to my success.  I can only prove it at the end with productivity, but practicing it helps me realize the opportunities now!\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "\nQuite an endeavor.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "Brian\nWe need to discount every political post we come across with positive logic and reason.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "\nThat is a job.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "Brian\nI am tired of the trash from the media outlets.  I agree its too much work.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "\nI have not found a media outlet I trust anymore.\nThey all have a great deal of spin\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "Brian\nI agree 100%  Its awful.  They change their headlines based on their audience.  How do we fight that?  By everyone trolling with positivity and changing their minds.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "\nI guess. Look at all the coverage trump has gotten. & fox news blatantly biased lies.\nGotta go.  Later.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "Brian\nI agree.  But does it come from honesty, how is more honest, Trump or Hillary?\nSee what I mean by hard questions?\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "\ntrump lies so much the Republican networks have started fact checking him.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:21:00.000Z",
            "message": "Brian\nPolitics is a huge waste of time.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T21:44:00.000Z",
            "message": "\nWent to sleep in my chair.\nWhacked out today.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T21:44:00.000Z",
            "message": "Brian\nYeah I was really foggy yesterday after watching Waking Life with my wife. Everything made sense this time, it didn't 10 years ago to me.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T21:44:00.000Z",
            "message": "\nI don't think I ever saw that.  I couldn't sleep last night so I took a herbal medicine. Maybe I took much.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T21:44:00.000Z",
            "message": "Brian\nWhat do you get out of the herbs? Waking Life is very smart. And not religious even if it sounds like it.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T21:44:00.000Z",
            "message": "\nI am a night person by nature, living in a day world sometimes if I don't take something I will be awake until 7 am & I will return to being a real night person. I worked nights for years because of it.The only herbs I take are valerian & melatonin.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T21:44:00.000Z",
            "message": "Brian\nSo you are aware of circadian rhythm?\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T22:26:00.000Z",
            "message": "\nOh yes & mine is backwards to what I need.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T22:26:00.000Z",
            "message": "Brian\nHow can I help?  What time is it now?\nI am ahead of my time.  I can help!\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T22:26:00.000Z",
            "message": "\nWell I have lived with it all my life. So I just deal with it. I will not take prescription sleep meds. Just herbals. But it looks like as I get older those need to be cut back. Happens 3 or 4 times a year.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "Brian\nI am completely against prescriptions, I took Retalin as a child and my kidneys are weak.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "\nRitalinis a terrible drug they used to give to a kid because he asked too many questions or was the least bit active. They wanted classrooms full of zombies & school doctors were quacks.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "Brian\nOne of my posts got reported and removed \nExactly my experience with school.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "\nWas your post that bad? I keep getting called away.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "Brian\nLol that's ok. I am sure it is more important. An emo girl called me creepy and probably reported me.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "\nI don't do much important. Anymore.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "Brian\nI disagree.  I think everything you do is important to you.  You spent hours today talking to a total stranger about it.  I appreciate your honesty more than I can ever explain.  You taught me something valuable today.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "\nI enjoy it. I am retired & time is what I have a lot of.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "Brian\nOh awesome!  My wife's step dad is retired, he spends all his time on art projects.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "Brian\nYour entire conversation helped me speak to my estranged father and have a more informed conversation with him about his views on responsibility and my generation.  You have made an impact on me that extends yourself.  That is where I started this conversation talking about God.  I see God in you.\n"
        },
        {
            "from": "Cliff",
            "time": "2016-10-08T23:53:00.000Z",
            "message": "\nI am an atheist.\nI am glad to be of help. But I did not think our conversation was that important. Just banter.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T00:08:00.000Z",
            "message": "Brian\nWhat's more important to me is understanding your existence.  In some small way if I am ever encountered with this, I'll have some understand of where the conversation is going.\nPlus if you watch Waking Life and like it, then I will have a positive affect on you too.\nPeople are so afraid to have a personal conversation online we just spew our comments out with little regard for the noise it created.\n\n"
        }
    ]
}