{
    "thread": "https://www.facebook.com/messages/t/corinne.cullinan?filter=unread",
    "participants": [
        {
            "name": "Corinne Cullinan",
            "description": "In a relationship",
            "url": "https://www.facebook.com/corinne.cullinan"
        }
    ],
    "messages": [
        {
            "time": "2012-05-14T18:34:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nhi \n"
        },
        {
            "time": "2012-05-14T18:34:00.000Z",
            "from": "Brian",
            "message": "Brian\nhey"
        },
        {
            "time": "2012-05-14T18:34:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nwhats upp\nI want to come see you this summer"
        },
        {
            "time": "2012-05-14T18:34:00.000Z",
            "from": "Brian",
            "message": "Brian\nyou should!"
        },
        {
            "time": "2012-05-14T18:34:00.000Z",
            "from": "Corinne",
            "message": "Corinne\ni knoww. i hope dad will let me. school is really tough right now but I'm hoping to give him some good news later this week. im working on transferring to OSU\nhow are things?"
        },
        {
            "time": "2012-05-14T18:34:00.000Z",
            "from": "Brian",
            "message": "Brian\nSo you can't come to LiB?"
        },
        {
            "time": "2012-05-14T18:34:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nnah. it's not very good timing. and my grades aren't that great this quarter. but this summer for sure"
        },
        {
            "time": "2012-05-14T18:34:00.000Z",
            "from": "Brian",
            "message": "Brian\nOh \n"
        },
        {
            "time": "2012-06-03T03:03:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nr u seriously married?\nthat is crazyyyy"
        },
        {
            "time": "2012-06-03T04:13:00.000Z",
            "from": "Brian",
            "message": "Brian\nyes\nseriously\nwe will have a party in Italy.\nYou will come"
        },
        {
            "time": "2012-12-17T05:09:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nwaahhhttt?? I have a brother??? lol\nI haven't seen you in MORE THAN A YEAR you know.\nand I have yet to meet my sister in law.\nwhen am I going to see you again!? ...ski trip? Dad HAS to take me if there is a trip this year. but dad tells me your doing really well with your job and it might be hard to get time off.\nAll is good on my end. Just had finals week and I'm off until January 14th. And my 21st birthday is coming up! I'm pretty excited. I can finally go out with you guys when you come to town again. \n\nanyway, I miss you. I hope you're having a great holiday season  w/ the new family (Iga + Ewok lol)\nlove you, talk to you soon!"
        },
        {
            "time": "2013-05-28T01:36:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nhey i got to meet seans wife today! I haven't seen him in forever. and one of his... step-daughters? he introduced me to her as his daughter but i know he doesn't have a 14 yr old daughter! lol. \n he seems really happy. I hope u guys had a good memorial day"
        },
        {
            "time": "2013-05-28T02:48:00.000Z",
            "from": "Brian",
            "message": "Brian\nOh good!"
        },
        {
            "time": "2013-06-12T23:18:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nr u online? who is patrick lee? he friended me and he's friends with u judy dad and like other people in our fam put i can't place him.."
        },
        {
            "time": "2013-06-12T23:18:00.000Z",
            "from": "Brian",
            "message": "Brian\nhe's the gay guy\nthat's married to the guy who did catering for the last reunion"
        },
        {
            "time": "2013-06-12T23:18:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nooOoo.. i dont really remember him but I will accept \n how r u guys doin?"
        },
        {
            "time": "2013-06-12T23:18:00.000Z",
            "from": "Brian",
            "message": "Brian\nawesome.\nI started a new project that could sit on a billion dollars.\nI am going to piss a lot of people off."
        },
        {
            "time": "2013-06-12T23:18:00.000Z",
            "from": "Corinne",
            "message": "Corinne\ngood \n hopefully u can elaborate sometime soon in person. that's awesome! why is it gonna piss ppl off?"
        },
        {
            "time": "2013-06-12T23:18:00.000Z",
            "from": "Brian",
            "message": "Brian\nI am creating a fully encrypted e-mail service that is 100% easy to use and secure."
        },
        {
            "time": "2013-06-12T23:18:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nthats awesome!\nespecially now. people would love that"
        },
        {
            "time": "2013-06-12T23:18:00.000Z",
            "from": "Brian",
            "message": "Brian\nyes, especially because of the NSA"
        },
        {
            "time": "2013-06-12T23:18:00.000Z",
            "from": "Corinne",
            "message": "Corinne\ncrazy shit happening in us \n"
        },
        {
            "time": "2016-02-24T20:59:00.000Z",
            "from": "Corinne",
            "message": "Corinne\ntxt me! I don't have ur number. I got a new phone and for some reason my phone didn't back you up to my google contacts."
        },
        {
            "time": "2016-11-30T00:22:00.000Z",
            "from": "Brian",
            "message": "Brian\nCan you send me a video of you singing again?  I lost the link"
        },
        {
            "time": "2016-11-30T15:38:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nI don't think I have a video of me singing. I think they were on my old facebook but that is deleted. If I make another one ever I'll be sure to link you."
        },
        {
            "time": "2016-12-04T19:50:00.000Z",
            "from": "Brian",
            "message": "Brian\noh\nWe're losing data."
        },
        {
            "time": "2017-08-27T17:34:00.000Z",
            "from": "Brian",
            "message": "Brian\nDid you move to Denver?  \n$70\n flights from Phoenix, we will come visit.  I can't wait to go skiing this year, I need the exercise."
        },
        {
            "time": "2017-09-30T19:30:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nHey big bro, sorry I haven't gotten back to you for a while. How's everything been? Yes, I moved to Denver. I guess I have been avoiding having to talk about dad and I still am not really ready to. \n But I know that's no reason to avoid you because I'm sure you respect that. it sucks and it hurts what he did and said. I'm sure you've heard his side of the story. I swear, he has no idea who I am, Brian. I hope you and Iga are doing good. I'd love for you guys to visit or for me to come visit you when I can. I'm trying to find work out here still, I haven't been trying my hardest but I'm kicking it into high gear now. We are only about 12 hours from each other now!! Anyway, let me know how things are going, my mom said she saw on linkedin that you got a new job? How are the pups?"
        },
        {
            "time": "2017-09-30T23:15:00.000Z",
            "from": "Brian",
            "message": "Brian\nYeah, things are really good. Come visit!  Or we will fly to you since it's only like an hour flight.  I haven't talked to dad about much, he just said you moved and you wanted a dog before that."
        },
        {
            "time": "2017-10-02T15:31:00.000Z",
            "from": "Brian",
            "message": "Brian\nMaybe he is only capable of having a friendship with one person at a time. I don't know. I know my Asperger's is way worse than I thought it was. That's what I learned from 2016.  Flagstaff is really nice, kind of like Denver's climate.  I have been working on some automation stuff at work."
        },
        {
            "time": "2017-10-02T18:45:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nWe should make plans as soon as I settle into a new job. Eric starts his new job this week. Yeah, we got our pup she's 6 months now, a female german shepherd, Riley. She's an awesome dog, I've been training her myself and I'm actually pretty good at it. Yeah, I'm not sure why he is the way he is. I just keep thinking about something he said to me a while back... that all he wants is to make the people around him happy. The thing is though is that he thinks he knows what people need/want to be happy and doesn't understand when its different than the way he sees it. It's just a lie. I went to my stepbrothers wedding in Chicago in August and it tugged on my heart the way the brides father spoke about her and it made me sad that I'll never have that. I've just been reminding myself that it's nothing I've done (even tho that's what he probably thinks and how he makes me feel sometimes), that he's just not capable of having the feelings other dads have for their children. It's not normal.\nI didn't know you had Aspergers. What's that like? We've had a good summer here in Denver and have gone on lots of adventures exploring the mountains. It's been so cold lately though! I was getting to be seriously unhappy in Columbus, stressed and anxious all the time. I told you I was having extreme headaches and I got an MRI to make sure I was ok. That's when I knew I needed to change my life. I thought, if I only had a few months to live or found out I was dying is this really how I'd continue my life? Life is too short and I decided to go after something bigger. I've been getting into furniture design and really want to try starting my own thing and working for myself. That would be ideal. Since coming out here though I've had no headaches due to stress or anxiety and I feel more at peace with myself. It just feels right and I thought I would miss Columbus more but I don't. I'm glad I did it instead of looking back ten or so years later wishing I had gone for it, you know?\nAnyway, I gotta run \n I love you bro, tell Iga I say hi and love her too. Give the pups a tummy rub for me. \n"
        },
        {
            "time": "2017-10-03T18:38:00.000Z",
            "from": "Brian",
            "message": "Brian\nI am not sure what causes the pressure build up in the head.  I try to enjoy it and pretend it's just blood-flow.  It feels like I am on the brink of a headache all the time, like if it wasn't for drinking lots of water I would get a migraine while I'm trying to work.  It could also be one of many poisons we ingest everyday.  I hope you are eating organic, more vegetable and less meat, that it was modern nutrition tells us which is grossly different from what the FDA recommends. \nThe fresh mountain air should do you some good, as well as the beautiful hiking all around the south west.  I am glad you moved and you are closer.\nWe will come visit as soon as you are ready, and you're always welcome out here.\nAs for the family stuff, Iga and I realized if you can't have the family you want, you can make your own!  It's still just talk though.\nJimbo will never be the nurturing father, and my mother is just as bad, she's overweight and watches a lot of TV and bullshit news.  They have no better list of priorities than anyone else.  Which is sad because millennials can't prioritize either.\nIf I had to put it in order it would be 1) God, 2) Food, fresh water, sleep 3) Wifey 4) Father, mother, family.  5) Work.  But I am sure I mix up that order all the time.\nThis is what living with Asperger's is like:\nhttps://www.facebook.com/megamindbc/posts/10102142130066248\nLiving with Asperger's is like having no ability to determine the quality of the conversation you are having.  Unless someone is completely, almost blatantly rude about what they think of you, there is no understanding of emotional interaction.\n\nBrian Cullinan"
        },
        {
            "time": "2017-11-13T03:58:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nHey Bri, how was your day? Hope you had a nice Birthday. How's life going? You and Iga look great in those wedding photos."
        },
        {
            "time": "2017-11-13T05:37:00.000Z",
            "from": "Brian",
            "message": "Brian\nYeah it was fun."
        },
        {
            "time": "2017-11-14T23:56:00.000Z",
            "from": "Brian",
            "message": "Brian\nQ: How do you cure a headache?\nA: Put your head through a window and the pane will just disappear!"
        },
        {
            "time": "2017-11-22T00:28:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nLol where are you getting these jokes? I had the craziest dream last night and you and Iga were in it! She was pregnant! Uncle Jack was in it too and a few other people. I invented this strange communal coffee contraption and we were all trying it.\n\nHope you guys have a good Thanksgiving on Thursday!"
        },
        {
            "time": "2017-11-22T00:28:00.000Z",
            "from": "Brian",
            "message": "Brian\nI love coffee contraptions!\nHow is CO?"
        },
        {
            "time": "2017-11-23T03:42:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nYeah it was like, circular in design like how you'd sit around a hooka and each person had a clear scooper with bubbling coffee and the top held a tray for cookies and little shots of milk. Wild! CO has been good, the weather has been awesome and the pup has been so ornery getting through her teen phase but it's been fun. I'm headed to the store to pick up some last minute Thanksgiving items so I'll ttyl! \n"
        },
        {
            "time": "2017-11-23T15:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nGood! We are celebrating, when will you be visit?"
        },
        {
            "time": "2017-11-23T17:13:00.000Z",
            "from": "Brian",
            "message": "Brian\nI'm thankful for you!!"
        },
        {
            "time": "2017-11-23T19:45:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nSame!! We have been cooking pretty much all morning. Doing turkey breast, green bean casserole, corn casserole, cheesy potatoes and a dutch apple pie! Riley is going to get her own doggified plate. \n Hope you guys are having a good day!"
        },
        {
            "time": "2017-12-07T22:01:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nHow's it going? What are these bots you are creating? what do they do? I tried to go to megamind.bot but my browser said it was an insecure connection."
        },
        {
            "time": "2017-12-07T22:01:00.000Z",
            "from": "Brian",
            "message": "Brian\n\"Would have run \\\"Good UX Intro.ipynb[0]\\\" but you don't have permission.\"\n Mm\nHaha, my bot replied to your use of the word megamind, I should probably limit that to the beginning of the message."
        },
        {
            "time": "2017-12-08T02:34:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nSo I can talk to the bot thru messenger? Hello bot! What is your purpose?"
        },
        {
            "time": "2017-12-11T17:03:00.000Z",
            "from": "Brian",
            "message": "Brian\nHas to start with \"megamind ...\""
        },
        {
            "time": "2017-12-18T16:47:00.000Z",
            "from": "Brian",
            "message": "Brian\nDoes existence require a purpose?"
        },
        {
            "time": "2017-12-19T22:02:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nHmmmmmmm.. I don't think so. Maybe. Your choice of the word require is what I'm getting hung up on. What's the purpose of the question? lol"
        },
        {
            "time": "2017-12-21T17:48:00.000Z",
            "from": "Brian",
            "message": "Brian\nI think we understand each other.  How are you feeling?  What is going on in CO?  When can we get together?  Also, you shouldn't stop talking to your parents.  We have to teach Jim to \"feel\", by being emotionally open people ourselves.\nIt might be his last chance before he dies.  He never meant to hurt anyone."
        },
        {
            "time": "2017-12-21T19:44:00.000Z",
            "from": "Brian",
            "message": "Brian\nnvm, it's hopeless.  Respond to the other stuff when you get a chance.  We'd love to see you."
        },
        {
            "time": "2017-12-21T19:44:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nHey! Just saw these messages. Things are going good. I start a new job next month and I'm pretty excited about it, I'll be working downtown in a pretty tall building that looks out to the mountains. The team seems pretty cool too, some people my age so hopefully I can make some friends. Idk when we can! I'm planning a trip to cbus hopefully in spring/summer and then a trip in september to isle of palms and hopefully I'll be able to stop and see grandma.\nI guess I just haven't been ready to talk to Dad yet. When I think about replying to his last email I just don't have any words. I don't know what is truth and what is lies with him. I really thought our relationship had been getting better the last few years and he was quick to forget about all our happy memories and said some really awful things to me that I won't ever be able to forget. I miss him and Olena, or rather I miss what I thought we had. I feel like as I grow older the more I understand him and his ways. I want to talk to him, of course I've been thinking about it more because of the holidays. I will, I just need some time to figure out my thoughts and what I want to say. \nI'd love to see you guys too. Let me settle into this new job and figure out how my PTO days are going to be and we will plan something out. Whether we come to you or the other way around. \n What are your Christmas plans?"
        },
        {
            "time": "2017-12-21T19:44:00.000Z",
            "from": "Brian",
            "message": "Brian\nProbably spending the day with Ela and Iga in Flagstaff, then coming back before Christmas day at Linda's here in Phoenix.  I guess all I meant was, there's way more bullshit in this world than I thought 10 years ago when I started college.  If you keep talking to dad about different, maybe we can sift through the bullshit and find a gems to help us later in life.  I don't want to miss our only chance at a legacy."
        },
        {
            "time": "2017-12-25T20:47:00.000Z",
            "from": "Brian",
            "message": "Brian\nMerry Christmas!"
        },
        {
            "time": "2017-12-26T01:08:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nMerry Christmas hope it's been great!!"
        },
        {
            "time": "2018-01-03T21:30:00.000Z",
            "from": "Brian",
            "message": "Brian\nBe careful talking to family in the middle of legal proceedings.  Don't say something that could hurt one side or the other.  Not assuming you would, just a warning I have had on my mind the last week."
        },
        {
            "time": "2018-01-04T00:14:00.000Z",
            "from": "Corinne",
            "message": "Corinne\nIs some of your family going thru legal proceedings? Hope all is ok. How was your new year? We didn't really do much. It's weird not being on eastern time and seeing the ball drop then being like... okay now, two more hours till midnight! \n haha"
        }
    ]
}