{
    "thread": "https://www.facebook.com/messages/archived/t/craig.bird.58",
    "participants": [
        {
            "name": "Craig Bird",
            "description": "Project Consultant at QuakeWrap, Inc.",
            "url": "Lives in Tucson, Arizona"
        }
    ],
    "messages": [
        {
            "from": "Craig",
            "time": "2010-04-15T02:26:00.000Z",
            "message": "\nHey Brian,\n\nI own an energy efficiency company here in Flagstaff. We provide energy audits to homeowners and make recommendations to reduce the homes energy and water usage. We also provide green building consulting services.\n\nWe are currently looking for a paid intern to complete some modifications to our website. It is not a lot of pay but we wanted a student to get something for their efforts and learn some important web development skills in the process.\n\nThe only requirement is that the student has experience building sites in the Joomla CMS and some graphics experience.\n\nI have sent this to the officers listed on your Facebook page for the ACM group. Let me know if you know anyone who would be interested.\n\nCraig Bird, BPI Building Analyst, HERS Rater\nReGroup\nEnergy Audits, Efficiency Retrofits and Green Building Consulting\nwww.RegroupConserve.com\nCell - 928-255-5564\nAttachment Unavailable\nThis attachment may have been removed or the person who shared it may not have permission to share it with you.\n\n"
        },
        {
            "from": "Brian",
            "time": "2010-04-15T17:52:00.000Z",
            "message": "Brian\nGraig,\nThis sounds like an excellent opportunity to make a little money and participate in a great field of work.  Fortunately, I am currently in the process of looking for some small development jobs this summer so that I can stay in Flagstaff; so I would be very interested in the opportunity.  Although, graphics are not my specialty, I do have some graphics experience and can touch up the design and layout of websites.  I do have a lot of experience with Content Management Systems, such as Joomla, Drupal, Wordpress, and MediaWiki.  I am actually a huge fan of Drupal, because of their enormous community, and security scheme.  I am sure that I am not the first person or the last to respond to this job offer, so for now, I’d like to direct you to my online resume as well as a list of sites I’ve recently been working on.\nFor capstone: My teammate created the design, and I wrote some utilities that tie in to the CMS for our client to take advantage of.  This can be found here: http://capstone.bjcullinan.com\nFor my resume and my personal website, can be found here: http://bjcullinan.com\nI have also been working on an open source project written in PHP, I created a website for it, and information about the project can be found here: http://monolithicmedia.org\nI would enjoy working together this summer, and I hope to hear from you soon.\nOrganizations Who Benefit From Our Fund-Raising | Arizona Major League Alumni\nFormed in 1987, our mission is to promote the game of baseball, involve major league players in community activities, inspire today's youth through positive sports images, and raise funds to support important charitable causes.\ncapstone.bjcullinan.com\n"
        }
    ]
}