{
    "thread": "https://www.facebook.com/messages/archived/t/dawid.szmyd.90",
    "participants": [
        {
            "name": "Dawid Szmyd",
            "description": "proffesionol idealizer that creates what he says hes going to do at THE PLOT",
            "url": "Studies myself at Harvard University"
        }
    ],
    "messages": [
        {
            "from": "Dawid",
            "time": "2015-04-04T21:17:00.000Z",
            "message": "\nSATURDAY – Red Bull Thre3style USA National Final ft. Z-Trip, Four Color Zack, Trentino\nRed Bull Thre3Style is a DJ contest that will rock the house all night! Crowd reaction, technique and the art of party rocking are what makes this the new school DJ contest. DJ’s are judged on track selection, creativity, mixing skills, stage presence and crowd reaction. Each DJ gets one 15 minute..…\nrelentlessbeats.com\n"
        },
        {
            "from": "Dawid",
            "time": "2015-04-23T15:32:00.000Z",
            "message": "\nGlowing Murals Turn Dark Rooms Into Dreamy Worlds\nWhen the lights go out, these glowing murals transform dark rooms into dazzling, dreamy worlds.\nwww.earthporm.com\n"
        },
        {
            "from": "Dawid",
            "time": "2015-04-23T15:32:00.000Z",
            "message": "\nPlay\t\n-1:48\nAdditional Visual SettingsEnter Fullscreen\tUnmute\n\nJay Russell added a new video.\nWTF - What would you do: Run or Fight?\nJay Russell\n"
        },
        {
            "from": "Brian",
            "time": "2015-04-23T19:20:00.000Z",
            "message": "Brian\nThat painting is awesome.\nLol I am totally doing that if someone ever tries to fight me\n"
        },
        {
            "from": "Dawid",
            "time": "2015-04-23T19:20:00.000Z",
            "message": "\nMe too\n"
        },
        {
            "from": "Brian",
            "time": "2015-04-23T20:28:00.000Z",
            "message": "Brian\nDon't see how people sleep with all this glow in the dark paint.\n"
        },
        {
            "from": "Dawid",
            "time": "2015-04-23T23:51:00.000Z",
            "message": "\nThey eat exctasy every night\n"
        },
        {
            "from": "Brian",
            "time": "2015-09-06T05:34:00.000Z",
            "message": "Brian\nI hope you do this to people when you see them liter.  So disgusting how people act without thinking or care for anyone but themselves.\nPlay\t\n-1:12\nAdditional Visual SettingsEnter Fullscreen\tUnmute\n\nWhiteboy7thst added a new video.\nKarma.\nWhiteboy7thst\n"
        },
        {
            "from": "Dawid",
            "time": "2015-09-08T00:14:00.000Z",
            "message": "\nI've seen that. I do that all the time! Humans just suck period! Less humans less trash!!!!!!\n"
        },
        {
            "from": "Brian",
            "time": "2015-09-08T22:32:00.000Z",
            "message": "Brian\nThat's awfully nihilist of you.  I think its funny.  People are welcome but if you dump, I'll dump on you.\n"
        },
        {
            "from": "Dawid",
            "time": "2015-09-08T22:32:00.000Z",
            "message": "\nHumans are the problem period! Just be animals as we are. Humans are the only species that will smile at your face then think shit and talk shit in their mind! \n\nI'm a realist not a nihilist!  I call it out how it is no matter how bad it hurts ones feelings. You can talk to Iga about eastern bulk straight forward not lying! America is full of smiles with lies!\nIed rather frown and spit out what's on my mind rather then say thank you smile and stab your back while you turn!\n\nEye for a eye! Live by the knife get cut by the knife! Live by trash be trash. Easy!\n"
        },
        {
            "from": "Brian",
            "time": "2015-09-09T01:12:00.000Z",
            "message": "Brian\nIf you can't beat them, join them. zdrajca zdrajca uciac mu jajca\n"
        },
        {
            "from": "Dawid",
            "time": "2015-09-09T01:12:00.000Z",
            "message": "\nNow your talking! If your gonna watch flys fly over shit might as well see what all the commotion is all about! Just don't land on the shit like the rest of them!\n\n"
        },
        {
            "from": "Brian",
            "time": "2016-07-17T01:18:00.000Z",
            "message": "Brian\nHey buddy, hows it going?\nDo know anyone, or jews, that might want a silver German belt buckle from WWII?\n"
        }
    ]
}