{
    "thread": "https://www.facebook.com/messages/archived/t/diane.amos.37",
    "participants": [
        {
            "name": "Diane Amos",
            "description": "",
            "url": "https://www.facebook.com/diane.amos.37"
        }
    ],
    "messages": [
        {
            "from": "Diane",
            "time": "2009-08-15T16:35:00.000Z",
            "message": "\nYou must be one of the luckiest guys around at least in travel land this summer!   Great pics of both trips...WOW!\n\nI know I'm the enemy and get that...just wanted to drop in and say hi; tell ya I miss you and what you're all about (especially that wacky sense of humor & huge capacity for love); and will always cherish those hilarious times we've had along with the discussions on so many topics.\n\nJust been thinking of you alot...you were part of my family for quite awhile and that doesn't stop in my heart because your dad and I couldn't get it together.  I was never \"just another one of dad's bimbos\" .  LOL   I still chuckle over that first meeting!   You've come along way baby!!\n\nStay special Bri and I don't mean the short bus special!\n\nLove, \nDiane\n"
        },
        {
            "from": "Brian",
            "time": "2009-08-17T04:36:00.000Z",
            "message": "Brian\nWe did have some wonderful times.  I have changed (for the better) so much since we last spent time together.  I recently broke up with my girlfriend, but I am dealing with it.  Crystal, the one you met last fall, we decided we were incompatible (it was mutual).\n\nI have been trying to take a more positive outlook on every situation to combat the curse of my father.  Corinne seems to be having some love troubles too, but nothing she won't get over.\n\nI never thought of you are the \"bad enemy\", but instead realize you both have some craziness build it to who you are.  And I miss the fun times we had, like how I could just stand there and you would come around the corner and flip out.\n\nI have a lot to do before school start, but I hope we can talk again soon.\n\nLove,\nBrian\n"
        },
        {
            "from": "Diane",
            "time": "2009-09-02T23:12:00.000Z",
            "message": "\nThought you might like this!  Not quite a roller coaster but WOW!\nAttachment Unavailable\nThis attachment may have been removed or the person who shared it may not have permission to share it with you.\n"
        },
        {
            "from": "Brian",
            "time": "2009-09-03T06:51:00.000Z",
            "message": "Brian\nThanks for the link!\n"
        },
        {
            "from": "Diane",
            "time": "2009-11-06T17:45:00.000Z",
            "message": "\nHey cutie.... what is the name of the website where you purchase your geek wear???  I've been dating a major geek and this site would be right up his genius alley!  I need Christmas idea along w/ just surprise deliveries \n\nAlso...would you be interested in helping me w/ my website for my tax biz...paid of course... wouldn't be for a few weeks... got lots to do on my end first.  Don't worry about it if you can't... I know you're good so you were my 1st pick... \n\nYou doing good?   All good here...great really.  Zach, my youngest (don't think you met him..not Florida boy), is engaged & getting married next summer!  So fricken exciting..his girlfriend (oops...finance') is awesome and they are an incredible match...  this will sound weird (but it's from me!) but it's like when you are with them together you just feel the energy and in-syncness of the two of them... like they're spoonin' out loud but not visible.  Yeh, weird I know but so very cool.   YOU\"LL BE NEXT!!!! One never knows Bri!\n\nI have more very cool youtube videos to send ya...glad you like the last one...  soon I'll send them... time is like a blink these days!  Can't believe we're in turkey day month.\n\nAnyone new in your life Bri...I'm talkin' romantically not day to day  casual unless there's a very interesting character you'd like to share about.\n\nJust thinkin of ya today ...go figure..!\n\nLove ya kiddo as always & miss that sarcastic wit!\nDiane\n\nps   I had nothing to do w/ that letter concerning your dad...I got a copy anonomously (sp?) myself like back in May/June, can't remember... no one on my end will ever see the sucker..wicked bad stuff... thought you should know since it shook up Corinne  ...  we've limited contact as you suggested but she's still my girl but under the radar always... don't want anything to screw up her & your dad or you... i get it goofy boy\n"
        },
        {
            "from": "Brian",
            "time": "2009-11-06T17:45:00.000Z",
            "message": "Brian\nthe website is thinkgeek.com, more response to come later, got to study!\n"
        },
        {
            "from": "Diane",
            "time": "2009-11-06T17:45:00.000Z",
            "message": "\nthanx Bri...found exactly what I was lookin' for!  You always come thru!\n"
        },
        {
            "from": "Brian",
            "time": "2009-11-06T22:10:00.000Z",
            "message": "Brian\nThat is cool that your son is getting married and has found someone really special.  People used to observe the physical attraction between Crystal and I.  I was very in love with her and it sent out vibes to everyone around us.  Nevertheless, she has issues that no relationship and no lover can remedy.  She doesn't know how to love herself, and therefore cannot love someone else.\n\nI have met someone new.  A pretty little blond girl.  Our religious and political views are always conflicting, but it provides a nice contrast to our relationship.  And obviously we don't let it get in the way of our attraction and compatibility in other areas.  She is really great, and very smart.  Tell me more about this guy in your life?  What does he do?  How did you meet?\n\nWith the relationships stuff out of the way; definitely send me youtube videos, I love wasting time at work!  :-D  Here is one for you http://www.youtube.com/watch?v=ZdVHZwI8pcA\n\nNow down to business concerning the website; I have recently become a big advocate of Drupal.  It is a content management system (CMS) that has an enormous following.  I would recommend this system for anyone that would like the ability to easily modify the content themselves and still take advantage of some more advanced features.  It is open-source and completely free unless you are using your site to make lots of money, in which case I recommend making a donation.\n\nFirstly, you have to choose a domain name, that is what \".com\" or \".net\" address would you like to use for your website.  Then you have to choose a registrar, I can do this part for you if you give me a list in order of preference for some domain names you would like to use.  The company I used to work for, Red Pepper Solutions, can register your domain for $15 per year.  This is a pretty standard price for full, honest control over the domain name.  Other places will offer deals such as $5 per year, but will require you use their sub-par hosting service.\n\nFinally, you will need to find a place to run your website.  RP-S can also do this, for a small annual fee.  At this point I could set up a basic Drupal site, and we can discuss the necessary features.  More importantly, we will have to decide on a template or how the site looks; themed colors, logo placement, layout.  Drupal provides a set of templates that I can modify on a basic level, such as changing colors around, or you can buy a template online for a small fee ($25-$80) from various different services and I can convert it to be used with Drupal.  The most complicated option is to buy a custom design, RP-S also provides custom designs, and that will then be converted to work with Drupal.  Custom designs can range from $150 to over $300.\n\nMy fee would be a fixed price based on the number of expected hours to get the site up and running.  In the past, employers have paid half up front (so I can support myself on Funions and RedBull), then the second half on delivery of the site meeting all the required expectations.  Afterward, further changes and modifications and additions to functionality will be charged on a per hour basis.  Electronic payments are preferable, but I would accept a check outside of any services provided by RP-S.\n\nHere is the RP-S website: www.rp-s.com.  If you would like any of the services on top of just a Drupal set up then contact them and tell them I sent you, they will treat you well.  Here is the site I designed for the radio station on campus www.kjack.org.  I don't have much time to work on stuff outside of school and my jobs, however I have an entire month off for winter break, so that would be the perfect time to get a site started.\n\nConcerning the letter; it is not the letter or your poor relationship with my father that concerns me.  It is simply a concern for my sister's well being.  She has many poor adult role models in her life, but I constantly see evidence that she realizes this and is intelligent enough to overcome the influences of bad nurture (vs. nature).  However, the idea of either of us continue to communicate with you drives Jim absolutely insane.  He is convinced that you are crazy, and you steal, and you are out to ruin his life.  After recently breaking it off with a woman that truly is crazy (bi-polar, and manic), I can completely understand how meaningless actions can be interpreted as trying to make someone miserable.  For example, I have found some of Crystal's belongings laying around so I set them aside to give back to her.  When I tell her that I have stuff for her we try to set up a day and time for her to retrieve them.  I am trying to be nice and considerate by inviting her over.  Alas, she had shown up unexpectedly when I was not around or spending time with other close friends and completely interfered with my plans.  So a seemingly meaningless action on her part (showing up whenever it was convenient for her without warning) managed to infuriate me.\n\nHopefully you understand the origin of his frustrations.  More importantly, this anger is affecting Corrine in a very negative way.  He threatened to cut her off completely if she did not sever her relationship with you.  As a poor, young, woman, that is entering college next year, this could be traumatic.  I can't imagine going through school without the financial support that I have received from him.  You may recall our conversation about rubbing him the right way in order to receive financial benefits; I don't think Corrine has quite perfected this skill.  So, whether or not his frustrations are justified, I hope you both understand the importance of your discretion.\n\nYou are an important part of both of our lives.  But we all have our flaws, and I hope that by realizing these flaws, we can overcome them.  Hope you hear from you again soon!\n\nLove,\nBrian\n\nBeached Whale\nA whale wakes up on a New Zealand beach\nyoutube.com\n\n"
        },
        {
            "from": "Diane",
            "time": "2009-11-12T23:55:00.000Z",
            "message": "\nHappy Birthday Bri!\n"
        },
        {
            "from": "Brian",
            "time": "2009-11-13T22:09:00.000Z",
            "message": "Brian\nHey thanks, did you get my other really long response to website stuff and dad and Corinne?\n"
        },
        {
            "from": "Diane",
            "time": "2009-11-14T03:07:00.000Z",
            "message": "\nYeah..I sure did... this week just got away from me.  I'll write you this weekend...lots to tell you and I should have time to check out the website stuff too.   I got a new laptop and its been a bitch getting things up and going.  Getting there...my sweetie is on the job as I type.  It came with Windows 7...I like XP... yeah..I'm totally behind I know but I know what I like.   \n\nLove,\nMe\n"
        },
        {
            "from": "Brian",
            "time": "2009-11-14T21:01:00.000Z",
            "message": "Brian\nWindows 7 is really nice, way better then Vista, I definitely recommend getting in to it.\n"
        },
        {
            "from": "Diane",
            "time": "2009-11-16T21:29:00.000Z",
            "message": "\nhey cutie...love your profile pic!  \n\nOk...haven't yet checked out website stuff but WILL...windows 7 is a bitch..it does not support outlook express where ALL of my client emails are..taken bloomin thing to IT guy tomorrow...  I could get it with about a weeks time but AAAARRRRGGGHH.   Once I'm up and running...like in 2 days I'll send you my link to my very primitive website provided by my tax software WHICH can link into any website.  My goal date of final (but bare bones) website is Dec 15th...  ADVISE PLEASE!!  The only other problem with Windows 7 is that its just a revised (but better) version of XP.. anything programed before VISTA becomes a problem...oh, like accounting history, and tax programs...wont convert w/o many problems.  2006 tax program cannot download the state programs as is was XP and prior...conversion is VISTA plus...my knowledge to date.\n\nOk...I'll just briefly address your dad, Corinne & you.   I have a mssge saved in drafts which was lengthy and YOU would sleep thru after the 1st more than 3 sentence paragragh..so scratch that.   I get all you are saying and we are CAREFUL!   You father will never mess with Corinne like he did with you...just a fact, fair or not, but a fact...he might dick w/ Wendy for a bit but bottom line I am 99.9% certain he would never leave Corinne in the lurch like he did you for a bit.  For one thing...Wendy would make sure EVERYONE in Columbus knew what he was doing...you know your dad...not OK.....  image thing.  Anywho (as you would say)...we are careful.   \n\nBri...I am SOOO happy that he is happy...Olena (sp?) sounds like total imbecile so perfect...she does talk back w/ nonsense...just talks...pull the cord! (I'm bad)  Seriously though...I really hope he is happy and has what he wants...we all have different wants and needs and we were just not on the same page (obviously).  To me, and this is just me, in the end what do we all have...once physical things fade (whatever) is conversation...give me a man with that and right now I've found that with depth.  Refreshing and I am careful to know that this is over-the-top good because of many years of lack...just as it is w/ your dad... he had yrs of me challenging him but not now so OMG how good...works both ways I know.\n\nI met this guy (my geeky wonderman) years ago and just a brief email via facebood put us together after a couple of emails in August.   I'm not only in love with his heart (which by the way I was w/ your dad) but with the content/conversation...and the willingness and depth of his thoughts (you know...like you..some geeks do have depth AND willing and wanting to converse!  LOL!)\n\nI should have reviewed your prior email to address all of what you said but what can I say...it's MONDAY and I'm a lazy woman on Monday's PLUS this fricken computer is ZAPPIN my energy!  Excuses!!!\n\nI love you kiddo...what did you do on your birthday???  \n\nI'll send you my stuff by Friday (goal date anyway!)...\n\n\nLater.\n\nHugs kiddo...say hey to your mom!  I'm about to order something comfy from her \n"
        },
        {
            "from": "Brian",
            "time": "2009-11-16T21:29:00.000Z",
            "message": "Brian\nYou could get microsoft office, then copy the emails in to outlook.\n"
        },
        {
            "from": "Brian",
            "time": "2010-02-13T03:22:00.000Z",
            "message": "Brian\nI was just responding to my mom about a new website she wants to set up, and I remembered you never really responded to my last message about website stuff.  I believe I sent a pretty detailed message on the website process, how is that going?  Have you been busy and not really thought about it?  What else is new?\n"
        },
        {
            "from": "Diane",
            "time": "2011-01-27T05:46:00.000Z",
            "message": "\nBri---\nWhat is this from???  Great quote and so damn true!\n"
        },
        {
            "from": "Brian",
            "time": "2011-01-27T05:46:00.000Z",
            "message": "Brian\nhttp://www.youtube.com/watch?v=eB74qeRghrw\nEncoder - Pendulum - Immersion\nHere is Pendulum's song Encoder Click her for the rest of the album http://www.youtube.com/user/Ifazzaification#grid/user/6EC8A3F52DF7ECF7 Download from itunes at http://itunes.apple.com/gb/album/imme... DON'T FORGET TO LIKE COMMENT SUBSCRIBE\ngdata.youtube.com\n"
        },
        {
            "from": "Diane",
            "time": "2011-12-24T02:23:00.000Z",
            "message": "\nMerry Christmas Bri!   If I remember right you were an awesome skeet shooter too!\n\nHappy Holidays!\nDiane\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-24T02:23:00.000Z",
            "message": "Brian\nHaha, thanks, you too!  Skeet shooting was awesome!\n"
        },
        {
            "from": "Diane",
            "time": "2012-02-04T21:57:00.000Z",
            "message": "\nyou bought a house???!!!\n"
        },
        {
            "from": "Brian",
            "time": "2012-02-04T21:57:00.000Z",
            "message": "Brian\nYa\n"
        },
        {
            "from": "Diane",
            "time": "2012-02-04T21:57:00.000Z",
            "message": "\ncongrats grown-up!!!  where?\n"
        },
        {
            "from": "Brian",
            "time": "2012-02-04T21:57:00.000Z",
            "message": "Brian\nScottsdale\nWell technically Phoenix, but it is just west of Kierland in Scottsdale.\n"
        },
        {
            "from": "Diane",
            "time": "2012-02-04T21:57:00.000Z",
            "message": "\ngood for you Bri!!!  where are you working?  haven't kept up..\n"
        },
        {
            "from": "Brian",
            "time": "2012-02-04T21:57:00.000Z",
            "message": "Brian\nEPIC Diagnostics. I have to go fix a few things in my new house.\n"
        },
        {
            "from": "Diane",
            "time": "2012-05-08T15:56:00.000Z",
            "message": "\nhey Bri...my sister will be in Phoenix next week and i'm giving site seeing advise (yeh I know!)..anyway your dad & I went somewhere that was know for bells...all sorts and by some famous guy...any clue?\n"
        },
        {
            "from": "Brian",
            "time": "2012-05-08T15:56:00.000Z",
            "message": "Brian\nThat is in Arcasanti\nhttp://maps.google.com/maps?q=acasanti,+bell,+arizona&oe=utf-8&rls=org.mozilla:en-US:official&client=firefox-a&um=1&ie=UTF-8&hl=en&sa=N&tab=wl\nhttp://www.arcosanti.org/project/activities/foundry/main.html\nhttp://blog.aia.org/aiarchitect/2008/09/is_it_time_to_go_back_to_arcos.html\n"
        },
        {
            "from": "Diane",
            "time": "2012-05-13T17:25:00.000Z",
            "message": "\nThanks!  I convinced them if choice is one or other to go to Sedona!  Love that place... what was name of restaurant w/ awesome cactus fries you took us to???  They are doing this retirement thing (yawn! with a few couples ) in San Tan Valley..trying out houses for four days... they need to get past bingos and flea markets! LOL Thanks in advance Bri!\nd\n"
        },
        {
            "from": "Brian",
            "time": "2012-05-13T21:23:00.000Z",
            "message": "Brian\nThat is the cowboy club.\n"
        },
        {
            "from": "Diane",
            "time": "2012-05-14T09:54:00.000Z",
            "message": "\nThanks!\n"
        },
        {
            "from": "Diane",
            "time": "2012-06-27T12:24:00.000Z",
            "message": "\nCongrats on getting married!  Who is she and am I missing the pic?s!  She's a lucky woman!!  I am blown away!\n\n"
        }
    ]
}