{
    "thread": "https://www.facebook.com/messages/t/don.speer.12",
    "participants": [
        {
            "name": "Don Speer",
            "description": "SSA CEFNS IT at Northern Arizona University",
            "url": "Worked at NAU College of Engineering, Forestry & Natural Sciences"
        }
    ],
    "messages": [
        {
            "from": "Don",
            "time": "2010-12-17T15:25:00.000Z",
            "message": "\nI'm sorry to bail last night.  I haven't been sleeping well and so I was drinking a redline before I came over, and the crash hit me hard after I came over.  Sorry bro,  I'll feel better tonight, and hook us up with some beer.\n"
        },
        {
            "from": "Don",
            "time": "2011-09-14T22:49:00.000Z",
            "message": "\nhey man! long time no see. Are you and michael still down to give that RFID hack talk? I'm pres of acm now. all kinds of shit is happening in that room now\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-14T22:49:00.000Z",
            "message": "Brian\nI am not.  Haven't worked on it.\n"
        },
        {
            "from": "Don",
            "time": "2011-09-14T22:49:00.000Z",
            "message": "\nWell you still have the remaining of the semester or even next semester if you want it to still happen.  I was thinking about ordering or making a shit load of ID sleeves (not full wallets) that can protect rfid sensitive id cards.\nand just hand them out to people\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-14T22:49:00.000Z",
            "message": "Brian\nthat sounds useful.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T20:17:00.000Z",
            "message": "Brian\nThank you for connecting!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:59:00.000Z",
            "message": "Brian\nHELLO!\n\nI am playing a game.\nCan you send Joe Flieger a compliment?\n"
        },
        {
            "from": "Don",
            "time": "2016-10-12T00:59:00.000Z",
            "message": "\nmaybe, what's the catch? did you turn yourself into a bot?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:59:00.000Z",
            "message": "Brian\nHaha almost\n"
        },
        {
            "from": "Don",
            "time": "2016-10-12T00:59:00.000Z",
            "message": "\nhmmm...\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-17T19:04:00.000Z",
            "message": "Brian\nThank you for hanging out with me on my birthday!  That was awesome.  We should go out to dinner sometime.\n"
        },
        {
            "from": "Don",
            "time": "2016-11-17T19:04:00.000Z",
            "message": "\nThat would be awesome. But I still live in Flagstaff, at snowbowl actually, literally.  My girlfriend lives in Scottsdale so I try to make it there a couple times a month. And I hang out with Ryan a lot too.\nMy goal in Scottsdale is to find the best sushi place to eat. We should hit up some sushi bars\n\n"
        }
    ]
}