{
    "thread": "https://www.facebook.com/messages/archived/t/ericfoehner",
    "participants": [
        {
            "name": "Eric Foehner",
            "description": "",
            "url": "https://www.facebook.com/ericfoehner"
        }
    ],
    "messages": [
        {
            "from": "Eric",
            "time": "2010-05-28T07:52:00.000Z",
            "message": "\nHello Brian, it’s been quite some time since we have spoken to each other and I’d really like to start talking to you again. I don’t know why we haven’t been friends the past few years, I don’t see any reason we shouldn’t be. Tonight I saw your mom and Chase at his graduation and I got to congratulate him and talk to your mom a little (what a great lady she is). Anyway, it got me thinking about how long it’s been since we have talked and I really can’t remember when the last time I saw you was. I wonder about how you’re doing a lot and I hope your life’s been going well. We used to be such great friends and I would really like to resurrect some semblance of what our friendship used to be. I look forward to hearing from you. \n\nSincerely, Eric\n"
        },
        {
            "from": "Brian",
            "time": "2010-05-28T19:09:00.000Z",
            "message": "Brian\nHey,\nIt is good to hear from you.  I don't think we stopped being friends for any one reason, I think our lives just went in separate directions.  There are going to be a couple old friends here tonight for the party, you should come by.  Feel free to bring Brianna and anyone else along, and we can all catch up!\n"
        },
        {
            "from": "Eric",
            "time": "2010-05-28T20:50:00.000Z",
            "message": "\nI wish I could but we are in Flagstaff. We had to come straight back after the graduation because I had to work and Brianna has summer school. Are you still living in flagstaff or are you back in Phoenix?\n"
        },
        {
            "from": "Brian",
            "time": "2010-05-28T22:01:00.000Z",
            "message": "Brian\nI am living in Flagstaff all summer.  I am still working for the college.\n"
        },
        {
            "from": "Eric",
            "time": "2010-05-29T05:25:00.000Z",
            "message": "\nCool. I will be in Flagstaff all summer too. Hopefully that will allow us plenty of opportunities to hang out.\n"
        },
        {
            "from": "Eric",
            "time": "2011-11-02T03:53:00.000Z",
            "message": "\nHey Brian! I'm filling out a job application and I need your current address and phone number. (I have to list all people I have lived with over the past 5 years)\nSo just send me a message when you get a chance. I would really appreciate it.\nThank you in advance.\nAlso, we should hang out sometime. I'm living in Phoenix again\n"
        },
        {
            "from": "Eric",
            "time": "2011-11-03T23:36:00.000Z",
            "message": "\nHey, just wondering of you got my message from the other day?\n\n"
        }
    ]
}