{
    "thread": "https://www.facebook.com/messages/t/fabian.paco.3",
    "participants": [
        {
            "name": "Fabian Paco",
            "description": "In a relationship",
            "url": "https://www.facebook.com/fabian.paco.3"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "Brian\nI have started writing down every \"coincidence\" that I notice, at the end of my life I will be able to prove how my reaction led to my success.  I can only prove it at the end with productivity, but practicing it helps me realize the opportunities now!\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "\nDo you think that's because of god or a coincidence. I think it's confirmation bias\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "Brian\nI think I am biased because of time.  If I look back on my 20/20 hindsight, I wish I knew what I know now back that.  That mindset makes us all Gods.\nThis is all a test of voice.\nWhich part of your mind can I access next?\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "\nWhat God to you believe exists? It's s serious question\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "Brian\nUs.  Serious answer.  We are all part God.  Only the sum of us equals 1 answer to the most important question.  We finally have the technology to experience that.  The Singularity ha already happened.  Revelation is happing now.  If we don't work together now, the earth will be unmade in the same way it \"poofed\" into existence.  The biggest secret in all of religion is a matter of time.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "Brian\nWhat are you thinking?\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "\nSo you would consider yourself a pantheist? Or what would you consider yourself?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "Brian\nWoah!  That is new information!  What is a pantheist?\nI think so.  Good idea.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "\nAs far as I know, a pantheist believes the earth and nature are godlike. Something like that\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "Brian\nHow do we convert atheists to pantheists?\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "\nwe? I'm an atheist. Any type of theism needs to show evidence for the claim. I love nature and everything but I'm not gonna pray to it\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "Brian\nI'm evidence.  If you help me that is evidence too.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "\nYou're not evidence. That's called personal credulity. If that were the case, truth would be anyone's thoughts. Unfortunately that's not how evidence works\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "Brian\n\nOh good word.  I get that a lot.  Also Narcissist.  Ok, here is more evidence.  I've started to document coincidences and my affect of people and profound realizations that I've had.\nWhat do you think?\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "\nNah I don't think it's narcissism. Do you believe in Yahweh?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T19:25:00.000Z",
            "message": "Brian\nI don't know much about it, but I have some Israeli friends.  They just shared their new years with me and it was really inspirational!\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nI think you just have a need for faith. Humans have the need for answers, and the easy answer has always been a god. Any of the thousands of gods. But we're getting to the point where our species is looking beyond that, and just finding out the reality that's our existence. Sometimes it's not as poetic as we'd like. We are here now, we live, when we die, we seize to exist. Would I love to exist in some afterlife? Of course. But lying to myself is something that's unacceptable\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nI love where your head is at right now.  Love transcends time, it's faster.  Your love for faith has made an impact on me that I will never be able to explain.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nSerious question: are you messing with me? I'd like to be having an adult conversation. It's just a question. Cause there are plenty of trolls and I don't like wasting my time with them\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nI am not messing with you I promise.  I am just trying to understand what you are thinking so that I can learn something important.\nI hate wasting time, I haven't been social networking before so I want to meet really intelligent people that have doubts just like me.  Atheists offer that unique opportunity and I can already see it working.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nOk koo. Conversation continues. So you can say or ask what you wish. You seem to be going through a faze of doubt. Sorry if I'm wrong, but I know a few people going through this. Not that I have the answers, but I do have the answers to the questions that have been asked. That's all I can do. I'm a simpleton so I have questions as well\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nI have been thinking the exact same thing!\nDo you have any questions?\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nWhat were you brought up believing as a child? Its very easy to disprove \"God\". All I need is to know where a person is from and I can sort of guess what God they worship. A deity shouldn't be that easy to predict. Me, I was brought up as a very liberal Christian. That's not even fair to state because my parents \"God bless them, lol\", never ever ever infused religion in me. So I've been a life long atheist.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nBrilliant!  I love where your head is at right now, I'll try to exercise it.  My parents raised my Catholic.  I don't practice because of their exuberance and misconduct.  I am part god.  Any questions?\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nI'd like to tell you to please excuse some people that might be rude to you on some atheist pages.\nSome of us are annoyed at thrust trolls\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nI don't mind, but I really appreciate your caring.  This is where equanimity come in.  Peace of mind.  Doesn't matter the consequence so I can act as kindly and efficiently as I feel like.  Everyone in this forum is an opportunity.  We have all come here to feel connected to someone, but when a stranger connects we are shocked and surprised!  This gives me the chance to understand your mind.  That is how I operate.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\ntheist trolls\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nI love that word!  I need to be a troll to activate your mind.  No troll is as smart as me.  Do you believe that statement?\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nIdk. So what makes you a god? I'm intrigued by your mindset\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nLevel up!  You said a keyword! https://www.gatesnotes.com/Books/Mindset-The-New-Psychology-of-Success\nWhat You Believe Affects What You Achieve\nBill Gates reviews the book “Mindset” by author Carol Dweck.\ngatesnotes.com\nAmbition makes me a god.  What would you accomplish if you had a billion dollars?  I can prove my ambition but only at the end of my life.  So I have to try to do everything perfectly now to achieve it.  Once you start acting like god, you will think you are one.\nI can see coincidences and alternate realities.  Like Donnie Darko.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nWatch Midnight Special.  It's a true story.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nDo you believe in afterlife?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nYes.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nWhat kind of afterlife? Why? Describe this afterlife, please\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nIt's the same as this life except everyone around you knows everything and already knows what you are going to say.\nI love where you head is at though because you are asking really hard questions people usually save for a Priest.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nWhy do you believe in this afterlife? Is it like the Christian afterlife? Unicorns and rainbows and grandma's cooking and all that good stuff?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nThe movie Midnight Special.  I've seen it.  I can see the effects people leave on us long after they are gone from the physical world.  This is immortality.  The impression that you leave.  Our entire existence comes from somewhere else.  Who loved us enough to spread life throughout the universe?\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nYou see spiritual things? Like things that are not normal?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nI see coincidences like Donnie Darko.  I can see the path out in front of me.  I can see forks in the road and opportunities as plain as daylight.\nI need a job.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nStay with me here... You're saying you see things?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nHmm, yes, I'll try to put it the same way I described it to a physicist.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nTry this: The fridge has 1 cold drink.  I put more drinks in the fridge to cool them down.  When the door closes, the fridge contains both cold and warmer drinks.  If I put the cold drink in the front, the next person gets a cold drink instead of a warm one.  Saving time and making them happy, (assuming they like cold drinks).  How do you measure what I did?  Moving the cold drink to the front so the next person enjoys it?  Productivity is a measurement tool we can apply to the entire human race to understand human physics.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nI'm all about productivity.\nI assume that everything is a waste of time given limitless human ambition.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nI'm more of an \"Occam's razor\" type of guy\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nWhat is that?\nThis is totally new to me.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "\nGoogle it\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T20:51:00.000Z",
            "message": "Brian\nHaha, that sounds like work.  Just trying to save time \nHoly shit, that is brilliant.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:29:00.000Z",
            "message": "Brian\nHoly shit, that is brilliant.\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T23:29:00.000Z",
            "message": "\nPretty much it's defined as \"the simpler answer is usually the best answer\". The more you try and add attributes to life, the more evidence you need. All we have now is we live, we die. And that's ok\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:29:00.000Z",
            "message": "Brian\nDid you see my latest post?  lol what is the answer?\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T23:29:00.000Z",
            "message": "\nI think you need to look for more answers. I think you're a good person that is finding your way to your truth.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:29:00.000Z",
            "message": "Brian\nWow.  I really appreciate that.  You are kind for saying that.  I am just exercising my voice.  What I realized from all of you is that there is no argument I can ever hear from an atheist that would make my faith waver.  I am at peace with it and it includes all of you.  I wonder what would happen if I had more friends than celebrities.  If I because a celebrity through natural social growth.  Who does that sound like to you?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:29:00.000Z",
            "message": "Brian\n*become\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T23:29:00.000Z",
            "message": "\nThat's the problem, you say there's nothing someone can say to change your mind. Your mind is set. You seem to need faith and everything that happens is confirmation bias. I'm always open to new evidence. Most atheists are as well. It just so happens that the evidence, as of now, shows a natural answer to most questions. Keep your mind open\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:29:00.000Z",
            "message": "Brian\nI agree completely!  But I raise you a harder question.  What is the point?  Why talk about it to anyone?  Why does everyone here jump to defending their beliefs?  I think its because we all lack understanding.  My ambition transcends understanding, I want to be understood by everyone so that I can understand myself.  Knowledge is power!\n"
        },
        {
            "from": "Fabian",
            "time": "2016-10-08T23:29:00.000Z",
            "message": "\nWhat is the point of what?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-08T23:29:00.000Z",
            "message": "Brian\nTalking.\n"
        },
        {
            "from": "Brian",
            "time": "2018-01-14T22:22:00.000Z",
            "message": "Brian\nwhat do you think of sosmethod.herokuapp.com?\n"
        },
        {
            "from": "Fabian",
            "time": "2018-01-15T00:09:00.000Z",
            "message": "\nI'm not much of a meditation guy. I have beer for my troubles\n"
        },
        {
            "from": "Brian",
            "time": "2018-01-15T00:09:00.000Z",
            "message": "Brian\nWill you try it because I made that app and I need help beta testing it. It if doesn't work for you that would be valuable feedback too.\n"
        },
        {
            "from": "Fabian",
            "time": "2018-01-15T00:09:00.000Z",
            "message": "\nYea I'll try it. Not today but I'll see if I do it 2mrw\n"
        },
        {
            "from": "Brian",
            "time": "2018-01-15T00:09:00.000Z",
            "message": "Brian\nIt's only 10 min a day\n"
        },
        {
            "from": "Brian",
            "time": "2018-01-27T05:05:00.000Z",
            "message": "Brian\nhttps://www.facebook.com/yhtst/videos/vb.1785045585047275/1801630460055454/?type=2&theater\nAttachment Unavailable\nThis attachment may have been removed or the person who shared it may not have permission to share it with you.\n"
        },
        {
            "from": "Fabian",
            "time": "2018-01-30T01:37:00.000Z",
            "message": "\nIt's a heavenly miracle that someone survived a car crash?\n"
        },
        {
            "from": "Brian",
            "time": "2018-01-31T23:33:00.000Z",
            "message": "Brian\nYou said it not me.  That's your interpretation.\n;D\n"
        },
        {
            "from": "Fabian",
            "time": "2018-01-31T23:33:00.000Z",
            "message": "\nWow. Well you believe anything if that's your conclusion. Geez\n\n"
        }
    ]
}