{
  "data": [
    {
      "description": "Mark your Calendars!  The fourth annual Winter 4x4 Jamboree will be held in Hurricane (St. George), Utah on January 18th, 19th, and 20th, 2018.  

Registration for the event will be online in November, including trail selection. There are limited numbers of trails available, so we encourage you to select your trails online as soon as possible.  Trails will be limited to group size to ensure participants have an enjoyable experience, with more technical trails limited to groups of 10, and other trails up to 25 vehicles.",
      "end_time": "2018-01-20T17:00:00-0700",
      "name": "2018 Winter 4x4 Jamboree",
      "place": {
        "name": "Winter 4x4 Jamboree",
        "location": {
          "city": "Hurricane",
          "country": "United States",
          "latitude": 37.168774,
          "longitude": -113.4080338,
          "state": "UT",
          "street": "9 N 5300 W",
          "zip": "84737"
        },
        "id": "577246442379535"
      },
      "start_time": "2018-01-18T08:00:00-0700",
      "id": "322056298256716",
      "rsvp_status": "unsure"
    },
    {
      "description": "Join us at Scottsdale Stadium, home of the Scorpions, for the Bacon and Beer Classic on October 7th, 2017. Come hungry, come thirsty, leave happy!

Experience 50+ craft beers, 25+ bacon-infused dishes, music, contests, games, and more with all-inclusive tickets. 

10/7 Afternoon: 1-4pm
10/7 Evening: 7-10pm

VIP ticket holders enter one hour early. 

For tickets and more info, visit www.baconandbeerclassic.com.",
      "end_time": "2017-10-07T22:00:00-0700",
      "name": "Scottsdale Bacon and Beer Classic",
      "place": {
        "name": "Scottsdale Stadium",
        "location": {
          "city": "Scottsdale",
          "country": "United States",
          "latitude": 33.488333,
          "longitude": -111.921111,
          "state": "AZ",
          "street": "7408 E Osborn Rd",
          "zip": "85251"
        },
        "id": "135426226488004"
      },
      "start_time": "2017-10-07T12:00:00-0700",
      "id": "111811912768172",
      "rsvp_status": "unsure"
    },
    {
      "description": "Jodorowsky’s Dune tells the stranger than fiction tale of the legendary filmmaker’s ill-fated adaption of Frank Herbert’s classic sci-fi novel Dune – an unfinished epic dubbed “The Greatest Movie Never Made.”

Part of our month-long series, The Films of Alejandro Jodorowsky.
View the schedule at http://tiny.cc/jodorowsky

“Marvelous and preposterously fascinating … allows audiences a rare glimpse inside the furiously creative mind of Jodorowsky.” – Frank Pavich, Austin Chronicle

In 1975, following the success of his wild cult films El Topo and The Holy Mountain, Jodorowsky began work on his most ambitious project yet. Starring his own 12 year old son Brontis alongside Orson Welles, Mick Jagger, David Carradine and Salvador Dali, featuring music by Pink Floyd and art by some of the most provocative talents of the era, including HR Giger (who later designed the nightmarish look of Ridley Scott’s Alien) and Jean ‘Moebius’ Giraud, Jodorowsky’s adaptation of Frank Herbert’s beloved novel Dune was poised to change cinema forever. For two years, Jodo and his team of “spiritual warriors” worked night and day on the massive task of creating the fabulous world of Dune: over 3,000 storyboards, numerous paintings, incredible costumes, and an outrageous, moving and powerful script. In the words of Jodorowsky’s producer, Michel Seydoux, “It should have been enough. But it wasn’t.” Through interviews with legends and luminaries including Giger, Gary Kurtz (producer of Star Wars) and Nicolas Winding Refn (director of Drive), and an intimate and honest conversation with Jodorowsky himself filmed over the course of three years, director Frank Pavich’s film – featuring never-before-seen realizations of Jodo’s mind- blowing psychedelic space opera – finally unearths the full, unbelievable saga of the Dune that never was.",
      "end_time": "2017-09-27T21:00:00-0700",
      "name": "Jodorowsky’s Dune",
      "place": {
        "name": "The Loft Cinema",
        "location": {
          "city": "Tucson",
          "country": "United States",
          "latitude": 32.23621,
          "longitude": -110.9239,
          "state": "AZ",
          "street": "3233 E Speedway Blvd",
          "zip": "85716"
        },
        "id": "63731214856"
      },
      "start_time": "2017-09-27T19:30:00-0700",
      "id": "454870314895375",
      "rsvp_status": "unsure"
    },
    {
      "description": "***BOTH DATES ARE SOLD OUT***

Join us for a Grown-Up Corn Maze adventure! Discover Coronado Vineyards tasting stations hidden amongst our corn maze. Strictly 21+. 
This event will be held two evenings, Friday, September 22 and Saturday, September 23 beginning at 5:00 pm each day.",
      "end_time": "2017-09-23T19:00:00-0700",
      "name": "Find the Wine: A Corn Maze Adventure for Grown-Ups",
      "place": {
        "name": "Willcox, AZ",
        "location": {
          "city": "Willcox",
          "country": "United States",
          "latitude": 32.2556,
          "longitude": -109.836,
          "state": "AZ",
          "zip": "85643-85644"
        },
        "id": "105521389480392"
      },
      "start_time": "2017-09-22T17:00:00-0700",
      "id": "267592653725886",
      "rsvp_status": "unsure"
    },
    {
      "description": "Myofascial Release & Restore w/ Stephanie 

Sunday, September 17th
12 noon
$25 cash 
$30.00 credit card
Myofascial Release & Restore workshop will allow you to dive deep into healing and relieving various ailments such as pain, soreness and inflammation by focusing on releasing and caring for the Myofascial connective tissue restrictions. By focusing on relaxing contracted muscles and stimulating the stretch reflex in muscles, your body is then able to improve blood and lymphatic circulation, increase range of motion and reduce recovery time. 
This is one of those \"You deserve a break- take care of your body & give yourself some love!\" types of workshops!
Stephanie will guide you through the workshop by utilizing pranayama (breath-work) and various props to help dive deep into the connective tissue of your bodies from head to toe. Props such as:
-tennis balls   -blocks    -straps    -yoga mat   -foam rollers
*Please bring your yoga mat and water. We will provide the rest of the props.
*This workshop is for those who have tight muscles/pain/soreness in their feet, calves, hamstrings, glutes, lower back, upper back, arms, hands, shoulders, neck- the list goes on! This workshop is for everyone as we all experience  ailments somewhere in our bodies! 

Re-Barre Studio| rebarrestudioaz@gmail.com | 480-699-5120",
      "end_time": "2017-09-17T13:00:00-0700",
      "name": "Myofascial Release workshop with Stephanie!",
      "place": {
        "name": "Re-Barre North Scottsdale",
        "location": {
          "city": "Scottsdale",
          "country": "United States",
          "latitude": 33.652643295572,
          "longitude": -111.88574787169,
          "state": "AZ",
          "street": "18261 N Pima Rd, Ste E115",
          "zip": "85255"
        },
        "id": "165453400236430"
      },
      "start_time": "2017-09-17T12:00:00-0700",
      "id": "343005789478526",
      "rsvp_status": "unsure"
    },
    {
      "description": "Join with our whole Diocesan community as Bishop Olmsted celebrates a Solemn Pontifical Mass to commemorate the visit of St. John Paul II to our beloved Basilica and city on September 14, 1987, the Feast of the Exaltation of the Holy Cross. Following the Mass, all are invited to our Social Hall where there will be food and a rare opportunity to view some of the papal memorabilia and historical artefacts from the visit. St. John Paul II, pray for us!",
      "name": "30th Anniversary of St. John Paul II Visit to Phoenix ",
      "place": {
        "name": "Saint Mary's Basilica",
        "location": {
          "city": "Phoenix",
          "country": "United States",
          "latitude": 33.450955316063,
          "longitude": -112.06919053542,
          "state": "AZ",
          "street": "231 N 3rd St",
          "zip": "85004-2219"
        },
        "id": "1447082302179536"
      },
      "start_time": "2017-09-14T12:00:00-0700",
      "id": "266311813773070",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come out and play, and enjoy blues/fusion dancing in a relaxed and welcoming atmosphere. Blues dancing is all about connection and musicality. No fancy footwork, really easy to learn and dance,
even after just one lesson. Every week, from 7-7:30 p.m, we teach a lesson, and all are welcome! We play a variety of great music from 7:30-10:30 p.m. ALL AGES! No partner necessary - everybody dances with everybody!

Cee Dee's has a whole room for us, a great sound system, and a full menu. Please patronize them, as they allow us to be there for free!

Thanks to Kari for the fun photo!

This week's lesson will be taught by Kristen

DJ's: Angelina (7:30-9:00 p.m.), then
Kristen (9:00-10:30 p.m.)",
      "end_time": "2017-09-12T22:30:00-0700",
      "name": "Tuesday Bluesday at CeeDee's!",
      "place": {
        "name": "CeeDee Jamaican Kitchen",
        "location": {
          "city": "Tucson",
          "country": "United States",
          "latitude": 32.23669,
          "longitude": -110.87932,
          "state": "AZ",
          "street": "5305 E Speedway Blvd",
          "zip": "85712"
        },
        "id": "117016961672276"
      },
      "start_time": "2017-09-12T19:00:00-0700",
      "id": "270410850143053",
      "rsvp_status": "unsure"
    },
    {
      "description": "Kickoff Event for Speaker Series: Finance & Capital for Veteran-led Startups Presented by JP Morgan Chase & Co.; Hear from RJ Jones, VP of Investor Relations for Zillow, speak on how military veterans can best capitalize their new business ventures.",
      "end_time": "2017-09-07T19:00:00-0700",
      "name": "Speaker Series Presented by JP Morgan Chase",
      "place": {
        "name": "The Armory Incubator",
        "location": {
          "city": "Phoenix",
          "country": "United States",
          "latitude": 33.45271,
          "longitude": -112.06918,
          "state": "AZ",
          "street": "455 N. 3rd Street",
          "zip": "85004"
        },
        "id": "295940374072283"
      },
      "start_time": "2017-09-07T16:00:00-0700",
      "id": "258854171300436",
      "rsvp_status": "unsure"
    },
    {
      "description": "NO COVER CHARGE, the first round is on us!

The Blooze presents STRAIGHT OUTTA MAYBERRY for our 1st north valley appearance. This is a last minute show call, but we're gonna make it a humdinger of a shin dig!The Blooze is one of the best known names in live music, and we're quite thilled they'd have us. So c'mon north side MAYBERRY MAFIA and let's break this place in right and proper!!! #blooze #mayberrymafia",
      "end_time": "2017-09-03T01:00:00-0700",
      "name": "Mayberry at the Blooze",
      "place": {
        "name": "The Blooze Bar",
        "location": {
          "city": "Phoenix",
          "country": "United States",
          "latitude": 33.59509199431,
          "longitude": -112.01412829235,
          "state": "AZ",
          "street": "12014 N 32nd St",
          "zip": "85028"
        },
        "id": "107540129271286"
      },
      "start_time": "2017-09-02T21:00:00-0700",
      "id": "112175682823647",
      "rsvp_status": "unsure"
    },
    {
      "description": "Join us for Harry Potter and The Sorcerer's Stone on August 26th in the heart of downtown Flagstaff!

The Clay Olympics will also take place before this movie with Sandy Quintanilla from The Artists Gallery! Test your clay handling skills during this fun activity!

Bring the whole family downtown to enjoy this FREE community loved event. There will be live entertainment, kids activities, and giant games before the movie begins. Bring blankets and sleeping bags - PJs too. No need to bring food - Fratelli Pizza, popcorn, ice cream and other treats will be available.

Movies show every Saturday through the summer and are presented by the DBA (Flagstaff Downtown Business Alliance).

HUGE THANKS to OneAZ Credit Union for sponsoring this moive!",
      "end_time": "2017-08-26T22:00:00-0700",
      "name": "Harry Potter and The Sorcerer's Stone - Movies on the Square",
      "place": {
        "name": "Heritage Square, Flagstaff, Arizona",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.198522325568,
          "longitude": -111.64805357808,
          "state": "AZ",
          "street": "6 W Aspen Ave",
          "zip": "76701"
        },
        "id": "379475118793183"
      },
      "start_time": "2017-08-26T16:00:00-0700",
      "id": "1946605502031783",
      "rsvp_status": "unsure"
    },
    {
      "description": "Fly-In and Car Display. Young Eagle Flights for children 8 to 17. Demonstrations and talks. Much more information at http://flagthunder.org/",
      "end_time": "2017-08-26T15:00:00-0700",
      "name": "Thunder Over Flagstaff 2017",
      "place": {
        "name": "Flagstaff Pulliam Airport",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.140277777778,
          "longitude": -111.66916666667,
          "state": "AZ",
          "street": "6200 S Pulliam Dr Ste 204",
          "zip": "86005"
        },
        "id": "143117839035721"
      },
      "start_time": "2017-08-26T08:00:00-0700",
      "id": "1325068160904508",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come join us for a taste of the services we offer at a discounted price, as well as discounts on products and memberships. Stop by the spa or call us to reserve your spot and enjoy a 30 minute mini facial (30.00), 30 minute massage (30.00) as well as our 30 minute Hydrafacial (59.00).  We will have other mini services to take part of as well such as small laser hair removal (15.00) for one small session. Spend time mingling with others enjoying wine, beer and party food. Call today, limited spots available for this special event.  480-588-6809!",
      "end_time": "2017-08-24T19:00:00-0700",
      "name": "Spa Night Scottsdale-Shea Location",
      "place": {
        "name": "spa810",
        "location": {
          "city": "Scottsdale",
          "country": "United States",
          "latitude": 33.585360484342,
          "longitude": -111.92487587116,
          "state": "AZ",
          "street": "10893 N. Scottsdale Rd.",
          "zip": "85254"
        },
        "id": "258915591135372"
      },
      "start_time": "2017-08-24T15:00:00-0700",
      "id": "442513019466061",
      "rsvp_status": "unsure"
    },
    {
      "description": "Join us for our 2nd annual WURST FESTIVAL EVER from 5pm-10pm on Saturday, July 22 at Short Leash Sit...Stay, 110 E. Roosevelt, PHX. Relish local beers, meat local chefs while you sample their creative hot dog recipes and watch funny folks mustard up the courage to win the thrilling Suns Out Puns Out Competition. $10 admission/$3 hot dog samples/$5 beers. Stay tuned for more details!",
      "end_time": "2017-07-22T22:00:00-0700",
      "name": "2nd annual WURST Festival EVER",
      "place": {
        "name": "Short Leash Hot Dogs",
        "location": {
          "city": "Phoenix",
          "country": "United States",
          "latitude": 33.45886,
          "longitude": -112.07215,
          "state": "AZ",
          "street": "110 E Roosevelt St",
          "zip": "85004"
        },
        "id": "122567251113081"
      },
      "start_time": "2017-07-22T17:00:00-0700",
      "id": "219328555254364",
      "rsvp_status": "attending"
    },
    {
      "description": "For the first time ever, join Joel Hodgson, creator of the critically acclaimed Mystery Science Theater 3000 TV show and its new host Jonah Heston (Jonah Ray) as they bring the first live touring production of “MST3K” to the historic Orpheum Theatre, in downtown Phoenix, on the “Watch Out for Snakes!” Tour. 

Appearing with Joel and Jonah live on stage will be robot companions Crow (Hampton Yount), Tom Servo and Gypsy, along with Synthia (Rebecca Hanson) and her Bonehead henchmen. Of course, it wouldn’t be “MST3K” without the ever-present surveillance of the Mads, Kinga Forrester (Felicia Day) and TV’s Son of TV’s Frank (Patton Oswalt), checking up on their unwilling test subjects via a video screen. 

The tour consists of a completely unique show. Each event will include all the things expected from an “MST3K” experience: a cheesy B-movie, hilarious riffing, wisecracking robots, silly sketches, plus – for the first time – audience participation! Show # 1 is the MST3K favorite “Eegah,” featuring all-new riffs and sketches.

Following its record-breaking #BringBackMST3K Kickstarter campaign, the new season of the show launched on April 14, 2017, exclusively on Netflix. The two live shows are written by the cast and writers of the new Netflix Original Series, which has earned a critics’ rating of 100% Fresh on Rotten Tomatoes.. The New York Times hails, “At last, a revival of something actually worth reviving… a different cast but the same outlook and style — and mercifully, the same reliable, giddy humor.”  “MST3K is just as hilarious as ever in rebooted form, turning its bemused eye on old, schlocky fare for some good, old-fashioned riffing,” raves Vanity Fair. And Nerdist says “The references are updated, the sets are snazzier, but the heart and soul of MST3K certainly remains intact.”  

Tickets for “MST3K” “Watch Out for Snakes!” Live at the Orpheum Theatre in downtown Phoenix will go on sale to the public Friday, May 19 at noon local time via AXS.com and the venue box office at phoenix.ticketforce.com, or by calling 877-840-0457.",
      "end_time": "2017-07-20T23:00:00-0700",
      "name": "Mystery Science Theater 3000 Live!",
      "place": {
        "name": "Orpheum Theatre - Phoenix",
        "location": {
          "city": "Phoenix",
          "country": "United States",
          "latitude": 33.449008784621,
          "longitude": -112.07667672013,
          "state": "AZ",
          "street": "203 W Adams St",
          "zip": "85003"
        },
        "id": "337382383022187"
      },
      "start_time": "2017-07-20T20:00:00-0700",
      "id": "1683843975257190",
      "rsvp_status": "unsure"
    },
    {
      "description": "#yesphx is thrilled to announce the entrepreneur and business summer party: The Summer Social! This epic collaboration brings all our communities together in celebration of entrepreneurship, innovation and Arizona’s extreme generosity.

Please join us Friday, July 14 2017, as we take over The Saguaro Hotel in Downtown Scottsdale for an amazing evening of great music, drinks, spectacular networking and summer fun. You are encouraged to bring guests, the more the merrier!

Register at: www.thesummersocial.com

The Saguaro Hotel is offering anyone in our group interested in a room a 20% discount. Enjoy the evening and make a weekend out of it at the hotel. Enjoy the pool and being located in the middle of Old Town Scottsdale!
Room Discount Code: 20% off
Promo code SOCIAL",
      "end_time": "2017-07-14T23:00:00-0700",
      "name": "The Summer Social #yesphx",
      "place": {
        "name": "The Saguaro Scottsdale",
        "location": {
          "city": "Scottsdale",
          "country": "United States",
          "latitude": 33.494148710805,
          "longitude": -111.92278191732,
          "state": "AZ",
          "street": "4000 N Drinkwater Blvd",
          "zip": "85251"
        },
        "id": "151554904939365"
      },
      "start_time": "2017-07-14T18:00:00-0700",
      "id": "1097906000342573",
      "rsvp_status": "attending"
    },
    {
      "description": "Join the Greater Flagstaff Chamber of Commerce, Pepsi, Twin Arrows Casino Resort and the Flagstaff community in celebrating our country's Independence Day! There will be over 100 floats driven by local businesses and community organizations!

The 21st Annual Greater Flagstaff Chamber of Commerce 4th of July Parade will follow the usual route around Historic Downtown Flagstaff. This year's theme is \"Let Freedom Ring\"

Please register online or print out an application to participate as a parade float. Mail payment and application to the Greater Flagstaff Chamber of Commerce. See application link below:

https://chambermaster.blob.core.windows.net/userfiles/UserFiles/chambers/1660/File/ParadeApplicationRevisedVersion.pdf",
      "end_time": "2017-07-04T11:00:00-0700",
      "name": "4th of July Parade",
      "place": {
        "name": "Downtown Flagstaff, Flagstaff",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.198295037333,
          "longitude": -111.648395255,
          "state": "AZ",
          "zip": "86001"
        },
        "id": "117205878622150"
      },
      "start_time": "2017-07-04T09:00:00-0700",
      "id": "266655400411897",
      "rsvp_status": "unsure"
    },
    {
      "description": "Meeting at David Earl Smith's place at 2pm-ish on Saturday. We will consolidate cars and head to East Pocket!

Bring all your usual camping gear.",
      "end_time": "2017-07-02T12:00:00-0700",
      "name": "Camping at East Pocket!",
      "place": {
        "name": "Flagstaff, AZ",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.1992,
          "longitude": -111.631,
          "state": "AZ",
          "zip": "86001-86005-86004, 86011"
        },
        "id": "107818412580173"
      },
      "start_time": "2017-07-01T14:00:00-0700",
      "id": "1383667721728124",
      "rsvp_status": "unsure"
    },
    {
      "description": "This meditation will cleanse our minds and work with set intentions. In this meditative gong bath we allow the gong sound to bring the healing and integration of our body, mind, and soul.

The gong is a powerful healing sound. Gong sends waves that are a combination of overtones and undertones. It creates deep relaxation, freeing us from the flood of thoughts our mind releases, and stimulates the glandular system to a higher level of functioning. It affects the physical nervous system, not just hearing it through the ears, but the sensation of feeling it on the skin. The gong sound vibrates the energy meridians in the body and brings them into balance. Kundalini energy, which begins at the base of the spine is released, traveling upwards along the spine through the body. Sound travels and the body picks up a sound. It’s also a cleansing process for the subconscious mind. During the gong meditation, emotional transformation is produced as it reduces tension, releases blocks and stimulates circulation. The result is a reorganization of the emotional energy and feelings that are tied into the body structure. The gong changes feelings that are blocked by cutting the thoughts that sustain and recreate the feelings. During the gong bath let the entire body relax and let the sound of the gong penetrate the body and guide the mind.

* Wear comfortable clothing

* Bring mat &/or blanket to lie down on

* Hydrate before & after the gong; helps nerve function & cleansing of body

~Welcoming Niki Shields to serenade the space 

$15 before 6/23
$20 drop~in


The Gong is the spirit song. It is the primal whisper of the soul. Its sound is the echo of the Original Word that created the world, the sound within all sounds. ~Yogi Bahjan",
      "end_time": "2017-06-23T20:00:00-0700",
      "name": "Sound Healing Meditation",
      "place": {
        "name": "Linger Longer Yoga and Massage",
        "location": {
          "city": "Chandler",
          "country": "United States",
          "latitude": 33.30847,
          "longitude": -111.94635,
          "state": "AZ",
          "street": "325 N Austin Dr, Ste 1",
          "zip": "85226"
        },
        "id": "201210656723619"
      },
      "start_time": "2017-06-23T19:00:00-0700",
      "id": "175931546274938",
      "rsvp_status": "attending"
    },
    {
      "description": "Senior Portfolio Presentations",
      "end_time": "2017-05-11T20:00:00-0700",
      "name": "VC Capstone Presentations",
      "place": {
        "name": "NAU School of Communication",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.191626348191,
          "longitude": -111.65585345738,
          "state": "AZ",
          "street": "575 E Pine Knoll Dr",
          "zip": "86001"
        },
        "id": "114887308565763"
      },
      "start_time": "2017-05-11T10:30:00-0700",
      "id": "373964616338611",
      "rsvp_status": "unsure"
    },
    {
      "description": "Join us for an exclusive insider experience at Scottsdale Museum of Contemporary Art's (SMoCA) of it's latest exhibition, I Remember Not Remembering.  Enjoy a cash bard, mingling and contemporary art. 

RSVP: laurenz@scottsdalearts.org 

Thursday,  April 27th @ 5:30-7:30",
      "end_time": "2017-04-27T19:30:00-0700",
      "name": "AG2 Spring Mixer at SMoCA",
      "place": {
        "name": "Scottsdale Museum of Contemporary Art (SMoCA)",
        "location": {
          "city": "Scottsdale",
          "country": "United States",
          "latitude": 33.491756726407,
          "longitude": -111.9229419889,
          "state": "AZ",
          "street": "7374 E 2nd St",
          "zip": "85251"
        },
        "id": "32589572091"
      },
      "start_time": "2017-04-27T17:30:00-0700",
      "id": "146615392540844",
      "rsvp_status": "attending"
    },
    {
      "description": "Its that time again where the Telluride Colorado trip is right around the Corner!! Lets get ready to Snowboard/SKi!!! 

The dates this year will be January 5-8th 2016. (The 1st full weekend of January).. This year the trip has gone up a bit cause lift passes and transportation has gone up a bit (10$ more from last year).. Its going to be $450 a person this year. This will cover your ride up and back on All Aboard America bus rides (they do have bathrooms in them so feel free to get crunk on the bus ;), 3 day lift pass, 4day 3 night lodging, a party for everyone, and a BBQ, served with cold beer :)!! The buses will depart at 7am on the 5th of January and will be back at around midnight on Sunday the 8th of January. 

Those of you that are veterans, you know the drill!! This trip is a blast every year and gets bigger every time! 

The deposit will be due by Sept 20th of $150 a person, THE DEPOSITS ARE NON REFUNDABLE!! So make sure once you are in.. you stay in!! then the remaining balance of $300 will be due no later then December 10th.. Same as last year.. Anybody who is later then December 10th with the remaining balance there is 20$ late fee!! So don't be late!!! 
If you decide to use credit card, Alpine will end up charging you another 3% of Balance for processing cause you had to use it.. Silly.. I know...

Lets make this trip bigger and better than ever before.. I cant wait to see everyone again and to anyone that has never gone on this trip before.. You don't wanna miss it!! Once you go once, you will wanna go every year!!!

IF you have any questions. feel free to call me at any time
Derek Fout 602-334-3123",
      "end_time": "2017-01-08T00:00:00-0700",
      "name": "14th Annual Telluride Trip",
      "place": {
        "name": "Telluride Ski Resort",
        "location": {
          "city": "Telluride",
          "country": "United States",
          "latitude": 37.933742468314,
          "longitude": -107.85183229089,
          "state": "CO",
          "street": "565 Mountain Village Blvd",
          "zip": "81435"
        },
        "id": "350091519847"
      },
      "start_time": "2017-01-05T07:00:00-0700",
      "id": "1783754845231004",
      "rsvp_status": "unsure"
    },
    {
      "description": "Our house 6:00 pm Main Event Avondale 7:30pm:)) please come we love you kiddies",
      "end_time": "2016-11-12T22:00:00-0700",
      "name": "Prove Brian still exists by surprising him on his 30th birthday",
      "place": {
        "name": "Main Event Entertainment",
        "location": {
          "city": "Avondale",
          "country": "United States",
          "latitude": 33.463111,
          "longitude": -112.282078,
          "state": "AZ",
          "street": "10315 W. McDowell Rd.",
          "zip": "85392"
        },
        "id": "151121805283126"
      },
      "start_time": "2016-11-12T19:00:00-0700",
      "id": "312293089143517",
      "rsvp_status": "attending"
    },
    {
      "description": "STRFKR
GIGAMESH, PSYCHIC TWIN

Wednesday, November 9, 2016
Doors: 7:00 pm
Crescent Ballroom
Phoenix, AZ
$25.00 - $28.00

*This event is 16 and over
Get tickets Stinkweeds, Crescent Ballroom, or here online http://ticketf.ly/2bkxAvx",
      "end_time": "2016-11-09T23:00:00-0700",
      "name": "Strfkr at Crescent Ballroom",
      "place": {
        "name": "Crescent Ballroom",
        "location": {
          "city": "Phoenix",
          "country": "United States",
          "latitude": 33.4517809,
          "longitude": -112.0765933,
          "state": "AZ",
          "street": "308 N 2nd Ave",
          "zip": "85003"
        },
        "id": "168811196520360"
      },
      "start_time": "2016-11-09T20:00:00-0700",
      "id": "323476038043209",
      "rsvp_status": "unsure"
    },
    {
      "description": "The Safe In Sound Festival brings the BASS to Downtown Phoenix with Borgore, LAXX & TERRAVITA Friday October 28th! Get your Tickets Now >> http://rb.ht/2bJ79QV",
      "end_time": "2016-10-29T02:00:00-0700",
      "name": "Safe In Sound Festival Arizona ft. Borgore, Terravita &LAXX",
      "place": {
        "name": "The Pressroom",
        "location": {
          "city": "Phoenix",
          "country": "United States",
          "latitude": 33.445755,
          "longitude": -112.079987,
          "state": "AZ",
          "street": "441 W Madison St",
          "zip": "85003"
        },
        "id": "179509082254272"
      },
      "start_time": "2016-10-28T20:00:00-0700",
      "id": "1743945679203867",
      "rsvp_status": "unsure"
    },
    {
      "description": "Caravan Palace
DJ JonnY Rogers


Friday, June 3, 2016
Doors: 7:30 pm
Crescent Ballroom
Phoenix, AZ
$20.00


*This event is 21 and over
Get tickets at Stinkweeds, Crescent Ballroom, or here online http://ticketf.ly/1RT3LBA",
      "name": "Caravan Palace at Crescent Ballroom",
      "place": {
        "name": "Crescent Ballroom",
        "location": {
          "city": "Phoenix",
          "country": "United States",
          "latitude": 33.4517809,
          "longitude": -112.0765933,
          "state": "AZ",
          "street": "308 N 2nd Ave",
          "zip": "85003"
        },
        "id": "168811196520360"
      },
      "start_time": "2016-06-03T20:30:00-0700",
      "id": "1703937173155245",
      "rsvp_status": "unsure"
    },
    {
      "description": "Hello Cullinan Clan, the Cullinan reunion is fast approaching so I thought this might be a good time to send out a schedule of events and sort of a weekend guide.

Location: 4988 Thornhill Ln, Dublin, OH 43017
Dates: From Noon on Friday, July 31st thru Sunday, August 2nd (whenever)
Main Event: Saturday, August 1st - All Day - for those only coming for one day
Hotels: There are many hotels in the area. Anything on Frantz Rd and all hotels near Tuttle Mall are prefect and a very short drive to the house.
Food: Jerry is handling the food for the most part, I've got the drinks and beer covered. So bring something if you like but it's not required. 

There were several rumors floating around so I thought I would clarify the event times for everyone. Regarding the Dublin Irish Festival, it runs from Friday through Sunday. There will be a breakfast at the house on Saturday morning from 9am to 11 am. The festival doors opens at 11am on Saturday. http://dublinirishfestival.org/

We usually eat breakfast and then head over. For whoever wants to go, we typically set up a Cullinan base of operations in one of the main tents. Tom Cullinan is in charge of getting there early and scouting out the best spot. Cell phone location texting has served us well in the past. 

For anyone NOT interested in the festival, I want everyone to understand that the house is OPEN the entire weekend. Please do not ring the doorbell. Just come in. You can ring the bell if it makes you happy, but by all means come and go as you please. Help yourself to anything in the fridges, food, wine, beer, alcohol. I'm sure people will be coming and going throughout the day so make yourselves at home. I will probably go to the festival for awhile, but not all day/night. My thinking is to go over for a few hours and come back to the house around 4pm. I'm sure the day will be a blur of fun in the end, so schedules are only a guide. 

Activities at the house include boating, waterskiing, tennis, basketball, kayaking, and volleyball. Do not forget your swimsuits! We also have two swimming pools available within a 10 minute drive. We could also sneak out for 9 holes if anyone is interested and time permits. 

At the last summer reunion, several of the musically gifted members of the family played for everyone. Please bring your instrument if you wish to participate.

I used the latest email list from Marilyn's correspondence. I know not everyone is copied, so please forward to anyone in your circle of family contacts. I will also send a Facebook invite although I do not use it much so wish me luck on that one. I'm missing a lot of email addresses, so whoever is Facebook and other social media a lot, please this send to anyone not copied here. 

My email contact is jimc@natsignsys.com. Phone is 614-361-7192.",
      "end_time": "2015-08-02T20:00:00-0400",
      "name": "Cullinan Family Reunion 2015",
      "place": {
        "name": "4988 Thornhill Ln, Dublin, OH 43017"
      },
      "start_time": "2015-07-31T00:00:00-0400",
      "id": "947970031929786",
      "rsvp_status": "unsure"
    },
    {
      "description": "OMG, Zsolt and Xiaojie are married! Let’s celebrate their new committed life in holy matrimony (and Xiaojie's birthday) and share their happiness. No need to take Jose’s happiness pill for at least a month guaranteed!

Some Chinese food will be provided if Xiaojie is in the mood to cook. Other food and drinks are welcome. Gifts are not necessary unless you insist. And Chinese friends, no red envelop please, just come to have fun!

INSTRUCTIONS: If you park on the street you might get towed. There are guest spots around the complex, or you can park along N Gila Springs Blvd by the lake.",
      "name": "Ball and chain party (新婚派对)",
      "place": {
        "name": "5970 W Oakland St, Chandler, AZ 85226"
      },
      "start_time": "2015-06-13T17:00:00-0700",
      "id": "1450901168543151",
      "rsvp_status": "attending"
    },
    {
      "description": "Join intellectual giant Noam Chomsky and Lawrence Krauss for an intimate evening of conversation for an Origins Project Dialogue. Language, Power, Justice will be a candid and unscripted conversation on contemporary issues on the nature of humanity, the power of science and the mind, and global social justice. This will make for a thought-provoking and controversial evening.

Institute Professor at Massachusetts Institute of Technology, Noam Chomsky is a Fellow of the American Academy of Arts and Sciences and the National Academy of Science.  He has recieved numerous awards for his contribution to the study of linguistics, intellectural history, and philosophy, including the Kyoto Prize, the Helmholtz Medal, and the Dorothy Eldridge Peacemaker Award, among others.  A prolific author and public speaker, you can find more information about his publications at http://www.chomsky.info.
Lawrence Krauss is an author, professor, physicist, public intellectual and Director of the Origins Project at Arizona State University. He is called upon to share his views worldwide on many diverse topics and is a sought after speaker for events ranging from the World Economic Forum to the Larry King Show. 

The first 1,250 tickets are free to the ASU community with ASU ID, quantities limited, restrictions apply. Free tickets for the ASU community are available only at ASU Gammage Box office. For the first time, free pizza will be served at Gammage for students with an event ticket and ASU ID.  Pizza will be served from 5:30-6:30pm, first come, first served.

Tickets on sale February 9 from ASU Gammage Box Office 480-965-3434 and Ticketmaster.com.

If you are not local to the Phoenix Metro area, you can watch the live webcast of the event at http://www.ustream.tv/asutv",
      "name": "Chomsky and Krauss: An Origins Project Dialogue",
      "place": {
        "name": "ASU Gammage",
        "location": {
          "city": "Tempe",
          "country": "United States",
          "latitude": 33.416021065904,
          "longitude": -111.93814112272,
          "state": "AZ",
          "street": "1200 S Forest Ave",
          "zip": "85281"
        },
        "id": "107501532872"
      },
      "start_time": "2015-03-22T19:00:00-0700",
      "id": "760396394033783",
      "rsvp_status": "attending"
    },
    {
      "description": "The arch looked so amazing at Gem and Jam Festival with a spiral double helix of LED strips.  We got clearance from the FAA to put it up in Brittney Novelly front yard!  Yea!  Let's dazzle some corporate types!  

If you have ever wondered about how we actually put our structures together, we'll give you a short tutorial and teach you about LED's.",
      "end_time": "2015-03-03T17:00:00-0700",
      "name": "Relight the arch!",
      "place": {
        "name": "4721 N 24th st. phoenix az"
      },
      "start_time": "2015-03-03T15:00:00-0700",
      "id": "1447212508902703",
      "rsvp_status": "unsure"
    },
    {
      "description": "The weather is great and Tanzy has a very nice lounge area when you first enter that is so awesome!!! We'll be there enjoying some food and drinks and celebrating my last year in the 30's! My hubby will be in town, so that's another reason to come say \"hi\"!!! NO GIFTS allowed - just come and be with me instead!!! 

P.S. It's a BYOCC/C party cuz let's face it, I can barely afford my own way. (Bring your own credit card/cash). 
P.P.S. I don't have everyone's facebook, so there's some LSF and JSF people I gotta tell in person - or pass it on if you see someone not invited that loves me!!!
P.P.P.S. We can go to other local places if the group feels the need to change locations after Tanzy Scottsdale",
      "name": "Maciej-Aleks is turning 39 - come celebrate!",
      "place": {
        "name": "Tanzy Restaurant",
        "location": {
          "city": "Scottsdale",
          "country": "United States",
          "latitude": 33.624534,
          "longitude": -111.923877,
          "state": "AZ",
          "street": "15257 N Scottsdale Rd, Ste F-220",
          "zip": "85254"
        },
        "id": "132493350141007"
      },
      "start_time": "2014-04-23T19:30:00-0700",
      "id": "502005979904950",
      "rsvp_status": "unsure"
    },
    {
      "description": "We will be playing the entire night, Friday night March 21, at the Goathead Pub. Come and see us and celebrate Paul's birthday!!!",
      "name": "Defiants Gig",
      "place": {
        "name": "1423 S. Country Club Dr. Mesa, AZ. 85210"
      },
      "start_time": "2014-03-21T21:00:00-0700",
      "id": "606342782782227",
      "rsvp_status": "attending"
    },
    {
      "description": "Lan party at my house",
      "name": "Lan Party",
      "place": {
        "name": "3042 E Minton St Mesa AZ"
      },
      "start_time": "2013-05-11T18:00:00-0700",
      "id": "463016480443312",
      "rsvp_status": "unsure"
    },
    {
      "description": "Another beautiful Studio Ghibli film playing at the theater on mill. Last day to see it is the 25th! I will be going next Tuesday. If your interested just give me a shout out!",
      "name": "Goro Miyazaki: From up on Poppy Hill",
      "place": {
        "name": "Harkins Valley Arts",
        "location": {
          "city": "Tempe",
          "country": "United States",
          "latitude": 33.42516,
          "longitude": -111.93963,
          "state": "AZ",
          "street": "730 S Mill Ave",
          "zip": "85281"
        },
        "id": "193397737472258"
      },
      "start_time": "2013-04-24T18:20:00-0700",
      "id": "187507464730243",
      "rsvp_status": "attending"
    },
    {
      "description": "For everyone who's still going to be here. Because the world is not going to end in 2012.",
      "end_time": "2013-04-21T23:55:00-0400",
      "name": "2013",
      "start_time": "2013-01-01T00:00:00-0500",
      "id": "10153276530984802",
      "rsvp_status": "attending"
    },
    {
      "description": "Come celebrate my birthday Saturday night! Probable Cause will be playing a set after the celebration. $5 cover charge goes directly to the band.",
      "end_time": "2012-10-27T21:00:00-0700",
      "name": "Steve's Birthday Celebration!",
      "place": {
        "name": "We Market Everything",
        "location": {
          "city": "Mesa",
          "country": "United States",
          "latitude": 33.388238047577,
          "longitude": -111.83940924108,
          "state": "AZ",
          "street": "3370 N Hayden Rd #645",
          "zip": "85251"
        },
        "id": "209912932354389"
      },
      "start_time": "2012-10-27T18:00:00-0700",
      "id": "414893441910227",
      "rsvp_status": "attending"
    },
    {
      "description": "Were gonna brew some beer, drink some beer, eat some food and party! We haven't decided on what beer to brew so let us know what you'd like to brew!",
      "name": "Brew Party!",
      "start_time": "2012-10-13T13:00:00-0700",
      "id": "415204728535370",
      "rsvp_status": "unsure"
    },
    {
      "description": "Sarah and Scott Johnson cordially request the pleasure of your company as they celebrate their One Year Anniversary and Housewarming on Saturday September 8th at 6pm.
** Cocktail Attire**

We ask that you only bring yourselves and you RSVP in a timely manner so that we can give the caterer an accurate count. There'll be a bartender too!!! 


Please RSVP by September 2nd, 2012. 
You may also email Sarahj9411@gmail.com with any questions, concerns, or comments.",
      "end_time": "2012-09-08T23:00:00-0700",
      "name": "Anniversary/Housewarming Party!",
      "start_time": "2012-09-08T18:00:00-0700",
      "id": "247631118690926",
      "rsvp_status": "unsure"
    },
    {
      "description": "You know the drill.   Its 4 days this year,  26th-29th",
      "name": "DEFCON 20!!!!",
      "start_time": "2012-07-26T00:00:00-0700",
      "id": "404217639618979",
      "rsvp_status": "unsure"
    },
    {
      "description": "Poker night, $10 buy in",
      "name": "Poker Night",
      "start_time": "2012-07-14T19:00:00-0700",
      "id": "149687848502142",
      "rsvp_status": "unsure"
    },
    {
      "description": "We're watching Fifth element tonight! It's supposed to be very warm, but bring warm clothing anyway. Bring snacks and drinks too if you have them!",
      "end_time": "2012-06-24T22:00:00-0700",
      "name": "Films in the Forest: Fifth Element",
      "start_time": "2012-06-24T19:00:00-0700",
      "id": "380201562044546",
      "rsvp_status": "unsure"
    },
    {
      "description": "We're boating into our campsite at Blue Ridge! This is the best weekend for Joe Davidson, who has the boats. Let me know about conflicts. Hopefully anyone walking this weekend will be done by Friday evening. :-)

Ben's suggestion is that we plan our meals in advance. Sounds like a lovely idea, but I dunno if any of us has both the ability to cook AND the ability to plan in advance.

Nearly the whole way will be by vehicle (of one form or another), so no need to backpack. We can pack a bit heavier (big group meals and ice chest and stuff).

Invite anybody I forgot! (I've gone through my friends list like 4 times over the course of today, and am very tired of staring at it, so don't feel bad if I missed you...)",
      "end_time": "2012-06-17T18:00:00-0700",
      "name": "Blue Ridge Camping Trip",
      "start_time": "2012-06-15T18:00:00-0700",
      "id": "399771010056497",
      "rsvp_status": "unsure"
    },
    {
      "description": "Drum and Bass, and House Monthly featuring Flagstaff Local Producers, Dj's and AZ Premier talent. 

June 8th 

Resident Dj 

Skoolboy 
Full Moon Festival

w/ special guest

Steve Speaks and Eboka
   (neotribal)


Doors open at 9pm
free 21 and up
$5.00 under 21

Great Drink Specials all night long. 
VIP Area.",
      "name": "GrindHouse",
      "place": {
        "name": "Cinnabar Nightclub",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.19494,
          "longitude": -111.6488,
          "state": "AZ",
          "street": "110 S San Francisco St",
          "zip": "86001"
        },
        "id": "102105269837785"
      },
      "start_time": "2012-06-08T21:00:00-0700",
      "id": "401978493180345",
      "rsvp_status": "unsure"
    },
    {
      "description": "We are headed to the Salt River to float and relax. Wear your bathing suit and loose clothing. Bring a towel, PLENTY of water, alcohol if you want (plastic and cans only), snacks, and SUNSCREEN!!! Small coolers will be perfect. If you have a crummy bed sheet, this will save you from burning body parts on the rubber. Any questions, feel free to ask.",
      "end_time": "2012-06-01T15:00:00-0700",
      "name": "River Tubing!!",
      "start_time": "2012-06-01T09:00:00-0700",
      "id": "345634375502834",
      "rsvp_status": "unsure"
    },
    {
      "description": "Does Wednesday work for everyone?  I made this a private event.

POMO:
http://www.urbanspoon.com/cities/22-phoenix/restaurants/1514474-pomo-pizzeria-napoletana/menu

Crust:
http://www.urbanspoon.com/cities/22-phoenix/restaurants/661893-crust-pizza-wine-cafe/menu",
      "name": "Dinner",
      "place": {
        "name": "Pomo Pizzeria Napoletana",
        "location": {
          "city": "Scottsdale",
          "country": "United States",
          "latitude": 33.5662956,
          "longitude": -111.9258118,
          "state": "AZ",
          "street": "8977 N Scottsdale Rd Ste 504",
          "zip": "85253"
        },
        "id": "334412448018"
      },
      "start_time": "2012-05-30T19:00:00-0700",
      "id": "172919549504299",
      "rsvp_status": "attending"
    },
    {
      "description": "May 4 – Star Wars Day: A time to say ‘May the fourth be with you’, as we celebrate rebels seeking and (spoiler!) ultimately gaining freedom from an Evil Empire.

May 5 – Cinco De Mayo: a time to celebrate rebels seeking and (spoiler!) ultimately gaining freedom from an evil empire.

May 6 – Brittney’s birthday: a time to celebrate Brittney rebelliously seeking and (spoiler!) ultimately gaining freedom from an evil empire.
 
As these dates are too close to be coincidental, we’ll have to have a party for the glorious combinacion of all tres!
 
This party will be lo mejor de ambos mundos. Or, I suppose, all worlds! There will be plenty of Margaritas and Dos Equis (also to symbolize the two blights to the rebel cause: Darth and the Emperor). There will be Vader margarita jello shots, and maybe even a Death Star pinata! We are open to other ideas, too. If you have a light saber or two, they are also welcome.


 
You love it?
I know.",
      "name": "May the Fourth be Contigo",
      "start_time": "2012-05-04T19:45:00-0700",
      "id": "340490912680372",
      "rsvp_status": "unsure"
    },
    {
      "description": "We're at TotW again! Travis says the theme is s'mores around the campfire!",
      "end_time": "2012-05-01T22:00:00-0700",
      "name": "Crazy Cookout Tuesday #81",
      "start_time": "2012-05-01T18:30:00-0700",
      "id": "292155504202393",
      "rsvp_status": "unsure"
    },
    {
      "description": "Dress up in 40's attire- dresses or zoot suits- pin stripes and polka dots! Be ready to dance the night away. Bring wine & cheese to share. It's my last year in my 20's so let's make it count!  Bring swim suit just in case hot tub calls for us, too!",
      "end_time": "2012-04-15T02:00:00-0700",
      "name": "Swing House Dance Birthday Party!",
      "start_time": "2012-04-14T19:30:00-0700",
      "id": "850379671709344",
      "rsvp_status": "attending"
    },
    {
      "description": "Flagstaff Cultural Partners and the Artists’ Coalition of Flagstaff are excited to present the 10th Annual Recycled Art Exhibition with a free opening reception held on April 7, 2012 from 6:00-9:00pm. Bring the entire family for an evening of art, food, and a live circus act!
 
In the Center’s theater, performances will take place throughout the evening. The feature entertainment will be provided by Flagstaff’s premier circus troupe, Circus Bacchus. They will be playing music on instruments made from recycled materials and wearing costumes all made from recycled materials. There will be trapeze, fire dancing, stilt walking, hula hooping, a strong man and more! The full Circus Bacchus band will fill the gallery with their funky tunes! Visit them on the web at http://www.circusbacchus.org/.
 
Awards will be presented at the reception to artwork entries in the exhibition for Most Creative, Most Humorous, Most Useful, Best Use of Material, Elegance, Simplicity, and Best of Show. A People’s Choice award will be announced at the close of the exhibition. All visitors to the exhibition will have a chance to vote for the People’s Choice award. 
 
The Recycled Art show is organized every year through a partnership with Flagstaff Cultural Partners, the Artists’ Coalition of Flagstaff, and the City of Flagstaff. All artwork in the show must contain at least 80% recycled or reused materials. The possibilities are endless, and the exhibition is a testament to the creativity of the artists and community of Coconino County. The purpose of the exhibition is to encourage the reuse of a variety of materials in new, different, and creative forms and to promote recycling and resource conservation.
 
Artists will offer workshops and demonstrations to the public on creating recycled works each Saturday throughout the run of the exhibition. These will take place on April 14, 21, 28, and May 5 and 12. A full list of workshops will be posted soon on culturalpartners.org/recycled.htm.
 
The exhibition will run from April 10 – May 12, 2012 at the Coconino Center for the Arts, located at 2300 N. Fort Valley Road, Flagstaff. The Gallery is open Tuesdays through Saturdays, 11:00am-5:00pm. Admission is free. For more information, visit culturalpartners.org/recycled.htm or call (928) 779-2300.",
      "end_time": "2012-04-07T21:00:00-0700",
      "name": "Recycled Art Exhibition Opening Reception",
      "place": {
        "name": "Flagstaff Arts Council",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.225009412612,
          "longitude": -111.65523885677,
          "state": "AZ",
          "street": "2300 N Fort Valley Rd",
          "zip": "86001"
        },
        "id": "44684168258"
      },
      "start_time": "2012-04-07T18:00:00-0700",
      "id": "809862655757560",
      "rsvp_status": "unsure"
    },
    {
      "description": "Huzzah! It's that time of year again -- Ren Fest! For those of you who may not know, the Renaissance Faire is an annual festival of wit and anachronism down in Phoenix. This year, it's running from Feb 11 - April 1. This year kind of got away from me, so I'm proposing going the last weekend possible. (No fooling.)

Join me and:

Spearn to leek in a lifferent danguage!

http://www.torysteller.com/ 

Enjoy Adam's Crack!

http://www.winrichwhips.com/

Shove your face full of phallic imagery!
 
http://royalfaires.com/arizona/images/stories/FestivalMarketPlaceHighRes/food-feast-69.jpg

And much, much more!

Costumes optional.**


Logistics:

What seems to work best is leaving for Phoenix on Friday night, going to the Faire on Saturday, and then driving back up to Flag on Sunday. Drivers!: At present, my only way down is by Shuttle, so we need automobile volunteers! Free room (and probably some Mom Food) is available for all at the Hudson Abode.

The Faire doors open at 10 am and you really want to be there on time. Getting there a half hour early is also fun. Seriously. They entertain you at the door. And I am not just making this up to encourage timeliness.

Tickets can be purchased at the gates, but they're a couple bucks cheaper if we buy them at a grocery store ahead of time. (Like the night before.)

Also, invite more people. The more, the huzzahier!

**Costumes NOT optional. My folks [apparently no longer have any spare costume parts as they are all in storage, but you should still try to dress up, anyway!] Ren Fest is one of the few places where not looking silly makes you look silly. Resistance is futile.


2012!",
      "end_time": "2012-04-01T17:00:00-0700",
      "name": "Ren Fest 2012!",
      "start_time": "2012-03-30T17:00:00-0700",
      "id": "323947967654352",
      "rsvp_status": "unsure"
    },
    {
      "description": "Hey everybody!!! I wasn't sure if I wanted to celebrate my birthday on the actual day (saturday, 24th) or on friday (23rd) so, why the heck not just celebrate it Friday AND Saturday! As most of you probably know, The Maverick is my favorite place so I am going to do both of the nights there and if you can come on friday, saturday, or even both nights that would be cool too. Just so everybody is aware, Friday nights at this place is super busy. There will be a line that forms probably around 9pm for a lot of people trying to get in however, it goes relatively quick. Both nights have a $5 cover after 8pm. On Fridays 8-close they have $1 beers and on Saturday 8-close they have $2 well margaritas! Come give my favorite bartenders and servers your money and of course, I want everyone to come have some fun with me at my favorite place for my birthday! If you have any questions call/text me (516)-670-4436. Love y'all <3 <3",
      "end_time": "2012-03-25T02:00:00-0700",
      "name": "Jodi's Birthday Weekend",
      "place": {
        "name": "The Maverick",
        "location": {
          "city": "Tucson",
          "country": "United States",
          "latitude": 32.24698,
          "longitude": -110.85051,
          "state": "AZ",
          "street": "6622 E Tanque Verde Rd",
          "zip": "85715"
        },
        "id": "120696394613458"
      },
      "start_time": "2012-03-24T21:00:00-0700",
      "id": "966376620039904",
      "rsvp_status": "unsure"
    },
    {
      "description": "Insomniac | Bassrush | Steve LeVine Entertainment | Dubstep.Net 

PRESENT: The NOANTIDOTE Tour ft. NiT GRiT & Two Fresh

Purchase your tickets here: http://bit.ly/wVP0dX

Doors open at 9:00pm , 18 +


NiT GRiT

► www.nitgrit.com
► www.facebook.com/nitgrit
► www.twitter.com/nitgritmusic
► www.soundcloud.com/nit-grit

TWO FRESH

► www.twofreshbeats.com
► www.facebook.com/twofreshbeats
► www.twitter.com/twofreshbeats
► www.soundcloud.com/two-fresh-beats

School of Rock

► 411 South Mill Avenue 
► Tempe, AZ 85281
► (480) 966-3573

Insomniac

► www.insomniac.com
► www.facebook.com/insomniacevents
► www.twitter.com/insomniacevents

Bassrush

► www.bassrush.com
► www.facebook.com/bassrush
► www.twitter.com/bassrush

Steve LeVine Entertainment & Public Relations

► www.slentertainment.com
► www.facebook.com/slemusicevents
► www.twitter.com/slemusic

Time slots:

9-9:50 JUST CRIT
9:50-10:40 Riot Earp
10:40-11:30 ProtoHype
11:30-12:45 NiT GriT
12:45-close Two Fresh


More Up Coming Steve LeVine Entertainment Acts:

3/21 :: The NOANTIDOTE Tour ft. NiT GRiT & Two Fresh at School of Rock
3/23 :: DJ Soloman at Axis Radius
3/24 :: Manufactured Superstars at Axis Radius
3/30 :: Fedde Le Grand at Axis Radius
3/31 :: Bassjackers at Axis Radius
4/01 :: Scooter & Lavelle at The Mint
4/13 :: DJ BL3ND at Axis Radius
4/14 :: Cazzette at Axis Radius
4/19 :: Borgore at School of Rock
4/27 :: Manifesto at Axis Radius
5/11 :: Gabriel & Dresden at Axis Radius
5/13 :: Serge Devant at The Mint
5/18 :: Mark Knight at Axis Radius
5/28 :: Rusko at The Marquee Theatre
6/02 :: AN-21 at Axis Radius
7/26 :: Kaskade's Freaks of Nature Tour at The Rialto Theatre, Tucson",
      "end_time": "2012-03-21T23:00:00-0700",
      "name": "The NOANTIDOTE Tour ft. NiT GRiT & TWO FRESH",
      "place": {
        "name": "School of Rock Mill Ave",
        "location": {
          "city": "Tempe",
          "country": "United States",
          "latitude": 33.42607,
          "longitude": -111.93961,
          "state": "AZ",
          "street": "411 S Mill Ave",
          "zip": "85281"
        },
        "id": "141855472518903"
      },
      "start_time": "2012-03-21T20:00:00-0700",
      "id": "808413569242648",
      "rsvp_status": "attending"
    },
    {
      "description": "Pi-qued your interest? We'll be enjoying pi(e), eating pi-zza, perhaps pi-stachios, listening to pi-ano tunes (probably not), and watching Troll II. (You think Troll II has nothing to do with pi? Au contraire! II (roman numerals for 2) looks like two L's. there are 3 non L's in Troll. One vowel. Four consonants. One T. Five letters. We could go on (like Pi. But we won't.))

Other options:
-Trivial Pursuit (a nod to those who try to figure out the last digit of pi)
-Converting all numbers to base pi (4 cookies would be a lot!)
-Reverse Jenga (or other games)

We're up for other ideas as well - infinity is the limit!",
      "end_time": "2012-03-14T23:30:00-0700",
      "name": "Pi Day Celebration!",
      "start_time": "2012-03-14T17:30:00-0700",
      "id": "997376050286768",
      "rsvp_status": "unsure"
    },
    {
      "description": "Sounds like people want to do a Mexico trip again this year! That's good, cause Mexico trips are awesome. We discussed going somewhere besides Puerto Peñasco this year, but travel time and cost seem to be limiting factors. If anyone has ideas, let me know.

The earliest I can leave is Wednesday night. Also, Thursday morning, Thursday night, and Friday morning would work, depending on everybody's schedule. Thoughts?

They say you need a passport. They've been saying that for years. We haven't had a problem yet. It's up to you if you don't want to risk it, but so far we've made it through every time.

As for safety, the area we're going is extremely safe. The US State Department travel advisory for Puerto Peñasco says you shouldn't drink and drive, and should be careful of road conditions on dirt roads. The State Department specifically endorses our route as well.

You should come! It will be fun!",
      "end_time": "2012-03-18T19:00:00-0700",
      "name": "Spring Break 2012",
      "place": {
        "name": "Hotel Viña Del Mar, Puerto Peñasco",
        "location": {
          "city": "Puerto Peñasco",
          "country": "Mexico",
          "latitude": 31.300355014588,
          "longitude": -113.54989077278,
          "street": "Circunvalación",
          "zip": "83554"
        },
        "id": "123003121117136"
      },
      "start_time": "2012-03-14T16:00:00-0700",
      "id": "255392757881141",
      "rsvp_status": "unsure"
    },
    {
      "description": "WE WILL NEED TO PURCHASE TICKETS ABOUT 5-MONTHS IN ADVANCE IN ORDER TO GET THE CHEAPEST PRICE WE CAN, KEEP THIS IN MIND AND START SAVING NOW!

EDIT: I found out that technically we do not need to have th entire amount in order to book.  So we may only need around $200 to book the tickets per person.  Although in order to have money for spending also, I would suggest still trying to get the full amount by the time we book.  I will also be looking into group discounts and see how many we would need to have in order to get it.

Found the exact days for Spring Break in 2012.  The event is now set for those dates.  The bad news is that spring break for all you ASU kids is the week after!  

The 9 day cruise does not go the one week that we are on spring break ( unless you go to ASU ) for 2012 but there is the 7 day cruise, main difference is only one day is spent in Cabo San Lucas and we do not go to La Paz but I think that will be fine and will result in the cruise costing slightly less.

If we decide to go on Carnival and for some reason someone who is not 21 still wants to come they need to make sure they are WITH someone that is at least 25.   The Cruise Line we choose may change and if it does there are some that only require you be with someone that is 21 or allow anyone that is 18+ to be on the ship unaccompanied.

Here is a link: http://www.carnival.com/BookingEngine/ProductView/?embkCode=LAX&itinCode=MR9&durDays=7&shipCode=SL&subRegionCode=MR&sailDate=3/11/2012&sailingID=58344&numGuests=2&showDbl=False&isOver55=N&isPastGuest=N&stateCode=

Costs w/ Two People ( + ~$100 - ~$150 for tips on boat ):
Interior: $540
Ocean View: $640
Balcony: $790
Suite: $1,230

Break down of the preliminary costs to go on the cruise for 2 people in an interior room
( [ $1,300 [ cruise fees] ] + [ $300 [ tipping expenses ] ] ) / ( 2 [ # of people sharing room ] )
Estimated Cost ( for interior room ): ~$800 per person + spending money + ( gas, parking [ sometimes have to pay while you are on the cruise ] )
Amount needed by 5 months: ~$650

I know that sometimes the suites will hold more people and that it may actually be a good option for a larger group or possibly an Ocean View or Balcony because they may have more options for sleeping area and still save everyone some money.

Costs w/ Four People ( + ~$50 - ~$75 for tips on boat)::
Interior: $470
Ocean View: $535
Balcony: $624
Suite: $1,260

Break down of the preliminary costs to go on the cruise for 4 people in an interior room
( [ $2,150 [ cruise fees] ] + [ $300 [ tipping expenses ] ] ) / ( 4 [ # of people sharing room ] )
Estimated Cost ( for interior room ): ~$612.50 per person + spending money + ( gas, parking [ sometimes have to pay while you are on the cruise ] )
Amount needed by 5 months: ~$537.50

There are two main tips that you should be prepared to fork out at the end of the week which can be combined with everyone in your room because you all share the same room and everyone will dine with each other and have the same waiter all week.  At the end of the trip, combined by everyone in the room, should leave ~$100 for the people that make your room and about ~$100 or so for the waiter that servers you food each night.

Schedule:
Day One: Leave Los Angeles at 4:00pm
Day Two: Day at Sea
Day Three: Day at Sea
Day Four: Puerto Vallarta
Day Five: Mazatlan
Day Six: Cabo San Lucas
Day Seven: Day at Sea
Day Eight: Arrive at Los Angeles at 9:00am

Every night on the cruise everyone goes to a fancy or themed dinner where we get served as if we were at a restaurant.  There are several restaurants on the ship and usually you rotate through them.  I believe that these may be 100% optional but they serve some damn good food ( and you can order as much as you like ) such as King Crab, Steaks, etc with some bomb appetizers and deserts.

We also could eat at the fancier restaurants if we want but those usually require reservations and are not included with the ship so we would have to buy the meals.

If anyone goes to the link they can view excursions that are hosted by the boat that can be purchased and people can partake in.  However I suggest that people avoid these as you can usually find some Mexican in what ever port we are offering the same service for a cheaper price because we bypass the ships surcharge.

Feel free to suggest other cruises if you decide you want to do some research for yourself.  I will just keep posted the one that seems to work best.  Going to see if Norwegian or Royal Caribbean Cruise Lines have any similar  offerings.

If we order in advance ( 5+ months ) we get cheaper prices and the chance to possibly be automatically upgraded.  No matter the cruise we choose, people will most likely have to decide if they want to have 2, 3, or 4 to a room and split into groups.  As long as there is availability on the boat anyone will be able to buy tickets they just may cost more.

We are going to take a cruise ( most likely to Mexico on the Carnival Cruise Lines ) over Spring Break 2012.  The departure location and cruise location may change.  Most people should be 21 by March 2012.  If you plan on and want to come start saving now! A 7-9 day cruise will cost around $700 dollars each and will not include any alcohol or food/items bought off the ship!  There will be plans to smuggle alcohol onto the ship ( which is pretty damn easy ) to bring down the cost needed to purchase alcohol throughout the trip.  Keep in mind that each cabin is for two people, so people will need to be in pairs!  Some rooms can accompany up to 4 people and may make the cost slightly less.  A little extra money may be needed for when you drunkenly order room service and have to tip the person who brought you free food as well as at the end of the week where you tip your waiter and the kind people who make our rooms each night.

Currently am debating possibly staying one or two nights in San Diego/Los Angeles (would not happen if we did a 9 day cruise as we would leave port on Friday at 4:00pm), or where ever we depart, before we depart on the cruise.  If we do not we may not have to arrive until Sunday.

If you have someone you would like to invite on this trip please inform Caleb, Erich, Micheal or Myself.  A trip like this will take planning and we will need to know for sure who all is interested. 

We will be dressed in our tuxedos the entire time we are on the cruise and will sport our fancy attire during every activity we undertake.

More information to come in the future.",
      "end_time": "2012-03-18T09:00:00-0500",
      "name": "Mexican Aquatic Tuxedo Endurance Extravaganza",
      "start_time": "2012-03-11T11:00:00-0500",
      "id": "1016977624980862",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come see my new house!  We will have a big cookout with lots of food!
And (hopefully) thus begins Brian's semi-annual party/cookout/get-together.

We will have:
Beer
Bratwursts
Burgers
Hot dogs
Soda
And a few salad like side dishes

What you should bring:
Smiles :)

FYI: I also love Home Depot.",
      "end_time": "2012-03-10T21:00:00-0700",
      "name": "Brian's House Warming Party",
      "start_time": "2012-03-10T17:00:00-0700",
      "id": "988879147789102",
      "rsvp_status": "attending"
    },
    {
      "description": "We're having an open house/party now that we've mostly moved in. Hooray! We'll have fresh, grilled flounder from Mexico (and other treats), an air hockey table, tangelos, fun games, home-brewed beer, etc! Who could ask for anything more?",
      "end_time": "2012-03-03T21:00:00-0700",
      "name": "Open House",
      "start_time": "2012-03-03T15:00:00-0700",
      "id": "696544967122483",
      "rsvp_status": "attending"
    },
    {
      "description": "It's SKA NIGHT at the Rogue again, with a Treasurefruity twist...  YUM!

Catch the 2tone Lizard Kings, the Sara McAllister Trio (featuring Cameron Tuttle on drums), and Treasurefruit all in one night at everyone's favorite south Scottsdale dive, the Rogue.


$5 / 21+",
      "end_time": "2012-03-03T01:30:00-0700",
      "name": "2tone Lizard Kings, Sara McAllister Trio, and Treasurefruit @ The Rogue",
      "place": {
        "name": "The Rogue Bar",
        "location": {
          "city": "Scottsdale",
          "country": "United States",
          "latitude": 33.453249402445,
          "longitude": -111.92595667546,
          "state": "AZ",
          "street": "423 N Scottsdale Rd",
          "zip": "85257"
        },
        "id": "73415031001"
      },
      "start_time": "2012-03-02T21:00:00-0700",
      "id": "781774408603883",
      "rsvp_status": "unsure"
    },
    {
      "description": "Please give us your email/mailing address at this link for an announcement: 

https://docs.google.com/spreadsheet/viewform?formkey=dEFxR2FfVmJPeHRtdXdWMU9iUzZjR3c6MQ


Also check out our website at:

http://www.weddingwire.com/matthewandjulianne",
      "end_time": "2012-02-25T18:00:00-0700",
      "name": "Matthew & Julianne's Wedding Reception",
      "start_time": "2012-02-25T16:00:00-0700",
      "id": "1068367533178728",
      "rsvp_status": "unsure"
    },
    {
      "description": "Tickets & info: http://www.azfetishball.com/tickets.php

Sponsored by: Firebird Floggers, Cheetahs Gentleman's Club, Off Chute Too & Lingerie Superstore

*Faderhead
*Industrial Girl Bike Gang feat Amelia Arsenic & Valerie Gentile of Angelspit in a very special DJ Duo
*Masuimi Max
*CoCo Katsura
*Catwalk Fashion Show by Pierced Heart Clothing
*Life Suspended
*live wedding of International Fetish Model Maegan Machine \"I Love Maegan Machine\" and International Rocker Charlie Webster at 8:45PM on the main stage!
*Relax Your Erotic Senses in The Fetish Spa - An Opportunity to Try Different Types of Fetish Activities in a Safe Environment. Flogging, Boot Blacking, Erotic Massage, Candle Wax, Electricity, Bondage & More.
*Intro & interludes by HnH/AZFB Resident DJ's DJ_Dark_Mark & Beautiful John.
*Special VIP Bar w/Human Sushi Platter, chocolate fountains, Special VIP Performances & more
*Full VIP AfterParty feat DJ William Fucking Reed
*more TBA!!

Tickets & info: http://www.azfetishball.com/tickets.php",
      "end_time": "2012-02-11T23:00:00-0800",
      "name": "Fetish Revolution 2012",
      "start_time": "2012-02-11T20:00:00-0800",
      "id": "968787946479265",
      "rsvp_status": "unsure"
    },
    {
      "description": "Party at my place!  We will have a night of games,  with drinks!  Apples to apples with hot apple cider.   You are welcome bring games, drinks and a sleeping bag. We have two free rooms,  so you can pass out here or come back in the morning.

For breakfast will have Waffles with real maple syrup and Mimosas!",
      "end_time": "2012-02-11T11:30:00-0700",
      "name": "Surreptitious...",
      "start_time": "2012-02-10T21:00:00-0700",
      "id": "807540502659438",
      "rsvp_status": "unsure"
    },
    {
      "description": "http://www.mammothmountain.com/

Get there sometime Friday night. Enjoy 2 days of snowboarding/skiing. Leave Sunday night.

What to bring:
Snowboard or skiis, helmet if you want to be fancy.
Ski goggles
Good warm waterproof gloves
Wool socks
Snow clothes

Friends
Money for 2 days of lift tickets

You will want to stretch before each day, especially the first day.
Spend a lot of time in the Jacuzzi on Saturday night, so you can be ready for another wonderful day.

Bring a sleeping bag and pillow. Odds are you will not be the one on the bed.",
      "end_time": "2012-01-22T23:30:00-0800",
      "name": "Snowboarding/Skiing",
      "place": {
        "name": "Mammoth Mountain",
        "location": {
          "city": "Mammoth Lakes",
          "country": "United States",
          "latitude": 37.650783980407,
          "longitude": -119.03731889728,
          "state": "CA",
          "street": "10001 Minaret Rd",
          "zip": "93546"
        },
        "id": "94078717394"
      },
      "start_time": "2012-01-20T22:00:00-0800",
      "id": "960727853958164",
      "rsvp_status": "attending"
    },
    {
      "description": "Lineup:
-----------------
Authority Zero http://bnds.in/runvGM
Voodoo Glow Skulls
Skyfox http://bnds.in/ncfaEQ

Find Local Concerts: http://bnds.in/jlStT0",
      "end_time": "2012-01-15T22:00:00-0800",
      "name": "Authority Zero @ Orpheum Theatre - Flagstaff, AZ",
      "start_time": "2012-01-15T19:00:00-0800",
      "id": "734332799997585",
      "rsvp_status": "attending"
    },
    {
      "description": "Nice hike with friends. Invite anyone! :) Hope to have lunch after.

Will put up Squaw Peak address soon for those who want to meet there.",
      "end_time": "2012-01-14T13:00:00-0700",
      "name": "Saturday Squaw Peak Hike with friends :)",
      "start_time": "2012-01-14T10:00:00-0700",
      "id": "847681971952643",
      "rsvp_status": "unsure"
    },
    {
      "description": "Hey everyone,

So I think I’ve talked to everyone on this list about starting a few projects on the side. I know we have a ton of brilliant folks in Flagstaff that have great ideas. So what I want to do is have some fun, learn from one another, and focus on about one project a month, and try to get the first idea accomplished. I started a quick website, am registering a business, setup a project management tracking system and am getting a business bank account setup. 

I would like to have a meeting this Wednesday (Jan 11 at 6pm) to kind of get things rolling. If you are still interested please come or if you can’t make it let me know and I’ll keep you up to speed. 

First off you can see the website at 
ElectricLifeEngineering.com

But really the main thing is the project management system which can be assessed here.
ElectricLifeEngineering.com/redmine

If you’re not familiar with redmine it’s a system that keeps track of everything about a project. It has feature tracking, bug tracking, wikis, forums, version control system integration and a ton of other stuff. This will be at the heart of every project we do. It’s a great way to keep things organized and accessible to everyone. 

One more thing, if you have an idea to bring  (try to limit it to 2 ideas) please write a paragraph about the idea, and send it to me. I’ll make sure it gets to others before the meeting. This way we can somewhat be thinking about the project idea’s beforehand. I have attached my two ideas lower. 

Outlined structure of the first meeting:
•	Introduction to the idea and business model
o	Feedback would be encouraged. 
•	Introduce Website and Redmine Project Management site
•	Design matrix discussion for picking a project (if we think this is a good way to choose)
o	categories may be:
o	How interesting it is
o	In the scope of the talents
o	Innovative?
o	Interest from members
o	Marketability

o	Things the project has to have
-	In the scope of our resources we currently have
-	Reasonable amount of time to finish ~1 month long
•	Idea presentations and reviews.
•	Each person fills in the design matrix sheet to pick a project
•	Project chosen
•	Define all project goals, features, etc..
•	First obtainable release defined 
•	Initial outline of the sub-project for this first obtainable release.
•	Loose Timeline laid out
•	Project tasks and management assigned. 

Is there anything else I need to add?

People Invited to the first meeting

Joseph Davidson 	928-221-0940	josephraydavidson@gmail.com	Electrical Engineer
David Smith									Computer Scientist
Travis Hudson	 								Computer Scientist
Kenny   ( I don’t know your last name for some reason )			Electronics and Computers
Kenney Schipper  								Mechanical Engineer
David Aslanian	 								Computer Scientist
Michael Brooks	 								Computer Scientist
Brian Cullinan									Computer Scientist

I would like to keep the meeting to a small group at first, to allow for an efficient meetings and effective decision making. If you feel like there is someone else that can contribute feel free to bring them, just maybe let me know. 

Joseph Davidson’s Ideas for January 2012:

Project 1: An array of antenna’s that automatically gain access to surrounding wifi hotspots. Connected to a custom router box you would have super-fast internet for your network.
  
Project 2: Simple event display unit / slide presenter that can connect to a TV with HDMI in. Using a small beagle board (low power computer) that can fit behind the TV. The TV could then display upcoming events or messages that the user wants it to display. Example would be, the TV’s in the business or engineering building, could show upcoming events or a messaged upload from a web interface.",
      "end_time": "2012-01-11T21:00:00-0700",
      "name": "Electric Life Engineering, First Meeting",
      "start_time": "2012-01-11T18:00:00-0700",
      "id": "910883898965142",
      "rsvp_status": "attending"
    },
    {
      "description": "You're invited to celebrate us turning \"Bakers' Dozen x 2.\" We'll have catered BBQ so bring your favorite side dish if you want. There will be plenty of drinks provided. 
We have a heated pool and Jacuzzi just a few steps away if you're interested. So join in, we would love to start the new year off right.",
      "end_time": "2012-01-07T22:00:00-0700",
      "name": "Scott and Sarah's Birthday Party",
      "start_time": "2012-01-07T18:00:00-0700",
      "id": "836163616431515",
      "rsvp_status": "unsure"
    },
    {
      "description": "Most of you know the drill by now, but in case you haven't, PREPARE FOR A DAY OF EPICNESS!!!  
Tips for survival:
- be prepared to run around playing epic games!
- bring comrades who also delight in epic adventures!


Due to field maintanence, we are moving to a NEW and EXOTIC location, Chaparral Park. Baseball field 2. 

As always, we are open to the idea of celebrating our bought of epicness by going out for an epic meal of champions after.  Should this interest you, be sure to have some monetary wealth on your person to finance it.",
      "end_time": "2011-12-30T16:00:00-0700",
      "name": "How about another round of EPICNESS",
      "start_time": "2011-12-30T13:00:00-0700",
      "id": "882323991824471",
      "rsvp_status": "unsure"
    },
    {
      "description": "We will be playing three full sets so come down and check us out

here's their web site:

http://realfunbar.com/",
      "end_time": "2011-12-11T00:00:00-0700",
      "name": "Probable Cause Live in Mesa!",
      "place": {
        "name": "The Monastery",
        "location": {
          "city": "Mesa",
          "country": "United States",
          "latitude": 33.452280199732,
          "longitude": -111.72769344349,
          "state": "AZ",
          "street": "4810 E McKellips Rd",
          "zip": "85215"
        },
        "id": "181234091907738"
      },
      "start_time": "2011-12-10T19:30:00-0700",
      "id": "895148813870080",
      "rsvp_status": "attending"
    },
    {
      "description": "Update:
Please send Megan $20 per person via PayPal (megan.mcnamee.rd@gmail.com) or Wells Fargo (ask me for account #) if you plan to attend.  We will hop on the party bus with our booze in tow at 10:30 PM and have to have it back to our house by 2:30 AM.  The Old Town bars are still TBD, but I'm taking suggestions.

The pre-party starts at 8 PM; we will have beer, wine, and snacks.  Feel free to bring other booze that you prefer.  Don't forget your awesome costume!  Feel free to invite friends!

******************************************

Hey guys!  Holiday schedules fill up quickly, so I wanted to send out a Save the Date for our upcoming DATE DASH!  We will have a rockin' pre-party at our house and will take a bus around the town and to various bars.  Details are still TBD, but please let me know if you would be interested in coming so we can start to determine cost.  I'm thinking it will be about $20 a person for the bus.

The theme is Santas and Ho Ho Hos, so wear your favorite holiday gear - any holiday will do.  For those of you who have never heard of a date dash, here's what is is: 

1. You dress up in an awesome themed costume.
2. You go to a pre-party and have a lot of cocktails.
3. You get on a bus that takes you to bars where you have more cocktails.
4. You realize it's the most amazing night of your life.

You do NOT have to bring a date and you DO have to invite friends to join in on the fun.  If you were never in Greek life, here's your chance to understand why we paid ridiculous dues each semester: for the date dashes.

Don't worry, we might do shirts too...duh.",
      "end_time": "2011-12-04T02:00:00-0700",
      "name": "Santas and Ho Ho Ho's DATE DASH",
      "start_time": "2011-12-03T20:00:00-0700",
      "id": "823115571077198",
      "rsvp_status": "attending"
    },
    {
      "description": "Give the gift of comfort this holiday season by shopping with Private Quarters.  Come have snacks and wine, together!  Invite your friends!

For ordering, see www.privatequarters.net/linda.",
      "end_time": "2011-11-30T21:00:00-0700",
      "name": "Brian's PQ Party!",
      "start_time": "2011-11-30T18:00:00-0700",
      "id": "810201162428966",
      "rsvp_status": "attending"
    },
    {
      "description": "***THIS WEEK AND THIS WEEK ONLY UK THURSDAY MOVES TO WEDNESDAY TO NOT INTERRUPT YOUR TURKEY DAY PLANS WITH SPECIAL GUESTS: URBAN ASSAULT (aka Faust & Shortee)***

Urban Assault (aka Faust & Shortee) have been a powerhouse in the DJ/Production world for the last 16+ years electrifying audiences on a global scale. Specializing in the grimy beats & filthy bass line genres of Dubstep, Drum & Bass, Drumstep and Electro House, this dynamic duo continues to awe masses worldwide both in the studio & on stage complete with live 4 turntable DJ trick sets scratched to perfection.  

Ranked as one of the top 5 Turntablists in the world by SPIN Magazine, Faust released the first turntablist album in history, the critically lauded Man Or Myth and continues to push the boundaries of his production today in various genres. Shortee is acknowledged as one of the most diverse, technically skilled female DJs in the world, described as “The World’s Premier Female DJ” by the Grammy Foundation and named “Queen of the Scratch World” by DJ Times. 

Both were featured in the award-winning documentary “SCRATCH” (Palm Pictures) marking their historical contribution to the art of DJing and Turntablism. Together their solo & team albums have earned them critical acclaim in major publications like SPIN, URB, Remix, Knowledge, ATM, DJ Times, Rolling Stone etc., while their music is featured on networks such as MTV, NBC, CNN, HBO, ESPN and more. 

In addition to rocking stages globally, Faust & Shortee are constantly in the studio producing music for release on various record labels as well as their own imprints. They successfully run two multi-genre labels: Heavy Artillery Recordings (House / Drum & Bass / Breaks / House / Dubstep / Drumstep) and 5 Star Records (Hip Hop / Battle / DJ Tools). Their original tunes and remixes frequent the Top10 charts on the regular and some have held the #1 spot for weeks at a time. A few of their most popular Heavy Artillery EPs include “Scarface”, “Kid Dynomite”, “Lose Control” and “Dope” and their tune “Away” was nominated for the ‘Best Jungle/D&B track’ in the 2008 International Dance Music Awards. In addition, their infamous “Red Raider” EP, held the #1 spot on both Beatport & TrackItDown and was ranked as one of TrackItDown’s Top10 Drum & Bass releases of 2009, alongside such artists as Sub Focus, Deadmau5, Chase & Status, Noisia, DJ Fresh and The Prodigy, and it still continues to return to the charts time & time again today. 

Whether they appear as ‘Faust & Shortee’ or disguised as the grimy “Urban Assault”, the bass line is always front and center. Their ambitious schedule shows no signs of letting up as they continue to bang out killer beats in the studio and drop devastating bass on stages worldwide.

Support from Radar | S33D | E-Bomb

***stay chooned for more announcements/surprises***",
      "end_time": "2011-11-24T02:00:00-0800",
      "name": "UKT Presents: URBAN ASSAULT (aka Faust & Shortee) 18+",
      "place": {
        "name": "School of Rock Mill Ave",
        "location": {
          "city": "Tempe",
          "country": "United States",
          "latitude": 33.42607,
          "longitude": -111.93961,
          "state": "AZ",
          "street": "411 S Mill Ave",
          "zip": "85281"
        },
        "id": "141855472518903"
      },
      "start_time": "2011-11-23T21:00:00-0800",
      "id": "901320369911495",
      "rsvp_status": "attending"
    },
    {
      "description": "REDNEK was born in London and raised by Jamaicans in Hackney. REDNEK is not just a Dj/Producer. He is a unique performer that engages his audience with massive stage presences and vocal abilities like no other. REDNEKs sound consists of head destroying baselines with original intricate edits and even though he has only been making Dubstep since May 2011 don’t be fooled, he has 18 years of hard studio time under his hat. The true nature of the name “redneck” means grafter. This is why they call him REDNEK...

VIDS:

I'm Not Skrillex: http://www.youtube.com/watch?v=IwY59wgLOdE

They Call Me: http://www.youtube.com/watch?v=xSQ23kHjCsM

FB: http://www.facebook.com/OfficialRednek


SOUNDCLOUD: http://soundcloud.com/theofficialrednek

--------------------------------------------------------

Doors open at 9:30 PM

18 to step // 21 to stumble

Supporting lineup:

dLo (http://www.facebook.com/pages/DLo/170125596391081)
11:30-12:30

I'llWackya (http://www.facebook.com/IllWackYa)
10:30-11:30

Pre-Paid (http://www.facebook.com/jarrodvp)
9:30-10:30",
      "end_time": "2011-11-11T02:00:00-0800",
      "name": "UKT Presents: REDNEK (18+) \"I'm Not Skrillex\" Tour",
      "place": {
        "name": "School of Rock Mill Ave",
        "location": {
          "city": "Tempe",
          "country": "United States",
          "latitude": 33.42607,
          "longitude": -111.93961,
          "state": "AZ",
          "street": "411 S Mill Ave",
          "zip": "85281"
        },
        "id": "141855472518903"
      },
      "start_time": "2011-11-10T21:00:00-0800",
      "id": "883222225084131",
      "rsvp_status": "attending"
    },
    {
      "description": "Wrath, greed, sloth, pride, lust, envy, and gluttony... The Seven Deadly Sins. On Saturday October 29th we formally invite you to engage in a little fun and debauchery themed around the Capital Vices. There will be music, drinking, beer pong, photo booth, and more. For those of you who were here last year you know how much fun was had, and how good the costumes were, and for those of you who weren't: you missed out. This year we are hoping to be bigger, and better. Please RSVP ASAFP. A small donation to help compensate for the cost of the keg is recommended. 

UPDATE: 

*** If you've been invited, the RSVP doesn't much matter. But do us a favor- if you want to bring someone along that wasn't invited through this event, PLEASE CLEAR IT WITH US FIRST. For capacity reasons and for our own sanity, we need to give you the go ahead. ***

UPDATE:

*** We are getting the keg so we can situate it in the kegorator and get the system up to snuff. We are only providing the full size keg. Our kegorator WILL accommodate a torpedo keg as well, which can be set for the second tap. We are more then willing to pick one up if YOU, our guests would like to raise the funds for it. THE TOTAL COST, TYPE OF BEER, AND CASH TO COVER MUST BE GIVEN TO CHO, SCOTTY, OR ROB, NO LATER THAN THURSDAY OCTOBER 27TH! This would need to be a generally agreed upon brew by those fund-raising for said torpedo. Or if you want to purchase the torpedo amongst yourselves and bring it the day of the party we are cool with that to. Please contact us if you want to make this happen. ***

*** UPDATE ***
GOOGLE MAP LINK: use the following link if you need directions

http://maps.google.com/maps?q=2554+e.+cassidy+ln&oe=utf-8&rls=org.mozilla:en-US:official&client=firefox-a&um=1&ie=UTF-8&hq=&hnear=0x872d8ed058d04d37:0x628a9c5871182aa9,2554+E+Cassidy+Ln,+Flagstaff,+AZ+86004&gl=us&ei=an-sTsGPELTYiAKooISlCw&sa=X&oi=geocode_result&ct=title&resnum=1&ved=0CBsQ8gEwAA

see you all soon!",
      "end_time": "2011-10-30T03:00:00-0700",
      "name": "Rob & Cho's 2nd Annual Halloween Party",
      "start_time": "2011-10-29T19:30:00-0700",
      "id": "738466029584695",
      "rsvp_status": "unsure"
    },
    {
      "description": "http://eyeheartbrains.com/

Invite everyone!",
      "end_time": "2011-10-23T02:00:00-0600",
      "name": "Denver Zombie Crawl",
      "place": {
        "name": "16th Street Mall",
        "location": {
          "latitude": 39.745487989908,
          "longitude": -104.9926565982
        },
        "id": "188591677884790"
      },
      "start_time": "2011-10-22T15:00:00-0600",
      "id": "949868255052839",
      "rsvp_status": "unsure"
    },
    {
      "description": "The trees are changing!  The most beautiful place I know of to watch the trees change in Arizona is Hart Prairie.  We should all go there, and have a picnic!

If you want, bring a blanket, and some picknicky food to share.

DRESS VERY WARMLY, and in layers.  If it's sunny and calm, it'll be warm.  If it's cloudy and windy, it could be VERY cold.  No chickening out though.  If it's too cold, or precipitizing, we'll eat inside the biggest car. :-)

A portion of the journey is on a well-maintained dirt road.  This is the most important part of the journey, and a VERY scenic drive.  However, it has snowed there recently, and the road may be muddy, or have a little snow in shady spots.  If you're not comfortable on dirt roads, or don't think you have the car for it, you might want to either arrange to carpool with someone else, or park at the turnoff and let another car shuttle you in.  We should pile into as few cars as possible anyway, just to save gas.  And you'll have a lot more fun if you have others to share this drive with!

The location you get when you Google \"Hart Prairie\" is correct, though Google's route in has less dirt-road driving and is less scenic than the one I recommend.  Take 180 up, past the Snowbowl turnoff.  Exit right on Hart Prairie Road (Forest Service road 151).  Take it about 5 miles in.  Hart Prairie is the large, beautiful, golden prairie on the left.  Make it a loop by taking fire road 294 back to 180.  35°19'59.03\"N, 111°44'31.59\"W

Or just carpool with me!",
      "end_time": "2011-10-09T16:00:00-0700",
      "name": "Picnic Among the Trees",
      "start_time": "2011-10-09T12:00:00-0700",
      "id": "803800099714710",
      "rsvp_status": "unsure"
    },
    {
      "description": "Exciting times! Thanks to the Galeria de Los Muertos,  I'll be showing selected pieces in a fabulous gothic glam boutique which was once \"of the earth\". The revamped glamour is called missconstrued boutique! www.missconstrued.com Come check out the fashion finds and my art!!",
      "end_time": "2011-10-07T22:30:00-0700",
      "name": "First Friday at Misconstrued boutique!",
      "start_time": "2011-10-07T19:30:00-0700",
      "id": "1073207796028955",
      "rsvp_status": "attending"
    },
    {
      "description": "We are finally moved in and things are put away so it's time to party! Bring friends!",
      "end_time": "2011-10-02T10:00:00-0700",
      "name": "New House party!",
      "start_time": "2011-10-01T19:30:00-0700",
      "id": "917143828349961",
      "rsvp_status": "attending"
    },
    {
      "description": "Electric Kingdom and Culture Shock Present
!!EVERY THIRD SATURDAY!!

Mochipet
http://www.mochipet.com/blog/
http://soundcloud.com/mochipet
&
The Polish Ambassador
http://thepolishambassador.com/
http://soundcloud.com/davidsugalski


With support from
DJ Emtrails
DJ Reflex

ONLY $5!
Tickets: http://www.ticketfly.com/event/63385/",
      "end_time": "2011-09-18T02:00:00-0700",
      "name": "Mochipet and The Polish Ambassador",
      "start_time": "2011-09-17T21:00:00-0700",
      "id": "966098126755638",
      "rsvp_status": "unsure"
    },
    {
      "description": "SPLAT- TONIGHT

Event Detais

https://www.facebook.com/events/126454520831336/",
      "end_time": "2011-09-17T02:00:00-0700",
      "name": "3rd Annual Neon Festival ft: Mord Fustang and Liquid Stranger",
      "place": {
        "name": "Madison Events Center",
        "location": {
          "city": "Phoenix",
          "country": "United States",
          "latitude": 33.44576,
          "longitude": -112.07958,
          "state": "AZ",
          "street": "441 W Madison St",
          "zip": "85003"
        },
        "id": "156708997676433"
      },
      "start_time": "2011-09-16T20:00:00-0700",
      "id": "894497400614952",
      "rsvp_status": "attending"
    },
    {
      "description": "Epic! Minibosses on the same bill as Austin's the Lonesome Heroes! Does it get better? Well, Feel Free are going to shred your face off as well. Am I biased? Yes.",
      "end_time": "2011-09-03T00:00:00-0700",
      "name": "minibosses / the lonesome heroes / feel free",
      "place": {
        "name": "Mia's Lounge",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.19576,
          "longitude": -111.64854,
          "state": "AZ",
          "street": "26 S San Francisco St",
          "zip": "86001"
        },
        "id": "85182913010"
      },
      "start_time": "2011-09-02T21:00:00-0700",
      "id": "838149796255582",
      "rsvp_status": "attending"
    },
    {
      "description": "http://www.ticketmaster.com/",
      "end_time": "2011-09-02T00:00:00-0700",
      "name": "Excision w/ Deadmau5 in Phoenix @ Convention Center",
      "start_time": "2011-09-01T18:00:00-0700",
      "id": "820069504750641",
      "rsvp_status": "attending"
    },
    {
      "description": "Take your revenge on me because I am leaving you. 
We will play:
Capture the Flag
Civil War
other games

No paintball gun? No problem. Rent them from here:
http://maps.google.com/maps/place?um=1&ie=UTF-8&q=flagstaff+hot+shots&fb=1&gl=us&hq=hot+shots&hnear=0x872d8ef7da2e2631:0x8e1f3ca1cedbb300,Flagstaff,+AZ&cid=3649622032661571875
Beware of limited hours, so get yours in advance.

Bring lunch and bring whoever you want",
      "end_time": "2011-08-13T18:00:00-0700",
      "name": "Shoot Me for Leaving Flagstaff - Paintball",
      "start_time": "2011-08-13T10:30:00-0700",
      "id": "817418188340963",
      "rsvp_status": "attending"
    },
    {
      "description": "It is time once again for that most important holiday of the year! I assume you all have already marked your calendars and asked for time off from work if needed. And now we must work together to organize hotel rooms and rides.

For those of you who haven't attended previously, you are obviously aware of the importance of this event, and have been informed that your attendance is of course mandatory.

Seriously. We'll unfriend you.

As in previous years, our own Mike Brooks will be giving a talk. I'll post the time and track number so that you can be sure not to miss it. Get there early, as last year I had to wait 10 minutes to sit on the floor along the back wall to hear Mike's talk. I hear there will be an extra 400 seats per track or something this year though.

Badges are $150 for males who want to attend talks. If you are a male who isn't interested in the talks, or can't afford a badge, there will still be much fun to be had, and you can sometimes borrow a badge from someone who isn't currently using it. Badges for females have previously turned out to be entirely optional. (The discrepancy here is in the hopes of creating more interest in the field among females, to discourage the gender disparity. That's totally the reason.)

In our previous experience, organizers seem very disinterested in enforcing drinking-age restrictions, and appear to do the legal minimum with regard to enforcement. Being under 21 should not be a major hurdle to participating in activities, even if alcohol is present.

Although I don't have a full list of events yet, the first event people are generally interested in attending is the toxic barbecue at ~6 PM on Thursday. The last event is the award presentation at ~2 PM on Sunday. These are optional events of course, and many will be arriving later or leaving earlier as needed. The times I listed above for the Facebook event should be good for capturing these two events. I, for example, will be leaving later, and might miss at least part of the toxic barbecue. I'm sure there are others who will want to work Friday, and not make it up until that night or Saturday morning. See discussion.

For those who really truly aren't interested in the technical stuff, I encourage you to let us try to change your mind at least a little bit. (Not even just a little lockpicking workshop? You'll have fun we swear!) But there are still lots of other things to do. There's drinking and partying of course. The Star Trek convention's that weekend too I think (but I have been misinformed on this point before). And, of course, it is VEGAS. :-) There's talk of Pen and Teller, which I think is in the same hotel as the convention this year actually... There will surely be swimming. And just like last year, we'll have a game of chasing drunk Travis around the city.

https://www.defcon.org/",
      "end_time": "2011-08-07T18:00:00-0700",
      "name": "DEF CON 19",
      "start_time": "2011-08-04T13:00:00-0700",
      "id": "877792202282517",
      "rsvp_status": "attending"
    },
    {
      "end_time": "2011-08-07T17:00:00-0700",
      "name": "DEF CON 19",
      "start_time": "2011-08-04T08:00:00-0700",
      "id": "879218428808457",
      "rsvp_status": "attending"
    },
    {
      "description": "Crazy kids playing epic games for a night that will be most wickedly awesome.
Be ready to run around be competitive. Please chip in a couple bucks to help cover the fees for the field and lights.
If you would like to take part in a water fight of sorts, bring a water gun or two.

This is where we'll be at: http://www.scottsdaleaz.gov/parks/horizon
(You'll want to park by the softball fields)

Feel free to invite friends who you think would enjoy it!",
      "end_time": "2011-07-30T21:00:00-0700",
      "name": "A night to be as epic as a magnificent sideburn of God",
      "start_time": "2011-07-30T17:00:00-0700",
      "id": "908900035828084",
      "rsvp_status": "unsure"
    },
    {
      "description": "As was previously sent out Friday, July 29th, is my light rail pub crawl.  Everyone feel free to meet us part of the way through, leave early, or stay the entire time.  I'm estimating myself and 1-3 others will get started around 2 or 3 pm, and the rest of you will probably be more free after work is over around 5 or 6.

I've chosen the best 12 or so bars / stops, and I plan to start in Mesa and head west.  My plan is to stop at approximately half the stops on the way west, then turn around and hit the other half of the stops (probably with most of the Mill / Tempe stops on the return route).  As I said before, all are welcome to join so invite your friends if you wish.  To find out where we are when you are ready to join us, call or text my number (602-615-2729). As an alternative (if my phone dies or some other such nonsense happens) call Chris at 602-743-1497, he will be with me the whole time.

That about covers it, I hope to see you all there.",
      "end_time": "2011-07-30T02:00:00-0400",
      "name": "Ryan's birthday light-rail pub crawl",
      "start_time": "2011-07-29T14:00:00-0400",
      "id": "774633429301523",
      "rsvp_status": "attending"
    },
    {
      "description": "My old phone learned how to swim.  My new phone hasn't learned anything yet.

Give me your numbers.  Or text me.  Or do neither and save me the hassle.  I probably never call you anyway.

Either way, feel free to give my new phone words of consolation and encouragement.  She's in for 2 years worth of abuse, neglect, and outright antagonism.",
      "end_time": "2011-07-25T19:30:00-0500",
      "name": "The Phone Aquatic",
      "start_time": "2011-07-25T16:30:00-0500",
      "id": "836728056421070",
      "rsvp_status": "attending"
    },
    {
      "description": "Come over for some pizza, drinks, billiards, mini golf, swimming, and fun!",
      "end_time": "2011-07-07T23:30:00-0600",
      "name": "Party at Eric and Andrea's",
      "start_time": "2011-07-07T18:00:00-0600",
      "id": "1119746054708331",
      "rsvp_status": "attending"
    },
    {
      "description": "Fossil Creek and Fossil Springs are little-known wonders of the \"rim country\" of central Arizona. As this scenic canyon approaches the base of the Mogollon Rim, it suddenly transforms from a rather typical high desert canyon to an amazing water wonderland. This feature story is our one day discovery adventure with \"a little bit of everything\".


Our ongoing routine to find new and interesting places to present in the travelogue recently brought us to the Verde Valley in central Arizona. Fossil Springs is listed as a \"unique place\" in the Arizona atlas, and \"Arizona Highways' The Back Roads\" had an interesting story about old-time power plants, hot springs, and swimming holes in the Fossil Creek area.

Lower Fossil Creek is a scenic though typical high desert canyon. The environment is pinyon pine and juniper plus the ubiquitous cactus. The small perennial stream provides a lush green riparian area in the canyon bottom (lower left). The Mogollon Rim is in the background.

Our day trip to Fossil Creek brought us a bounty of interesting sights and experiences:

An exciting drive on a really scenic dirt road.
A hike through a very scenic desert canyon.
Historic artifacts which are still in use.
A very close encounter with a rattlesnake.
A spectacular water wonderland after hours of hiking through the desert.

  
The trailhead is adjacent to the antique Irving power plant on Fossil Creek. The plant, along with its sister plant, Childs, a few miles down the road, provided electricity to Phoenix in the 1920's and 30's when the city's population was all of 30,000. In 1916, work commenced on a dam below Fossil Springs and a flume (right) to bring the water four miles downstream to the plant.


As the canyon bottom is too clogged with brush to hike, the trail actually follows the Flume Road, built to service the dam and flume. The scenic dirt road is several hundred feet above the canyon bottom (a tough scramble from the parking lot). The road maintains a fairly even elevation around 4500 feet, but has numerous ups and downs. With warm temperatures and little shade it becomes rather tedious. Halfway to the springs, a tiny stream crosses the road with spectacular riparian growth including sycamores and maples. A perfect rest stop.

 
As we approach the springs area, the canyon bottom rises up to the level of the road, the canyon walls close in, and the environment suddenly changes. The road is now deep in woods, interwoven above the road to form a tunnel effect. We soon reach a clearing, and here is the dam and the pump house. Just as suddenly, I hear the loud buzz (sort of like a dragonfly) of the rattlesnake's rattle. He is coiling about 18 inches from my feet! The snake retreats as soon as I stop advancing. Sadly, I fumbled the camera and couldn't get a complete picture. For another snake photo and more info, refer to \"The Hidden Treasures of Fossil Creek and Fossil Springs Canyon (Part 2)\".


  
We pass the pumphouse, and now we're in the jungle. Lush riparian plants and water everywhere. The effect is staggering after hours in the desert. We stop for lunch at a lovely pool deep in shade. About two feet deep with a clean rocky bottom, the pool is fed by a spring and a gentle section of upstream rapids. Our boots are off in about two minutes, and we're in the water. We eat our lunch on an overhanging bank, feet soaking in the water.

Soon we push on, and enter the Fossil Creek Wilderness Area. The trail narrows to about one foot wide and goes through huge briar (berries, lower right photo) patches and other watery growth deep in shade. The roar of springs and falls and rapids is now almost constant. The photo, above left, is a huge spring emitting three tremendous streams of water. Check out the enlargement. Flowers abound everywhere. Beautiful yellow columbine is especially predominant (photo below).

  
Further down the trail, we come to a clearing which is clearly a camping favorite. The open level area makes for ideal tenting. The creek is a little more open and accessible here. That includes THE Swimming Hole. Someone has even attached a rope to an overhanging tree so you can swing into the pool. For photos of THE Hole and other watery scenes, refer to \"The Hidden Treasures of Fossil Creek and Fossil Springs Canyon (Part 2)\".


 
As the shadows lengthen, we sadly leave this wonderful place and head back to the Flume Road and the trailhead. At least there are now more shady areas along the road. By eight o'clock we are back in Phoenix, and it all seems like a dream.

The best part of the outdoor life is to be surprised by new and wonderful things. The national parks and other famous places of the west offer great beauty but discovering hidden treasure has its own special charm.",
      "end_time": "2011-06-26T21:00:00-0700",
      "name": "Backpacking Trip",
      "start_time": "2011-06-25T07:00:00-0700",
      "id": "945650658809048",
      "rsvp_status": "unsure"
    },
    {
      "description": "Hiking through endless forest
Shoot someone with a paintall in Capture the flag
Roasting marshmallows on the campfire


Invite whoever you want, I probably missed some people.

http://maps.google.com/maps?q=blue+ridge+lake+az&um=1&ie=UTF-8&sa=N&hl=en&tab=wl",
      "end_time": "2011-06-05T15:00:00-0700",
      "name": "Adventure Camping Trip",
      "start_time": "2011-06-03T17:30:00-0700",
      "id": "793886670689052",
      "rsvp_status": "attending"
    },
    {
      "description": "Rock and Roll Hits from the 70's to the 90's",
      "end_time": "2011-05-18T22:30:00-0700",
      "name": "Probable Cause at the Blooze Bar",
      "start_time": "2011-05-18T19:30:00-0700",
      "id": "816392341784287",
      "rsvp_status": "attending"
    },
    {
      "description": "Brian always used to have amazing end-of-semester parties. But alas, he is no longer with us. So, end of semester party in memory of Brian on Friday!",
      "end_time": "2011-04-30T03:00:00-0700",
      "name": "End of semester party!",
      "start_time": "2011-04-29T20:00:00-0700",
      "id": "858878297504756",
      "rsvp_status": "attending"
    },
    {
      "description": "Come visit me!!!

I am thinking ham and cheese potatoes so far.  Green beans and salad will also be featured in this meal.  Please bring drinks: soda, beer, juice.  And snacks: nuts, M&Ms, chips.  Anything we are missing I will be able to provide the day of.  RSVP on the wall if you have something to contribute!",
      "end_time": "2011-04-24T16:00:00-0700",
      "name": "Easter Lunch at Brian's New Place",
      "start_time": "2011-04-24T11:00:00-0700",
      "id": "892835537446773",
      "rsvp_status": "attending"
    },
    {
      "description": "Do you really own your own property?

Protest and cause Dismay in the month of May.

Boycott Sony until they fix their policies

This movement does not end here.

We will not desist.

IMPORTANT, need any websites with Sony Outlet locations in any and all locations not listed.

Sony Stores to Sit In in the US (Check both Links)
http://www.sonystyle.com/webapp/wcs/stores/servlet/CategoryDisplay?catalogId=10551&storeId=10151&langId=-1&identifier=S_SonyStyle_Outlets
http://www.sonystyle.com/webapp/wcs/stores/servlet/CategoryDisplay?catalogId=10551&storeId=10151&langId=-1&identifier=S_SonyStyle_Store_Listing

Sony Stores to Sit In in CANADA
http://www.sony.ca/html/ss_location/sonystyle_store_map.html

Sony Stores to Sit In in Sweden
http://www.sony.se/article/id/1154694496286

Sony Stores to Sit In in Australia
http://content.sony.com.au/homepage/sonycentre/store-locations.html

Find a Sony store near you in the UK
http://www.sony.co.uk/dealerlocator/search

Sony Netherlands to Sit In
http://www.sony.nl/section/contact

Find a Sony store near you in the Philippines
http://www.sony.com.ph/section/shop

Sony Stores to Sit In in Finland
http://www.sonycenter.fi/stores

Find a Sony store near you in Austria
http://www.sony.at/dealerlocator/search

Find a Sony store near you in New Zealand
http://www.sony.co.nz/section/retailshops

Sony website for Argentina (you can find store locations on the site)
http://www.sony.com.ar/corporate/AR/home.html

Sony website for Peru (you can find store locations on the site)
http://www.sony.com.pe/corporate/PE/home.html

Sony Stores to Sit In in Denmark
http://www.sonycenter.dk/stores

Sony Stores to Sit In in Germany
http://www.sony.de/section/kontakt

Sony VAIO outlets in the Middle East
http://www.sony-mea.com/microsite/VAIO/wheretobuy12.html

Sony Outlets in Switzerland
http://www.sonycenter.ch/

Find a Sony store near you in Mexico
http://www.sony.com.mx/corporate/MX/dondecomprar/dondecomprar.html

Sony Stores in France (Apparently there is only an Outlet in Paris)
http://paris.sony.fr/

Sony website for Nicaragua (you can find the store locations on the site)
http://www.sony.com.ni/corporate/NI/home.html

Sony website for Italy (you can find the store locations on the site)
http://www.sony.it/section/home

Sony website for Colombia (you can find the store locations on the site)
http://www.sony.com.co/corporate/CO/dondecomprar/dondecomprar.html

Sony website for Venezuela (you can find the store locations on the site)
http://www.sony.com.ve/corporate/VE/home.html

Find a Sony store near you in Brazil
http://www.sonystyle.com.br/store/index.html;jsessionid=QXUP10JOJTLR1QFIHVCSCNQ?&intcmp=bhome_lojas_20101104

Sony website for Vietnam (you can find the store locations on the site)
http://www.sony.com.vn/section/home

Find a Sony store near you in Ireland
http://www.sony.ie/dealerlocator/search

Find a Sony store near you in Chile
http://sony.cl/corporate/CL/dondecomprar/dondecomprar.html

Sony website for Poland (you can find the store locations on the site)
http://www.sony.pl/section/home

Find a Sony store near you in Costa Rica
http://www.sony.co.cr/corporate/CR/dondecomprar/dondecomprar.html",
      "end_time": "2011-04-17T00:00:00-0700",
      "name": "Operation SONY",
      "start_time": "2011-04-16T00:00:00-0700",
      "id": "853417458064058",
      "rsvp_status": "attending"
    },
    {
      "description": "ON SALE NOW

The name Wolfgang is synonymous with greatness. Name your baby Wolfgang, and he may grow up to be one of the world’s leading chefs, or a member of a seminal band like Kraftwerk or Van Halen. In keeping with that tradition, in less than three years the producer and DJ known as Wolfgang Gartner has gone from strength to strength, with eight #1 tracks on Beatport (including the site’s best-selling track of 2009) and remixes for A-list artists (Black Eyed Peas, Timbaland, Britney Spears), all lauded by peers such as David Guetta, Tïesto, and Pete Tong.

No, with the forename Wolfgang, Gartner’s success shouldn’t surprise anyone. And yet it does. Because that is his stock in trade: surprising listeners. “Right now, I feel like I have a responsibility to advance the genre,” he says. “I have to come up with something completely new, that’s never been done before.” Just study a couple of Gartner’s smashes to understand how rapidly his game keeps changing. The melody of “Undertaker” is composed from an encyclopedia array of electronic timbres, chopped into succinct, rapid-fire bits, yet solid hooks anchor the whole track; while the record is instantly recognizable, it packs so much information into its grooves it’s impossible for the brain to become overly-familiar with it. “Firepower” opens with a neo-classical melody, gives way to a brief passage of glistening arpeggios reminiscent of Vangelis or Tangerine Dream, then throws down an array of beats that explode in patterned bursts like Chinese New Year.

Yet Gartner isn’t simply an underground sensation. He has played before thousands at events like Coachella and Ultra Music Festival. Black Eyed Peas main man will.i.am has already tapped him for collaborations, he was recently nominated for a grammy, and legendary record executive Jimmy Iovine—who has nurtured the careers of icons ranging from Eminem to Stevie Nicks—has displayed a strong interest in Gartner. The number of requests he gets to remix other artists’ tracks has reached a point where he elects to decline ninety-nine percent of them (“I generally only work with artists for whom I have great respect and admiration”).

Like another famous Wolfgang, Gartner started his artistic experiments at a very young age. As a little boy growing up in California he studied piano, playing both classical and jazz. But it was during a family trip to Tanzania when he was 11 years old that Gartner was turned on to dance music, in the form of a mix tape that featured Kevin Saunderson’s 1988 crossover techno hit “Good Life.” “I heard that track and it completely changed the chemical structure of my brain.” Back home in America, he began making his own forays into the field, producing original tracks on drum machines and keyboards while other kids were off at soccer practice or watching cartoons.

Unlike Mozart, Gartner’s genius didn’t translate into the misadventures of an enfant terrible. Quite the opposite: “I spent all my time with music… alone.” With the onset of adolescence, he began sharing his handiwork with the world. At 13, he procured a set of tape decks with pitch controls and a four track mixer, and started playing basement parties. A year later, he graduated to turntables, and by 16 he’d begun spinning in nightclubs. As a consequence of his well-trained ear, he was particularly attuned to harmony, eschewing the classic rookie mistake of mixing tracks in incompatible keys. “I never wanted to compromise the integrity of the music,” he recalls.

That commitment to the integrity of the music continues to this day. Gartner is meticulous in his approach to crafting new tracks in the studio, contemplating how they’ll sound in different venues and new ways to pitch curveballs at the dance music cognoscenti—without using gratuitous gimmicks. Whereas many producers start with a rhythm track, Gartner is more likely to begin with a melody and a concept, and experiment… and experiment and experiment… until the pieces begin to click. “Music doesn’t just come out of thin air,” he admits. “Inspiration is a natural process.” And it can’t be forced.

As he moves forward, Gartner doesn’t want to just advance his art form—he also wants to put a fresh twist on Top 40 fare. “I definitely want to work with pop and rap artists as a producer.” So long as his identity and integrity remain intact: “I want to make what I like making, and if a rapper can rap on it, then great.” With numerous new projects in the pipeline, he still appreciates the distinction between world domination and overexposure. “I’m definitely about quality over quantity,” he concludes. With Wolfgang Gartner, only one thing is certain: his next move is always a surprise.

The Rialto Theatre, Universatile, and PHAT Entertainment present

$18 general admission advance
$21 general admission day of show
* prices may be subject to service fees",
      "end_time": "2011-04-03T23:00:00-0700",
      "name": "Wolfgang Gartner  ",
      "start_time": "2011-04-03T20:00:00-0700",
      "id": "1098235980203132",
      "rsvp_status": "attending"
    },
    {
      "description": "http://www.last.fm/event/1846307+Wolfgang+Gartner",
      "end_time": "2011-04-03T14:00:00-0700",
      "name": "Wolfgang Gartner",
      "start_time": "2011-04-02T21:00:00-0700",
      "id": "786663701410728",
      "rsvp_status": "attending"
    },
    {
      "description": "The TCBY (near Bookmans/Target) offers a delicious waffle cone with either soft serve OR a scoop for only 99 cents (plus tax = 1.10) on Wednesdays.  So wonderful it needs no further explanation. Remember: There are non-dairy options too! =D",
      "end_time": "2011-03-30T20:30:00-0700",
      "name": "TCBY Waffle Cone Wed = 99 cents for a delicious waffle cone!",
      "place": {
        "name": "TCBY",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.185808230782,
          "longitude": -111.65932047682,
          "state": "AZ",
          "street": "1530 S Riordan Ranch St, Ste D407",
          "zip": "86001-6399"
        },
        "id": "119142874803717"
      },
      "start_time": "2011-03-30T17:30:00-0700",
      "id": "920095844720071",
      "rsvp_status": "attending"
    },
    {
      "description": "As you may know, LANs have been removed from regular Digital Carnivals due to the heavy combined power consumption.  Welcome to Digital Carnival: LAN edition.  Featuring League of Legends.  Bring your own box/ machine/ custom gaming rig.  Other games playable too.",
      "end_time": "2011-03-25T22:00:00-0700",
      "name": "League of Legends LAN",
      "start_time": "2011-03-25T19:00:00-0700",
      "id": "907817712594254",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come out and help me celebrate my birthday!  

What to expect: Drinking, dancing, general goofing around.
What to bring: Food, Drink, Friends! - Everyone is welcome, the more the merrier!

Please RSVP ASAP!! (And also let me know what you'll be bringing.)",
      "end_time": "2011-03-20T12:00:00-0700",
      "name": "Birthday Bash",
      "place": {
        "name": "My Place!",
        "location": {
          "city": "Phoenix",
          "country": "United States",
          "latitude": 33.439458170514,
          "longitude": -112.08596850502,
          "state": "AZ",
          "zip": "85007"
        },
        "id": "146124758784443"
      },
      "start_time": "2011-03-19T20:30:00-0700",
      "id": "829411840429007",
      "rsvp_status": "attending"
    },
    {
      "description": "I know it's pretty much a cliché now, but yes. Spring break in Mexico!

We have a great time every year, and it seems like the only time of year everyone's free to get a trip together (you'd melt if you went in the summer, or at least I would).

Reasons to go:
* It's a lot of fun (most of our epic trip stories were Mexico trips)
* It's super-cheap (though the dollar tacos are $1.50 now...)
* The food's amazing (like fresh fish caught in the harbor today)
* It's extremely safe (see my wall comment below)
* It's a good chance to have fun experiencing another culture (though this is less and less true every year)
* It's a lot of fun (fish market, banana boats, fireworks, campfires on the beach, swim-up bar, failing at Spanish, piña coladas served in coconuts, tide pools, taco stands, sandcastles, getting in trouble for shooting fireworks off the roof of the hotel, shopping, Cuban cigars, dancing, boat rides, ...)

Note that I've crossed the border twice in the last year, and had people with me who didn't have passports both times, and we got no trouble whatsoever crossing back. Not to guarantee there won't ever be any trouble, but having a passport really seems like it's not something to worry too much about.

Last year I wrote:
Notes for next year:
* We spent significantly less on hotel than I expected, and got better rooms than I planned! And could comfortably fit more people in those rooms if we wanted to save even more.
* We spent more on gas and insurance than I estimated.
* We spent WAY more on food than I anticipated, but I think this was spurred on by the group's desires.
* Passports are optional. Psychic paper would work well. You could hold up a wheel of cheese and say it's your passport and they'd let you through.",
      "end_time": "2011-03-20T20:00:00-0700",
      "name": "Spring Break 2011",
      "start_time": "2011-03-16T12:00:00-0700",
      "id": "1080438571984985",
      "rsvp_status": "unsure"
    },
    {
      "description": "FAQ:

Ren Fest? What is this thing and why should I care?

The Renaissance Festival (aka Ren Fest, aka the Faire) is a yearly event of all things Huzzah! You go for the hilarious shows, the perilous jousting, the equally perilous birds of prey show, and the ginormous turkey legs. (Combining the last two is not recommended.) It is open on weekends and some special holidays. This year, the Faire Folk are gathering until April 3rd. 


The weekend you picked doesn't work for me! Why did you pick it??

I have picked here the weekend that works best for me. The choice is flexible, so speak up if it really doesn't work for you. We will try to pick whichever weekend allows the most people to attend.


Where is this magical place?

Apache Junction, AZ. The middle of nowhere. See address above and website below for more info.


Phoenix?? Should I stay overnight then?

Absolutely. The gates open at 10 in the blessed AM, and I highly recommend getting there on time. Sleeping quarters will be provided for anyone interested at the Hudson House (about an hour and a half away with Faire Traffic). The best way to do it is to go down Friday night, do the Faire on Saturday, and drive back to Flag on Sunday.


What will this cost me?

Tickets are $22 at the door, $21 online, and $20 at Fry's grocery stores. Remember to bring at least 15-20 bucks for the expensive Faire food, tips at shows, and anything else you want to do. (Camel rides, frozen orange things, handmade artsy stuff.) The Faire Folk only take CASH!! (For the most part. Actually, I'm not even sure this is true anymore. Don't count on being able to use your fancy credit cards, in any case.) Though there are anachronistic ATMs scattered about.


Oh God. Do I have to go in costume??

Yes. But really no. But if you want to be a Cool Kid, yes. If you do not have anything renaissancy to wear, the Hudsons have a very limited supply of Faire Garb that people could borrow. Also, the Faire offers the rental of awesome costumes, but it is pricey. Also, wear comfortable walking-around-all-freaking-day shoes.


You didn't invite me . . . Does that mean I don't get to come to this amazing event you just described so well? :'(

No. (And, in case you don't understand correct English -- Yes, you may come. I just missed your name.)



For more information on Ren Fest, and to buy tickets online, go here: http://www.royalfaires.com/arizona/

For a preview of my favorite show of all shows (with sign language interpreter!), go here: http://www.filmbaby.com/films/1659",
      "end_time": "2011-03-05T18:00:00-0700",
      "name": "Ren Fest!",
      "start_time": "2011-03-05T10:00:00-0700",
      "id": "896430190380335",
      "rsvp_status": "unsure"
    },
    {
      "description": "Friends and Drinks.",
      "end_time": "2011-02-19T03:00:00-0700",
      "name": "Margaritaville",
      "start_time": "2011-02-18T21:00:00-0700",
      "id": "1038154389547592",
      "rsvp_status": "attending"
    },
    {
      "description": "Because snowboarding is expensive and lands on a Monday, I have created a separate more inclusive event, on the Saturday beforehand.
BBB = Bring Beer and Boardgames

And if anyone wants to do dinner, I'm down. We can even make it at my place.",
      "end_time": "2011-02-05T23:00:00-0800",
      "name": "Birthday, Beer, Babes, and Bathtub",
      "start_time": "2011-02-05T21:30:00-0800",
      "id": "818892244813164",
      "rsvp_status": "attending"
    },
    {
      "description": "Andrew Jackson Jihad w/ Jonathan Boulay & the Street Alcoholics and Jacky Stone & His Ugly Bones",
      "end_time": "2011-02-06T01:00:00-0500",
      "name": "Andrew Jackson Jihad",
      "place": {
        "name": "Mia's Lounge",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.19576,
          "longitude": -111.64854,
          "state": "AZ",
          "street": "26 S San Francisco St",
          "zip": "86001"
        },
        "id": "85182913010"
      },
      "start_time": "2011-02-05T21:00:00-0500",
      "id": "884495031616314",
      "rsvp_status": "unsure"
    },
    {
      "description": "3811 59th Ave Circle East, Ellenton",
      "end_time": "2011-02-05T23:30:00-0500",
      "name": "SURPRISE Birthday Party for Bert",
      "start_time": "2011-02-05T16:00:00-0500",
      "id": "916918891663669",
      "rsvp_status": "unsure"
    },
    {
      "description": "Go skydiving on Saturday. It's that life goal you always wanted to do and now's your chance!  $189 here http://www.tandemrs.com/skydiveaz/ 
Oh, and its my birthday",
      "end_time": "2011-02-05T17:00:00-0800",
      "name": "Skydiving",
      "start_time": "2011-02-05T08:00:00-0800",
      "id": "979540302063887",
      "rsvp_status": "attending"
    },
    {
      "description": "You are all invited because we are very smart, ambitious people, and some of us need something to do in our free time, and others should spend more time with a noble pursuit that can change the world!

We should list and discuss some of our good ideas and select one to write up a business model for.  With enough of us, we can even fund the idea and start turning that investment in to more money.

Please be discrete about this, since we don't want anyone to steal our ideas!  We have a lot of talent in this group of friends, it's time to put it to some good use.

Please send me a message if you think there is anyone else we should invite, and this should be a productive evening!
Sorry ACM, this is more important and it's the only day that was free.",
      "end_time": "2011-02-04T00:00:00-0700",
      "name": "The other thing",
      "start_time": "2011-02-03T18:00:00-0700",
      "id": "881121665259489",
      "rsvp_status": "attending"
    },
    {
      "description": "Intense indoor racquetball. Bringing protective goggles is recommended. Rackets are available to borrow.

If you plan on driving, please be aware that you might not be able to park on-site. There are only eight visitor parking spaces for the entire complex to share, and the managers like to tow away cars more than Pluto wishes it were a planet.

Bicycling to my place is an excellent alternative to driving. Guests are welcome to store their bikes inside my apartment if they prefer not to use the bike racks outside.

Air hockey and foosball may also be available.",
      "end_time": "2011-02-01T22:00:00-0700",
      "name": "Balls to the Wall 3",
      "start_time": "2011-02-01T19:00:00-0700",
      "id": "995816927110111",
      "rsvp_status": "attending"
    },
    {
      "description": "Four years ago Sean Stevens and Zebbler were arrested by the Boston police department for placing \"Hoax Devices.\" It turns out that they were hired by Adult Swim to do an underground marketing campaign by placing LED Mooninites in various locations around the city.  Boston spent $800,000 to disable the Light Brights that were placed around the city.  We at The Latest With are proud to be joined by Sean and Zebbler to talk about how the situation unfolded, what has changed since they were arrested, and what they are doing now. Please tune in to watch it live and contribute to the conversation!

Tune in live at www.thelatestwith.com.  Please invite anyone who you think would be interested in watching.

You can also check out our preview at: 
http://www.youtube.com/watch?v=lILSZyQ31vk",
      "end_time": "2011-01-31T18:00:00-0800",
      "name": "Online show-The Boston Bomb Scare 1/31/07: Never Forget",
      "start_time": "2011-01-31T17:00:00-0800",
      "id": "1090480154299195",
      "rsvp_status": "unsure"
    },
    {
      "description": "KJACK open mic!
If you would like to perform sign up starts at 6pm. 
Come enjoy some local talents!",
      "end_time": "2011-01-28T22:00:00-0800",
      "name": "KJACK Open Mic",
      "start_time": "2011-01-28T19:00:00-0800",
      "id": "820051318031488",
      "rsvp_status": "unsure"
    },
    {
      "description": "Intense indoor racquetball. Bringing protective goggles is recommended. Rackets are available to borrow.

If you plan on driving, please be aware that you might not be able to park on-site. There are only eight visitor parking spaces for the entire complex to share, and the managers like to tow away cars more than Windows likes to crash.

Bicycling to my place is an excellent alternative to driving. Guests are welcome to store their bikes inside my apartment if they prefer not to use the bike racks outside.

Air hockey and foosball may also be available. The facility is equipped with showers and, apparently, saunas. The three hot tubs might be open for use as well. I will be distributing a map that shows where visitor parking is located.",
      "end_time": "2011-01-26T22:00:00-0700",
      "name": "Balls to the Wall Wednesday 2",
      "start_time": "2011-01-26T19:00:00-0700",
      "id": "840504366027774",
      "rsvp_status": "attending"
    },
    {
      "description": "On Saturday, January 22, the NAU Ice Jacks will be taking on the ASU Sun Devils at home.  The game will take place at 8:15PM on Saturday!

The last time the Ice Jacks met the Sun Devils the Ice jacks won both games with a score of 3-2.

If you aren't able to come to the game you can still listen to it on kjack.org (http://tinyurl.com/KJACKAudio).",
      "end_time": "2011-01-22T22:30:00-0800",
      "name": "NAU Ice Jacks VS. ASU Sun Devils (Saturday)",
      "place": {
        "name": "Jay Lively Ice Rink",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.21372005,
          "longitude": -111.639896,
          "state": "AZ",
          "zip": "86001"
        },
        "id": "461343407246836"
      },
      "start_time": "2011-01-22T19:30:00-0800",
      "id": "811458125598741",
      "rsvp_status": "unsure"
    },
    {
      "description": "On Friday, January 21, the NAU Ice Jacks will be taking on the ASU Sun Devils at home.  The game will take place at 8:30PM on Friday.

The last time the Ice Jacks met the Sun Devils the Ice jacks won both games with a score of 3-2.

If you aren't able to come to the game you can still listen to it on kjack.org (http://tinyurl.com/KJACKAudio).",
      "end_time": "2011-01-21T22:00:00-0800",
      "name": "NAU Ice Jacks VS. ASU Sun Devils (Friday)",
      "place": {
        "name": "Jay Lively Ice Rink",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.21372005,
          "longitude": -111.639896,
          "state": "AZ",
          "zip": "86001"
        },
        "id": "461343407246836"
      },
      "start_time": "2011-01-21T20:30:00-0800",
      "id": "859092297482997",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come to Chipotle from 2-4pm on Friday, January 21, for KJACK fun! We will be playing music, playing games and giving away prizes! 
There will be a trivia contest and more for FREE CHIPOTLE! 
Come on out and listen to great music, have some fun and win prizes!",
      "end_time": "2011-01-21T16:00:00-0800",
      "name": "KJACK Remote at Chipotle!",
      "start_time": "2011-01-21T14:00:00-0800",
      "id": "839714529398456",
      "rsvp_status": "unsure"
    },
    {
      "description": "We will be playing racquetball in the newly constructed rec center where I live. Wearing goggles or other protective eyewear is recommended. Rackets are available to borrow.

There are certain spots designated for visitor parking, no parking pass is necessary. If you choose to ride a bike, you can store it inside my apartment if you prefer.",
      "end_time": "2011-01-19T21:30:00-0700",
      "name": "Balls to the Wall Wednesday",
      "start_time": "2011-01-19T18:30:00-0700",
      "id": "965748950123217",
      "rsvp_status": "unsure"
    },
    {
      "description": "Since the University is closed on MLK day I thought I'd open my place to anyone who wants to come hang out. There will be video games, snacks, board games, movies, whatever anyone wants to do. Come and go as you please, it's an open house! Bring your games, movies, beer, whatever you want. 

If you have questions or need help finding the place, call me at (480) 335-6372 or post on the wall or whatever.",
      "end_time": "2011-01-17T22:30:00-0700",
      "name": "Ride out the last day of break at Jordan's!",
      "start_time": "2011-01-17T12:00:00-0700",
      "id": "955423081148607",
      "rsvp_status": "unsure"
    },
    {
      "description": "Have some fun, sing if your up for it. If your not, drink some more until you are.  I'm sure I missed some people I should of invited. So feel free to invite whoever.

If you have an extra mic bring it please.",
      "end_time": "2011-01-15T22:00:00-0700",
      "name": "Karaoke Night",
      "start_time": "2011-01-13T19:00:00-0700",
      "id": "874897062568344",
      "rsvp_status": "unsure"
    },
    {
      "description": "All are invited to participate in the 3rd Annual No Pants Light Rail Ride. This is part of The No Pants Subway Ride, which is a global event started by Improv Everywhere in New York in 2002:  http://improveverywhere.com/2011/01/01/global-no-pants-subway-ride-2011/

The event will take place at 2:00pm on Sunday, January 9th. Everything you need to know is in this post. Please read it carefully!

REQUIREMENTS FOR PARTICIPATION:

1) Willing to take pants off on light rail.
2) Able to keep a straight face about it.

**THIS IS A PARTICIPATORY EVENT. DO NOT SHOW UP UNLESS YOU PLAN TO TAKE YOUR PANTS OFF. THIS INCLUDES THE MEDIA! **

DETAILS
When: Sunday, January 9 at 2:00 PM Sharp! (Over by around 4:00)
Bring: A backpack and a fare card. http://www.valleymetro.org/metro_light_rail/how_to_ride/fares/
Wear: Normal clothes (hat, jacket, etc)
Mid Party: There will be a mostly unofficial gathering at Robbie Fox’s Pub at the midway point

WHERE
There are three starting points - choose whichever one is closest to you:

WEST SIDE - Start: Montebello/19th Ave

MID-TOWN - Start: Central/Roosevelt

EAST SIDE - Start: Sycamore/Main

END AT: Mill Ave/3rd Street (then head South to Robbie Fox's (more info below))

http://www.valleymetro.org/metro_light_rail/downloads/maps/

HOW IT WORKS

Be at the West Side or East Side starting point station and ready to board the train at 2:00pm sharp. It is the same time for both stops. Be early if you need to, especially if you need to buy a light rail pass.

Watch for Team Leaders (identified by a red bandana tied to their bag): The Team Leaders may try to split people into small groups to board different trains, depending how many people show up.

Show up in your underwear! Unlike in the past, we’re not waiting to depants on the train. If you’re depantsing once you arrive, bring a backpack, briefcase, or something else to carry them in. You are responsible for your own pants.

Act normal - Stay with your group. Sit in the car like you normally would. Read a magazine, listen to your iPod, etc. You do not know any of the other pantless riders. If questioned, tell folks that you “forgot to wear pants” and yes you are “a little cold.” Insist that it is a coincidence that others also forgot their pants. Be nice and friendly and normal.

Do not tell people you are doing a prank! You don't really notice anything odd about people not wearing pants.

We will have photographers on hand to take pictures documenting the event. We need everyone else to just act casual. If you bring a camera, be very discrete and only take a few. It's supposed to look like a normal train ride.

You can wear fun underwear if you like, but nothing that screams out, “I wore this because I’m doing a silly stunt.” Wear two pairs of underwear if it makes you feel more comfortable. Don’t wear a thong or anything else that might offend people. Our aim is to make people laugh, not piss them off.

Don't disrupt the Light Rail - While the Phoenix Police Department said that wearing your underwear in public isn't illegal, don't do anything dumb. All responsibility for your actions during this event are entirely your own.

Disembark at the Mill Ave station and head south. Stop by Starbuck’s for a coffee if you wish, but eventually make your way down Mill to 6th Street and hang a right. Head into Robbie Fox’s Pub where they will have some space set aside for us.

At 4:00 start heading back to the Mill Ave station and ride back to where you got on. Try to stay with your group, but if you need to leave earlier (or want to stay later) that's entirely up to you. The same rules apply as above.

Last year was a lot of fun and we're anticipating more people in 2011! Spread the word and tell your friends, just make sure they read all the rules!

See you on the 9th!

* Photo courtesy of Tyson Crosbie",
      "end_time": "2011-01-09T16:30:00-0800",
      "name": "No Pants Light Rail Ride AZ 2011",
      "start_time": "2011-01-09T14:00:00-0800",
      "id": "875431635827563",
      "rsvp_status": "attending"
    },
    {
      "description": "Tired of winter already? Let us party like it's summer time!

This tropical-themed extravaganza shall feature delicious frozen beverages, bikinis, and other things to help us believe it is toasty warm.

Mike: Wear a bathing suit, or bring booze/money for booze!",
      "end_time": "2011-01-09T02:00:00-0700",
      "name": "Beach Party!",
      "start_time": "2011-01-08T19:00:00-0700",
      "id": "957754980909930",
      "rsvp_status": "unsure"
    },
    {
      "description": "We should have a new year's party of some sort!
Formal dress recommended.  Let's start the new year off with a bang and in good company!

Where will everyone be? Flagstaff? Phoenix?",
      "end_time": "2011-01-01T00:00:00-0700",
      "name": "New Year's Party",
      "start_time": "2010-12-31T23:30:00-0700",
      "id": "928390113850764",
      "rsvp_status": "attending"
    },
    {
      "description": "So the year is drawing to a close and some of you are wondering, 'what should I do to celebrate?' The answer is simple, Cho and I will be hosting a Masquerade themed evening. The night will be broken up into two parts, Pot Luck and Party. Those of you who want to participate in the pot luck show up with food and/or drinks at 6:30, we will be eating around 7-7:30. Once dinner is over we will be kicking in to party mode, so around 9-9:30 we will have switched over to dancing, drinking, games, etc. You are welcome to attend one or both as we do not want to conflict with any prior social plans. We will have some booze but we recommend BYOB for those of you who want to get REALLY smashed. AGAIN, Masquerade means WEAR A MASK. Any other questions please contact Rob @ 480-298-0546.... See you soon.",
      "end_time": "2011-01-01T02:30:00-0700",
      "name": "New Years Eve Masquerade Party and Pot Luck",
      "start_time": "2010-12-31T18:30:00-0700",
      "id": "839348366114424",
      "rsvp_status": "unsure"
    },
    {
      "description": "The =ADK= Gaming Community is proud to announce a LAN Party that we will be hosting December 17th - 18th in Phoenix, AZ at Cyberzone. In all reality it is actually December 18th due to the fact that it is a lockin starting at Midnight. Some preliminary details:


Date: December 18th
Time: Midnight - 8 am
Cost: Pre-Register: $20 with computer, $23 with computer  At the door: $23 with computer $26 without
Cost Includes: Lockin Admission, Food, Drinks, ADK Sticker, 2 months Donor Status on ADK Servers.


Come join the =ADK= Gaming Community with our first hosted LAN Party!  It's going to be tons of fun, and meet some of the =ADK= Members!  Let all your friends know because this is going to be a night full of fun!!


Registration link: http://www.adkgamers.com/news.php?item.151.1
Info Link: http://www.adkgamers.com/news.php?item.150.1",
      "end_time": "2010-12-18T08:00:00-0800",
      "name": "LAN Party Hosted by the =ADK= Gaming Community",
      "start_time": "2010-12-18T00:00:00-0800",
      "id": "808458039222791",
      "rsvp_status": "unsure"
    },
    {
      "description": "I am finally graduating!  /happydance
So come party with me!  And say goodbye for a few days as I run around like a chicken with my head cut off trying to find a job.
5.5 long years in school *sigh*
I have to cut off the evening a little early since I am driving to Phoenix the next morning on a tight schedule.  But I will be back Monday or Tuesday to get some work done.",
      "end_time": "2010-12-17T23:00:00-0700",
      "name": "Brian's \"It's Finally Over\" Party",
      "start_time": "2010-12-17T19:00:00-0700",
      "id": "961729527193057",
      "rsvp_status": "attending"
    },
    {
      "description": "Come celebrate Sarah's graduation from ASU, with Food, Drinks, Soccer, Frisbee, Football, Basketball at the park.  Please RSVP by Weds Dec 15th so I know how much food to get.",
      "end_time": "2010-12-17T22:00:00-0700",
      "name": "Sarah's Graduation party!!!!!!",
      "start_time": "2010-12-17T16:00:00-0700",
      "id": "816349228432804",
      "rsvp_status": "unsure"
    },
    {
      "description": "Bring whatever you think looks good on a gingerbread house. Here are some ideas:

Graham crackers
Icing
Sprinkles
Small Candies
Candy Canes
M&Ms
- NOT gingerbread",
      "end_time": "2010-12-11T22:30:00-0800",
      "name": "2nd Gingerbread House Party",
      "start_time": "2010-12-11T19:30:00-0800",
      "id": "988239271187845",
      "rsvp_status": "unsure"
    },
    {
      "description": "When I heard there were a few of us who had never seen a Miazaki film before, I decided we should fix that. Plus it'll be relaxing before finals.

Which two should we watch?",
      "end_time": "2010-12-11T01:00:00-0700",
      "name": "Miazaki Night!",
      "start_time": "2010-12-10T20:00:00-0700",
      "id": "863571970370354",
      "rsvp_status": "attending"
    },
    {
      "description": "I am planning to film a short film for my EMF 225 class.  

With zombies.  

I need people to come and be zombies!  I also need a couple actors to be human as well.  There isn't much dialog.

Bring makeup if you have any, because I have none.",
      "end_time": "2010-12-05T17:00:00-0700",
      "name": "Filming a Zombie Short Film",
      "place": {
        "name": "NAU School of Communication",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.191626348191,
          "longitude": -111.65585345738,
          "state": "AZ",
          "street": "575 E Pine Knoll Dr",
          "zip": "86001"
        },
        "id": "114887308565763"
      },
      "start_time": "2010-12-05T12:00:00-0700",
      "id": "895030217209636",
      "rsvp_status": "unsure"
    },
    {
      "description": "Hold onto your pants, ladies and gentlemen; prepare to get excited! Last night's party went so well that we cant throw a party like that and not have another one. But this time, we're swinging for the fences.

Moooore lights!
Moooore sound!
Moooore BUMP!
Moooore goodies!

Also featuring TWO live DJS ALL NIGHT LONG!!

DJ Stand Alone & DJ Danimal!

http://soundcloud.com/the-danimal

There is a cover this time, a meager four bucks! for all that free dranky drank you can get yourself drunk with! We will provide the beer, the liquor AND someone tending bar....mMmMmMm...ice cold liquid refreshment! :)        

There will be EXTRA special presents for our extra special guests....with a little extra cost of course :)   Can you say EXTRA special Jello shots?!  Ranging from $10-$50......

Reminder: This is a Raver party, don't forget your candy, lights, glow-sticks, DANCING: PANTS, SHOES and SOCKS!!! 

Well, now you know where you will be on Saturday...",
      "end_time": "2010-12-05T03:00:00-0700",
      "name": "ROUND 2 of the Ravin Dubsteppin Hyphyyy Party!",
      "start_time": "2010-12-04T22:00:00-0700",
      "id": "800758053305621",
      "rsvp_status": "attending"
    },
    {
      "description": "David is turning 30, so we must punish him. I mean celebrate. There will be cake. And surprises.

Everyone, to be clear, David is not aware of this party -- Do not change that!! -deathglare-

Let me know if you have ideas/suggestions/objections. Date and time are NO LONGER subject to change.

The party will be at Brian's place. (Call someone if you don't know where that is or if you need a ride.) The guest of honor is due to arrive at 8:00 PM (and I, Jessica, will endeavor to make this happen) so please try to arrive by 7:00 and HIDE YOUR CAR, especially if it might be recognized by Dave. Too many cars and too many familiar cars would be suspicious.

Feel free to invite people. Just not Dave.",
      "end_time": "2010-11-30T22:00:00-0700",
      "name": "SUPER SECRET Birthday Party for David Smith!",
      "start_time": "2010-11-30T19:00:00-0700",
      "id": "817165561652750",
      "rsvp_status": "attending"
    },
    {
      "description": "I move November 24th so I want to get everyone in one place to hang out Flagstaff style before I leave. We're doing dinner (and $1 Kamikazes) at Dara Thai and then maybe go to Mia's or other downtown spots.",
      "end_time": "2010-11-21T02:00:00-0700",
      "name": "Going Away Party!!!",
      "place": {
        "name": "Dara Thai Restaurant",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.19603561584,
          "longitude": -111.648522,
          "state": "AZ",
          "street": "14 S San Francisco St",
          "zip": "86001-5737"
        },
        "id": "109559779079962"
      },
      "start_time": "2010-11-20T19:00:00-0700",
      "id": "926383257381982",
      "rsvp_status": "attending"
    },
    {
      "description": "We are very excited about this year's film festival and look forward to all of your participation.

1st Place Prize:

This year's first place film and team will win passes to the Sedona International Film Festival, as well as have the opportunity to have their film shown.

Rules:

Teams of up to 5 NAU students will be able to write, shoot, and direct their short films that will not exceed more than 5 minutes.

The teams will have 73 hours to complete their films beginning on Friday, November 5th, and the films MUST be submitted to Sierra Rankow's box in the SMC no later than 1:00 p.m. on Monday, November 8th.
Teams are encouraged to be as creative as possible, but must keep films in good taste. The judges have the right to not show a film if it does not meet that standard.
Your film MUST be in DVD format and be clearly labeled. You must also have the UTV62 Talent Release Forms, as well as well as the Film Festival Information page submitted. ALL talent in your films MUST have a release form filled out. 
Applications for teams must be submitted by Wednesday, November 3rd via e-mail.
Teams will receive an e-mail on Friday, November 5th by 12:00 p.m. stating the theme, and one specific line to be used in the film. This will be a critical part of the judging criteria for the films. From then on, the film making process can begin.  

All forms can be found at www.73hourfilmfest.weebly.com 

Thank you for your interest, and we look forward to seeing your work! Please feel free to contact me with any further questions.

-Sierra Rankow
NAU Film Festival Director
sierrarankow@gmail.com",
      "end_time": "2010-11-19T21:00:00-0800",
      "name": "NAU 73 Hour Film Festival!",
      "start_time": "2010-11-19T18:00:00-0800",
      "id": "800294293352837",
      "rsvp_status": "unsure"
    },
    {
      "description": "Volunteers will have the opportunity to play with the animals and to help fix their small trail that circles the building. After a 45 minute training session, volunteers can choose to play with the animals and/or help work on improving the trail. The trail is used by Humane Society staff when exercising the animals.",
      "end_time": "2010-11-12T15:00:00-0800",
      "name": "Volunteer with the Humane Society",
      "place": {
        "name": "Humane Society-Coconino Humane Association",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.190245802459,
          "longitude": -111.60197557139,
          "state": "AZ",
          "street": "3501 E Butler Ave",
          "zip": "86004-7869"
        },
        "id": "104940196216504"
      },
      "start_time": "2010-11-12T11:00:00-0800",
      "id": "910820775646707",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come enjoy a relaxing evening, a glass of wine, and intimate silence.
That's right, there is no talking at the this party.  There will be interactive games, and pencils and paper, and activities to exercise your mind.
This is intended to be a very personal experience.  So it should just be the few of us attending.  If you can think of anyone you want to invite, message me directly.",
      "end_time": "2010-11-07T22:30:00-0700",
      "name": "A Silent Evening",
      "start_time": "2010-11-07T19:30:00-0700",
      "id": "915106931892487",
      "rsvp_status": "attending"
    },
    {
      "description": "So as many people have complained we never plan these pot lucks far enough in advance. Now we have, All's Hallowed Eve 2010! Bring a little something to add to the party and take away an amazing night of food, fun and friends. This is one you wont want to miss. Costumes are not a must, but we will make fun of you if you aren't dressed for the occasion ^_-",
      "end_time": "2010-11-01T02:00:00-0700",
      "name": "All's Hallows Eve Pot Luck Party of Doom, and Such...",
      "start_time": "2010-10-31T19:00:00-0700",
      "id": "899623706727795",
      "rsvp_status": "unsure"
    },
    {
      "description": "As usual, after beginning the playlist for this party I can guarantee this night will be incredible! So get ready to party and dance it up to the amazing selection of music.

Come show off your costumes!  And invite all your friends!

Other features include:
Free skating at Jay Lively earlier in the day
Sweet dance music
Ghouly treats
Dry ice
Strobe Lights
Glow sticks",
      "end_time": "2010-10-31T02:00:00-0700",
      "name": "Halloween Madness: Fire and Ice",
      "start_time": "2010-10-30T21:00:00-0700",
      "id": "938222656230246",
      "rsvp_status": "attending"
    },
    {
      "description": "Bring your pumpkin and a snack/beverage! Carve the scariest or funniest or craziest pumpkin that your mind can come up with. 
Other helpful things you may want to bring:
-a sharpie for your design
-knife for carving

Pumpkins are about $5 at grocery stores. Woohoo!

Afterwards we will hit the jacuzzi, so bring your swimsuit",
      "end_time": "2010-10-24T19:00:00-0700",
      "name": "Pumpkin Carving Party",
      "start_time": "2010-10-24T16:00:00-0700",
      "id": "884112624985942",
      "rsvp_status": "attending"
    },
    {
      "description": "If you do not have your own gun, there are 30 dollar rentals at Hot Shot Paintball, we will all pitch in to buy boxes of paintballs.
http://maps.google.com/places/us/az/flagstaff/e-spruce-ave/2329/-hot-shot-paintball?hl=en&gl=us

Walmart sells a low end Tippman for $99, and a pump action paintball gun for $24.

Paint will be cheap if everyone pitches in, it is environmentally friendly. CO2 and N2 canisters we will probably need to get filled at Hot Shot Paintball.

Wear baggy clothing if you are concerned about getting welts. Wear clothes that you don't mind if they are stained, however paintball paint is made to come out of clothing.

Face-masks are required! Also sold at Walmart and Hot Shot Paintball.

Come shoot your friends!",
      "end_time": "2010-10-24T17:00:00-0700",
      "name": "Paintball in the Forest #2",
      "start_time": "2010-10-23T14:00:00-0700",
      "id": "931728556857846",
      "rsvp_status": "attending"
    },
    {
      "description": "Royal Epic is at it again. It's a Journey Through Life Fitted.

Get your Freak on this Friday October 22nd. 

DJ P-Phunk from the green room is on the 1's an 2's 

$5 dollar entry fee all night and We wont disappoint.
 
Be there early doors will open at 9:30pm.

Jazzercise is located just north of the rail road underpass where Milton turns into Route 66.  It is 1 block west of City Hall",
      "end_time": "2010-10-23T02:00:00-0700",
      "name": "Freaky Friday",
      "place": {
        "name": "Tranzend",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.19887,
          "longitude": -111.65429,
          "state": "AZ",
          "street": "417 W Santa Fe Ave",
          "zip": "86001"
        },
        "id": "296393553748409"
      },
      "start_time": "2010-10-22T22:00:00-0700",
      "id": "1068432629840213",
      "rsvp_status": "unsure"
    },
    {
      "description": "In House Digital Carnival!

Stop by for both LAN and casual gaming! There will be tournaments for League of Legends and Soul Calibur IV!",
      "end_time": "2010-10-23T00:00:00-0700",
      "name": "Digital Carnival!",
      "place": {
        "name": "Northern Arizona University College Of Engineering",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.185218811035,
          "longitude": -111.65748223152,
          "state": "AZ",
          "zip": "86001"
        },
        "id": "110664168990344"
      },
      "start_time": "2010-10-22T18:30:00-0700",
      "id": "912854412112640",
      "rsvp_status": "attending"
    },
    {
      "description": "my old phone can no longer take a charge so i had to get a new one..same numba as before (614-560-6179)
but now i need yours, if you'd like leave it here or text me with a name soz i know who you are. :)",
      "end_time": "2010-12-15T01:30:00-0800",
      "name": "gotz a new fone",
      "start_time": "2010-10-18T22:30:00-0700",
      "id": "842983515750315",
      "rsvp_status": "unsure"
    },
    {
      "description": "Andrew W.K., a.k.a. the Party God, has been a constant inspiration to partygoers around the world. On October 9, we pay tribute to the great strides he has made in the field of partying.

OFFICIAL PARTY ACTIVITIES INCLUDE:
- Eating official Andrew W.K. party snacks (as specified by Mr. W.K. himself)
- Listening to the Andrew W.K.'s Greatest Hits (coincidentally his entire discography)
- Socializing with fellow official Andrew W.K. Appreciation Party Partygoers
- Drinking official Andrew W.K. Party Juice
- Playing the official variant of popular local drinking game Down By The River, to be known as Party Hard: The Drinking Game

AND FINALLY

- Calling The Man himself. Yes, we have his phone number. Yes, his real phone number. No, we do not know if he will answer. 

Even if you don't like Andrew W.K., you might as well call this a party appreciation party, so let's make this the best party EVER, regardless of your attitudes toward Andrew W.K. And EVERYONE is welcome - invite your friends!",
      "end_time": "2010-10-10T02:30:00-0700",
      "name": "Andrew W.K. Appreciation Party",
      "start_time": "2010-10-09T21:00:00-0700",
      "id": "888130717892766",
      "rsvp_status": "unsure"
    },
    {
      "description": "Jazz for October! Don't miss out!",
      "end_time": "2010-10-08T00:30:00-0700",
      "name": "Arctic Fox @ Mia's Lounge",
      "start_time": "2010-10-07T21:30:00-0700",
      "id": "874727929241613",
      "rsvp_status": "unsure"
    },
    {
      "description": "Party.

So, paintball can be an expensive sport, there are rentals available in Flagstaff, I am not sure what their terms are concerning taking guns to other locations but they shouldn't be very tight.
http://maps.google.com/places/us/az/flagstaff/e-spruce-ave/2329/-hot-shot-paintball?hl=en&gl=us

Walmart sells a low end Tippman for $99, and a pump action paintball gun for $24.

Paint will be cheap if everyone pitches is, it is environmentally friendly.  CO2 and N2 canisters we will probably need to get filled at Walmart or at Hot Shot Paintball.

Wear baggy clothing if you are concerned about getting welts.  Wear clothes that you don't mind if they are stained, however paintball paint is made to come out of clothing.

Face-masks are required!  Also sold at Walmart.

Come shoot your friends!",
      "end_time": "2010-10-03T10:00:00-0700",
      "name": "Paintball in the Forest",
      "start_time": "2010-10-02T10:00:00-0700",
      "id": "897387293635999",
      "rsvp_status": "attending"
    },
    {
      "description": "Custom Sound Instruments is located right across the street from Macy's Coffee House. I will be playing on the lawn, and the show is free! Bring a blanky or a nice sweater because you never know if you might need it!",
      "end_time": "2010-10-01T19:30:00-0700",
      "name": "Leah Nobel LIVE! @ Custom Sounds for First Fridays!",
      "start_time": "2010-10-01T19:00:00-0700",
      "id": "842720885764323",
      "rsvp_status": "attending"
    },
    {
      "description": "Randy Guthrie, a representative from Microsoft will be speaking about the development of applications for Windows phones!",
      "end_time": "2010-09-30T22:00:00-0700",
      "name": "Microsoft is Speaking at NAU!",
      "start_time": "2010-09-30T19:00:00-0700",
      "id": "939663049388436",
      "rsvp_status": "attending"
    },
    {
      "description": "Come to the V for the first ever Sizzling Singles- \"We'll keep you warm as the nights get cool.\" We will be featuring festive music all night and a private Salsa instructor, Heidi, from 7pm-9pm.  There will also be some food and AMAZING drink specials
there is a $5 cover that allows us to have the beautiful Heidi as a salsa instructor, and to have unbelievable drink specials.  
questions? Feel free to contact me (Katie) directly at 928) 380-3655
Get ready for a night to remember!",
      "end_time": "2010-09-30T22:00:00-0700",
      "name": "Sizzling Singles",
      "place": {
        "name": "Rendezvous at The Hotel Monte Vista",
        "location": {
          "city": "Flagstaff",
          "country": "United States",
          "latitude": 35.19835,
          "longitude": -111.64742,
          "state": "AZ",
          "street": "100 N San Francisco St",
          "zip": "86001"
        },
        "id": "126213464067551"
      },
      "start_time": "2010-09-30T18:00:00-0700",
      "id": "829797443742142",
      "rsvp_status": "unsure"
    },
    {
      "description": "Hey everybody, the Student Radio Club and KJACK are putting on a give back night at Chili's!  As some of you know, if you present the coupon when you pay your bill, Chili's donates 10% of what they make to the Student Radio Club!  

Chili's is still having their 2 for $20 deal, where you can get an appetizer, two entrees, and a dessert for only $20!  How can you go wrong!

You can pick up a flyer at KJACK in the Communication building (building 16), or you can print out the coupon posted on the event page.

So come to Chili's on Monday, September 27th anytime between 11AM and 11PM and help out!

Late-Breaking News:  On the same night as the SRC's give back night, Chili's is also donating all of their profits to St. Jude Children's Hospital!",
      "end_time": "2010-09-27T23:00:00-0700",
      "name": "Chili's Give Back Night!",
      "start_time": "2010-09-27T11:00:00-0700",
      "id": "831987490183136",
      "rsvp_status": "unsure"
    },
    {
      "description": "MY BIRTHDAY IS FINALLY HERE!! Come celebrate it with me! THURSDAY NIGHT at midnight!!!",
      "end_time": "2010-09-24T06:30:00-0700",
      "name": "ERIKA'S POWER HOUR!!!!",
      "place": {
        "name": "Trident Grill",
        "location": {
          "city": "Tucson",
          "country": "United States",
          "latitude": 32.23641,
          "longitude": -110.94152,
          "state": "AZ",
          "street": "2033 E Speedway Blvd",
          "zip": "85719"
        },
        "id": "145568406069"
      },
      "start_time": "2010-09-23T23:30:00-0700",
      "id": "976076762416201",
      "rsvp_status": "unsure"
    },
    {
      "description": "The time has come once again for ACM to hold a Digital Carnival. The event will be a tried-and-true Digital Carnival complete with TV's to play games on and a tournament with fabulous prizes, though we have made a few changes. First and foremost, tournament entry fees are gone, so there's no need to worry about having cash on you! We've also aquired some funding this time around and will be serving pizza.

Several TV's and projectors will be set up featuring Digital Carnival regualrs like Soul Calibur IV, Rock Band, DDR, Halo 3, etc. Don't forget to bring your own games/consoles! We'll do our best to find a place for your stuff!

Tournament Game: Super Smash Bros. Brawl
Rules: 2v2 Team Battle 4 Stock
Map: Smashville
Entry Fee: The will to crush your enemies!
Notes: Team damage is ON!
Prizes: Coming Soon!",
      "end_time": "2010-09-11T00:00:00-0700",
      "name": "Welcome Back Digital Carnival 2010",
      "start_time": "2010-09-10T19:30:00-0700",
      "id": "909390349083501",
      "rsvp_status": "attending"
    },
    {
      "description": "Come on down for some great music and DJ's. 

Amazing night of dancing!!! Hope to see you all there!",
      "end_time": "2010-09-04T02:00:00-0700",
      "name": "Electric Kingdom",
      "start_time": "2010-09-03T21:30:00-0700",
      "id": "837420982985777",
      "rsvp_status": "unsure"
    },
    {
      "description": "Celebrate Labor Day weekend and go camping in the forests of New Mexico! We may all pitch in for a hotel room one of the nights so we can go shower...
We have a ton of fireworks to light off
We can go to Carlsbad Caverns
Woohoo!

Leave after work on Friday night, get back Monday evening",
      "end_time": "2010-09-06T21:00:00-0700",
      "name": "New Mexico Trip!",
      "start_time": "2010-09-03T18:00:00-0700",
      "id": "1090706557612421",
      "rsvp_status": "unsure"
    },
    {
      "description": "A BBQ for Computer Science Majors hosted by NAU ACM and sponsored by the NAU CS Department! Join us for free food, activities, and meet peers and faculty.",
      "end_time": "2010-09-03T20:30:00-0700",
      "name": "CS BBQ!",
      "start_time": "2010-09-03T17:30:00-0700",
      "id": "1055736354454603",
      "rsvp_status": "attending"
    },
    {
      "description": "A social for Computer Science Majors! Come join for free food, activities, and meet other students and CS faculty.",
      "end_time": "2010-09-03T20:30:00-0700",
      "name": "CS BBQ!",
      "start_time": "2010-09-03T16:00:00-0700",
      "id": "999088460103720",
      "rsvp_status": "unsure"
    },
    {
      "description": "Join us for the largest game of tag you have ever seen.",
      "end_time": "2010-09-05T19:30:00-0700",
      "name": "Campus Tag",
      "start_time": "2010-08-27T16:30:00-0700",
      "id": "1094188520597059",
      "rsvp_status": "attending"
    },
    {
      "description": "JAZZ! Plus, it'd be awesome to see some familiar faces while I'm in town :D",
      "end_time": "2010-08-27T00:30:00-0700",
      "name": "Arctic Fox @ Mia's Lounge",
      "start_time": "2010-08-26T21:30:00-0700",
      "id": "834289869953803",
      "rsvp_status": "unsure"
    },
    {
      "description": "If you are like me (which you're probably not), you enjoy a large collection of photos taken during events that you have participated in over the last 5? years.  And if you have friends like me (which you do), they have fallen short on the sharing of photos since this ridiculous Facebook craze.

Well here is the simple fact.  Facebook photos suck.  They are lower quality, barely good enough for printing (if needed), and there is no Slideshow option.  This event is a reminder to bring your photos to parties on flash drives or CDs for distribution among the participating friends.

I would like to get photos from these events:
Cookouts
Mexico Trip
Random weekend parties

If you have photos from these events or any others that include more people than just yourself, please bring them to share with the rest of the group!  You know who you are...",
      "end_time": "2010-08-24T22:00:00-0700",
      "name": "Picture Swap Party",
      "start_time": "2010-08-24T18:00:00-0700",
      "id": "956044127759817",
      "rsvp_status": "attending"
    },
    {
      "description": "Hey Again,
Okay, so just  in case everyone hasn't had enough of each other this year, there is a growing group of us who are planning to attend the Dublin Irish Festival together on Saturday, August 7th. The current plan is to meet at my house in Dublin at 9am for a breakfast to kick off the day. From there we will head over to the Irish Festival and try to secure a table in one of the music tents as a sort of home base. Should be a blast. If anyone has a favorite breakfast casserole (Jeri), please bring it. There will be plenty of food I'm sure so don't sweat it. Just come.
Since everyone is not on Facebook yet, please pass on the word about this event and Shelly's birthday.",
      "end_time": "2010-08-07T23:00:00-0400",
      "name": "2010 Dublin Irish Festival",
      "start_time": "2010-08-07T09:00:00-0400",
      "id": "1125767610784755",
      "rsvp_status": "unsure"
    },
    {
      "description": "Hey Friends!

Please join me for my 21st birthday. Stopping first at my house for cake (because every birthday needs cake) and continuing to downtown. 

If you can't stop by first we will be starting the night at Collin's at midnight on the dot.

**I may have invited you knowing you couldn't come, but decided that I still wanted to show you that I like you anyway <3 **",
      "end_time": "2010-08-01T02:00:00-0700",
      "name": "Jessie Del Quadro's 21st birthday (Flagstaff)",
      "start_time": "2010-07-31T22:00:00-0700",
      "id": "913041028717178",
      "rsvp_status": "unsure"
    },
    {
      "description": "This event is for those who want to organize rooms and rides to DEF CON in July",
      "end_time": "2010-08-01T21:00:00-0700",
      "name": "DEF CON 18",
      "start_time": "2010-07-29T17:30:00-0700",
      "id": "1094210063929373",
      "rsvp_status": "attending"
    },
    {
      "description": "This is my first official notice of the reunion for this summer.It was very difficult finding a date that works for eveyone and I apologise to anyone who has other plans that weekend. Our relatives are coming all the way from Ireland so lets show them a good time. They will be here on Friday night and fly out on Sunday, so lets all try to be here on Saturday the 3rd at a minimum. As usual, the house will be open all weekend to anyone who comes.
Please spread the word.",
      "end_time": "2010-07-04T12:00:00-0400",
      "name": "2010 Cullinan Reunion",
      "start_time": "2010-07-02T16:00:00-0400",
      "id": "1063036587043089",
      "rsvp_status": "attending"
    },
    {
      "description": "Email me and I will send directions!  Raffles, hostess rewards, food, drinks and lots of friends!",
      "end_time": "2010-06-29T21:30:00-0700",
      "name": "Comfort Food Party with Renee and Linda",
      "start_time": "2010-06-29T18:30:00-0700",
      "id": "872638746111231",
      "rsvp_status": "unsure"
    },
    {
      "description": "Sorry for the short notice.  Don't tell Jessie.  We're going to get together at Brian's and surprise Jessie before she leaves for camp.  Show up by ~7:30.  Jessie will be there around 8.  Park identifiable cars discreetly. :-)

There will be cake.",
      "end_time": "2010-06-28T22:00:00-0700",
      "name": "Shh!!! Super-Secret Surprise Send-Off Soiree!",
      "start_time": "2010-06-28T19:00:00-0700",
      "id": "961526773868008",
      "rsvp_status": "attending"
    },
    {
      "description": "This is going to be the first of these events, I'm hoping to have 2 this summer! You don't have to be good at baseball and there is not even a guarantee we will play baseball, there will be other things (like a soccer ball). If you have equipment, bring it to help out (baseballs, bats, mitts, and other things like hacky sacks, soccer stuff, anything you want).

The point is just to get a humongous group of people together, outside, enjoying the day. Bring some food and water, and bring as many friends as you can. I'll bring some food and beer if I can too. Afterwards we'll see if anyone wants to go get dinner, and maybe go downtown and play pool or get some drinks. This is a totally casual event, and if you can't make it then hopefully you can come to the next one! :-)

The start time is a recommendation, but you can show up and leave anytime, of course.

I'm still working on the location, but am thinking the park next to Sinagua High School will work:
http://maps.google.com/maps?q=35.195598,-111.597759&num=1&t=h&sll=35.195274,-111.599003&sspn=0.003656,0.006877&ie=UTF8&ll=35.195686,-111.599003&spn=0.003656,0.006877&z=17&layer=c&cbll=35.195617,-111.599076&panoid=5TQ7tRZslaTjQFjD0-qOGw&cbp=12,132.79,,0,-3.46",
      "end_time": "2010-06-27T17:00:00-0700",
      "name": "Social Gathering (Sandlot-style baseball)",
      "start_time": "2010-06-27T10:00:00-0700",
      "id": "873493376030669",
      "rsvp_status": "unsure"
    },
    {
      "description": "We are planning a Navajo Taco dinner night.

The following items will be needed:

Frybread: Provided by Talbert
Chili Beans: Sherman (pending)
Shredded lettus: 
Shredded cheese: 
Chopped tomatoes:
Chopped onion (green or yellow):
Salsa:

We will also wants some non-alcoholic and alcoholic drinks.

(optional)
Sour cream, chips, dessert, etc.",
      "end_time": "2010-06-26T20:00:00-0700",
      "name": "Navajo Tacos Dinner",
      "start_time": "2010-06-26T18:00:00-0700",
      "id": "950451598328097",
      "rsvp_status": "attending"
    },
    {
      "description": "Because it's summer, and we do what we want. Plus, can't resist the beautiful weather in Flagstaff!",
      "end_time": "2010-06-18T01:00:00-0700",
      "name": "Arctic Fox @ Mia's Lounge",
      "start_time": "2010-06-17T21:30:00-0700",
      "id": "911005625589562",
      "rsvp_status": "unsure"
    },
    {
      "description": "We're back at Kiwanis!  Bring your favorite meats, sides, and brews!  Call for directions or a ride.",
      "end_time": "2010-06-15T22:00:00-0700",
      "name": "Crazy Cookout Tuesday #23",
      "start_time": "2010-06-15T18:00:00-0700",
      "id": "990694570941398",
      "rsvp_status": "attending"
    },
    {
      "description": "I would like to get this event rolling.  We need to make sure everyone can come.  Jessie won't be able to come if we plan for July.  We should definitely bring BBQ materials, and get a list of tents and drivers.  Remember camping is all about the \"bare necessities of life.\"  Let me (Brian) or David know of any suggestions using the Message feature.

Directions:
Take Hwy 180 towards Snowbowl. After mile marker 225 turn Right on to Forrest Service Road 151. Take the dirt road exactly 6.2 miles and turn Right on to Bismark Trail. Go 1/2 mile to the second main left in to the woods.
There is cell signal.

Drivers (so far):
Brian
David McArthur

Food:
Bring your own, or stuff to barter with. People will/should bring a little extra for trading.
There will be some beer and hard alcohol so far, so bring more and mixers/breakfast juices!
Bring enough food for two days, we will have quite a few campfire utensils for cooking it.",
      "end_time": "2010-06-13T11:00:00-0700",
      "name": "Flagstaff Camping Trip 2010",
      "start_time": "2010-06-11T18:00:00-0700",
      "id": "1042781329068195",
      "rsvp_status": "attending"
    },
    {
      "description": "Get Lost.


This is it, that last episode. We want you to join us for a night of reminiscing, discussion, food, fun, and the big event brotha.

Bring a side dish/dessert and a smile, we'll take care of the rest. 

If you would like a desmond T-shirt it will be $10 

Post your favorite pictures of characters or moments in the show. Feel free to discuss final theories :) 

See you in another life brotha (on may 23rd)",
      "end_time": "2010-05-23T22:00:00-0700",
      "name": "GET LOST!",
      "start_time": "2010-05-23T17:00:00-0700",
      "id": "942037739169880",
      "rsvp_status": "unsure"
    },
    {
      "description": "Hey, I'm gonna have a little open house here in Flagstaff to hang my art from this semester and celebrate finishing college. Come by and say hello. Meet my wonderful family, let them meet you. Have some food. It'll be fun.",
      "end_time": "2010-05-09T16:00:00-0600",
      "name": "NAU Graduation Party ",
      "start_time": "2010-05-09T12:00:00-0600",
      "id": "963026333721784",
      "rsvp_status": "unsure"
    },
    {
      "end_time": "2010-05-02T12:00:00-0700",
      "name": "Birthdays in Vegas!",
      "start_time": "2010-04-30T17:00:00-0700",
      "id": "10153280816489184",
      "rsvp_status": "attending"
    },
    {
      "description": "I'm getting older and I want all of you there to make sure I don't fall and break my hip.  

We will have Shady Fellers' best beers on tap and some boozy surprises, but you are also encouraged to bring any other consumables that you may require.  

Hope to see you there !",
      "end_time": "2010-04-25T06:00:00-0700",
      "name": "Joe's Birthday Extravaganza",
      "start_time": "2010-04-24T20:00:00-0700",
      "id": "964507356901026",
      "rsvp_status": "unsure"
    },
    {
      "description": "Courtney and I are re-launching our Prepaid Legal Business.  As part of our relaunch, we would like to extend an invite out to all to attend the local event this weekend.  After the event, we can all meet up for lunch and drinks.

This event is hosted by Prepaid Legal.  Focus will be on this past weekend International Convention and some of the new announcements.   Be our invited guest to check the service out and/or the opportunity to all.  Teachers, Self-Employed, Engineers, Police Officers, Military, etc.  All walks of life will be here.

Event starts promptly at 10:00 AM
      MILLIONAIRES ON A MISSION-Hear from the BEST!
11:15 AM to 2:00 PM - OKC Recap and New Training!


Guests are FREE.  Integrity Always Please!",
      "end_time": "2010-04-17T11:15:00-0700",
      "name": "Prinke Business Relaunch",
      "start_time": "2010-04-17T09:45:00-0700",
      "id": "959934274038324",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come make Tye Dye so it will be dry for the Graffiti Party.",
      "end_time": "2010-04-17T00:25:00-0700",
      "name": "Pre-Graffiti Tye Dye and Setup Up Party",
      "start_time": "2010-04-16T20:25:00-0700",
      "id": "1087418694608383",
      "rsvp_status": "attending"
    },
    {
      "description": "That`s right folks! Circus Bacchus be performin' a shipmate show! Featurin' th' newly formed an' ever' talented Circus Bacchus Band! 

Prepared t' be ooo'd an' awe'd as we take ye tho a magical shipmate adventure complete wi' live music, jugglin', fire arts, strongman, dancin' lasses, comedy an' much, much more!

$7 at the door - $5 in costume!!
18+  

This be a backyarrd show!  Bring yer own grog and dress appropriately!",
      "end_time": "2010-04-16T22:00:00-0700",
      "name": "Circus Bacchus Presents: Rawr... A Pirate Show!",
      "start_time": "2010-04-16T19:00:00-0700",
      "id": "979093092115051",
      "rsvp_status": "unsure"
    },
    {
      "description": "First half of the night will be at the house, then at midnight its off to the bars!
The house is on litzler. Lets try to get some carpoolage going. :)",
      "end_time": "2010-04-16T02:00:00-0700",
      "name": "Heather's 21st!",
      "start_time": "2010-04-15T21:30:00-0700",
      "id": "10153241532849346",
      "rsvp_status": "attending"
    },
    {
      "description": "The most awesome tournament that NAU has ever seen.  Bring your favorite game and a console!  You will be tried.  You will be measured.  Will you be found wanting?",
      "end_time": "2010-04-10T00:00:00-0700",
      "name": "Elite Four Challenge",
      "start_time": "2010-04-09T19:30:00-0700",
      "id": "948438085167057",
      "rsvp_status": "unsure"
    },
    {
      "description": "Share the Comfort gives product from Private Quarters to the Sojourner Center in Phoenix Arizona when you host an event at your home.  I am also taking orders for pillows (without commission) to donate to the Sojourner Center for women to have a clean pillow when they need the use of the shelter for themselves and for their children.  One in four women have been abused in their lifetime, this is your chance to help them out!  Everyone that hosts, or purchases will get raffle tickets from me!  I have hotel stays, sheets, throws, robes and more!  Call me today at 480-513-1717.",
      "end_time": "2010-04-30T18:55:00-0700",
      "name": "Share the Comfort in Arizona and Pillows for a Purpose!",
      "start_time": "2010-04-01T15:55:00-0700",
      "id": "1000520499982142",
      "rsvp_status": "attending"
    },
    {
      "description": "The dinner party will take place after Jessie's recital in Ashurst auditorium starting at 5:30.
Food:
Something including the fresh, authentic, Mexican tortillas I bought next to the border.
Tortilla Chips, and Mexican beer
Joe's infamous 7 layer dip (which is excellent btw)

What to bring:
More food (be creative)
More drinks (keep the alcohol to a minimum)
Other people that couldn't make the Mexico trip

Jessie's parents may be attending, so I hope everyone can come for them so see what a wonderful group of friends she has found!
Bring your full quality Mexico pictures to share with people who hate having to view the Facebook version.
I know TGen has a meeting in Phoenix this weekend, so I hope those employees can come after they get back on Sunday.",
      "end_time": "2010-03-28T21:30:00-0700",
      "name": "Mexican Dinner",
      "start_time": "2010-03-28T18:30:00-0700",
      "id": "971460529538968",
      "rsvp_status": "attending"
    },
    {
      "description": "The Inhouse Digital Carnival for only the best who inhabit the Engineering building at NAU... or anyone else who wants to come.  Invite your friends!",
      "end_time": "2010-03-27T00:00:00-0700",
      "name": "Inhouse Digital Carnival",
      "start_time": "2010-03-26T19:30:00-0700",
      "id": "951551954863772",
      "rsvp_status": "attending"
    },
    {
      "description": "You can make it happen!  

Google wants to give several cities Web service that is 100 times faster than most Americans currently have—1 Gigabit per second. This means fiber all the way to the home, business, or campus. What was a soda straw becomes a fire hose, or a hundred fire hoses, and all at competitive prices. Total fantasy? Not at all.

We just need lots of people to tell Google how Flagstaff is a perfect fit by March 26, 2010 at 6 PM Arizona Time. Go to http://www.google.com/appserve/fiberrfi to find out how.
Then put your creative genius to work. Record a song, make a video, or just write why you think Flagstaff is the city for Google’s new fiber-to-the-home network.  

We have a terrific advantage as a small city in a rural county with a population near the lower end of Google’s range for cities with populations between 50,000 to 500,000 residents. With people in the incorporated city limits as well as many just beyond—Kachina Village and Baderville, for example—we are exactly what Google is looking for. 

The implications for becoming a trial city are huge:

•         Faster Internet means Flagstaff becomes very attractive to businesses thinking of locating here

•         True “cloud computing”

•         The Open Access Network enables services we haven’t imagined—maybe you’ll create some

•         More fun! We can only imagine what might be available for entertainment and communications with essentially unlimited bandwidth. 

o   3D movies streamed with no waiting

o   Music downloads that take less than a second. 

o   Increasingly complex and sophisticated gaming with absolutely no latency

o   Video streaming in HD for keeping in touch with family and friends

o   Access to HD viewing of landscapes, cities, and art from all over the globe

o   No more hourglasses and spinning beach balls!
So have fun, be creative, go wild, and rave about Flagstaff. You can do a good thing for yourself and for Flagstaff too. Help thrust us into a new era! We can’t do it without your help. Come on and show your stuff!",
      "end_time": "2010-03-26T18:00:00-0700",
      "name": "Google Offers World’s Fastest  Internet to Flagstaff!",
      "start_time": "2010-03-19T16:00:00-0700",
      "id": "892821457407876",
      "rsvp_status": "attending"
    },
    {
      "description": "Buy your tickets at Fry's ahead of time for a $2 discount ($18). 

We'll be heading down on Friday to get to the Faire by 10 am Saturday. 

Lodging is available at the Hudson household for all who need it.",
      "end_time": "2010-03-06T18:00:00-0700",
      "name": "Ren Fest!",
      "start_time": "2010-03-06T10:00:00-0700",
      "id": "10153249884164049",
      "rsvp_status": "attending"
    },
    {
      "description": "One Day Without Shoes is the day we spread awareness about the impact a simple pair of shoes can have on a child’s life. On April 8th, we ask people to go the day, part of the day or even just a few minutes, barefoot, to experience a life without shoes first-hand, and inspire others at the same time. 

You must OFFICIALLY register at http://www.onedaywithoutshoes.com to be entered to WIN a TOMS Shoe Drop!!

 Join us on April 8th - http://www.onedaywithoutshoes.com
 Join us on April 8th - http://www.onedaywithoutshoes.com
 Join us on April 8th - http://www.onedaywithoutshoes.com
 Join us on April 8th - http://www.onedaywithoutshoes.com
 Join us on April 8th - http://www.onedaywithoutshoes.com
 Join us on April 8th - http://www.onedaywithoutshoes.com


-------
FAQ:

. . Why would a shoe company sponsor an event to not wear shoes...
Why would a company GIVE away a pair of shoes for every pair they sold? Sure, it might sound crazy at first but One Day Without Shoes expresses everything we stand for: educating consumers about the impact a pair of shoes can have on a child's like and empowering them with simple actions that address the need for shoes. Learn more at http://www.onedaywithoutshoes.com

. . Sorry, I work... I can't participate!
There are a ton of creative ways to participate in One Day Without Shoes. Walk for an hour barefoot after work, plan a barefoot evening event or breakfast with friends, participate simply by sharing the message with friends who are able go with no shoes. The possibilities are endless, and people are getting creative. There are plenty of events all across the country: search by zip code at http://www.onedaywithoutshoes.com

. . Will i get in trouble for not wearing shoes??
We hope not. But we've anticipated your coworkers, teachers, principals, or community leaders having questions. We have a letter you can download and send to them at http://www.onedaywithoutshoes.com. Go check it out! 


-------
LATEST NEWS:

- Find events in your area or create your own event by visiting http://www.onedaywithoutshoes.com


-------
SHARE THE FACTS:

Fact #1:In some developing nations, children must walk for miles to food, clean water and to seek medical help.

Fact #2:Cuts and sores on feet can lead to serious infection.

Fact #3:Often, children cannot attend school barefoot.

Fact #4:In Ethiopia, approximately one million people are suffering from Podoconiosis, a debilitating and disfiguring disease caused by walking barefoot in volcanic soil.

Fact #5: Podoconiosis is 100% preventable by wearing shoes.",
      "end_time": "2010-04-08T23:55:00-0700",
      "name": "One Day Without Shoes 2010",
      "start_time": "2010-04-08T00:30:00-0700",
      "id": "10153300225034850",
      "rsvp_status": "unsure"
    },
    {
      "description": "2 vs 2 Super Smash Brothers Brawl tournament.  Non-tournament play is free.  $5 per person tournament registration.  Couples can enter for free, as long as they are prepared to prove that they are a couple.  What could be more romantic than a night of Brawl?",
      "end_time": "2010-02-12T22:30:00-0800",
      "name": "Valentine's Day Brawl!",
      "start_time": "2010-02-12T19:30:00-0800",
      "id": "10153221008526675",
      "rsvp_status": "unsure"
    },
    {
      "description": "Okay, so my birthday ends up being on the religious holiday of SUPERBOWL.

HOWEVER... Snowbowl closes at 4, Kickoff is at 4:30, so just do a little
extra speedy driving and you are fine. (Nothing exciting is at the beginning anyway)
ALSO, slopes should be pretty clear of people, as it is Sunday and all the snowboarders are at church, or back in Phoenix where they belong because they have to be there in time for the beforesaid Holiday.

With all that being said... Woohoo!
Meet at my place at 8am, rent your snowboard the day before at one of the places in town... (FYI Peace Surplus snowboard rental $20)

I plan on going for the full day 8am-4pm, but you are welcome to come whenever.
Also, you are welcome to bring whoever, as it nice to have a ski lift buddy :) (and not that annoying dude who insists on telling you their life story)

***If you are my friend and reading this, you are invited***
At the very least, my birthday is an excuse to go snowboarding. You don't even have to see me if you just need the excuse to go up there.


Oh. And if you want to ski instead, I suppose you could come. Don't know if I'll speak to you though.",
      "end_time": "2010-02-07T16:00:00-0800",
      "name": "Birthday - Snowboarding",
      "start_time": "2010-02-07T08:00:00-0800",
      "id": "10153309098159875",
      "rsvp_status": "unsure"
    },
    {
      "description": "Gabe Wolf- trumpet
Holly Pyle- vocals
Brad Bays- guitar
Zach Downes- bass
Ron James- drums",
      "end_time": "2010-02-05T01:00:00-0700",
      "name": "Arctic Fox @ Mia's Lounge",
      "start_time": "2010-02-04T21:30:00-0700",
      "id": "10152772292998456",
      "rsvp_status": "unsure"
    },
    {
      "description": "Annual CS !(BBQ).  Since we will be serving !(not) BBQ, there will be pizza instead.  Play video games.  Meet other Computer Science students, or like minded people.",
      "end_time": "2010-01-29T21:00:00-0800",
      "name": "CS !(BBQ);",
      "start_time": "2010-01-29T18:00:00-0800",
      "id": "10153028736668173",
      "rsvp_status": "unsure"
    },
    {
      "description": "He is expected to arrive around May 4th or 5th if everything goes according to plan. 

The plan: Once I find out when he is scheduled to arrive in Phoenix, I will text whoever is interested the time and additional info. His mom will be meeting him at the gate, I will be there once he gets past security, then all of you willing and able friends will be at baggage claim to surprise him.  Since I would like a few minutes to greet him alone (selfish I know... ;-), and I legally can't meet him at the gate, I'll be there at security, we'll have our few minutes then once I take him down to baggage... Surprise!

Thanks again for helping me and his mom welcome our Soldier home.

<3 Christina",
      "end_time": "2010-05-05T17:00:00-0700",
      "name": "Woody's Airport Welcome Crew",
      "start_time": "2010-05-05T15:30:00-0700",
      "id": "10155443267170693",
      "rsvp_status": "unsure"
    },
    {
      "description": "Jared and I got a new place, drop by and drop out. Going to make a bunch of food too. Bring some alcohol for everyone :-)",
      "end_time": "2010-01-16T05:00:00-0700",
      "name": "HouseWarming Party Crazy",
      "start_time": "2010-01-15T21:00:00-0700",
      "id": "10153012573883821",
      "rsvp_status": "unsure"
    },
    {
      "description": "Let's get together and pregame the pine cone drop at my place.  And return for some drinks afterward, like spiked eggnog and hot chocolate.",
      "end_time": "2010-01-01T02:00:00-0700",
      "name": "New Years Eve",
      "start_time": "2009-12-31T20:00:00-0700",
      "id": "10153240464022486",
      "rsvp_status": "attending"
    },
    {
      "description": "The Weatherford Hotel's lighted pine cone is back in place atop the historic three-story building in preparation for the upcoming New Year's Eve \"pine cone drop.\" This is the 10th year the pine cone has been hoisted up to the Weatherford's pointy \"witch's hat\" cupola so it can be sent earthward to ring in the new year, like the famed glowing ball in New York City's Times Square. The local tradition has been in place since 1999, when Weatherford owners strung up a decorated, illuminated garbage can to celebrate the 21st century and the hotel's 100th anniversary.

***Upload your own pictures from past years!!***",
      "end_time": "2010-01-01T02:00:00-0800",
      "name": "New Years Eve Pine Cone Drop!",
      "start_time": "2009-12-31T21:55:00-0800",
      "id": "10152727973457312",
      "rsvp_status": "attending"
    },
    {
      "description": "We are planning to leave in a week or two for San Diego.  The official offer has not come in but nobody else is being looked at so it is almost certain.  If all else falls though we still need a graduation party for Keifer, Ben, and Travis.",
      "end_time": "2009-12-12T22:00:00-0500",
      "name": "Keifer and Joanna's Going Away/Graduation Party",
      "start_time": "2009-12-12T19:00:00-0500",
      "id": "10152939688879107",
      "rsvp_status": "attending"
    },
    {
      "description": "Make a gingerbread house at my place!
I will have stuff like...
-gingerbread
-candy 
-cardboard to put it on
-Hot chocolate

But feel free to bring anything you would like to PIMP your house!!!",
      "end_time": "2009-12-12T00:00:00-0800",
      "name": "Gingerbread house party!",
      "start_time": "2009-12-11T20:00:00-0800",
      "id": "10153217886518680",
      "rsvp_status": "attending"
    },
    {
      "description": "I got this up kind of late but whatever, it's my birthday tomorrow. I'm still kind of zoned out from the trip but it should be fun either way. I'll be going at it all day after one but the plan for tomorrow night is downtown around 9. I'm guessing Monte V and other bars but really don't care. 928 210 7557.",
      "end_time": "2009-11-25T03:00:00-0700",
      "name": "IT'S MY BIRTHDAY!!!",
      "start_time": "2009-11-24T21:00:00-0700",
      "id": "10152680568936829",
      "rsvp_status": "unsure"
    },
    {
      "description": "SUPPORT NAU ACM at Chili's

10% of sales will go to funding ACM and its Spring 2010 Projects/Digital Carnivals

When: Monday, November 23, 2009
Where: Chili's Restaurant
1500 S Milton Rd
Flagstaff, AZ 86001
Phone: (928) 774-4546

Present the flyer (attached to this event) to your server to support ACM. This flyer can also be applied to To-Go Orders!!",
      "end_time": "2009-11-23T23:00:00-0800",
      "name": "Support ACM at Chili's",
      "start_time": "2009-11-23T11:00:00-0800",
      "id": "10153727147549338",
      "rsvp_status": "unsure"
    },
    {
      "description": "We'll be staying at the Viña Del Mar Hotel; We have 2 rooms reserved. The Hotel is right on the rocky coast with a swim-up bar, hot tub, and coconuts!",
      "end_time": "2010-03-21T17:00:00-0700",
      "name": "Spring Break in Puerto Peñasco",
      "start_time": "2010-03-18T12:00:00-0700",
      "id": "10152876160577852",
      "rsvp_status": "attending"
    },
    {
      "description": "The ACM is proud to feature fighting game tournaments at our third Digital Carnival for this semester. Entering any of these tournaments earns you the chance to win the great prizes we have available. Of course we'll also have our TV's set up with the games you know and love including DDR, Rock Band, Mario Kart, and more! We're also happy to announce that we've brought back LAN support! Bring your PC's and throw down with your fellow gamers.",
      "end_time": "2009-11-21T00:00:00-0800",
      "name": "Digital Carnival: Battle Royale",
      "start_time": "2009-11-20T19:30:00-0800",
      "id": "10152902639589952",
      "rsvp_status": "unsure"
    },
    {
      "description": "The Clarinet Studio in the School of Music at Northern Arizona University will present a studio recital and fundraiser for the Michael Sullivan Young Artist Scholarship Fund. Dr. Sullivan was Professor of Clarinet at NAU from 1994 until 2007 and the 2005-2006 Teacher of the Year for the College of Arts and Letters. Dr. Sullivan passed away on June 2, 2007 after a courageous battle with cancer.

The NAU clarinet studio will present a delightful array of solo and chamber works by Devienne, Saint-Saens, Mozart, Beethoven, Gustavino, Roza, Crusell, Rabaud, and others.

The recital is free of charge. Donations to the scholarship fund in Dr. Sullivan’s name will be accepted and raffle tickets for prizes will be sold. For those not able to attend the recital, donations may be sent by mail to:

NAU Foundation, Michael Sullivan Young Artist Scholarship Fund
School of Music, Northern Arizona University
PO Box 6040
Flagstaff, AZ 86011",
      "end_time": "2009-11-07T14:00:00-0800",
      "name": "NAU Clarinet Studio Recital",
      "start_time": "2009-11-07T12:30:00-0800",
      "id": "10152778697363016",
      "rsvp_status": "unsure"
    },
    {
      "description": "So I'm 21 now! Time for this newfangled drinking thing the kids are always talking about. Since every good drinker does so on a full stomach, our first stop will be dinner at Buffalo Wild Wings. Those who aren't 21 or aren't interested in barhapping can join in for this part of the night. Then we'll be heading out to drink the night away at the various liquor peddling establishments that Flagstaff has to offer!",
      "end_time": "2009-11-07T02:00:00-0700",
      "name": "Jordan's Barhopping Extravaganza!",
      "start_time": "2009-11-06T19:00:00-0700",
      "id": "10152969476217946",
      "rsvp_status": "unsure"
    },
    {
      "description": "This is going to be a truly awesome party. There are over 30 artists at this event spanning the spectrum of Electronic Dance Music (EDM).",
      "end_time": "2009-11-29T06:00:00-0700",
      "name": "Ritual Music Festival",
      "start_time": "2009-11-28T21:00:00-0700",
      "id": "10152364394227706",
      "rsvp_status": "attending"
    },
    {
      "description": "UPDATE: 
32 people max, for two rooms! Pay Anne or I $65 if you want to go!

HOTEL
MGM Grand. Due to space restrictions, we are all going to have to pack relatively light. One duffel bag and maybe a backpack per person...

Ryan and I have booked the 'Celebrity Suite' at the MGM Grand. Please be respectful by not partying too much in the room (you shouldn't be in the room, except to sleep, anyway!). If security gets called for a noise complaint, and they find extra people in the room, there is an extra $35 charge per person per night - but this should not be a concern at all if we are reasonable with the room. There is a $200 damage deposit on our credit card too, so if something breaks then someone’s going to have to make it up. As for myself, I plan on not sleeping, but maybe crashing there for an hour or two when the sun comes up.

TRAVEL
I just booked a 15 person passenger van. Please post below if you have a vehicle and can drive to Vegas.

SUMMARY
Cramped, but luxurious hotel suite: $30 for 2 nights
15 person passenger van (I'm renting and driving it, this will be the PARTY VAN): $35 per person, round trip.
Total: $65 per person

Also:
Food, misc, gambling: Bring food and probably, oh, about $300 in cash. Don’t expect to come back with any of it :-) (You can do much in Vegas for less, but the town is generally pretty expensive, especially on the Strip. 

My friends and I are dressing up as various army men. We have built a prototype and it works, contact me if you would like to dress up with us!",
      "end_time": "2009-11-01T16:00:00-0700",
      "name": "HALLOWEEN IN VEGAS",
      "start_time": "2009-10-30T16:00:00-0700",
      "id": "10152804909850918",
      "rsvp_status": "unsure"
    },
    {
      "description": "Awesome.",
      "end_time": "2009-10-25T21:00:00-0700",
      "name": "Party",
      "start_time": "2009-10-23T21:00:00-0700",
      "id": "10153214667726306",
      "rsvp_status": "attending"
    },
    {
      "description": "For all the people going to Vegas, this is just an optional get together so we can meet each other before the trip. Feel free to come and meet the people who have organized it, ask questions, get to know people, or just get dinner.",
      "end_time": "2009-10-23T22:00:00-0700",
      "name": "dinner before vegas",
      "start_time": "2009-10-23T19:00:00-0700",
      "id": "10153212917010953",
      "rsvp_status": "unsure"
    },
    {
      "description": "Head out to Harkins to catch the 9:40 showing! Probably can't really control seats or who comes or doesn't; just head out with friends and watch a scary movie.

Probably head to Denny's on Milton afterward.",
      "end_time": "2009-10-17T00:00:00-0700",
      "name": "Movie: Paranormal Activity",
      "start_time": "2009-10-16T21:40:00-0700",
      "id": "10152828608663519",
      "rsvp_status": "unsure"
    },
    {
      "description": "Ladies, take out your old worn-me-once  dresses; Gentlemen, bring out your favorite suits-

It's time to cut a rug at the first ever Prom Party
Bring a date or come stag- There will be dancing,  punch, goodies and, of course, the ever classy prom decor. 

*Prom attire and your dancing feet are required*",
      "end_time": "2009-10-10T02:00:00-0700",
      "name": "Prom Party",
      "start_time": "2009-10-09T21:00:00-0700",
      "id": "10152939468162858",
      "rsvp_status": "unsure"
    },
    {
      "description": "AC/DC in Phoenix at US Airways Center.

Thursday October 1st.

http://www.ticketmaster.com/event/1E0042EEBB0168F2?cce_tid=3F3F3F166B693F3F7B22E353F513E6C60323F3F&oid=3F3F3F166B693F3F7B22E353F513E6C60323F3F&eid=410551&artistid=1170951&majorcatid=10001&minorcatid=200&brand=livenation&",
      "end_time": "2009-10-02T00:30:00-0700",
      "name": "AC/DC in Phoenix!",
      "start_time": "2009-10-01T19:30:00-0700",
      "id": "10153728305622656",
      "rsvp_status": "unsure"
    },
    {
      "description": "Graffiti (singular: graffito; the plural is used as a mass noun) is the name for images or lettering scratched, scrawled, painted or marked in any manner on property. Graffiti is any type of public markings that may appear in the forms of simple written words to elaborate wall paintings.

That's right, the entire place is covered in painters tarp!  Enjoy loud dance music and feel free to express yourself all over the plastic surfaces.  This party will also include making Ty Dy t-shirts, body painting, and black lights.  So wear white shirts (and white pants if you're feeling adventurous) and come get spray painted!

Entrance fee: $5 or bring drinks and snacks
People traveling over 30 miles don't have to bring anything.",
      "end_time": "2010-04-18T04:00:00-0700",
      "name": "Graffitti Night",
      "start_time": "2010-04-17T21:00:00-0700",
      "id": "10153853065674062",
      "rsvp_status": "attending"
    },
    {
      "description": "Come join the NAU Chinese Scholar & Student Association for a China National Day Celebration.  There will be cultural presentations, a talent show, drinks and snacks.",
      "end_time": "2009-09-26T20:30:00-0700",
      "name": "China National Day Celebration",
      "start_time": "2009-09-26T18:30:00-0700",
      "id": "10153232929968374",
      "rsvp_status": "unsure"
    },
    {
      "description": "Join us in celebrating Erika's birthday! Yay no more teenage years! : )

directions: these are Erika directions so if they suck...ask someone else ;)

if your on speedway, turn south on tucson (at eegees). take a left on 4th st, then your next left, then first right (at stop sign). My house is the second one on the right. you can park anywhere on my street.
The map they give you on facebook is wrong, thats not my house so please don't follow that. Thanks!",
      "end_time": "2009-09-25T00:00:00-0700",
      "name": "Erika's 20th Birthday!",
      "start_time": "2009-09-24T18:00:00-0700",
      "id": "10152957293973585",
      "rsvp_status": "unsure"
    },
    {
      "description": "This is now a dual celebration, for Elyse and Travis both turning 21 within a day of each other!

Starting off at the birthday girl's place, then at midnight (early Sunday morning) we're going to the bars!!

Woo get shitty and bring Elyse and Travis a birthday drink!",
      "end_time": "2009-09-20T18:00:00-0700",
      "name": "Elyse and Travis's 21st Birthday Dance Party",
      "start_time": "2009-09-19T20:00:00-0700",
      "id": "10153323525540362",
      "rsvp_status": "unsure"
    },
    {
      "description": "In response to a new trend of Ladies Nights, I've decided to create this event to combat the exclusiveness of the all female parties.

Being the gentlemen that we all are, we invite the women to join us.  However, be warned, there will be tobacco and drinking of scotch and whiskey; no girlie drinks.

I have not chosen a location so please post in the comments, we could of course go out into the woods and then shoot stuff too.
Also, we will need more outdoor chairs for the back porch so we can sit around and smoke.",
      "end_time": "2009-09-13T02:00:00-0700",
      "name": "A Gentlemen's Evening",
      "start_time": "2009-09-12T21:00:00-0700",
      "id": "10153348450994954",
      "rsvp_status": "attending"
    },
    {
      "description": "Come one, come all to this year's Computer Science BBQ! Socialize with your fellow CS majors and CS faculty. There will be food, drinks, and fun at Kiwanis Park, located across from the Dome.

Also, bring your DS or PSP!",
      "end_time": "2009-09-11T21:00:00-0700",
      "name": "Computer Science BBQ!",
      "start_time": "2009-09-11T17:00:00-0700",
      "id": "10155507732560541",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come see us at Mia's: Holly Pyle on vocals, Gabe Wolf on trumpet, Ian Amberson on piano, Zach Downes on bass and Ron James on drums. Don't miss it! :)",
      "end_time": "2009-09-11T00:30:00-0700",
      "name": "Arctic Fox 5 @ Mia's Lounge",
      "start_time": "2009-09-10T21:30:00-0700",
      "id": "10153157567818654",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come out and see KJACK Radio and join up! You won't regret it!",
      "end_time": "2009-09-01T18:30:00-0700",
      "name": "KJACK Radio Open House",
      "start_time": "2009-09-01T17:00:00-0700",
      "id": "10153281058506122",
      "rsvp_status": "unsure"
    },
    {
      "description": "My infamous semi-annual parties are back!
This time become a mad scientist and have an explosive time playing with food, ferromagnetic fluids (if you don't know what a ferrofluid is, come find out!), marbles made out of water, a volcano cake, and maybe even some thermite.  So put on your lab coats and goggles and come have a great time.  (some lab coats and goggles will be provided, other clothing optional)
Other attractions include: test tube shots, dry ice, \"Mad Science\" the movie, awesome music, and drinking out of beakers!  Don't forget to invite your friends!

P.S. If I forgot to invite you, don't take it personally; I just don't like you.  Buahahahaha!

Click \"View Map\" for directions.",
      "end_time": "2009-08-29T02:00:00-0700",
      "name": "Mad Science Night",
      "start_time": "2009-08-28T21:00:00-0700",
      "id": "10153204740747305",
      "rsvp_status": "attending"
    },
    {
      "description": "Come one, come all to ACM's first Digital Carnival of the semester! There will be games, pizza and more in the Du Bois Center at 7pm this Friday, August 28th. 

There will be a new tournament every hour on the hour ranging from hardcore fighters like BlazBlue and Marvel vs Capcom to casual games like Wii Sports. Along with the prizes awarded to the winners of these tournaments, there will also be door prizes raffled off to our guests.

Be there AND be square!",
      "end_time": "2009-08-29T00:00:00-0700",
      "name": "Welcome Back Digital Carnival!",
      "start_time": "2009-08-28T19:00:00-0700",
      "id": "10152717289882016",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come see some awesome live jazz, featuring
Holly Pyle: vocals, Gabe Wolf: Trumpet, Ian Amberson: Piano, Zach Downes: Bass, and Ron James: Drums.",
      "end_time": "2009-08-21T00:30:00-0700",
      "name": "Arctic Fox 5 @ Flag Brew",
      "start_time": "2009-08-20T21:30:00-0700",
      "id": "10152762626482109",
      "rsvp_status": "unsure"
    },
    {
      "description": "It may be a dry heat, but that won't stop Diggnation from coming to Arizona and having a blast.  Join us in Tempe as Kevin and Alex talk the top stories on Digg.com with our friends and fans in Arizona!",
      "end_time": "2009-08-19T21:00:00-0700",
      "name": "Diggnation LIVE in Arizona",
      "start_time": "2009-08-19T19:00:00-0700",
      "id": "10153176962836827",
      "rsvp_status": "unsure"
    },
    {
      "description": "We're goin to veeeeggggaaassss... again.

see you there!


all you need to do is get a room and transportation. the room i am in is already overflowing with people haha. 
if you can do that, then come along and party with us!",
      "end_time": "2009-07-28T10:00:00-0700",
      "name": "\"We're goin streaking!\" ...in Vegas",
      "start_time": "2009-07-24T10:00:00-0700",
      "id": "10152837701209013",
      "rsvp_status": "unsure"
    },
    {
      "description": "Sherman will be hosting a party at his place. Pending if we can get it, deep fried turkey will be on the main menu.

Currently I am the liaison for Mr. Seschillie, so if you have any questions please ask me.

You are more than welcome to bring any food/drink stuff you want. I asked that you write down what you plan to bring in the comments below.",
      "end_time": "2009-07-10T23:55:00-0700",
      "name": "Turkeyfest 09",
      "start_time": "2009-07-10T17:00:00-0700",
      "id": "10153202492409799",
      "rsvp_status": "unsure"
    },
    {
      "description": "I'm going far, far away and Sunday is my last night in Flagstaff.  Come party with me one last time (for the next year, at least).  Also, whomever wants to help me move into a storage locker before the party is more than welcome to ;)",
      "end_time": "2009-07-06T00:00:00-0400",
      "name": "Ryan's farewell pub crawl",
      "start_time": "2009-07-05T20:00:00-0400",
      "id": "10152893131878721",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come to the 4th of July Parade downtown to watch us and other bands march and play! 

We begin staging at 8am on Sullivan street between Beaver and Leroux. (Sullivan is 8 blocks north of Route 66) and start playing around 9am. 

If you can't make it, we also play at night at the Green Room (9:30)!

Hope to see you!

From the Daily Sun:

As usual, Flagstaff on the Fourth is not lacking for activities. Because the holiday falls on a Saturday, the schedule this year is more jam-packed than last, ending with fireworks and including horse races, a symphony concert and Hopi and pioneer festivals.  The highlight, of course, is the Fourth of July parade, now in its 13th year since its revival by the Flagstaff Chamber of Commerce. It takes off at 9 a.m. from Elm and Beaver, and a crowd of at least 10,000 is expected to line the downtown route. This year's special entry is Sambatuque, a Brazilian-style band based in Seattle.

http://www.flagstaffchamber.com/",
      "end_time": "2009-07-04T13:00:00-0700",
      "name": "4th of July Parade - SAMBATUQUE",
      "start_time": "2009-07-04T09:00:00-0700",
      "id": "10152630695921572",
      "rsvp_status": "unsure"
    },
    {
      "description": "Depending on the response of those willing to make the trek out to my house I will be hosting a party at my house.
If not enough people plan to attend then there really is no need to go all the way out into the boon docks.

Its a ways out and the last part of the road is a bumpy dirty road.

I will finalize this event by 3:00 pm Thursday to confirm if we are having this part or not.

*UPDATE*

Well even thought there is not going to be a lot of people going to be there, I will still be hosting the event for some of my other friends. They don't have facebook so you guys don't see them that often. But I will probably have food for like 10 - 13 people.

But if you are feeling bored and and to take a trek stop by.",
      "end_time": "2009-07-03T22:00:00-0700",
      "name": "Pre-4th of July BBQ",
      "start_time": "2009-07-03T17:00:00-0700",
      "id": "10152802390566778",
      "rsvp_status": "unsure"
    },
    {
      "description": "i think the title pretty much sums it up.. bbq and pool party. bring your swimsuit and a towel. im thinkin the traditional hamburgers and hot dogs.. if you want something else you should probably bring it. we have some booze but not a lot so feel free to bring your own 6-pack or something. 

if anybody has one of those floating beer pong tables.. PLEASE BRING IT!! and show up early too haha. that would be bichin to get some pool-b-pong goin on

itll be good times. 

if you have questions or need directions call or message me.

For anybody who might be confused.. this will be taking place in PHOENIX.. not tucson.",
      "end_time": "2009-07-04T04:00:00-0700",
      "name": "pool party / bbq",
      "start_time": "2009-07-03T14:00:00-0700",
      "id": "10153767866726679",
      "rsvp_status": "unsure"
    },
    {
      "description": "This day  is the day for all men to stand up and say, \"Yes, I am a Man.\" And \"Yes, I will step up and do manly things and whatever I want to do on this glorious day!\" 
Come, make history! Be a part of National Man day. Take the world by the throat and tell them it's ok to watch  Rocky movies all day. Tell them it's fine if you sit in your favorite chair and scratch yourself. Tell them it's normal to go shoot stuff or blow something up. Why? Because YOU ARE A MAN!!!
You aren't some nancy that likes to frolic in the fields, unless it's a field of mines and you have an AK47 and a hand full of grenades... Then you really are a man! 
Yes on this day, men across the nation will be saying, \"Screw you salad bar, with your salad and light dressings!\" Men will step up and say, \"I'll take that 20 oz steak, and yes, I'll eat it all. Because I'm a man!\"

I'm not asking you to throw some sissy party, or to go buy a new power tie because you're a man. All I'm asking you to do is step up live this day like a man would. Blow something up, shoot some animal, punch your buddy in the face for no reason, be a good father, play football and literally knock someone's head off... Do something manly. Be a man like God intended you to be... 
Take this day and celebrate your manhood!


Hello my friends,
A person has made a significant slam to our sacred holiday. Instead of giving support to National Man Day, they have deemed our day as \"Sneak a Kiss Day\". 
First, who the crap thinks of a day like that?? Seriously.
Second, how can you sneak a kiss? The object of sneaking something is to not let anyone else know about what you are doing. So are you guys going to sneak into your closet and kiss yourself without telling you?? Maybe later you can write in your journal and laugh about it... 
Here it is men, we are MEN! We don't sneak kisses. We kiss and make sure she knows it's a freaking kiss!! Let her know you care, not by being some nancy that tries to play it off like it was a bug that landed on her cheek. 
Be a man!
So, let's not go around \"sneaking\" kisses on June 15th. Let's go around being men! Being responsible, God fearing, mother loving, good fathering, awesome husband, men! Men that don't need to sneak a kiss to actually get one, men that treat their women right and deserve a big kiss!
Let's be MEN!
Sincerely, 
Joel Longanecker


Hello my fellow countrymen!
I have received mail recently that questioned the motives of this day. So, once again I want to clarify what National Man Day is about.
National Man Day isn't about getting drunk and having sex with a million girls, anyone can do that. 
National Man Day is about being a responsible man and having fun doing it! So many times the media and other forces tell us that being manly isn't cool. They say it's ok to not be a man of your word, or to walk out and leave your family. National Man Day is a day to step up, slap the media in the face and tell them it is GREAT to be a manly man, one that John  Wayne would be proud of! It is a day to step up and be a good father, or bring some flowers home to your wife. It's a day to be a man, one that this country hasn't seen in decades. It's a day to be a responsible, God fearing, God loving man! And it's a day to have freaking blast doing it!!!!
So on June 15th, take time to be a good man! Take time to honor your family, to honor you country and to honor God! Take this day to make it the beginning of the return of manly men!!!! 

June 15th is the RETURN OF MAN!!



National Man Day. What comes to your mind when you hear that? Maybe blowing things up, maybe doing manly things and cooking food on the grill. If so, GREAT! All those things are a part of National Man Day. Notice PART. The other part to National Man Day is about men stepping up and becoming men. Here at National Man Day, we want to make the men of this nation better men! Why? Because men around this nation have been taking the easy way out and shying away from what being a man is all about! We want to make men better fathers, better husbands, better boyfriends, better sons, better brothers, and better Americans. Our goal is to make men better! While having lots of fun doing it! So next time you wonder why National Man Day is here, know that our goal is to make men across this Nation better MEN!
Keep up the good work, fellas!
Remember, June 15th is the Return of Man!



Here it is, gentlemen... The time you have all been waiting for....
Then National Man Day website is UP and manlier than EVER! What's that?? You don't know what the web address is?? How does, thereturnofman.com sound?? That is, the return of man.com with NO spaces. 
Look, I may be a little bias.... But the site is freaking A-mazing!! You can check out some info on us founders or check out a sweet t-shirt that has the official NMD logo on it!
Check it out, fellas! You won't regret it!
And remember.....
June 15th is the Return of Man!
Sincerely,
Joel Longanecker
National Man Day Co-Founder

 www.thereturnofman.com



Become a fan of NMD!! Follow us on Twitter and SO MUCH MORE! Be a fan now! Follow the link below to our fan page!

www.facebook.com/group.php?gid=45213511730


Greetings fans of National Man Day!
Are you a man? Are you dating someone? Well we here at NMD have seen the light and jumped on board with our friends at MANsaver and now need not fret about forgetting important dates like anniversaries or special holidays our ladies would enjoy!
 “Why?? How does one do this, Mr. Longanecker??”
Well random fan, please allow me to elaborate. Our friends Micah, Russ and Selah at MANsaver have designed and published an ingenious app that tracks the time you and your significant other started on the love journey (if you will) together , and then sends you reminders days before the actual event! Do yourself a favor and get this app now to keep yourself out of the dog house! This app has tons of cool features and did I mention that it is FREE!! 
More importantly, MANsaver now has one of the year’s most important (non)holiday that is (not) on the calendar! Yep, National Man Day is included in the app with a link to our website! 
Be sure to get this app downloaded and keep yourself out of the dog house! More importantly, keep yourself out of NMD’s dog house… Because our dog house is not a pleasant place…. Unless you like rabid vampire ninjas that haven’t ate since we tossed the guy from Twilight in there to see if those vampires could hold their own against us… Let’s just say that didn’t go well.
Download MANsaver NOW!!!
Remember, June 15th is the Return of Man!
-Joel Longanecker
National Man Day Co-Founder
www.thereturnofman.com",
      "end_time": "2011-06-16T00:00:00-0500",
      "name": "National Man Day",
      "start_time": "2011-06-15T00:00:00-0500",
      "id": "10153281915829904",
      "rsvp_status": "attending"
    },
    {
      "description": "Friday morning I am leaving for Las Vegas to fulfill my duties as a camp counselor, before then, I want to see your smiling face!",
      "end_time": "2009-06-12T12:30:00-0700",
      "name": "Pre-Camp Party",
      "start_time": "2009-06-11T20:30:00-0700",
      "id": "10153242842354134",
      "rsvp_status": "unsure"
    },
    {
      "description": "Bring a bottle of wine and wine glasses for tasting!
We already have a few people bringing bread/cheese.
Yay!!!

If you do not know where Teresa lives, call her.",
      "end_time": "2009-06-07T22:00:00-0700",
      "name": "Wine Tasting (and Swallowing)",
      "start_time": "2009-06-07T19:00:00-0700",
      "id": "10153205373862141",
      "rsvp_status": "attending"
    },
    {
      "description": "Toni and I just got a house.  We need to celebrate!!  Come over, see it, enjoy it, and byob, we're broke!",
      "end_time": "2009-05-24T02:00:00-0700",
      "name": "House Warming Party, Huzzah!",
      "start_time": "2009-05-23T16:00:00-0700",
      "id": "10153221958921635",
      "rsvp_status": "unsure"
    },
    {
      "description": "Birthday Party for Joe Flieger ...

Some assortments of wine and frozen drinks will be provided but as always your welcome to bring your own.

Lets start the summer off with a Bang.",
      "end_time": "2009-05-13T02:00:00-0700",
      "name": "Joe's Birthday Party",
      "start_time": "2009-05-12T21:00:00-0700",
      "id": "10153430569319796",
      "rsvp_status": "attending"
    },
    {
      "description": "Come celebrate birthdays, graduations and end of finals at Brews and Cues Friday night at 10pm.
Officially celebrating Mandolin's Graduation, and Drea's bday/graduation!",
      "end_time": "2009-05-09T02:00:00-0700",
      "name": "Brews and Cues Graduation/Birthday Celebration",
      "start_time": "2009-05-08T22:00:00-0700",
      "id": "10152949078439773",
      "rsvp_status": "unsure"
    },
    {
      "description": "*This is a joint IEEE/ACM Party Hosted by Joe Davidson: I just used ACM as the host so I could mass-invite*

\"Bling Out Your Graduation Caps\"
May 7th at 5:00pm, Engineering Building room 105 (ACM Lounge)

Some of us are about to graduate, and to look cool during graduation we are throwing an EE/CS \"Bling Out Your Graduation Caps\" party, on May 7th at 5PM in the room 105.  I'll bring a bunch of LED's, and various electronic components. I'll also get some food delivered. Even if you are not graduating, stop by and have some fun making circuits and soldering some stuff.

You might want to bring:
 - Your graduation cap (duh)!
 - 9V batteries, I got a bunch of 9V battery clips so you might want to bring 9V batteries for your circuit.
 - Soldering Iron, we have some but to make it so you don't have to share you might want to bring one. (You can buy a pocket butane soldering iron @ Radio Shack for cheap!)


EVEN IF YOU'RE NOT GRADUATING, COME HANG OUT AND DO GEEKY STUFF WITH US!",
      "end_time": "2009-05-07T23:00:00-0700",
      "name": "PIMP YOUR GRADCAP PARTY",
      "start_time": "2009-05-07T17:00:00-0700",
      "id": "10152829975603806",
      "rsvp_status": "attending"
    },
    {
      "description": "Everyone needs a break from studying right!

Themed parties at the Deathstar are back, this time a night of spies and secret agents.  Come dressed as your favorite agent or private eye in their best sting.  Possible movie options include but aren't limited to, Quantum of Solace, Bourne (series), Spy Game, Austin Powers?, Mission Impossible?, or we can kick it old school with Sean Connery!

Highly trained assassins are also welcome (Hitman anyone?).",
      "end_time": "2009-05-02T02:00:00-0700",
      "name": "Spy Night",
      "start_time": "2009-05-01T20:00:00-0700",
      "id": "10152834826703354",
      "rsvp_status": "attending"
    },
    {
      "description": "The School of Music presents the NAU Percussion Ensemble Concert.

Our Samba band SAMBATUQUE will be performing at the end. Please come to watch a FREE amazing show!

http://london-underground.modlang.nau.edu/cal_events/music_events_view.php

Doors open at about 7:00 - 7:15, show starts at 7:30. We go on possibly as early as 8:15 or so!",
      "end_time": "2009-05-01T21:00:00-0700",
      "name": "Samba",
      "start_time": "2009-05-01T19:30:00-0700",
      "id": "10152711614421020",
      "rsvp_status": "unsure"
    },
    {
      "description": "Doors Open @ 9pm - Wrestling begins at 10pm!
$5 Donation at the door

Join the Womens Rugby Team and The Green Room in an all out bash!!  

Drink Specials ALL NIGHT!
$1 Jello Shots
$1.50 Coors Light Cans
$2 Domestic Drafts
$3.25 Jim Beam

COME WATCH OR COME WRESTLE, BUT COME TO HAVE A GOOD TIME!!!",
      "end_time": "2009-04-19T01:00:00-0700",
      "name": "Bubblebath Wrestling!!!!!",
      "start_time": "2009-04-18T22:00:00-0700",
      "id": "10153208587787403",
      "rsvp_status": "unsure"
    },
    {
      "description": "Michael Brooks (your friendly neighborhood hacker)  is turning 23 Friday, April 17th, Help surprise him on his way to old age. There will be drinks, music and loud shouting when he shows up. Come out and party with a purpose!",
      "end_time": "2009-04-18T02:00:00-0700",
      "name": "Michael Brooks (possibly surprise) birthday party",
      "start_time": "2009-04-17T21:00:00-0700",
      "id": "10153274317343658",
      "rsvp_status": "unsure"
    },
    {
      "description": "NAU ACM's next Digital Carnival is coming up!

Entry is FREE!

Once again we'll be hosting a LAN party of epic proportions. As always, bring your consoles and games, we'll provide the T.V.'s! This time the location is in the Dining Hall in the DuBois Center.

For the first time ever, we will be putting on two tournaments! The games are Street Fighter IV and Soul Calibur IV. Entry for EACH Tournament will be $5. Each grand prize winner will receive a portion of the pot AND a $75 gift card to Gamestop. Second place winners will receive a smaller portion of the pot AND a $25 gift card to Gamestop.

Also for the first time we will be giving away door prizes! Just fill out one of our super cool surveys and you'll get a raffle ticket!

Here's a list of the prizes!
http://acm.cens.nau.edu/node/71

Also special thanks to our very own Meaghan Winfield for creating a wonderful, non-copyrighted image for our Facebook advertising campaign for this event!",
      "end_time": "2009-04-11T00:00:00-0700",
      "name": "ACM's Battle of the Fours!",
      "start_time": "2009-04-10T19:00:00-0700",
      "id": "10152868072971032",
      "rsvp_status": "attending"
    },
    {
      "description": "1 Recital
2 Clarinets
**********************
4 / 1 / 09, 7:30 PM
**********************
4 Fantabulous Pieces!

Featuring:
Sonatina -Martinu
Grand Duo Concertant -Weber
Solo de Concours -Messager
Konzertpiece 2 -Mendelssohn

Skip class, call in sick to work, or travel across the U.S. to witness this once-in-a-lifetime opportunity!

And the best part of all: treats and punch! yay!",
      "end_time": "2009-04-01T20:30:00-0700",
      "name": "Jessie and Teresa's Recital",
      "start_time": "2009-04-01T19:30:00-0700",
      "id": "10152695100502273",
      "rsvp_status": "unsure"
    },
    {
      "description": "Whether it's happy or sad, we'll get through it together. It's the final episode of Battlestar Galactica AND the Friday of spring break, so let's celebrate...  And remorse.  Come early to watch the episode from the week before (3/13).  

Bring $2.99 for booze.


LOL :-]  Drink of the night: $3 booze.  Akshually Pina Coladas and Daqaries!",
      "end_time": "2009-03-21T02:00:00-0700",
      "name": "!!Final Battlestar Galactica Party!!",
      "start_time": "2009-03-20T20:00:00-0700",
      "id": "10152824602587616",
      "rsvp_status": "attending"
    },
    {
      "description": "A St. Patrick's Day party involving charades, cards, and whatever else we can think of. Wear green or nothing at all!!! Bring $3 for booze.

Drink of the night: The Midori Margarita",
      "end_time": "2009-03-18T06:00:00-0700",
      "name": "St. Patrick's Day Partay",
      "start_time": "2009-03-17T21:00:00-0700",
      "id": "10153332726880955",
      "rsvp_status": "unsure"
    },
    {
      "description": "I'm trying to get rid of stuff so I don't have to spend a lot on a storage room, so most everything you can get out of me for free!  I'm selling:
Clothes
Two sets of storage drawers
Desk
Bedding (Full Size)
Desk Organizer
License Plates
Beads
Yarn
Incense Oil Burners
Head Board
Tupperware
Fan
Black Lights
Jewelry
Full size mirror
Chicken Wire and Posts
FUN IN A BOX!
and much more!
ALSO!
If you have stuff lying around that you would like to trade or try and make a few bucks on, feel free to join in!",
      "end_time": "2009-03-15T12:00:00-0700",
      "name": "Yard Sale",
      "start_time": "2009-03-14T08:00:00-0700",
      "id": "10153256330191797",
      "rsvp_status": "unsure"
    },
    {
      "description": "Get ready to dance yer ass off!!
Parade on Aspen Ave. around 7:30pm, then party at The Green Room at 8:30pm.

performances by:
Sambátuque - carnivale samba
Low Cash - funk/jazz/hip hop
The Flat Fives - bossa nova
Capoeira Novos Raizes

No cover charge! Hurricanes and Daiquiris only $4! Beads for everyone! 
Drink specials if you come in costume!!!",
      "end_time": "2009-02-25T02:00:00-0800",
      "name": "MARDI GRAS",
      "start_time": "2009-02-24T19:30:00-0800",
      "id": "10152997859789145",
      "rsvp_status": "unsure"
    },
    {
      "description": "Circus Bacchus presents our biggest, most elaborate, most inspiring, most sexy show yet!! Our performers will be taking you through time and showing you the exciting history of Circus Bacchus through the decades!! 

We have beautiful burlesque dancers, jugglers, staff and baton twirlers, poi spinning, hoops, strong man, whips, comedy and LIVE MUSIC!!! All under one roof!!

So come one come all to The Joint Friday February 20th at 10 p.m.!! It's only $7 at the door for all this entertainment and more! Can't wait to see our favorite fans there and even more people we would love to meet! Come see Circus Bacchus in our biggest show EVER!!!

Check out our websites for performer bios and more!
www.circusbacchus.org
www.myspace.com/circusbacchus",
      "end_time": "2009-02-21T02:00:00-0500",
      "name": "Circus Bacchus at The Joint!!",
      "start_time": "2009-02-20T22:00:00-0500",
      "id": "10153199181800605",
      "rsvp_status": "unsure"
    },
    {
      "description": "For those of us that only got you wear our costumes once a year after we worked so hard on them :-( Now we can wear them twice this year!  Wear your costume this Friday and come enjoy some drinks.",
      "end_time": "2009-02-21T02:00:00-0700",
      "name": "Costume Party @ The Deathstar",
      "start_time": "2009-02-20T20:00:00-0700",
      "id": "10153278506516103",
      "rsvp_status": "attending"
    },
    {
      "description": "Friends,

For those of you who don't know, one of my loves in this life is reading Brian Lee O'Malley's comic series \"Scott Pilgrim\" - the story of a 23-year-old happy-go-lucky slacker who plays bass in a rock band, while simultaneously battling a guild of 7 Evil Ex-Boyfriends of the love of his life. People rock out, play videogames, shoot lasers from their mouths, crap like that. I'm sure you can see why this would appeal to me.

Today (2/3/09) Mr. O'Malley posted a contest on his website (original post @ http://radiomaru.com ). The gist of this contest is that fans who can't make it to New York for his book signing to kick off the 5th installment of Scott Pilgrim need to take a picture of themselves in their town. Wackiest/most interesting/sexiest/coolest picture wins. What's at stake, you might ask? Here you go:

TWO signed posters (this alone makes me shoot geysers of joyful Cherry Wheat from my eyes)

One t-shirt

And some book wrap thingy

Needless to say, I REALLY want to win this. Therefore, my scheme is this: get a lot of people. In fact, get a lot of crazy people. I am asking, or perhaps pleading, that as many people as possible show up to this event. I don't have anything to give back (except a charming wink and a heartfelt \"thank you\"), but I would really appreciate this. So if you can (I can't in good conscience guilt-trip people to show up just so I can win some posters and a t-shirt), show up for just 15 minutes at most on Friday the 13th (or Sunday the 15th, if that works better for my unruly mob) and get your picture taken with me in a huge mass of people. You can show up in pajamas, your Halloween costume, naked, I don't care. Oh, and one final thing: INVITE YOUR FRIENDS. I don't care if they're out on parole, if they can/want to come, BY ALL MEANS!

Alright, time for class, I'll talk to you all later.

AND THANK YOU FOR SHOWING ANY INTEREST AT ALL!!!

EDIT: One of the caveats of the contest is that the picture needs to be with my copy of Scott Pilgrim 5. I have preordered this from Amazon.com months ago, and it ships early next week. The date may need to be changed according to its arrival, sorry!

EDIT 2: To all the people I invited who are in Tempe/Tucson: basically that was on the off chance you were coming up/wanted to come up to visit. Totally fine if you can't make it, but thanks though!",
      "end_time": "2009-02-13T15:15:00-0700",
      "name": "Help Me Impress Brian Lee O'Malley!",
      "start_time": "2009-02-13T15:00:00-0700",
      "id": "10153148517336075",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come join Gillenwater, McDonald, and Raymond Hall in celebrating the wonderful Valentines Day a few days early in the new union expansion on Thursday, February 12th 2009.

We will have music, food, arts and crafts, games, and much more!  

Plus, it's all FREE!!!!

We will have:

**Valentine making
**Fun games
**Food
**A \"love dedication\" wall
**Boxes to share the love (make donations of clothing or food)
&& Much more!

Come stop by during dinner!


**Also, if you are part of a club, organization, greek life, or residence hall, and would like to have an activity table at our event, please contact Carissa at carissa.scarpa@nau.edu! 


Can't wait to see you there!",
      "end_time": "2009-02-12T20:00:00-0800",
      "name": "St. Valentine's Fest!!",
      "start_time": "2009-02-12T17:00:00-0800",
      "id": "10153235205513164",
      "rsvp_status": "unsure"
    },
    {
      "description": "Sambátuque is a fifteen piece Brazilian percussion group that is Flagstaff, AZ only Bateria!!

Lowcash is a local eight piece band,playing funk-soul-hip hop-jazz influenced music!

Both groups are guaranteed to get you out onto the dance floor!!! Come get down with us after the first friday ArtWalk in downtown Flagstaff.",
      "end_time": "2009-02-07T02:00:00-0600",
      "name": "Sambátuque & Lowcash at Mia's Lounge",
      "start_time": "2009-02-06T22:00:00-0600",
      "id": "10153762175511664",
      "rsvp_status": "unsure"
    },
    {
      "description": "Greetings from Miami University,

The Highwire Team, formerly known as Laws Hall & Associates, is conducting a survey for a current client.  The survey will take approximately 10 minutes to complete and will address several topics regarding personal vehicles and vehicle maintenance habits.  The Highwire Team appreciates you taking the time to fill out our survey. 


Please copy and paste the following link into your browser:

http://www.zoomerang.com/Survey/?p=WEB228RY44KW6E 

We would be extremely grateful if you forward this survey onto anyone you know between the ages of 18-34.  Thank you very much and have a wonderful day!

Sincerely,

The Highwire Team",
      "end_time": "2009-02-06T22:00:00-0600",
      "name": "Highwire Brand Studio 2009 Survey",
      "start_time": "2009-02-02T13:00:00-0600",
      "id": "10153296033619600",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come join ACM for the ultimate LAN party featuring great titles including Soul Calibur IV, Super Smash Bros. Brawl, and many more. Bring your friends, your consoles, and your good self and have a blast! There will be full support for PC users as well, so bring your desktop or laptop!

The tournament game for this Digital Carnival is Gears of War 2. The tournament is a series of 2-on-2 matches, so make sure you bring a buddy or that significant other in anticipation of Valentine's Day! The entry fee is $5 per participant with the winning team splitting the pot!

Call or email Jordan Hedges (contact info above) if you have any questions!",
      "end_time": "2009-02-13T23:00:00-0700",
      "name": "ACM Digital Carnival Valentine's Day Massacre",
      "start_time": "2009-02-13T19:00:00-0700",
      "id": "10153399231536874",
      "rsvp_status": "unsure"
    },
    {
      "description": "AHHHHHHH

Last week was crazy!

This week we have special guest DJS up from Phoenix that will be getting in on the action!

Silver Medallion will be coming up to Flagstaff to celebrate the upcoming February Cover Photo on XPOZ magazine.

THERE WILL BE TONS OF GIVEAWAYS!

9pm to 2am -  be there early
5 cover!

F.P. Photography will be there takin pics all night long

no theme this timeee... maybe next week

special thanks to

nos
rehab
whatspoppin.net",
      "end_time": "2009-01-24T02:00:00-0700",
      "name": "MAD I | JAN 23rd | Special guest DJS SILVER MEDALLION",
      "start_time": "2009-01-23T21:00:00-0700",
      "id": "10153057025247740",
      "rsvp_status": "unsure"
    },
    {
      "description": "Umm. Dead Man's Carnival wants to play house party. Considering it's the end of the first week of school, let's celebrate with a keg.

We'll also bring all of our fire gear for some free fire entertainment!



Map to Dave's house: http://www.intldaveclub.org/house_directions.jpg

Park on Union and Pacific",
      "end_time": "2009-01-17T02:00:00-0700",
      "name": "Chillin' with Circus Bacchus and the Dead Mans Carnival",
      "start_time": "2009-01-16T21:00:00-0700",
      "id": "10153250391303564",
      "rsvp_status": "unsure"
    },
    {
      "description": "Playing Brazilian Samba with my band Sambatuqe again! 
Its at MIA's downtown, don't know if it is 21 and up only but it probably is since it is at a bar...",
      "end_time": "2008-12-06T00:00:00-0700",
      "name": "Sambatuqe!",
      "start_time": "2008-12-05T23:00:00-0700",
      "id": "10155441467270497",
      "rsvp_status": "unsure"
    },
    {
      "description": "Phusion Entertainment along with help from Royal Epic brings to you Cold Crush!  We've done Phoenix and we've done Tucson, now its time to bring the hottest dance party to Flagstaff and the Mad I.  Don't be left in the cold on this hot night!!!

****SPECIAL GUEST DJs****
**CONTESTS & GIVEAWAYS **
**** LIVE PHOTOGRAPHY ****

Music - HIP HOP, HYPHY, AND REMIX BANGERS

Early arrival is strongly suggested. Make sure you come out and represent on one of the last nights before finals!

~Phusion Entertainment",
      "end_time": "2008-12-05T02:00:00-0700",
      "name": "COLD CRUSH",
      "start_time": "2008-12-04T21:00:00-0700",
      "id": "10153129332082702",
      "rsvp_status": "unsure"
    },
    {
      "description": "Tequila Night! I have some Tequila that I need drunk! Help me by drinking my tequila and having Margaritas!

We will have more than just tequila, so stop by and say hi...",
      "end_time": "2008-12-04T23:00:00-0700",
      "name": "Tequila ++",
      "start_time": "2008-12-04T20:00:00-0700",
      "id": "10152996027404900",
      "rsvp_status": "attending"
    },
    {
      "description": "Come down to Cue 30 on the 14th for a night packed full of video game related fun! Headlining this Digital Carnival is ACM's Call of Duty 4 Tournament, with cash prizes to the top 3 competitors. We also have NAU's own Jacob A. Stevens coming by to host a very special tournament for Mad Stone, the brand-new Wii Ware game made by his company, Riverman Media. Expect to also see some intense Smash Bros., Guilty Gear, and Rock Band action happening! If that wasn't enough, wear your Halloween costume to compete for the Best Costume Prize!

Free Entry! $5 for Call of Duty Tournament!

Bring your friends!",
      "end_time": "2008-11-14T22:30:00-0800",
      "name": "ACM Digital Carnival",
      "start_time": "2008-11-14T19:00:00-0800",
      "id": "10152645310921534",
      "rsvp_status": "unsure"
    },
    {
      "description": "We're bbaacckkkk!!!!  (AGAIN.. ROUND 2.. lol)

no theme this time around though.

but yea..

Thats right.. LAST \"Club MADi\" we did The place was PACKED(to say the least) so this time.. i can only imagine.


Sooo... this is what's goin down....
DJ Boobie On the 1's and 2's!!

FREE ENERGY DRINKS - FREE ENERGY DRINKS - FREE ENERGY DRINKS!!!

we are giving away ALL Energy Drinks away for free when you come.

our sponsor's hooked it up this time!!

Sponsors:
**Royal Epic Clothing**
*Nos Energy Drink
*Rehab Energy Drink
*WhatsPoppin.net
*Go Der Magazine
*American Dream Promotions
*Million bucks Collogne

PROFESSIONAL PHOTOGRAPHER's will be in the building as well as a camera crew... so come dressed to impress and get ready to have a great time with us.

Pictures  will be available on Facebook THE NEXT DAY!
so get ready to tag you and all your friends in these flick's. they are going to look amazing!

To check out the super duper cool myspace page go here:
http://www.myspace.com/sigsat

so do us a favor..Come out, have a great time.. we hope to contunue to have the support of all you flagstaff young folk's (like ourselves) we love you... lol


i think some big huge gigantic things are planed for the end of this semester(and next).. STAY TUNED!!


---------RoyalEpic.com----------
--Journey Through Life Fitted--

to check out our website and stuff goto

www.RoyalEpic.com or www.myspace.com/royalepic",
      "end_time": "2008-11-08T02:00:00-0800",
      "name": "Club MAD i (Round 2) - Royal Epic -  NOS energy Drink -  @ MAd i 11/7",
      "start_time": "2008-11-07T21:30:00-0800",
      "id": "10153209344454892",
      "rsvp_status": "unsure"
    },
    {
      "description": "A scary movie, pillow fight, and truth or dare, heavy on the dare.
Bring your own pillow, blankets and attractive underwear (not necessary but recommended).
we will also be making cookies and playing video games.
the first movie will start at 10:00",
      "end_time": "2008-11-08T10:00:00-0700",
      "name": "Sexy Sleepover",
      "start_time": "2008-11-07T21:00:00-0700",
      "id": "10153228603630040",
      "rsvp_status": "attending"
    },
    {
      "description": "On November 4, 2008, the United States of America will hold its 55th consecutive quadrennial election for President and Vice President of the United States.

This is your chance to shape history.  Both the 2000 and 2004 election were very intense and close races.  Every vote counts!

Add this event and send it to your friends to remind them to vote on November 4th, 2008!

Questions?  
http://www.declareyourself.com

or

Need to register? 
http://www.rockthevote.com/rtv_register.php?ms=fb_pe2008

Or for military personnel and overseas citizen:
http://www.fvap.gov/
https://www.overseasvotefoundation.org/

Or these, recommended by others:
Curious how they really voted:
http://www.ontheissues.org

Matchmaker website:
http://www.glassbooth.org

and more...
http://www.factcheck.org
http://www.vote411.org
http://www.votesmart.org
http://www.2decide.com/table.htm
http://www.techpresident.com/

Debating is great, but try not to personally attack someone no matter how wrong you think they are.",
      "end_time": "2008-11-04T22:00:00-0600",
      "name": "Presidential Election 2008",
      "start_time": "2008-11-04T06:00:00-0600",
      "id": "10153294928989759",
      "rsvp_status": "unsure"
    },
    {
      "description": "We are throwing our 5th Annual Halloween Party at my place. This is a costume party. We are throwing it on Halloween night, October 31st,  it is on a Friday this year! If you are able to bring a dish to the party, that would be choice! Please post on the wall what you can bring so we have an idea of what and what not to get. There are a lot of underage students here so please do not bring alcohol. We are expecting a good crowd so dress to impress! There will be food, dancing, music and friends. Please feel free to invite whoever :).

-Phil

Examples of grub to bring include:
Drinks
Chips
Salsa/dip
Cookies
(Any sort of finger food would be awesome!)
Plates
Napkins
Plastic Cups
Hot Dog Buns
Condiments

And I think this year, we'll be grilling some hot dogs on the grill, My roomies mommy gave him more than he can eat.",
      "end_time": "2008-11-01T02:00:00-0700",
      "name": "5th Annual Halloween Party @ Phil's Crib",
      "start_time": "2008-10-31T19:30:00-0700",
      "id": "10152744787745308",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come have an awesome time at Pine Ridge, costumes required!",
      "end_time": "2008-11-01T02:00:00-0700",
      "name": "Keifer's Halloween Party",
      "start_time": "2008-10-31T19:00:00-0700",
      "id": "10153126999512415",
      "rsvp_status": "attending"
    },
    {
      "description": "The theme is Ice, the place is The Deathstar.  Wear your shiniest clothes and come enjoy some COOL cocktails.  Some specific details include blue ambient lighting, some Planet Earth: Ice Worlds in High Def!, fog machines, dry ice, and the coolest of cool cocktails to top off the theme.

Please give Keifer or I $5 for boos ahead of time.

Here is a link to the Deathstar's location on Google maps:
http://maps.google.com/maps/ms?ie=UTF8&hl=en&msa=0&msid=116469469808521085637.000458349abafd17f783f&ll=35.172738,-111.665779&spn=0.006788,0.015525&t=h&z=17&iwloc=000458349cbd5e27dcbd3",
      "end_time": "2008-10-11T04:00:00-0700",
      "name": "Ice Party at The Deathstar",
      "start_time": "2008-10-10T19:00:00-0700",
      "id": "10155576456765624",
      "rsvp_status": "attending"
    },
    {
      "description": "come out and join Theta chi on Friday October 3rd. 

everyone is invited. no cover for girls, 5$ for guys.

9pm til 2am..

come ditch the parents and be as nautghty or nice as you want.
WHICH SIDE ARE YOU ON?????",
      "end_time": "2008-10-04T02:00:00-0700",
      "name": "Heaven or Hell bid party ",
      "start_time": "2008-10-03T21:00:00-0700",
      "id": "10152415346079364",
      "rsvp_status": "unsure"
    },
    {
      "description": "This is a small get-together involving casual card games, such as Hearts and Spades. A variety of fine bottled root beer and cream soda will be provided. Business casual attire, please.",
      "end_time": "2008-10-03T23:00:00-0700",
      "name": "Card Play at Pine Ridge",
      "start_time": "2008-10-03T20:00:00-0700",
      "id": "10153326793495739",
      "rsvp_status": "unsure"
    },
    {
      "description": "Werd.",
      "end_time": "2008-09-28T03:25:00-0700",
      "name": "Brad/Danny's Party Numero Dos/Ni Ban",
      "start_time": "2008-09-27T21:25:00-0700",
      "id": "10153305017298117",
      "rsvp_status": "unsure"
    },
    {
      "description": "Lets celebrate the one and only Erika with lots of love and fortune cookies.",
      "end_time": "2008-09-24T22:00:00-0700",
      "name": "Erika's 19th Birthday!",
      "start_time": "2008-09-24T19:00:00-0700",
      "id": "10153207992742508",
      "rsvp_status": "unsure"
    },
    {
      "description": "The ACM Digital Carnivals are back and kicking! 

*FREE ENTRY*

Bring your favorite games and consoles to use with our grant-funded HDTVs! We've also got two projectors for the Soul Calibur 4 tournament and an awesome sound system! 

Come Play:

Soul Calibur IV
Rock Band
Super Smash Bros. Brawl
... and much more!!

--Soul Calibur 4 TOURNAMENT--
$5 Entry, Cash Prize (Pot goes to top three spots)

Rules are no custom characters or guest characters (No Yoda or Vader!) We want to keep the games moving quickly, so we don't want people creating custom characters to fight with.

*FREE ENTRY* Only $5 for tournament entry!",
      "end_time": "2008-09-19T23:00:00-0700",
      "name": "ACM Digital Carnival",
      "start_time": "2008-09-19T19:00:00-0700",
      "id": "10152989668112933",
      "rsvp_status": "attending"
    },
    {
      "description": "Seriously: Geeks + Fire + Food = awesome.

Google Map to Kiwanis Park: http://maps.google.com/maps/ms?ie=UTF8&hl=en&t=h&msa=0&msid=116805776751554442081.000452656fb135ab7ecec&ll=35.178772,-111.653109&spn=0.009155,0.017874&z=16

Bring your Nintendo DS if you have one!",
      "end_time": "2008-08-29T23:00:00-0700",
      "name": "Computer Science BBQ",
      "start_time": "2008-08-29T17:00:00-0700",
      "id": "10153241398349464",
      "rsvp_status": "attending"
    },
    {
      "description": "Come say goodbye to Crystal as she embarks on a year graduate degree in Ithaca, NY.  Invite friends that couldn't come to defcon so we can talk about how cool it was and recruit them for next year! Let's exchange pictures, so bring your cameras or USB sticks!",
      "end_time": "2008-08-16T06:00:00-0700",
      "name": "After DefCon / Crystal's Going Away Party",
      "start_time": "2008-08-15T19:00:00-0700",
      "id": "10152662309462820",
      "rsvp_status": "attending"
    },
    {
      "description": "A birthday celebration in Las Vegas?!?! You know what that means :->  So tell the GF that your going on a missionary mission in Africa, pack your bags and lets go get wrecked at the best place on earth known to man, Sin City.  Dont forget to bring your party attitude, an extra pair of underwear and some annulment papers cuz hey, when your in Vegas you never know whats going to happen, unless you want to end up like Britney.  So remember that what happens in Vegas, really should stay in Vegas. 

A word from Greg:
\"COME CELEBRATE ME TURNING 21 IN LAS FUCKING VEGAS BABAYYYYY!!!\"",
      "end_time": "2008-08-07T23:55:00-0700",
      "name": "VIVA LAS VEGAS!!!!!!!!!",
      "start_time": "2008-08-03T00:00:00-0700",
      "id": "10152944539108167",
      "rsvp_status": "unsure"
    },
    {
      "description": "Anyone up for Sliderock before the semester starts? Theres a few campgrounds near by and we can park at Slide Rock during the day. If you're interested, join the group and we can all figure out a few days that would work best. If you can only stay a couple days just figure out how you would get to/from there.

Bring your tents, coolers, swim stuff and marshmellows cuz its all going down!

Slide Rock = $10/vehicle for 4 people
Campground = $19/night for 8 people 

I couldn't change the dates so I'm putting it here: 
START TIME: AUGUST 13th or 14th
END TIME: AUGUST 17th

Its about a 40 minute drive from Flag so its not that far.",
      "end_time": "2008-08-20T08:00:00-1000",
      "name": "Slide Rock camping trip",
      "start_time": "2008-07-27T15:00:00-1000",
      "id": "10152851361102749",
      "rsvp_status": "unsure"
    },
    {
      "description": "Pre-party at our place then hittin the bars down 4th ave. Then we are gonna do it again the following night.",
      "end_time": "2008-08-02T02:00:00-0700",
      "name": "Finally 21!",
      "start_time": "2008-07-31T22:00:00-0700",
      "id": "10152742692162611",
      "rsvp_status": "unsure"
    },
    {
      "description": "Slipknot is coming to Cricket Pavilion on Friday July 18. Doors open at 2pm. Tickets on sale NOW. Go to ticketmaster.com to get yours!


Bands playing:

Mayhem Stage (main stage):
Slipknot
Disturbed
Dragonforce
Mastadon

Jagermeister Stage:
Machine Head
Airbourne
Five Finger Death Punch
Walls of Jericho

Hot Topic Stage:
Underoath
Black Tide
Suicide Silence
36 Crazyfists
The Red Chord",
      "end_time": "2008-07-18T23:55:00-0700",
      "name": "Rockstar Energy Drink Mayhem Festival featuring Slipknot",
      "start_time": "2008-07-18T14:00:00-0700",
      "id": "10155439847625117",
      "rsvp_status": "unsure"
    },
    {
      "description": "Woooo! Coding Parteh!


Essentially, a problem is revealed on the ICFP website at 12:00 noon on July 11, 2008 and we have all weekend to come up with a code solution using any of the approved languages, which are listed on the website but include Java, Perl, Scheme, C, C++, C#, Lisp and Prolog. Most likely we'll be using Java, but you're welcome to use whatever language you choose!

Now, to clarify, this is an *open team* competition, so if you show up, you won't be put on the stand: You can just work alongside the rest of us!

The prizes are as follows:

    * First place team: $1000.00
    * Lightning round team: $500.00
    * Judges' prize team: $500.00 

Here's more information: http://www.icfpcontest.org

So, *THIS FRIDAY* July 11, 2008 at 12:00P.M. (noon) be in the ACM Lounge (Room 105) in the Engineering Building to start the weekend-long coding party!! Bring your brains and optionally a laptop or PC!!

AND OMG BRING CAFFEINE!",
      "end_time": "2008-07-14T12:00:00-0700",
      "name": "Code Party",
      "start_time": "2008-07-11T12:00:00-0700",
      "id": "10155502265000501",
      "rsvp_status": "unsure"
    },
    {
      "description": "GO OUT AFTER 2 a.m. BECAUSE THE MOON WILL BE GONE AND IT WILL BE EASIER TO SEE THE METEORS!  

You will be able to see the meteors for the next few mornings (early morning!).  Even if you missed the \"peak\" this morning (the 12th of August), go outside tonight or tomorrow morning (or tomorrow night, etc) and take a look!


YOU CAN SEE THE METEORS BEFORE AND AFTER THESE DATES.  JUST GO OUTSIDE!


Meteors look like (/are) \"shooting stars.\"  Streaks of light across the sky.  They don't just look like stars.  It's pretty obvious what they are once you see them.


Maybe you love lying under the stars. Maybe you'll like to pretend that every meteor is a falling star because you have a lot to wish for. Maybe you enjoyed the movie Armageddon and your destructive imagination could use a good visual.

*****Since this seems to be confusing people-- this isn't an actual event. You watch the shower on your own, I'm just trying to inform you. You can watch it wherever you are, not just in College Park. Just open your eyes and look up.*****



Times listed are the times wherever you are.  2 a.m. Eastern Time is only 11 p.m. Pacific Time so it won't be dark enough there yet.  2 a.m. Eastern Time is 9 a.m. in Amsterdam and you won't be able to view it in the morning.  You have to go out after the moon is gone.


If you want to see the meteors, go somewhere away from city lights (if possible). Bring a sleeping bag or lawn chair, kick back and watch the skies.  Try to look in the direction that the sky is darkest.  You will probably see a meteor about once a minute on average (fewer if your sky is light polluted).  The meteors will be visible for a few days before and after the peak viewing time, so keep an eye out.


The meteor shower can be viewed anywhere in the Northern Hemisphere and the shower happens around the same time every year.


Invite your friends!

(Event picture thanks to Wally Pacholka!  See more of his work at http://www.astropics.com.)",
      "end_time": "2008-08-13T04:00:00-0400",
      "name": "Perseids Meteor Shower",
      "start_time": "2008-08-12T00:05:00-0400",
      "id": "10155438808660545",
      "rsvp_status": "unsure"
    },
    {
      "description": "Beach Party. June 3rd. 3-19. For my birthday. Be there or be square. Straight down Magnolia in Huntington Beach. over 21-can go to the bars after. MEET AT HURRICANS IN DOWNTOWN HUNTINGTON AT 10 PM!!",
      "end_time": "2008-06-03T21:00:00-0700",
      "name": "GRUMET'S 21ST!",
      "start_time": "2008-06-03T15:00:00-0700",
      "id": "10152675181695448",
      "rsvp_status": "unsure"
    },
    {
      "description": "So I accidently updated my ipod software on my iphone and didn't have a back up and had to delete all my content on my phone to get my pictures to save on my phone at Vegas...",
      "end_time": "2008-05-31T02:00:00-0600",
      "name": "I Need Your Numbers",
      "start_time": "2008-05-27T23:00:00-0600",
      "id": "10153289606799940",
      "rsvp_status": "unsure"
    },
    {
      "description": "Come out and celebrate the end of final's week.......",
      "end_time": "2008-05-08T23:55:00-0700",
      "name": "Andrea's 21st",
      "start_time": "2008-05-08T19:00:00-0700",
      "id": "10152994999784118",
      "rsvp_status": "unsure"
    },
    {
      "description": "Poker and food.  BYOB",
      "end_time": "2008-05-08T23:00:00-0700",
      "name": "Poker Night!!! Finally",
      "start_time": "2008-05-08T18:00:00-0700",
      "id": "10152742479130598",
      "rsvp_status": "unsure"
    },
    {
      "description": "We have just establised the official world jump day home page: http://www.worldjumpday.net 

Some day (maybe not today, may not tomorrow...or maybe yesterday) there will be a time in which the world needs to come together as one to prevent the destruction of the home of billions. Everybody knows a nuclear warhead is not able to stop an asteroid capable of destroying the Earth.... Silly Bruce Willis. Everybody also knows that jumping at the same time could easily propel the Earth out of the Earth Shattering Asteroid's destructive path.

On May 2, 2008 there will be a practice Jump Day, in which all the Earth's citizens must jump simultaneously. Said jump will propel the Earth out of the way from any outside objects that could threaten its existence.

Brought to you by the same people that think the world is flat...?

DISCLAIMER:

This group is not responsible for anyone jumping from a  height greater than 2 feet. (Do not jump off a building.)



The jump was a complete success! Earth moved from it's orbit just enough to dodge the disastrous meteor. Nice work, everyone!",
      "end_time": "2008-05-02T15:00:00-0500",
      "name": "World Jump Day",
      "start_time": "2008-05-02T15:00:00-0500",
      "id": "10152841830336586",
      "rsvp_status": "attending"
    },
    {
      "description": "Come hear some of NAU's finest!",
      "end_time": "2008-05-01T21:00:00-0700",
      "name": "Clarinet Studio Recital",
      "start_time": "2008-05-01T19:30:00-0700",
      "id": "10153204587153771",
      "rsvp_status": "unsure"
    },
    {
      "description": "Open to all math majors, and anyone who would be up for some fun and interesting math problems! Participation will be tournament-style, with teams of four people. The questions will most likely be taken from old NAU Math Day competitions, therefore leveling out the playing field (that is, the level of math a student has completed won’t really make a difference.) There is no entry fee and this will be a great chance to meet new people and have fun. Be sure to invite anyone you think would enjoy watching or participating in this event! (There will also be some cool prizes for various places in the competition, and possibly a grand prize for overall winner!)",
      "end_time": "2008-04-25T18:00:00-0700",
      "name": "Math College Bowl",
      "start_time": "2008-04-25T16:00:00-0700",
      "id": "10153298090658824",
      "rsvp_status": "unsure"
    },
    {
      "description": "Thank you for making 31 Cent Scoop Night a success!

Share your pictures! Simply upload them to the 31 Cent Scoop Night group at Flickr at http://www.flickr.com/groups/680026@N21/pool/. 

You can also check out 31 Cent Scoop Night pictures at http://www.baskinrobbins.com/31cent and see how the event was celebrated around the country.

Be sure to sign-up to become a fan of Baskin-Robbins to stay updated on fun ice cream news - http://www.facebook.com/pages/Baskin-Robbins/8779632721",
      "end_time": "2008-04-30T22:00:00-0700",
      "name": "Baskin-Robbins 31 Cent Scoop Night",
      "start_time": "2008-04-30T17:00:00-0700",
      "id": "10152679148071986",
      "rsvp_status": "unsure"
    },
    {
      "description": "ACM Digital Carnival and Super Smash Brothers Brawl Tournament!  This one is sponsored by ACM only, no SUN Entertainment.  No worries though, it'll be at least as much fun!  We'll be in room 101 of the Engineering building.  Come dressed as your favorite Nintendo character!",
      "end_time": "2008-03-29T01:00:00-0700",
      "name": "ACM Digital Carnival",
      "start_time": "2008-03-28T19:00:00-0700",
      "id": "10152959139808422",
      "rsvp_status": "attending"
    },
    {
      "description": "Halo 3 Tourney and All around Gaming 

Dress up in a Toga!",
      "end_time": "2008-02-29T23:55:00-0700",
      "name": "Leap Year Digital Carnival",
      "start_time": "2008-02-29T20:00:00-0700",
      "id": "10155473876130344",
      "rsvp_status": "attending"
    },
    {
      "description": "Valentines Day is over, But dont throw away your Red and White.
Its time for Heaven and Hell, another Red and White theme.
 Friday Feb 15th, doors open at 10p.m.
$6 cover 
Red if your felling bad, right out of HELL
White if you’re feeling innocent and Good.
 
You know we always keep it pop n. Come dance, sweat and meet new people. 
p.s please come with the right change.

Take milton to butler make a right, then make a left on san francisco its going to be on the left hand side right across the street from teh Joint.",
      "end_time": "2008-02-16T02:00:00-0700",
      "name": "Heaven or Hell Party ",
      "start_time": "2008-02-15T22:00:00-0700",
      "id": "10153154357960340",
      "rsvp_status": "unsure"
    },
    {
      "description": "The performances will be held 
Thursday
Friday
Saturday 
at 7:30 pm (Feb. 14-16) at Cline Auditorium.
Tickets are $10 for students and can be purchased at the central ticketing booth or at the door.


FIVE REASONS MEN SHOULD SEE THE VAGINA MONOLOGUES:
mothers
sisters
wives
daughters
aunts


V-Day is a global movement to stop violence against women and girls. V-Day is a catalyst that promotes creative events to increase awareness, raise money and revitalize the spirit of existing anti-violence organizations. V-Day generates broader attention for the fight to stop worldwide violence against women and girls, including rape, battery, incest, female genital mutilation (FGM) and sexual slavery.",
      "end_time": "2008-02-16T20:30:00-0800",
      "name": "Vagina Monologues",
      "start_time": "2008-02-14T19:30:00-0800",
      "id": "10152981802069006",
      "rsvp_status": "unsure"
    },
    {
      "description": "Sorry everyone!  I need all your numbers!!!  You would be my best friend ever if you text it to me or left it here!",
      "end_time": "2008-02-10T07:00:00-0700",
      "name": "The toilet ate my phone =(",
      "start_time": "2008-01-31T04:00:00-0700",
      "id": "10152671002187330",
      "rsvp_status": "unsure"
    },
    {
      "description": "NO im not kidding...Nerd is the theme for this party so dress up in your nerdiest wear..most of you were in band im sure you can handle it. the picture is a good example of what you want to look like. no, matching isn't required.
New Years party.  Its a pot luck so everyone please bring something. Contact me to see what you can bring..Everyone is more than welcome to sleep over my place since it is in the middle of nowhere!
Bring games, music, and movies",
      "end_time": "2008-01-01T10:00:00-0700",
      "name": "New Years Eve Party!!!",
      "start_time": "2007-12-31T20:00:00-0700",
      "id": "10153278366562220",
      "rsvp_status": "unsure"
    },
    {
      "description": "Dress as a Ninja or Pirate and Get in Free!

$2 entry fee.

TV's provided!  
Xbox, Wii, PS3, DS, PS2, etc!!!",
      "end_time": "2007-09-22T00:00:00-0700",
      "name": "Digital Carnival ",
      "start_time": "2007-09-21T20:00:00-0700",
      "id": "10153132118392906",
      "rsvp_status": "attending"
    },
    {
      "description": "My birthday is the 26th however can't do anything that day so Wednsday the 28th I am planning a get together Gillenwater for all my friends who want to come.  We are gonna grill, eat, enjoy eachothers company and later watch America's next top model!!!!

*******NOTICE********
Lauren and I decided that we want this to be a potluck like event, and we will provide some dishes.... however if you want something on the grill, please provide your own food for us to grill and any extra side dishes you would like and don't mind sharing.  Join up with someone if you would like to buy meat to grill or some side/appetizer",
      "end_time": "2007-03-28T22:00:00-0700",
      "name": "Birthdays and ANTM Extravaganza",
      "start_time": "2007-03-28T16:45:00-0700",
      "id": "10153300718519515",
      "rsvp_status": "attending"
    },
    {
      "description": "Erin is turning twenty! Come help us surprise her with a party! Bring a drink or food to share! Meet at 9:45 at Cue 30-The pool house on campus, it's in the University Fieldhouse next to Java.P.S. It's a surprise! DUH! SO DON'T TELL ERIN!",
      "end_time": "2006-05-05T00:00:00-0400",
      "name": "Kimberly Raguso",
      "start_time": "2006-05-04T21:45:00-0400",
      "id": "10153251932919648",
      "rsvp_status": "unsure"
    },
    {
      "description": "Local Band Performances featuring: The Honors Project, Fight the Quiet, Runaway Phoenix, Sunday Morning Drive.  Come see what all the noise is about!",
      "end_time": "2006-03-31T17:00:00-0700",
      "name": "Rock the Quad",
      "start_time": "2006-03-31T12:00:00-0700",
      "id": "10153300186794074",
      "rsvp_status": "attending"
    },
    {
      "description": "Learn East Coast Swing, Lindy Hop and more at Galaxy Diner on Route 66, just a few blocks from campus, every Saturday.Enjoy great music, food, and fun. Make new friends and join the NAU Swing Club",
      "end_time": "2006-01-28T22:00:00-0500",
      "name": "Swing Dance at Galaxy Diner",
      "start_time": "2006-01-28T19:00:00-0500",
      "id": "10152712374636930",
      "rsvp_status": "attending"
    }
  ],
  "paging": {
    "cursors": {
      "before": "QVFIUnQwMGNSTGtaSVdfZA1c5TnVXUUdvdVRGNmlURHpsdm9VcThiZAm9yS2hkaHMwakc2TnZACVFFYMkNRRWtPb3lzMk1XNWNtWWFkaHl6RTJoTmZAaT2h6Qldn",
      "after": "QVFIUllLNE5vTnRZAdlFCakViSU1YQkRUaTlzUGkwanVyblViSzBmeEJpNDRvcG5VQmxfaWNfR3Rab3BiSFExTElnZAkN1S0c1Rk80ZAlRlaTVJT1psdjllc25B"
    },
    "previous": "https://graph.facebook.com/v2.10/27705471/events?access_token=EAACEdEose0cBAE6T84urbsY7vQ1w1AOOcihX9UqC8AQnJVnS0gjeFjI4MulUEZBUuIRr5eVc42tUzQxDtxADRZCmmDPWo6tDxXRC7eZBcT2Fqb4S7K0ljTE2eP3ZAbzVzhM1XklcjQKCGowcWjZCaZBpiK7M0oLWw5hQuVZCBBiKUeFC35NsU4YXtPnKSdZAFj0ZD&pretty=0&limit=200&before=QVFIUnQwMGNSTGtaSVdfZA1c5TnVXUUdvdVRGNmlURHpsdm9VcThiZAm9yS2hkaHMwakc2TnZACVFFYMkNRRWtPb3lzMk1XNWNtWWFkaHl6RTJoTmZAaT2h6Qldn"
  }
}