{
    "thread": "https://www.facebook.com/messages/t/frank.vitale01",
    "participants": [
        {
            "name": "Frank Vitale",
            "description": "Lives in Phoenix, Arizona",
            "url": "From Pittsburgh, Pennsylvania"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2015-09-13T02:35:00.000Z",
            "message": "Brian\nHey, how are you doing?  I want to take you to dinner and tell you about this concept I've been thinking of.  I was thinking if someone could illustrate it, I could apply for some kind of music festival artwork fund to build it.\n"
        },
        {
            "from": "Frank",
            "time": "2015-09-13T15:54:00.000Z",
            "message": "\nSounds good Brian, how about one night this week?\n"
        },
        {
            "from": "Frank",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "\nHey do you know CSS? I'm doing a site in SquareSpace right now that I need to tweak a with some custom code and CSS is just not in my wheelhouse... LMK. We can grab a drink and chat about it. Regardless let's get togheter and catch up soon.\nMaybe we can do some trade \n"
        },
        {
            "from": "Brian",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "Brian\nWe should, what's the site?  I can do it right now in the browser and send you the changes, how long do you think it SHOULD take?\n*boss\n\nIt's probably something really simple with Divs.  Flow layout is hard to grasp and there are so many caveats unless you set\n* {\n    box-sizing: border-box;\n}\n"
        },
        {
            "from": "Frank",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "\nLet's plan to get together soon and you can have a look... have you ever used SquareSpace? How's your week look?\n"
        },
        {
            "from": "Brian",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "Brian\nFairly open at night, moving at a pretty steady pace on this App I am working on so anytime in the evening or all day on weekends would work.\n"
        },
        {
            "from": "Frank",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "\ncool, how about tomorrow night?\n"
        },
        {
            "from": "Brian",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "Brian\nOh Iga gets off at 7, which wouldn't affect when I can work, but does affect our car situation.  Thursday she is off all day.\n"
        },
        {
            "from": "Frank",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "\nNo worries I'll come to you... after 7 is fine... if anybody is in need of a ride I can help.\n"
        },
        {
            "from": "Brian",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "Brian\nSo come over whenever you feel like tomorrow and we can spend a few hours on it. Looking forward to it.\n"
        },
        {
            "from": "Frank",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "\nAwesome! I'll hit you up when I\"m heading over... it's been a few... can you shoot me your address again.\n"
        },
        {
            "from": "Brian",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "Brian\nSure 6934 E Sandra Ter Scottsdale Az, 85254\n4804660856\n"
        },
        {
            "from": "Frank",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "\nThanks!\nCool, got it in my contact for you... Catch you guys tomorrow night.\n"
        },
        {
            "from": "Brian",
            "time": "2016-02-10T00:23:00.000Z",
            "message": "Brian\nsure thing!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T22:14:00.000Z",
            "message": "Brian\nI got laid off.  I have a ton of job offers.  I like you better than most.  I want to work on emotions.\nhttps://www.generosity.com/emergencies-fundraising/send-brian-and-his-wife-to-tahiti-temporarily--2/x/15204496\nSend Brian and his Wife to Tahiti temporarily!\nSupport 'Send Brian and his Wife to Tahiti temporarily!' by donating or sharing today!\ngenerosity.com\nCheck out the description.\nI have lots of emotions.\nI see this as a sign.  We should work together.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T22:14:00.000Z",
            "message": "Brian\nI like the Anger section \nWhich state would you say that article is?\nhttp://languagealchemy.com/\nLanguage Alchemy | Transform Your Language, Transform Your Organization, Transform Your Life\nWelcome to Language Alchemy's website. Meet the Alchemist, browse the calendar of workshops and training and explore consulting, coaching, and other language services.\nlanguagealchemy.com\n"
        },
        {
            "from": "Frank",
            "time": "2016-10-12T22:14:00.000Z",
            "message": "\nHaha love the fundme campaign... hope that pans out for you...\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T22:14:00.000Z",
            "message": "Brian\nlol\nYou get it!\nNo expectations.\n"
        },
        {
            "from": "Frank",
            "time": "2016-10-12T22:14:00.000Z",
            "message": "\nDo you do the Language Alchemy site? Looks like a cool site, I'll have to dive in a bit more when I have time.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T22:42:00.000Z",
            "message": "Brian\nIts an API from IBM\n"
        },
        {
            "from": "Frank",
            "time": "2016-10-12T22:42:00.000Z",
            "message": "\nWe should have a drink soon and talk about this project that I'm on... I can show you some examples of what we are shooting for and you can let me know what you think.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T22:42:00.000Z",
            "message": "Brian\nMy thinking is to use that to read people's text, then counsel them on it using your site.\n"
        },
        {
            "from": "Frank",
            "time": "2016-10-12T22:42:00.000Z",
            "message": "\nMy site?\nI need to set up 3 interviews with the client so we can choose a developer. Check out this ipad app... they have videos on the site... this is what we want to do...\nhttp://wordflex.com/\nWordflex - Brain-friendly English dictionary for your iPad, with content from Oxford University Press\nFeaturing more than two million language nodes, this fascinating tool offers a truly interactive, engaging reference for word lovers of all ages and interests.\nwordflex.com\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T22:42:00.000Z",
            "message": "Brian\nThat makes sense to me.  Staffing is a huge waste of time.  I can work on it.\nhttps://www.linkedin.com/in/megamindbrian?trk=nav_responsive_tab_profile\nBrian Cullinan | LinkedIn\nView Brian Cullinan’s professional profile on LinkedIn. LinkedIn is the world's largest business network, helping professionals like Brian Cullinan discover inside connections to recommended job candidates, industry experts, and business partners.\nlinkedin.com\n"
        },
        {
            "from": "Frank",
            "time": "2016-10-12T22:42:00.000Z",
            "message": "\nCool, thanks... can you shoot me a link or two of sites you have worked on?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T22:42:00.000Z",
            "message": "Brian\ncourse.studysauce.com, epicdiagnostics.com\nSecond one is mostly backend that they ended up not using.  First one has an iOS app called Study Sauce, \"demo\" to register.\nFirst one is 2 different products.\n"
        },
        {
            "from": "Frank",
            "time": "2016-10-12T22:42:00.000Z",
            "message": "\nPerfect, thanks... Hows your weekend look, want to get together and I'll share the Design Doc with you? I've an outline and a flow diagram... next up are the wireframes and design comps.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T22:42:00.000Z",
            "message": "Brian\nAwesome.  Anytime is good, I'll let Iga know.\nI have a much better version of the app but it hasn't been accepted yet, we added in App purchases and have to resubmit.\n"
        },
        {
            "from": "Frank",
            "time": "2016-10-12T22:42:00.000Z",
            "message": "\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-19T15:43:00.000Z",
            "message": "Brian\nMeditation made simple\n"
        },
        {
            "from": "Brian",
            "time": "2017-03-24T00:40:00.000Z",
            "message": "Brian\nHello friend, quick question; did we pay you everything?\n"
        },
        {
            "from": "Frank",
            "time": "2017-03-24T22:54:00.000Z",
            "message": "\nHey brother... you sure did! Hows life?\n"
        },
        {
            "from": "Brian",
            "time": "2017-03-27T14:27:00.000Z",
            "message": "Brian\nExcellent.  How have you been?\n\n"
        }
    ]
}