{
    "thread": "https://www.facebook.com/messages/archived/t/james.dickison.7",
    "participants": [
        {
            "name": "James Dickison",
            "description": "Studied at Pierce College Puyallup",
            "url": "Went to Puyallup High School"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2016-10-11T20:50:00.000Z",
            "message": "Brian\nYou're a genius\n"
        },
        {
            "from": "",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "James Dickison accepted your request."
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nWhy?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nYour ability to reason.\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nThank you.\nI was hoping it was my massive knowledge of religious texts.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nThat too haha, something tells me that isn't the most important thing to you at this moment though.\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nNo, at the moment we are looking to buy an island property and start a business fabricating custom cars.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nThat is freaking awesome!  I need a job, any need for IT or software?\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nWe are building them old school. Solid wood forms and hand hammer the bodies to shape them and an English wheel to finish. One at a time, all hand work.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nVery impressive, what about support staff?\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nWe plan to make 12 a year max. What support staff? Last month I set up the one and only dealer in Washington state.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nNice.\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nFor the first few years we will be using Honda engines and transaxle. We may switch to a custom built V12 at some point. A low displaced engine. Around 2.8 L\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nV12 how many horse power does that get you?\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nAround 158 Hp. It is not about Hp. It is about a smooth ride.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nyeah, I get that.  Can I see a picture?\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nNone yet. We are just started the bucks a few weeks ago.\nBrief description is a small coop with three wheels. A reverse trike a little larger than the Morgan three wheeler. A classic 1930s body style with the sweeping teardrop front fenders and a boat tail backend.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nsounds awesome, g2g drive home from work\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nThe buck is the wood form used to form the body.\nOur target retail price is just under $30,000\nWhat do you do?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nSoftware development and IT\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nI have an idea for a program. Interested?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nYeah definitely!\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nOk, first the money thing. If you develop it and if you earn over $10 million personally from it I want you to come buy me dinner. Ok?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nOf course!\nI'll buy you more than dinner, i'll buy you a car.\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nA program that will allow people with Parkinson's or Huntington's disease to use a computer mouse with ease.\nIt needs to be able to distinguish between tremors and movements.\nYou can do this by \n1. averaging the shake in any given moment. This should give you a steady mouse.\n2. It needs to illuminate rapid movements. This will take sudden jerk tremors out of the equation.\n3. It needs to recognize slow movements that are the results of intentional movements.\n4. Clicking. Each click needs to be longer. People with disorders that cause tremors have difficulty pressing buttons one or two times because the trimmer will cause the button to press multiple times in rapid succession. So each click should be slow and deliberate.\n5. Each part of this process needs to be customizable because everyone is unique and has slightly different tremors and needs different tolerances\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "Brian\nHmm, I think they can just connect to people's brains by now.\nhttps://www.facebook.com/l.php?u=https%3A%2F%2Fwww.steadymouse.com%2F&h=wAQEbuCyR&s=1\nSteadyMouse - Hand Tremor Mouse Accessibility Software\nThe SteadyMouse Project - Mouse Accessibility Software for People with Essential Tremor\nsteadymouse.com\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T22:41:00.000Z",
            "message": "\nThere is a growing demand to retrofit technology to make it accessible to people in the workplace. It is cheaper to ....\n\nCrap..\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "Brian\nlol\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "\nYours would be better\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "Brian\nHmm, I might be able to get a job for DARPA, I want to train AI to have a conscience and follow a moral code.\nI have collected enough spiritual depth I think I could do well to test it.\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "\nJust don't use the bible as a guide.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "Brian\nhahaha, I knew you would say that \nI have been to hell and back, I'm not scared.\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "\nLet's play lifeboat.\nA big ship just sank at sea. There are five people in a lifeboat but the lifeboat is only made to hold three. Look at the people and see who you would throw overboard.\nAn old man in a wheelchair who is collecting welfare.\nA fat woman with a sniffling crying baby\nA mentally handicapped person that flails their arms\nA blond haired blue-eyed doctor with perfect teeth\nA beautiful woman who works as an attorney\n\nOK, go. Who do you throw overboard?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "Brian\nI love you question this is especially relevant to autonomous cars and robots choosing someones life or death.\nAttorneys, old man, handicap\nProbably have to eat one of them too\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "\nTrick question.\nThe lifeboat is already holding that number of people. Although the design specs only approved three it is obvious that they are all doing just fine without sacrificing anymore. In a pinch if needed you could lose weight by ditching the wheelchair as well as any other unnecessary weight.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "Brian\nLol\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "\nThe problem with an AI is that they cannot really think outside the box. They always except the known variables as absolute. In a similar lifeboat question you have people in the lifeboat and people swimming up to the lifeboat. The question is do you leave the people in the lifeboat who seem to be of less value to except higher valued survivors who are swimming up to the boat. In this case we specify that it is in the tropics and help will be coming in three days.\nFor this one the answer is that you can have half of the people in the boat and half of the people holding on to the side and rotate people in and out. They are in the boat to dry out and warm up and rest and out of the boat to allow others to do the same. By sharing the time in the water the boat is never swamped and all can survive.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "Brian\nSo the handicapped probably can't hang on.\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "\nIn high school we had a robotics class. We played king of the hill. I'm sure you seen it but the object is to get your ping-pong ball to the highest point. Our robot was a fixed block with a lead base and steel sides. We lifted the ping pong ball swing a blower motor. Once the ball was lifted vertically the airstream tilted to place it in the target zone.\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "\nI was once told by think outside the box. I didn't know there was supposed to be a box.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "Brian\nI haven't I'll have to find a demonstration.\n"
        },
        {
            "from": "James",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "\nI went and did a quick search. I didn't see anything really relevant. We had to build small RC electric vehicles that would get a ping-pong ball to the highest point on a ramp. Most people used a wedge design that would get underneath an opponent and flip them over.\nDid this in high school in 1989\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T23:18:00.000Z",
            "message": "Brian\nImpressive. I did not have enough robotics. Played with some Legos though. That gave me a leg up.\n\n"
        }
    ]
}