{
    "thread": "https://www.facebook.com/messages/archived/t/jessica.cregeen.31",
    "participants": [
        {
            "name": "Jessica Cregeen Johnson",
            "description": "From Phoenix, Arizona",
            "url": "https://www.facebook.com/jessica.cregeen.31"
        }
    ],
    "messages": [
        {
            "from": "Jessica",
            "time": "2005-07-19T00:48:00.000Z",
            "message": "\nHey!!! I havent talked to you in a long time.  How have you been?  I hope your summers going great!\n"
        },
        {
            "from": "Brian",
            "time": "2005-07-25T22:32:00.000Z",
            "message": "Brian\nHey, Yeah it's been a long time, too long.  I have been doing great and I can't wait for college.  How about you?  Maybe we could talk online just like old times.\n"
        },
        {
            "from": "Jessica",
            "time": "2005-07-25T22:32:00.000Z",
            "message": "\nyeah im excited too.  yeah we definitely should talk more!!\n"
        },
        {
            "from": "Brian",
            "time": "2005-07-31T19:32:00.000Z",
            "message": "Brian\nDo you have a screen name or something?  Your contacts section is pretty empty.  I even had my mailing address on there but decided to take it off.  My screen name is just my full name, it makes it easy for people to keep track of me BrianJCullinan.  Talk to you soon!\n"
        },
        {
            "from": "Jessica",
            "time": "2005-08-01T05:13:00.000Z",
            "message": "\nI have a screen name but honestly i never use it im never on AIM but you can call me if you want 480 707-3744\n"
        },
        {
            "from": "Brian",
            "time": "2005-08-01T08:52:00.000Z",
            "message": "Brian\nCool, I'll call you sometime.  I just got a new cell phone 480-444-9066.  What are you doing the rest of the summer?  Any more vacations?  Go anywhere interesting already?  I am leaving Tuesday to go to NYC, I can't wait.  I have never been there before.  After that I go to Jackson hole with my father, assuming he didn't cancel my flight already.  He's fighting with my mother again...  Long story.  Anywho, I'm online all the time, usually because I forget to sign off and then go out with friends and find lots of messeges on the screen when I get home.  I hope to hear from you soon, it's almost 2:00AM and I'm bored. :-Z\n"
        },
        {
            "from": "Brian",
            "time": "2005-08-14T14:36:00.000Z",
            "message": "Brian\nHey Jessica,\r\nMaybe on a break we could get together and have lunch or something.  I leave next week for NAU two days after i get back, and you have to leave Friday to check into the dorms right?  There just isn't enough time off during the summer.\n"
        },
        {
            "from": "Jessica",
            "time": "2005-08-14T17:38:00.000Z",
            "message": "\nYa that would be cool.  I would love to get together over break.\n\n"
        }
    ]
}