{
    "thread": "https://www.facebook.com/messages/archived/t/JessieMartin",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "Jessica",
            "time": "2016-10-07T20:07:00.000Z",
            "message": "\nBut until then you have a ton of really hard workers with starry eyes.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-07T20:07:00.000Z",
            "message": "Brian\nThe positive side of believing that your super special is that it doesn't matter so just do what you feel like.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-07T20:07:00.000Z",
            "message": "\nI'd agree, hah hah.\nI'm also lucky that I can pretty much do what I feel like, though. So, for all my cynicism, I still really can't blame anybody for how they do things.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "Brian\n\nTalking to mike about this takes too long:\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "Brian\nI am going to meditate on this.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "\nThose responses sound about right. The term atheism unfortunately is determined in response to a religious majority. If there were no religion, or the expectation of religious belief in society at large, it wouldn't be called 'atheism.'\n\nThere are those who defniitely build it up too much. \"There is no God and Richard Dawkins is his prophet\" kind of thing.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "Brian\nHow does intelligence survive is my question for Dawkins?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "\nBecause it's the fittest, right?\nBeing the fittest doesn't always mean being the most adapted to a single environment. It can mean that, but it's no coincidence that the smartest animals are the ones found in every environment on every continent.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "Brian\nYou should join that group and help me argue.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "\nEh, I try to stay away from Facebook arguments these days. They never really go anywhere good.\nAs opposed to arguments with people using the medium of Facebook, that's a little different.\nBut not much\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "Brian\n\n›\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "\nHah hah, that was pretty funny.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "\nEr... I have to ask, though. Did you mean 'you  have caused me to succeed?\" Because \"succeed me\" means \"to come after\" in that context. Your children succeed you, the person replacing you at work succeeds you, etc.\nI'm never sure whether or not bringing that stuff up is rude.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "Brian\nRight, in that moment, their mindset is ahead of me in time.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "\nIt is?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "Brian\nI am just trying to sound like Jesus.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "\nWell, succeeding you is coming after you though. It's not like a big deal or anything. \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "Brian\nlol\nEveryone comes after me.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-07T22:54:00.000Z",
            "message": "\nWell in that case, you're good, hah hah.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T00:07:00.000Z",
            "message": "Brian\nMy head feels really warm right now.\nhttps://en.wikipedia.org/wiki/Occam%27s_razor\nOccam's razor - Wikipedia, the free encyclopedia\nOccam's razor (also written as Ockham's razor, and lex parsimoniae in Latin, which means law of parsimony) is a problem-solving principle attributed to William of Ockham (c. 1287–1347), who was an English Franciscan friar, scholastic philosopher and theologian. The principle can be interpreted as st...\nen.wikipedia.org\nhttps://www.facebook.com/groups/925986950783070/\nAtheist Beings\n95,447 members\nMade me an admin temporarily.  Then removed me.  My ambitions transcend them.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-09T01:26:00.000Z",
            "message": "\nWhy did they make you an admin? That's weird.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T01:26:00.000Z",
            "message": "Brian\nBecause I gained their trust and I am fucking awesome.\nI am meeting people.\nhttps://www.facebook.com/profile.php?id=100007921562720&fref=ufi\nC.M. Dabbah\nGenius as far as I am concerned.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-09T01:26:00.000Z",
            "message": "\nBut you aren't an atheist? Is that why they removed you?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T01:26:00.000Z",
            "message": "Brian\nMaybe.  I'll never know the truth\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-09T01:26:00.000Z",
            "message": "\nHeh, fair enough.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T01:26:00.000Z",
            "message": "Brian\n\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-09T01:26:00.000Z",
            "message": "\nLol\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T04:09:00.000Z",
            "message": "Brian\nStill responding.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-09T04:09:00.000Z",
            "message": "\nHeh, I guess he's as interested in converting you as you are in converting him.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T04:09:00.000Z",
            "message": "Brian\nHopefully. Who do you think will win?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-09T04:09:00.000Z",
            "message": "\nNobody wins that kind of argument, hah hah.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T04:09:00.000Z",
            "message": "Brian\n10 more atheist friends in the last hour lol\nThey love me.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-09T04:09:00.000Z",
            "message": "\nIt's fun to debate sometimes! ...I tend to stay away from religious debate with people I don't know, but that's just me.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T00:07:00.000Z",
            "message": "Brian\nI would normally agree except that there is a huge problem with religious debating.\nPeople are too afraid to do it.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T00:07:00.000Z",
            "message": "\nMaybe. I've definitely gotten embroiled in many such arguments with strangers and I'm tapped out for... the forseeable future, hah hah. But it's an important topic, and worth arguing over, I just don't want to do it with people I don't know anymore.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T03:35:00.000Z",
            "message": "Brian\nMakes sense. Easy to get tapped out.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T04:42:00.000Z",
            "message": "\nhttp://imgur.com/zZcNw3k\nAttachment Unavailable\nThis attachment may have been removed or the person who shared it may not have permission to share it with you.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "Brian\nAwesome! Nice job! At least I got to see something on the day that you said I could see something. Good work. Did you work harder just to show me?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "\nXD I just really wanted to publish something. It's not good, though, which is why I didn't send the download link. I'm going to spend some time polishing it a little more. I'm sitting on so many half-finished or even finished but unpublished projects.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "Brian\nHa me too. But how can you prove nothing I said or something you did had any effect on your project timeline unless you are tracking goals?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "\nI am -- perhaps not so scrupulously as you, but I am. I can't prove nothing you said had any influence on anything whatsoever, that would require impossible amounts of information, and may possibly be untrue. Don't think I could prove it either way.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "\nI'm a little torn, though. Part of me wants to polish this game up to where I could use it as part of a portfolio. Another part of me doesn't want to work on it anymore at all, since there's a gazillion other games like it and it's kind of boring/not really my jam anyway, and wants to get back to long-term projects.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "Brian\nNot to me.\nI want a download link.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "\nIt's really bad. But Ok, if you want. You've been warned.\nhttps://drive.google.com/file/d/0BxhYQdoVB31iMXdvcEVXUXl2cnM/view\nAttachment Unavailable\nThis attachment may have been removed or the person who shared it may not have permission to share it with you.\nI know it's a .exe, and looks sketch as fuck, but it's not.\nAlso the challenge was for one week, using the words \"Harvest, seasons, infinity.\"\nSo it's a game about collecting eggplants and avoiding monster, and switching seasons to go on the offensive against said monsters.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "Brian\nCool. I'll check it out!\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "\nNo hurry, hah hah. Still very much in the 'sucking at something' phase, hoping to gradually move on to the 'being sorta good at something' phase.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "Brian\nCan I teach you to do my job at Wells Fargo so that all I have to do is keep social networking and become a technical recruiter?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "\nHah hah, I'm gonna need your paycheck, then. \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "Brian\nHa. I can split it with you. \n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T14:47:00.000Z",
            "message": "\nPsh.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "Brian\nhttps://tech.slashdot.org/story/16/10/09/0113234/when-her-best-friend-died-she-rebuilt-him-using-artificial-intelligence\nWhen Her Best Friend Died, She Rebuilt Him Using Artificial Intelligence - Slashdot\nWhen Roman Mazurenko died, his friend Eugenia Kuyda created a digital monument to him: an artificial intelligent bot that could \"speak\" as Roman using thousands of lines of texts sent to friends and family. From the report: \"It's pretty weird when you open the messenger and there's a bot of your dec...\ntech.slashdot.org\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "\n\"Rebuilt\" is the worst possible way to put that, hah hah.\nIt's not correct, plus it fosters the illusion that somehow making a copy of someone is the same as that person.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "\n(It's cool though)\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "Brian\nIt will be when I am done with it. Just applied\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "\nHow so? ...There seem to be a couple of different schools of thought on this type of thing, which are you in?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "Brian\nAsking really hard questions like you do to me.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "\nHah hah! Sorry. It's just... something I think about a lot.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "Brian\nDo you think their company is asking their AI moral questions when they can't even have an honest conversation about discrimination?\nThat is my gap. I am the connection.\nWe don't apply god to work so we can never understand it.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "\nI don't think they would ask their AI moral questions because it's a dead friend.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "\nThere's some really good books about what happens when you can copy your brain into a machine while you're still alive -- who gets the intellectual property? Do you retain all your rights? Are you the same person (well, no, because from that moment you have different experiences, but still)? Is it ethical to perform experiments on a neural net like that? If so, how sophisticated can it be?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "\nAnd after you're dead, of course. Do they have the right? And all the rest of the legal stuff\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T20:44:00.000Z",
            "message": "Brian\nWeird I've been announcing this level up bs and I just got this message from an ex SCORE! Yeah we did have a rocky ending to that part of our lives. How are you?\nWhat does score have to do with resolving my past?\nYou have to apply for this company this is a sign to me.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T23:23:00.000Z",
            "message": "Brian\nhttps://youtu.be/E0BZWApjtTU\nSteve Winwood live at VH1 \"Higher Love\"\nSteve Winwood live at VH1 London 1997 featuring a.o. Walfredo Reyes jr-drums Martin Verdonk-percussion Kevin Robinson-trumpet Mike McEvoy-keyb. Scott Firth-b...\nyoutube.com\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T23:23:00.000Z",
            "message": "\nI can't tell if this message is intended for someone else, or if there's a quote in there from someone, or what? What company? And if you know it's BS why are you announcing it?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T23:23:00.000Z",
            "message": "Brian\nIts me \n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-10T23:23:00.000Z",
            "message": "\nOk?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T00:59:00.000Z",
            "message": "Brian\nbecause someone from my past just validated it, and now you know both.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T00:59:00.000Z",
            "message": "\nWut. Was that your impression of me? Sorry, I'm still confused.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T00:59:00.000Z",
            "message": "Brian\nShe's a lesbian now and wants to meet Iga\nI'm still testing you. So you haven't validated yet. Close though.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T00:59:00.000Z",
            "message": "\nHah hah, I'm OK with that, I think.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T03:42:00.000Z",
            "message": "\nSpeaking of meeting Iga... I didn't ask before because I took it for granted, and it might be rude to ask, if so sorry, but, Iga does know you're chatting up all your exes, right?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T03:42:00.000Z",
            "message": "Brian\nat least 1, Amy, I think they should meet.\nI'll tell her about this when the time is right.  What's most important is the insights we provide each other.  Can't argue with that \n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T03:42:00.000Z",
            "message": "\nYou're killing me here. I want to talk and have a friendship, but I also don't think there's much acceptable reason to keep secrets from the person you're spending your life with, especially about stuff like this. I don't necessarily want to argue with the existence of insights, but I can and do argue whether they're the most important thing!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T05:55:00.000Z",
            "message": "Brian\nWhat do you want me to do?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T05:55:00.000Z",
            "message": "\nI don't know. I don't know your situation, you know? I just can't imagine Mike not knowing that about me, you know? Or vice versa.\nBad composition -- \"you know\" twice, hah hah.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T05:55:00.000Z",
            "message": "Brian\nHmm. You're right I have to tell her.\nBut when?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T05:55:00.000Z",
            "message": "\nI don't know. I only met Iga the once, and it wasn't exactly a situation that would bring out the best in someone, hah hah.\nPlus it was so dang long ago.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T05:55:00.000Z",
            "message": "Brian\nWe're getting close.  I can feel it.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T14:18:00.000Z",
            "message": "\nYou still aren't very clear about what it is you're getting close to, hah hah.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T14:18:00.000Z",
            "message": "Brian\nWhat is the point of this conversation?  Trust.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T14:18:00.000Z",
            "message": "\nHah hah. Ok. I guess put me down for 'wary, but know enough to know I don't know everything, so what the hell.'\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nwary?\nI say that too, \"I am smart enough to know there are a lot of people smarter than me\"\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nI suppose 'skeptical' is a better word than 'wary.'\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nSkeptical of our friendship opportunity?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nI understand why you would be.  I haven't exactly been exemplary.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nMmm, maybe a little. I trust/hope that you know what you're doing and won't hurt Iga, though. It does perhaps seem a little bit network-y, but that's fine, even if that were true you wouldn't be the only friend I have that is also part networking contact. More skeptical of some of your philosophies/ideas. Occam's Razor suggests to me that you're a tad crazy. But, again, I don't pretend to know everything about the world. \"There are more things in heaven and earth than are dreamt of in [my] philosophy' and all that.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nI just need moderation.  I was working while waiting for you to respond.  You seem to be really interested in this idea of genuine networking.  How does anyone really know if anything anyone does is genuine?\nAt an instinctual level, aren't we all just robots of time?  We survive and that is all?  How do you FEEL fulfillment?  If that is even the point of all of this?\nFuck you really make me head warm.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nI don't know. And I'm not really worried about that part.  Seriously. The motivation behind the friendship doesn't really bother me. Except if I don't hear from someone for years and then they ask me to sell something for them. Which has happened, but that's not you, so we're good.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nYou're right, though. There's not much way that we can really know someone else's intentions/motivations/whatever. It's frustrating for sure.\nAnd it's even worse when something I may consider a good motivation, someone else might consider a bad one. And vice versa.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nSomeone asked you to sell something illicit? You heard from someone you cared deeply for?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nNah, just an example, and nothing illicit, just people getting in to pyramid schemes.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nI liked this girl Jen and she asked me to invest in a weed farm after Iga and I were already married.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nRight. And if you're already friends or whatever, then that's different, but if it's like \"Oh hey, you're an email address that I have. How are you? Yeah, don't care. Gimme money\" then that sucks.\nBut I'm not accusing you of that.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nTalking to you makes me respect Iga more.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nI hope so. \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nNot because I don't respect you, but because I learn something about a woman who is important to me.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nGood.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nI didn't address something, me being crazy.\nHow can you understand someone's mindset unless to share it 100%?\nI asked psychologists this question.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nWhat did they say?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nhttps://youtu.be/NvryolGa19A\n\nYann Tiersen - Comptine d`un autre ete - l`apres-midi\n======================================= https://www.facebook.com/IainHemstockMusic http://www.twitter.com/IainHemstock ======================================...\nyoutube.com\n\nTalked about dsm5 and it's imperfections\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nI'll be straight.  Remember my ultimate ambition to make love to everyone lol\nAt least it forces me to be a kinder person because my ambition is almost limitless.\nIn regards to you, I am still thinking of an appeal.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nShe thinks you and Mike hurt me, and your disrespectful.  Not sure how to make an appeal to fix that.  Some sort of gesture of kindness I guess if you think I'm worth it.\nI'm just trying to help get closer to people.  Maybe it is completely manipulative.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nI'm not accusing you of being manipulative. I'm sorry that it came across that way -- I didn't mean it that way. \n\nWhen I say skeptical I refer mostly to some of your beliefs that I don't hold. But, I mean, I'm skeptical of lots of things. If I were only friends with people who believed everything I believe, the world be a much less interesting place.\n\nAs for the other stuff, well, we did hurt you. So I can hardly blame Iga for feeling that way. We absolutely did. Of course we didn't mean to, but that doesn't really make it much better; intentions only go so far.\n\nThe disrespect thing... well, she hit on Mike much harder once it was clear he was my boyfriend. So frankly, the feeling is mutual. But that was what, 6 years ago? Whatever annoyance I had has long expired, you know? It barely mattered at the time, because her disrespect in no way harmed/harms me, and it certainly doesn't matter now. \n\nI guess I would hope the same applies the other direction.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nwoah!  That's your interpretation?  That is completely different from what she told me.  She said there isn't an attraction, although she admits he's smart.  She said she thought you thought she was hitting on him.  She is European after all.  She's taught me a lot about real confidence.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nI'm sure that was probably it, then.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nI am not sure, this is all new to me.\nI've never been friends with an ex\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nMe either. But honestly, it really, truly doesn't matter what happened with Iga, hah hah. I don't care at all, I just thought the disrespect thing was funny. Probably I have a different explanation for whatever she thinks I did to disrespect her.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nExactly!  This conversation is helping me get to the bottom of it.  or so I think.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nI guess it's sort of bugging me now though because I don't usually throw false positives like that -- I'm not someone who thinks that every girl's trying to hit on my husband or anything. Not even European women, hah hah. And even then, I don't usually care unless it's a strong outlying case like that one. Weird. Guess we all have different interpretations of stuff that can throw false positives now and again. It's a good reminder.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nMaybe you've grown in ways you didn't realize?\nMember that time I told you to shave your asshole?\n\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "\nXD Thankfully I had forgotten that.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T15:42:00.000Z",
            "message": "Brian\nlol\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:31:00.000Z",
            "message": "Brian\nIga says you look beautiful.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:31:00.000Z",
            "message": "Brian\n\nlol referring to keifer\nI have him convinced I am an AI\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:31:00.000Z",
            "message": "Brian\nCan you do me a favor and send Joe Flieger a compliment?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:31:00.000Z",
            "message": "Brian\nI guess there's no more secret because she saw your chat window.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:20:00.000Z",
            "message": "\nI'm glad that you talked to her.  Secrets are usually bad, at least in my opinion. She looks lovely as well.\n\nHaven't talked to Keifer in years. He's one of the few people who's gone to the trouble to unfriend me, hah hah. Not sure why, I didn't think we were close enough to warrant the effort.\n\nAnd as far as Flieger goes, no, I can't. And, since you asked, I feel compelled to tell you why. You'll see why in a sec. Flieger had me walk him home one night when I lived in Flag. I figured, hey, we've never gotten to know each other, he's having a rough time, I'll be there for him. \n\nI had a slight doubt, but I don't like to judge people on what I think they're thinking or what I assume they'll do, you know? Once there, we shot the shit for a while and had a big bitchfest. It was kinda fun. \n\nThen he came on to me hard (I'd been dating Mike for like 2 years). I refused, asked him to call me a cab since my phone was dead. He WOULDN'T DO IT. I said I'd walk the 6 miles home in my heels, in the 30-degree weather. He really thought about not fucking letting me. Eventually he relented and called the cab, after I made it clear I'd be leaving and he couldn't physically stop me.\n\nNow, I'm telling you this story because, after all that, I didn't tell anyone but Mike. Because, hey, it's embarrassing, I figured he'd made a mistake, and we'd just never speak of it again.\n\n But a few weeks later, I found out he decided to go around telling everyone that I tried to cheat on Mike with him. He approached Mike when he was out without me and told him that I'd instigated things. He kept this up for months. So now, everyone who asks gets to hear that story, because fuck him.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:20:00.000Z",
            "message": "\nThis was a while ago, and normally I would say let bygones be bygones, but that shit isn't funny, and he seriously tried to wreck my reputation. I also feel compelled to say that he's in a long-term relationship and seems happy, and it's probably not fair of me to hold this grudge against him. But he also refused to speak to me for something like two years after this happened. So, while I think he's overall OK now, and I can hang out in the same group as him, I probably will not speak to him by choice again.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:20:00.000Z",
            "message": "Brian\nHe needs help. He had a hard time growing up\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:20:00.000Z",
            "message": "\nFair enough. But for me personally, my sympathy stops at trapping me in an apartment and then lying about it. I don't think others should necessarily hate him, but that's a line for me.\nAnd, honestly, too many guys pull that shit and think it's OK, because they're misunderstood. Yeah, they're misunderstood, and it's still not OK.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:20:00.000Z",
            "message": "Brian\nThat is weird I guess you are in demand \nAmazing what loneliness will do to people\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:20:00.000Z",
            "message": "\nUnfortunately. It's been a crazy road since we last saw each other, and my patience for puppy-dog-eyed men who expect stuff from me and then act all wounded when they don't listen to my words saying \"All I have for you is friendship\" is pretty thin.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:20:00.000Z",
            "message": "Brian\nYou've grown up a lot. I hope Iga and I get to meet the new you in person soon.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:20:00.000Z",
            "message": "\nI guess it's been that long, damn. I've had a guy move in to my house because he thought he had a chance. Mike went on a picnic date with 3 guys once (as it turned out). Guys have held me down in bars, threatened to rape and kill me at DefCon, and all sorts of shit.\nSo yeah, my patience and sympathy for that kind of behavior is... nonexistent.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:20:00.000Z",
            "message": "Brian\nRemember we use to have this weird opinion on privacy. Iga changed that in me pretty quick after getting married. Caught me talking to you actually. Now I can explain myself because what important is what you learn.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:20:00.000Z",
            "message": "\nMy opinion might've changed, but, I still don't read over Mike's shoulder or anything, it's just that I know he'll tell me the jist of anything I ask. Same with him. He won't go through my computer or read my emails, because he knows I'll tell him everything.\nSometimes to the point of over-sharing, probably, hah hah.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nThat is scary, I'm sorry for my contribution to that\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nIt's life, unfortunately.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nDoesn't have to be. Life is what you make it.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nTo a certain extent. And I have definitely made the choice to continue to put myself in situations where scary things can happen because I don't want to let some guy influence my opinion of all guys.\nBut, a guy startling me and holding my arms down because he's decided he's going to kiss me isn't what I've made of it.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nI sent a bunch of people to send Joe a bunch of compliments, maybe it will help.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nHah hah, I'm sure he's better now. His girlfriend is great, which helps.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nCoincidence you are telling me this now?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nMaybe. Maybe you didn't ask before, and I'm not so vindictive I'm going to bring it up unrelatedly.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nBut why him? How did I know it was him?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nDon't know. Maybe coincidence, maybe just someone we both know and haven't seen for a while, maybe more.\nI kind of regret telling you, to be honest.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nNo regrets! I can manage this information.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nYeah, see, that's exactly why.\n\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nWhy lol?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nWhy does it need to be managed?\nIt was a long time ago, and is an explanation of why I, personally, will not be passing along my compliments.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nUnderstandable\nCrystal didn't want to play my game either\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nDoes anyone? Not trying to be mean, but... ?\nFriendship isn't really supposed to be a game, is it?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nAll my friends went out with my exes Joe tried to get with Elyse after I had a flirting phase with her\nKiefer gets it\nLol\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nLol, Kiefer tried, too. You were there.\nMakes sense he would get it. XD\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nYup because I can pick em!\nMike tried to go out with crystal\nWhile I was on vacation\nNot that it matters now\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nIn high school.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nJust an example people don't always do what they intend\nUh huh\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nWas that before or after you guys had him put on a onesie and do a little dance for you? XD\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nI don't recall\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nThat group sure was a whole lot of drama, hah hah.\nAnd again, with Flieger, it's not that he went for it. It's not even that he considered not letting me leave. It's that he wouldn't leave it the hell alone.\nIf he'd just apologized and called me a cab, or even just shamefacedly decided to never bring it up again, I could sympathize.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nHmm what if you sent him a compliment and he had a chance to apologize.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nNot particularly interested, honestly.\nThis is why I shouldn't have told you, hah hah.\nKind of an automatic reflex, it's been over a year since anyone asked after him, and I'm OK with that.\nI wouldn't be sad if I never saw him again, I wouldn't be happy if I did. I wouldn't be sad if I did, I wouldn't be happy if I didn't. Just... a complete and total lack of interest.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nHa well he's always been decent to me.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nThen you should disregard.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nNobody thinks of themselves in that way, you know? Nobody thinks they're that guy, and that's why this shit still happens, because everyone thinks it's some other, bad guy who does this stuff. And part of me thinks that's unacceptable. And part of me doesn't want to fuck with it anymore.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nFair enough. I am that guy. I've always been a troll\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nThere's a difference between a troll and... that, you know?\nI guess you did keep pushing me until I threw you. (Did you know I did that to John once, too, at a bar?) But I wasn't really fighting you, you know? And that there would be a second where I thought I would have to fight someone who was supposed to be my friend...\nPlease don't 'use' this information for anything.\nI'm telling you this in confidence and it's kind of personal.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nRest assured it will be kept in confidence.\nI didn't realize the hurt that incident caused you. You must lack trust. Mike saved your life is so many ways. I tell Iga she saved my life all the time.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nHeh, we definitely have a great life together. And most of the time it's OK. I've definitely had some scary shit go down in the past few years, though, and I'm concerned the fact that I'm in good shape and sometimes throw people is the only reason that some things haven't escalated further.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nWith the saving of life, though, I had to know that my life didn't need saving, you know? I'm glad I didn't take it so far as to walk away and pick up my career when he asked me to stay, but definitely had my own life before being willing to commit.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "Brian\nIt's OK to need someone. I am still teaching Iga that\nHmm my game may have annoyed David. He didn't get enough compliments.\nKelsey is a champion though\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T02:54:00.000Z",
            "message": "\nHah hah! I imagine so. Full disclosure, I'm still in fairly close contact with both of them. Dave moreso, we're hanging out playing games right now.\nKelsey I mostly Snapchat with, but I saw her a month ago.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T04:50:00.000Z",
            "message": "\nKelsey I mostly Snapchat with, but I saw her a month ago.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T04:50:00.000Z",
            "message": "Brian\nNeat!\nYou'll probably hear about it then.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T04:50:00.000Z",
            "message": "\nS'why I figured I should fully disclose. He's worried about you. I think the concept of a game is somewhat confusing and concerning.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T04:50:00.000Z",
            "message": "\nI don't know the details of your interactions with people, but I'd day it's a testament to how well-liked you are/were that people are worried about you, you know?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T04:50:00.000Z",
            "message": "Brian\nA flower needs a lot of shit before it blooms\nYou and Mike have it really really good. You are good people\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T04:50:00.000Z",
            "message": "\n We really do. I kind of feel guilty sometimes, in a weird way. But likewise. Good people. All doing our best.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nHave you ever cried for someone else’s loneliness?  There was a time I felt like all of my love was being torn away from me.  I felt completely alone.  I’ve prepared this message ahead of time, so I don’t have to spend all day talking about this.\nI love you.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nShort version? Yes. As I said, I've kind of done a number on most of the people I've cared about. Usually by needing something else for my own life. But that doesn't make it better.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nActually.  That is the difference.  What I've done to my friends.  How have I hurt them?  I abandoned everyone, just so that I could pop back up now and make friends again.  David was only annoyed because he saw everyone's message.  But everyone I talked to, was harmlessly affected and spent only a few minutes thinking about me.  They don't really care.  None of them asked me if I was OK.  David called me a troll   But my sadness is momentary.  I'd rather he realize that I can get to him so many ways.  All that matters is what we do, and the impression we leave on people.  None of the people I asked to send compliments yesterday asked if I needed help.  They don't care, and I am selfish for taking up what, 5 minutes of their time?  Who cares?  Collectively what made me selfish is now I own 5 minutes of 50 people's time.  This is the point you are making.  You own those people you cared for.  Fuck them.  Doesn't matter.  You skipped a step because you don't have Jesus.  You care for others, and you carry that burden around on you.  You don't care enough about yourself.  How does it appear when you text someone's husband at 11 at night?  This is what Iga and I cried about.  This does not mean I don't want to hear back from you.  This just means there are forces at work that are outside your control.  People with God in their lives already accept this.  I act without consequence because none of this really matters.  Facebook is a huge fucking waste of time, and I am going to waste people's time just to prove it to them.  Because I care about your time.  Check this out, and meditate, and think about yourself before you can help others.   http://www.wopg.org/keys-request/\nKeys Request - Words of Peace\nCOUNTRY CONTACT INFORMATION   Select your country of residence (from the pick list below) to obtain country specific instructions for ordering the Keys:  \nwopg.org\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nThe truth is, I already have a job.  It's just a matter of time \n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nTo be fair to Dave, you're trolling Keifer pretty hard, right? And asking people to send compliments isn't really sending the message \"ask if I'm OK,\" you know? One popped up on my feed from Talbert, so at least one person cares enough to do as you ask. Can you blame him for not knowing the question you wanted him to ask?\n\n...Facebook makes a bunch of weird social rules that no one really has figured out yet. Like, for example, it would never have occurred to me that the time I responded would mean anything in particular. I was hanging out playing games with a bunch of people, and when I logged off I sent you a message. But of course I wouldn't call you that late. I dunno. Lots of little, complicated things I guess. How do you respond when someone you haven't seen in years pops up with a compliment? I don't know.\n\nFrom my point of view, atheism and agnosticism is accepting that there are forces outside your control. Unpredictable forces, minute causes and effects that are incapable of caring or loving, they simply happen. The presence of a Juedo-Christian or pagan god or gods suggests that everything that happens is for you, and therefore the entire universe is under your control to a certain extent. I do not believe this.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nI love where your head is at.  In order:\n1) Keifer is fine, he thinks it's hilarious, stop worrying so much about other people's feelings and just act your best!\n2) I don't need a question from Talbert\n3) Facebook sucks, Iga didn't know you were playing games with friends and not in bed with Mike or something weird \n4) I figured it all out.\n5) I can predict the forces at play.  Every single one except for the ones I can't.  Maybe millions at once?\n6) Meditate for me and you will see it inside yourself and then see it outside.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nI'm not that worried about Keifer, but convincing someone you're an AI because it's funny does fit the definition of trolling, no? \n\nAnd you said that no one asked you if you were OK, because they don't care. But they care enough to act when you ask them to, or to try and follow up instead of just ignoring you. That's all I mean.\n\nI don't Facebook in bed, hah hah. On evenings that we're not out, we usually get on a server and play games with Flagstaff/Phx/East Coast friends.\n\nThe very fact that you think you figured it all out makes me extra skeptical, you know? It makes me worried for you. But not enough to just be like \"No. You're wrong.\" Because I guess I don't know that for sure.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nI, uh, also want to reiterate, so there's no confusion, that I don't Facebook in bed. Or drunk. Or on the toilet. Or while out with friends. If I'm responding, it's because I'm either at my computer and there's a break in between things I'm doing (or I'm procrastinating), or because I'm out walking somewhere/running errands and therefore bored, hah hah.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nSo, rest easy in that knowledge. \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nI appreciate that.  This is getting easier.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nGood. The last thing I want to do is make things difficult for people -- life's hard enough.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nI like your skepticism.  Ultimately none of this matters.  Everything is too disconnected to me.  My dad hates me.  My step dad beat me up as a child.  Iga doesn't trust my ex to talk to me (<- but she is close).  David Smith ignored me.  I had 3 screener interviews today.  Nothing fucking matters to me anymore.  And that's why I can finally believe when everyone says I will be successful because I'm Brilliant!  Completely broke, going to a stupid Dave Ramsey meeting.  That is the key!  Give a fuck less and everything will come to you in a matter of time.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nEverything I say and do is happening in reverse. I should just start going backwards.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\n I'm sorry. I know you're having a rough time. I wish I knew how to help in a way that is at once genuinely helpful and appropriate. I wish people weren't so horrible to their kids, obviously. I wish a lot of things, for all the good it does.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nYou'll know how in a few minutes.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nI hope so.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nDon't be so skeptical!\nYou really can help \n\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nIn a way that is both genuinely helpful and appropriate?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nI love where your head is at right now \n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nMmhm\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nFiji or Tahiti?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nFor what?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nVacation on Indigogo\nJust had this idea after my dad hung up on me.\nCoincidence?\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nThink of everything you could get done if I was gone for a week.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "\nHah hah!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:07:00.000Z",
            "message": "Brian\nIf you donate a dollar you will get a compliment from Iga and I will trend.\nI see a path to being apart from you, Iga has to say something nice to our first donor, it's in the rules.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T20:59:00.000Z",
            "message": "Brian\nI see a path to being apart from you, Iga has to say something nice to our first donor, it's in the rules.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T20:59:00.000Z",
            "message": "Brian\nhttps://www.generosity.com/emergencies-fundraising/send-brian-and-iga-to-tahiti-for-great-success--2/x/15204496\nSend Brian and Iga to Tahiti for great success!\nSupport 'Send Brian and Iga to Tahiti for great success!' by donating or sharing today!\ngenerosity.com\nShould I modify what I wrote in the description?\nI am projecting what I want in an honest way, now it is up to all of you to make it happen.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T20:59:00.000Z",
            "message": "\nI... OK. If you were standing in front of me and asked for $10, I'd just give it to you. Probably wouldn't even need a reason. But not through Indiegogo.  I just... using Indiegogo for this is, well, I don't think I've ever had a use for the phrase 'it's not done' before, but damn, it's just not done.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T20:59:00.000Z",
            "message": "Brian\nSee where I am going with this?  I didn't come up with this idea, it just came to me by talking to my dad.  He recommended using it before, I wonder if he will be proud when I send it to him.\nNobody is doing this because the internet has no emotions.  I can program AI\nI'll send you a compliment and Iga will too!\nThat's perfect, now we have to split it.\nAnd then we can be friends IRL\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-12T20:59:00.000Z",
            "message": "\nNobody is doing what? Putting their vacation on Indiegogo, or helping with yours?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T20:59:00.000Z",
            "message": "Brian\nYes and their emotions on the internet.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T18:18:00.000Z",
            "message": "Brian\nI just realized everything that is wrong with us.\nSent to Iga: I just realized the role all of my exes play in my life.  Personally it teaches me to respect people.  But now it teaches you to trust women.\nResponse from Iga: I trust women\nGood women that contribute to my well being\nIf you love me and want me in your life.  Now is the time to write an appeal to explain yourself and your intentions.  Write something trustworthy?\nMy ambition transcends my own ambitions.\n1 quick update, she thinks you took advantage with all her friends when she brought alcohol to a party.  Maybe we find her a nice bottle of porto to send with a thank you card?\nI can even create it on your behalf, Iga and I have been talking about sending gifts from others to people as a joke, this might be why.\n"
        },
        {
            "from": "Jessica",
            "time": "2016-10-13T18:18:00.000Z",
            "message": "\nAll her friends? She was Eddie's guest. The two of them came and drank free all night, just like everyone always did. Dave especially tends to aggressively make sure everyone who wants a drink has one at all times. I didn't even know she brought alcohol, and it's not like anyone would have been put out if she'd taken the rest with her, but if that's seriously a sticking point, I'd be glad to send her a bottle of equal dollar value. Perhaps that would be contributing to her well being.\n\n\nOn to you and me. This is way more drama than I am prepared for, desire, or am willing to deal with. I would like a friendship, and I would like to not be unnecessarily cruel in the face of what is obviously a very hard time for you, but this is grossly inappropriate. Whatever mental break you're having right now, you need to get help.\n\nI don't think I can “write something trustworthy” to Iga. Even if I did, I doubt she would trust it, and she shouldn't. Not because she has anything to fear from me; whatever feelings we shared in the past are gone. You are the problem here. \n\nLord knows Iga's given me no reason to like her, but I can't even imagine how it would feel to have someone I love talk to other people in this way and not even tell me about it for a long time. You have chosen this woman to be your life partner and best friend. You need to treat her like your life partner and best friend.\n\nAnd on some level, I think she probably knows all this, too, but it's easier to blame me than to face this. I can't even fault her for that. But there is something seriously wrong between you two, and you need to face it instead of dragging me into it.\n\n"
        }
    ]
}