{
    "thread": "https://www.facebook.com/messages/archived/t/john.r.meyer",
    "participants": [
        {
            "name": "John R. Meyer",
            "description": "",
            "url": "https://www.facebook.com/john.r.meyer"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nyeah, that's true.  i think a lot of companies have gotten too big and powerful.  and what's to blame?  patent laws.\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nthe only solution is strict government regulation and a removal of corporate money from all levels of govenment\nalso... punishments for \"white collar\" crimes\ni don't think the protests will do anything\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nfuck regulation. beuocracy is what is making education so expensive.  students are in debt because of the 100 tiers of beurocrats the money has to go through before it reaches the schools.\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nhistory has shown, time and time again, the only thing to effect real change is violence\nno, lack of regulation got us in the mess we are in... and that is pure and simple fact.\nsocialized countries have nearly free education... that is the model we need to go after.\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nmaybe I am a bit of an anarchist here, but kill all corporate interests and all regulations and let everyone fight it out.\nso you're a socialist?\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nno, that cannot work in the consolidated environment that our corporate culture has evolved in to\nthe government exists to protect the citizens welfare and ability to live a fulfilling life\npart of that is to provide social benefit, like education and healthcare\nevery other developed nation has a handle on this\nexcept for us\ni am not a socialist, but government has a role to play in some markets\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nok social benefit and healthcare, but what about social security? if you want to distribute the wealth it might as well just been added on to the tax rate, it's not helping anyone.\nand what about stray organizations that aren't doing any good and costing the government millions like the TSA?\nthis is kind of a different conversation now\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nwe need to fix our corporate tax rate... that system is a joke.\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nbut it's all a result of shitty regulation.\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nthe TSA is nothing in comparison to our budget for blowing up brown people\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\ntrue fact.\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nour foreign policy is the elephant in the room\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nbut for some reason, not one who touches political conversation has the balls to admit that maybe we need to bring it in and regroup and focus on our own problems for a bit, instead of killing brown people.\nright, the elephant in the room implies don't talk about it right?\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nright\ndefense cuts and foreign aid cuts should be taking up substantial time on the national stage\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nbut what about all of the technology that comes out of war?  oh wait, monsanto is still genetically engineering the world and NASA has no money.  fuck all\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nthe military industrial complex is a PRIME example of how money has corrupted government\nat least as bad as the \"banksters\"\noh shit... prime.  i need to check engadet.\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nnah, just because they can afford to pay for something doesn't mean it wasn't a good idea. pretty much all of computer technology came from military funding.  try government supported monopolies.  which goes back to corporations getting too large which in turn goes back to patent laws and general bad decisions.  thank got the AT&T merger got shot down.\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nalthought since verizon is the best, the market could eventually decide they should be a monopoly.\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nthe MIC has produced some great technology\nbut unfortunately it has produced an untenable global climate\nand that trade off is unacceptable\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nbut we killed Osama and we killed Sadam\nwe won right?\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nour foreign policy continues to breed terrorists that will fill their shoes\nactions have consequences\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nI believe in educating the world, you really think we could make a difference if we spend more money on educating people to not become terrorist that it would make a difference?\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nif we didn't meddle in foreign governments we wouldn't have to worry\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\ni am all for bomb em and drop em\njust forget them\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\na great way to make even more terrorists!\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nkill all the people fighting each other and the UN makes us pay reperations\noh well\nprobably cheaper than 8 trillion in debt\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nor.. do nothing.\nthen there isn't a major problem.\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nwell the benefit of being a superpower is we don't have to care about the consequences\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nit is clear that we do\nthe war on terror is bankrupting the country\nthat is the consequence\nthe terrorists are winning, our country is in shambles and (as i see it) there is no hope of a fix\nthis country is a shit hole for pretty much anything there is a metric for (among developed counties)\nthe one title that will make me feel like a success: expatriate\neconomic mobility: ha!\nstatups: ha!\nhealthcare: ha!\nlivable minimum wage: ha!\nconsumer protection: ha!\nemployee protection: ha!\ni'm just glad i'm smart and not poor\nbut not everyone has the option or ability\nand they shouldn't suffer because of it\notherwise, what is the point of prosperity?\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nhmmm.\ni didn't have a problem getting a job.  coincidence?  not everyone is created equal.  that's a bullshit lie that idiots tell you to get you to stop fighting on the playground.  i don't mean to incite anger, but it isn't just coincidence.\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nall i heard was \"I DON'T UNDERSTAND SCIENCE\"\nyou can't be that dumb\nwe are all on a bell curve, sir\nif you can't see that, maybe you are on the left\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nyeah, and how much science in the form of statistics goes in to figuring out what the livable minimum wage is?  i am sruvival of the fittest.  I am just out of college and considering buying a house.  what differentiates me from all the others?  opporunity, sure, the market is bad so the time for buying is good.\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\npolitics is the problem here.  politics isn't science.\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nability, socioeconomic status, and luck\nthat is what differentiates you\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nthank you.  I am the 1%\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\na) not yet.\nb) it wasn't a compliment\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nhttp://www.financialsamurai.com/2011/04/12/how-much-money-do-the-top-income-earners-make-percent/\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nyou make 400k?\nif you made 400k you'd have better plates\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nhmm, I am getting new plates.\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\ni grew up in the top 1%\nshit, even higher\nbut at least i recognize the normal distribution of society\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nthen how are you such a liberal douche? (mostly joking <3)\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nbecause i think\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nahahaha\nyes\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nconservatism is a disease\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\ni g2g bed.  as usual it was an absolute pleasure debating with you.  educational as well. I hope you decide to reply to my post.\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\ni respect conservatives about as much as i respect people who believe in god\n(mostly kidding <3)\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\nlol, fuck you\n\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "\nhaha.  night!\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T06:21:00.000Z",
            "message": "Brian\ngoodnight sir.  i am tempted to post this whole thing to facebook.\n"
        },
        {
            "from": "John",
            "time": "2011-10-19T07:11:00.000Z",
            "message": "\nit was fun\nneeds more sources though\nalthough take out my vague reference to violent overthrow of the government\nand maybe the most offensive bit of this country is shit and i don't want to live here at all\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T15:12:00.000Z",
            "message": "Brian\nI agree.  I am not incredibly proud to be an American.  and I am guilty of political apathy too.\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-19T16:50:00.000Z",
            "message": "Brian\nSo here is some new information against regulation.  If you follow the logical path back from why rich people are so rich.  Bankers are making tons of money and control a lot of the countries money and where it goes.  We had to bail them out because so people who couldn't afford houses defaulted.  But even before that, why would they be loaning to people in the first place?  The Dod Frank act told them to give poor people money for a house.  A prime example of too much government regulation and 1 group of people making a stupid decision causes huge damage to our economy.\n"
        },
        {
            "from": "John",
            "time": "2011-10-20T01:53:00.000Z",
            "message": "\nIf that is your honest understanding of the housing financial crisis you don't understand it at all.\nThe problem came when these toxic assets were hidden in mortgage backed securities.\nThey were ingenious in hiding known toxic assets behind a AAA rating and no way to determine the actual value\nIt was fraud to the highest order... And instead of a bailout going to homeowners to restore value, it went to the banks who foreclosed with reckless abandon\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-20T04:55:00.000Z",
            "message": "Brian\nHmm good information.  Thanks.\n"
        },
        {
            "from": "John",
            "time": "2011-10-20T04:55:00.000Z",
            "message": "\nBut I need to look into how people were pushed into homes they couldn't afford\nI don't know enough about that\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-20T04:55:00.000Z",
            "message": "Brian\nyeah, it did happen.  I need to read about the toxic assets\ndid you see this?  https://www.facebook.com/event.php?eid=281139538577206\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-22T08:40:00.000Z",
            "message": "Brian\n!\n"
        },
        {
            "from": "John",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "\nhola friend\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "Brian\nhola!\n"
        },
        {
            "from": "John",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "\ni haven't done any reading on the housing crisis since we talked.... and i feel lazy.\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "Brian\nhahaha\n"
        },
        {
            "from": "John",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "\ni just had an awesome first date with someone i met on okcupid.  i did not expect that.\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "Brian\noh cool\n"
        },
        {
            "from": "John",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "\nbeing a nice person and describing yourself as a nice person are two very different things\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "Brian\nI think a lot of people do either and both\nso who are you and jessie to tell them that they aren't\n?\n"
        },
        {
            "from": "John",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "\ni have no idea\ni do not know anything about the situation\ni just hate guys using the descriptor \"nice guys\"\nso hard\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "Brian\nmy first reply was simply pointing out the fact that Jessie is one of those girls that complain about guys coming on to her and sends a whole mess of signals, and when a guy comes on to strong, she finally tells them that she is in a relationship\nwhen if she had any tact at all she would find a way to pursue the shared interests, AND let them know that she has a boyfriend.\n"
        },
        {
            "from": "John",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "\nperhaps true, i don't know her well enough to judge that\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "Brian\nI recently ran in to this, I met a nice bar tender, I expressed a shared interest, she let me know that she had a boyfriend and then we never hung out\n"
        },
        {
            "from": "John",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "\ni stop hanging out with girls when i find out they aren't interested\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "Brian\nnot quite the same.\n"
        },
        {
            "from": "John",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "\nif i like them romantically\nmaybe she doesn't set boundaries well?  i don't actually know her\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "Brian\nshe also has no concept of time frame, can't you like someone and hang out and then determine if you could have romantic feelings?  why is it that you would choose to hang out with someone you are romantically interested in over someone you have more in common with but is not single?\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "Brian\nah well\ni'm going to bed\n"
        },
        {
            "from": "John",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "\ni'm going to make some videos where i don't look creepy\n"
        },
        {
            "from": "Brian",
            "time": "2011-10-26T04:20:00.000Z",
            "message": "Brian\nsounds fun!\ngn\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-06T20:21:00.000Z",
            "message": "Brian\nOh man, internet at 30,000 ft is pretty hot.\nHow was your week?\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "\nhey, i have a simple code question for you\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "Brian\nwhats up?\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "\ni tried to fix an issue  in ubercart with a patch, but i was told my logic wouldn't work... but I don't see the problem.  im sure it is something simple that i'm just missing.\nhttp://drupal.org/files/uc_usps-address_zone_validation-14.patch\nthe zone field is only valid for country 840, so i don't want it checked otherwise\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "Brian\nso if you have if (empty($destination->country) and then under it you have if($destination->country == 840 that will never be reached\nso what you need to do is this:\n+  if ( empty($destination->zone) || \n+       empty($destination->postal_code) || \n+       (empty($destination->country) || $destination->country == 840)) { \n+     // Skip this shipping method. \n     return array(); \n   }\nsee what i did?  remove your change and put it down next to empty($destination->country) and change it to an || symbol not &&\nbasically, you are saying if country is empty or if country is not empty and county equals 840 then return array()\nwhich I assume blanks out that control you are talking about\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "\nthe zone should only be checked if the country is 840\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "Brian\nI would have to look at more of the module\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "\nthe rest should be checked for all countries.\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "Brian\nwhat version is this for?\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "\nhere is how i thought the logic went\n(if the zone is empty and the country is 840) or the postal code is empty or the country is empty\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "Brian\nyes but what does return array() mean?\nhow is it used?\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "\nthat I don't know\ni know my changes to the code fixed the problem i was having\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "Brian\nhuh\nyeah I don't know\npost your working example to the drupal bug report section\n*to the patch thread\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "\ni did\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "Brian\noh\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "\n\"That won't work - if zone is empty your code doesn't even check the country ... You want to check the country first, and only if the country is US should you check the other fields.\"\nis what I was told.  i just didn't see where i went wrong.\ni mean, all i did was change this: if (empty($destination->zone)        ||\nto: if ( (empty($destination->zone) && $destination->country == 840) ||\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "Brian\nI can see that\nYeah I don't see it\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:15:00.000Z",
            "message": "\ndoes that not prevent the empty from firing unless the country is 840?\nshould I just swap the statements?\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:50:00.000Z",
            "message": "Brian\nI am having trouble understanding when you want that to pass, does return array() mean it skips checking the \"zone field\"?\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:50:00.000Z",
            "message": "\nhttp://pastebin.com/pNvGG0hf\nthat is the whole function\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:50:00.000Z",
            "message": "Brian\nI don't think that function does what you think it does\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:50:00.000Z",
            "message": "\nhrm, okay\nI just wish the package maintainer had replied in a way that I could make sense of it.\nespecially given that my patch fixed  my problem\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-11T00:50:00.000Z",
            "message": "Brian\njust tell him you aren't a programmer and explain the problem you are trying to fix with hiding that field and they will help\n"
        },
        {
            "from": "John",
            "time": "2011-11-11T00:50:00.000Z",
            "message": "\nalright.  thanks for your help \n"
        },
        {
            "from": "Brian",
            "time": "2011-11-22T01:07:00.000Z",
            "message": "Brian\ndude, great to see you.\nwe should party in phoenix sometime.\n"
        },
        {
            "from": "John",
            "time": "2011-11-22T01:07:00.000Z",
            "message": "\nsorry i ditched out\ni was almost responsible, but instead i drove to the circus after party\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-22T01:07:00.000Z",
            "message": "Brian\noh nice\nthat would be fun\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-01T05:12:00.000Z",
            "message": "Brian\nWhat usenet do you use?\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-21T16:38:00.000Z",
            "message": "Brian\nmaking any impromptu trips to phoenix?\n"
        },
        {
            "from": "John",
            "time": "2011-12-21T16:38:00.000Z",
            "message": "\nwon't be through phoenix until mid-january, i believe. although a week ago i drove though it on my way to tucson\n.\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-21T16:38:00.000Z",
            "message": "Brian\nshoot, you should have called.\n"
        },
        {
            "from": "John",
            "time": "2011-12-21T16:38:00.000Z",
            "message": "\ni was stressing out about driving a stick\nwhich i learned how to do on my drive to tucson and back\ni wasn't making any unnecessary stops.\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-21T16:38:00.000Z",
            "message": "Brian\nohh, ahaha, I love stick.\n"
        },
        {
            "from": "John",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "\nthat is what i've heard\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "Brian\nlol\n,,|,,\n"
        },
        {
            "from": "John",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "\n\nhttp://www.youtube.com/watch?v=cdL6BjupD1E\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "Brian\nOMG\n"
        },
        {
            "from": "John",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "\nisn't that the greatest?\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "Brian\nthats hilarious\n"
        },
        {
            "from": "John",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "\nsometimes i think i've had sex with too many lesbians\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "Brian\ndamn, no fair.\n"
        },
        {
            "from": "John",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "\noh, it isn't an impressive thing.\ni'd rather have sex with straight girls.\nthey like men more, which is something i like in women.\nthat and me. zing!\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "Brian\nlol\n"
        },
        {
            "from": "John",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "\noh man, my roommate came home!\nguess who isn't technically drinking alone!\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "Brian\nawesome!\nnot me\n?\n"
        },
        {
            "from": "John",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "\nme.\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "Brian\nI am going to build this: http://www.instructables.com/id/Led-Cube-8x8x8/\nIn to a pair of bell bottoms and wear them to Lightning in a Bottle next year.\n"
        },
        {
            "from": "John",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "\nthat will be bad ass\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-22T05:14:00.000Z",
            "message": "Brian\ni thought so too!\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-28T02:21:00.000Z",
            "message": "Brian\nHi\n"
        },
        {
            "from": "John",
            "time": "2012-01-28T02:21:00.000Z",
            "message": "\nHello Good Sir\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-28T02:21:00.000Z",
            "message": "Brian\nI love facebook debates.\nand Dubstep\n"
        },
        {
            "from": "John",
            "time": "2012-01-28T02:21:00.000Z",
            "message": "\nfacebook debates are fun\ndubstep.  that is a thing.\ni stayed out of that one though\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-28T02:21:00.000Z",
            "message": "Brian\nWHAT!?\nSO DIRTY: http://www.youtube.com/watch?v=pV8SjNTZGJ4&list=UU5nJj-L4swL90huglMhKgOg&index=1&feature=plcp\nman, so filthy.  you are missing out.\nI love girls that love dubstep too.\n"
        },
        {
            "from": "John",
            "time": "2012-01-28T02:21:00.000Z",
            "message": "\nhttp://www.youtube.com/watch?v=Gw8luwwwXzc&t=0m4s\nnow that's music\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "Brian\noh pimp\nI just love music.\n"
        },
        {
            "from": "John",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "\ni love standup comedy more\nand women\nmainly the first, but both\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "Brian\nhaha, nice.\nbitches aint shit but hoes and tricks\n"
        },
        {
            "from": "John",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "\nthey can be\nlol\ni'd like to find one to actually date though\nas awesome as the hoes can be\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "Brian\nWe are building this: http://www.instructables.com/id/Led-Cube-8x8x8/#step1\nMe and a friend.\nYou know Joe Davidson.\n"
        },
        {
            "from": "John",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "\nyeah\nthat is awesome\ni hate instructables as a site though\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "Brian\nwhy?\n???\n"
        },
        {
            "from": "John",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "\nthe navigation suuuucks\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "Brian\nhmm, a lot of website suck then.\n"
        },
        {
            "from": "John",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "\nwait\nyou can view all the steps on one page\nnever mind, fine\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "Brian\nyup\n"
        },
        {
            "from": "John",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "\nfuck\nthat thing is awesome\n"
        },
        {
            "from": "Brian",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "Brian\nhttp://www.youtube.com/watch?v=cDJLmZLmCfc&feature=related\nI want to build bead curtains\nlike that\nbut for doorways\nI have a ton of LED ideas\nso Joe is going to help me get started\n"
        },
        {
            "from": "John",
            "time": "2012-01-28T02:24:00.000Z",
            "message": "\nCool\n"
        },
        {
            "from": "John",
            "time": "2013-03-15T06:38:00.000Z",
            "message": "\nhey, I have a quick question regarding android and a cpp source file, do you think you could take a look at something for me quick?\n"
        },
        {
            "from": "Brian",
            "time": "2013-03-15T06:38:00.000Z",
            "message": "Brian\nI haven't really played around with Android much.  I have been too busy with Windows 8 and WPF.\n"
        },
        {
            "from": "John",
            "time": "2013-03-15T06:38:00.000Z",
            "message": "\nAndroid, by default, compiles their dnsmasq settings used for tethering instead of using a config file\nFairly annoying\n"
        },
        {
            "from": "Brian",
            "time": "2013-03-15T15:43:00.000Z",
            "message": "Brian\nI just found a library to use for integration testing which allows me to write C# scripts for rendering and analyzing pages in Firefox. I am going to teach my computer how to do research on command.\n"
        },
        {
            "from": "John",
            "time": "2013-03-15T17:34:00.000Z",
            "message": "\nhttp://www.sikuli.org/ might be worth a look too, depending on what you are trying to accomplish\n"
        },
        {
            "from": "Brian",
            "time": "2013-03-15T17:35:00.000Z",
            "message": "Brian\noh yeah!  I have seen that before, that is freaking awesome.\n"
        },
        {
            "from": "John",
            "time": "2013-03-15T17:35:00.000Z",
            "message": "\nyeah\nhow's life, man?  I haven't talked to you in forever\n"
        },
        {
            "from": "Brian",
            "time": "2013-03-15T17:35:00.000Z",
            "message": "Brian\nIts pretty excellent.\nMy boss left, and good riddance, he was an awful developer.  I got a raise.  Married life is great.  I am getting new trees delivered tomorrow.  I like having a house and finding projects to work on.  I expanded the garden in the back yard and am planning to build a green house.\n"
        },
        {
            "from": "John",
            "time": "2013-03-15T17:35:00.000Z",
            "message": "\nI'm sad the house I tried to buy fell through\nI really want those projects\nIt had a 4 car garage, I was so excited\n"
        },
        {
            "from": "John",
            "time": "2013-03-15T17:35:00.000Z",
            "message": "\nYeah, congrats on the wife.  And the job getting easier.\nI've gotten several raises over here and about 1.5 years ago finally got the contractor that had been doing server admin stuff out of here\nThat guy was a little crazy.  Thanks to him we have a 13k dell server for 15 clients.  8 600GB SAS drives in the thing -  in no way do we need that, lol.\n"
        },
        {
            "from": "Brian",
            "time": "2013-03-15T17:35:00.000Z",
            "message": "Brian\nnice\n"
        },
        {
            "from": "John",
            "time": "2013-03-15T17:35:00.000Z",
            "message": "\nnow if only I could get a raise to his level, when he was working longer hours towards the end he was making 45/hr\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:32:00.000Z",
            "message": "Brian\nYou are a genius.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:32:00.000Z",
            "message": "Brian\nHELLO! \nCan you send Joe Flieger a compliment for me?\n"
        },
        {
            "from": "John",
            "time": "2016-10-12T00:32:00.000Z",
            "message": "\nHi\nYes?\n\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:32:00.000Z",
            "message": "Brian\nIts a part of a game.\nI'll send you his response.\n"
        }
    ]
}