{
    "thread": "https://www.facebook.com/messages/archived/t/katie.sharman.90",
    "participants": [
        {
            "name": "Katie Sharman",
            "description": "Physical Therapist at RehabCare",
            "url": "Former Physical Therapist at Team Select Home Care"
        }
    ],
    "messages": [
        {
            "from": "Katie",
            "time": "2005-10-05T23:05:00.000Z",
            "message": "\nA girl asked a guy if he thought she was pretty, He said...no. She asked him if he would want to be with her forever....and he said no. She then asked him if she were to leave would he cry, and once again he replied with a no. She had heard enough. As she walked away, tears streaming down her face the boy grabbed her arm and said.... You're not pretty you're beautiful. I don't want to be with you forever, I NEED to be with you forever. And I wouldn't cry if you walked away...I'd die... SO NOW I WILL SAY: I like you because of who you are to me....A true friend and if I don't get this back I'll take the hint. Tonight at midnight your true love will realize they like you. Something good will happen to you at 1:00-4:00 PM tomorrow. It could be anywhere -- AOL, Yahoo, outside of school, anywhere. Get ready for the biggest shock of your life. Please send to 15 people in 15 minutes. Remember: &#34;A good friend will come bail you out of jail.... But a true friend will be sitting next to you saying ... WE screwed up! &#34; Proud to be your Friend! Make sure you read all the way down to the last sentence, and don't skip ahead. I've learned....That life is like a roll of toilet paper. The closer it gets to the end, the faster it goes. I've learned....That we should be glad God doesn't give us everything we ask for. I've learned....That money doesn't buy class. I've learned....That it's those small daily happenings that make life so spectacular. I've learned...That under everyone's hard shell is someone who wants to be appreciated and loved. I've learned....That the Lord didn't do it all in one day. What makes me think I can? I've learned....That to ignore the facts does not change the facts. I've learned. I've learned....That the less time I have to work, the more things I get done. To all of you ... Make sure you read all the way down to the last sentence. It's National Friendship Week. Show your friends how much you care. Send this to everyone you consider a FRIEND, even if it means sending it back to the person who sent it to you. If it comes back to you, then you'll know you have a circle of friends. HAPPY FRIENDSHIP WEEK TO YOU!!!!!! YOU ARE MY FRIEND AND I am honored\n\n"
        }
    ]
}