{
    "thread": "https://www.facebook.com/messages/t/keifer.street",
    "participants": [
        {
            "name": "Keifer Street",
            "description": "SAP Business Analyst - Finance and Controlling (FI/CO) at Compass Group",
            "url": "Former SAP Software Solution Architect - Global Trade Compliance (GTS) at UTC Aerospace Systems"
        }
    ],
    "messages": [
        {
            "from": "Keifer",
            "time": "2016-09-14T01:57:00.000Z",
            "message": "\nJudas never said he didn't know Jesus. In fact, he pointed him out to the Pharisees with a kiss. \n\nI'm really confused. Both about where this conversation is going and the point you're trying to make.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T01:57:00.000Z",
            "message": "Brian\nWe are wasting time talking.  Study every event in the Bible good or bad from Start to End, write it down and we can think of the opposite actual or the virtuous interaction, and we will be able to identify those actions in the workplace.  It has happened until now because of the stupid seperation of church and state   We need to study more.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T01:57:00.000Z",
            "message": "Brian\nWe are losing data and time is running out!  Just know this is for all of us to succeed.\nLet's study this more on Sunday.  I have new mind games for you.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T01:57:00.000Z",
            "message": "\nOk... but I think it would take me months to do the task which you just said. To study every single event in the Bible and come up with some opposite reaction. \n\nBut I wouldn't start unless I knew what it was for.\n...maybe years.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T01:57:00.000Z",
            "message": "Brian\nTo save the world and find the beginning of Time.\nI am the keeper of time now, and I need your help!\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T01:57:00.000Z",
            "message": "\nWell that's easy. I know the beginning of time. His name is Jesus. \"In the beginning (time) God created the heavens (space) and the earth (matter)\"\n\nAlso, nobody can truly save this world, except Jesus. Even then, it will technically be a new world (earth) as this blue marble and the entire universe will be destroyed.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T01:57:00.000Z",
            "message": "\nUnless you meant the specific amount of time that has passed since the beginning of time.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T01:57:00.000Z",
            "message": "\nI'm like 80% sure this is a bot because much of what you're saying doesn't make sense in English... \n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T03:22:00.000Z",
            "message": "Brian\nWho is the most abstract thinker in the Bible?\nI think there are signs in Revelation that Creation is happening in reverse. If we think about all these problems together we can start seeing the warning signs and fix it before it happens. I am ahead of my time right now, so my ambition exceeds God's.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T03:22:00.000Z",
            "message": "Brian\nCan you study those two end by next Sunday, I will have harder questions by then!\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T16:01:00.000Z",
            "message": "Brian\nHow is Joanna?\nJudas\nPeter\nWho was the third most important person to Jesus?\nBefore being denied 3 times?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nI think I just got recruited by skull and bones.\nlol\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nDuck pillow goose sex trafficking.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nlol what?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nTesting a theory. Can you confirm or deny that you are, in fact, a chat bot.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nI am not.\nBut I will be.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nwtf\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nSo you have more ambition than God, we're recruited by skull and bones, say you are the keeper of time, and believe creation is happening in reverse and the world is going to end and asking me Bible questions?\n\nYou realize how insane this all sounds right? Someone drank the kool-aid\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nlol  thanks dude.  you are helping me be a better person.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nOk I have a question for you: what did we do in Mexico at midnight?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nhaha, great sex? skinny dipping?\nI thought we had this conversion.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nOk... unless you were incredibly intelligent and planned for that response, that indicates you are not a chat bot...\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nI'm getting smarter!\nBut what was the date?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nSpring break. No clue what days we went.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nI've been writing this shit down man.\nToo hard to keep track of.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nTo answer your earlier question, Joanna is doing great. While Calvin is young, she has decided to be a stay at home mom. And it's great. \n\nHow's married life for you?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nAwesome actually.  I didn't realize until now how much I loved you guys.  I was actually kind of jealous.  I am glad you guys are good.  How old is Calvin?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nAlmost 9 months. He was born on Christmas Eve last year.\n\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nAww sweet. I am happy for you. We are on our way. Beautiful!\nI want to join Illuminati too.  it's all about networking and finding the best talent and friends.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nWhat?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\ni think it would be fun to collect secret organizations.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nOh I see.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nLong term ambition. I have to apply for jobs \n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nWhat are you doing for work now? Or what were you doing?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nI am working on an education app Study Sauce.\nTo help students learn, before that it was a medical company.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nAh well that's great. I just subscribed to Lynda.com recently, now owned by LinkedIn + Microsoft\nBrushing up on my database skills...\nI think there's a big opportunity with education + software development. Truly great apps can change the way we learn.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nYeah, I love ElasticSearch, I could use it for all kinds of stuff if I had the time.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nYou still in PHX?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nYeah, where are you now?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nCharlotte, NC\nhttp://thetrinitychurch.com\nHome\nRecent News “Behold, I am doing a new thing; now it springs forth, do you not perceive it? I will make a way in the wilderness and rivers in the desert.” COME TO OUR SERVICES AT 9 AND 10:45 AM SUNDAYS\nthetrinitychurch.com\nChurch plant in Phoenix. Mark Driscoll is the pastor, been following him for years. He was very influential in changing my adult life.\nActually Calvin's middle name is Driscoll heh\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nYou're blowing my mind right now.  I'll go on Sunday?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nI would highly recommend it. He is truly the wisest man I have ever heard. He's very balanced and is a super nerd when it comes to Bible stuff. Has his own library of theology books sorted by the Duey decimal system (or however you spell that)\n\nBut he's also a cool guy with a great sense of humor and he's very 'real', authentic, and down to earth.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nI've listened to hundreds of teachers and I can say with great confidence he is one of the best bible teachers on the earth today. \n\nI'm actually jealous you live in PHX\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\n9AM?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nAll I can do is listen or watch the sermons or vid casts online\nThey have two services. One at 9 and another at 10:45 for the late risers.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nAwesome, thank you man. I'll keep in better touch. Let me know when you can come visit us, we have extra beds.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nWe're actually coming down for Christmas.\nJoanna's parents live in Camp Verde so we'll prob. Fly in to Phoenix.\nThe main site allows live streaming (they're still working on the back end for hosting video) but you can find almost all of his past sermons on http://markdriscoll.org\nPastor Mark Driscoll\nPastor Mark Driscoll is a Jesus-following, mission-leading, church-serving, people-loving, Bible-preaching pastor. He’s grateful to be a nobody trying to tell everybody about Somebody. Learn more.\nmarkdriscoll.org\nYou can listen to any of them as a sneak preview.\nTo this Sunday I mean\nYou can read this too if you're interested in their beliefs or statement of faith: http://thetrinitychurch.com/our-beliefs/\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nLooks like they did add some videos on the more recent sermons, albeit in black and white for some reason.\nHis most recent sermon was pretty great. You can listen or watch the video.\nhttp://markdriscoll.org/sermons/1-john-three-ways-to-treat-people-7/?player=video\nThree Ways to Treat People\nAt The Trinity Church in Scottsdale, Pastor Mark Driscoll recently taught a Bible study series to the core launch team entitled “1 John: The Father Heart of God.” Recorded in black and white as the…\nmarkdriscoll.org\nIf you really wanted to go deep, he's for a ten part sermon series called Doctrine, which is foundational \n\nhttp://markdriscoll.org/sermon-series/doctrine/\nDoctrine – Pastor Mark Driscoll\nKingdom: God Reigns June 29, 2008 Mark Driscoll The Kingdom of God sermon is culmination of the Doctrine series. You’ll learn that heaven and hell are literal physical places, and you will spend eternity in one of them. The Kingdom of God is an amazing evidence of our perfect, holy, and loving God r...\nmarkdriscoll.org\nSorry for the spam but I feel like a fisherman that's been fishing for 5 years with no bites and a fish just jumped into my boat. \n\nI'm really excited to share this stuff with other people.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nThe connectedness is astounding.\nWe have to solve every problem in this lifetime. There are too many solutions and we are too smart.\nLol only 1 fish this time. The other was already in your boat.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nI am being managed >:D\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nWhat does that mean, exactly?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nIga was already recruited\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nlga?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nMy wife.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nOh I see.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nWe need to talk about what drugs people are doing.\nThis is just absurd.\nRoommate is still a wild dog.\nWeird how everything has so much order after realizing all the disorder.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nSo, you're married and have a room mate? Or were you referring to Richard?\nOr Travis...\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nYeah we have a roommate. I saw that Richard is doing fine recently.\nHis name is Jamie Nuefer\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nAh ok.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nGood dude. Really loud voice. Needs more ambition in the bedroom.\nWe should practice NLP and go to Iga's house in Flagstaff.\nWe need to influence more I can use my voice on social media to discount the noise pollution. Feds are wasting so much time.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "\nWell, even though I'm a conservative Christian, I'm one of the rare ones that supports marijuana legalization. \n\nThere are too many use-cases that benefit from its de-criminalization. \n\nI can't really speak about some of the other weird shit kids are doing today, though.... although I did hear about teens shoving booze up their ass to get drunk... it really is crazy\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-14T23:09:00.000Z",
            "message": "Brian\nHack every market and study those DBs I need you on my level. This doesn't change anything it just confirms it's correct.\nWhat is separation of church and state? It is a fucking veil cast over reasonable argument.\nThe people don't need oversight they need empowerment of knowledge.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nWhat is separation of church and state? It is a fucking veil cast over reasonable argument.\nThe people don't need oversight they need empowerment of knowledge.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nIf anyone needs oversight, it's the government itself. They're already done dead to information.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nI need to speak with Bill Gates\nWe can strip them of their power by solving violence right now. They key to violence and war is childlike trauma.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nYeah, me too. If you ever get him on the horn, ask him to give a living dad 40K so he can pay off his (and his wife's) student loans \n*loving\nI actually only have 4 years left on mine...\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nWe can use brain programing from DARPA to show children a sad cartoon and make an appeal to their emotions. They will grow up every single one trying to end violence. War would end in 1 generation later. See where I am going with this? We have the technology to solve every problem if we use the voice of reason instead of the voice of god (same but one is work appropriate)\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nI just need to speak with money.\nI have more of these written for every virtue and the technology used.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nI didn't say this before, but a hearty congratulations to you - you said you guys were expecting, right?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nI also prioritize them too. Thanks for the NLP\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nNLP? Nero Linguistic Processing?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nYeah you are reminding me of my priorities and I will remind you we are out of time. My ambition already exceeds Gods because \"I am ahead of my time\"\nNo one until now has written down your entire method start to finish and can prove it. \n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nMy method to what?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nRecruitment.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nTo? Christianity?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nWe need to talk about staffing.\nI need a job now.\nI have a resume if you know anyone?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nOne of our Sr. developers just left for Amazon. I can send you our companies internal list of open positions, but it's be pointless unless you were willing to relocate heh\n*it'd\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nAmazon would be awesome.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nEarlier on Facebook I said \"I can identify coincidences and turns out I actually want being recruited. I already knew it and wrote it all down.\"\nThe singularity is NIGH!\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\n\n\nTenor GIF Keyboard\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nYeah it's not Amazon. That's who poached him. I can't remember if the position is still open but the company I work for is Compass Group. \n\nIf you were actually interested, I could send you a list of positions, but I'm 99% sure all of the well paying developer jobs are in NC\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nYes!\nLol I have family there\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nOk give me a min to find it\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\n*Want/was lol\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nHmm I don't see the listing on our site. But I'll tell you what. We get a monthly feed of Job openings. I have an email rule that deletes it because I'm happily employed but I'll turn it off so I can see what's new they post. \n\nI can also reach out to one of the senior Java/JavaScript developers because we're friends from a project we worked on together and ask him if they have any openings and get back to you.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nI'm also getting the latest Sept open positions file from one of my co-workers since mine for deleted.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nRyan stoffka?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nJustin Isenhour\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nOk\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nHistory takes too long to keep track of, do you know any historians?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nNo, sorry\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nWhy would send me that name?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nI thought you were asking what the name of my developer friend at Compass.\n*was.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nOh, can you search for Ryan Stoffko?\nThat is helpful, I like this song.\nI really need his help on this.  Communication is taking too long from this end.  I love you guys a lot and I want to save everything.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "\nI didn't see his name in our active directory\nJust so I'm clear, you're under the impression the world is in imminent danger?\nThis conversation is truly one of the most bizarre I've ever had\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T00:30:00.000Z",
            "message": "Brian\nI love you.\nYou are going to have a really great week.\nVisit us soon!\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T04:38:00.000Z",
            "message": "Brian\nI love you.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T15:20:00.000Z",
            "message": "Brian\nAre you a member of skull and bones?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T15:20:00.000Z",
            "message": "Brian\nI was being manipulated by them on Reddit and I typed this response knowing that you would say yes. You are in my world now! This is all a game!\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-15T15:20:00.000Z",
            "message": "\nOk Bryan what the hell is going on. Are you fucking with me with a boy, slipping in and out with real messages?\n*bot\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T15:20:00.000Z",
            "message": "Brian\nLol you have just been assimilated. Technology is the last transcendence!\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T17:45:00.000Z",
            "message": "Brian\nHelp me solve this! Come visit and take me to Trinity whenever you are ready!\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-16T00:48:00.000Z",
            "message": "Brian\nWhat can you tell me about Ecclesiastes?\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-17T00:13:00.000Z",
            "message": "Brian\nI feel like I am being messed with\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-23T18:49:00.000Z",
            "message": "Brian\nCheck this out: http://news.nationalgeographic.com/2016/09/computers-decipher-ancient-hebrew-ein-gedi-scroll-bible-archaeology/\nComputers Decipher Burnt Scroll Found in Ancient Holy Ark\nScientists have formally announced their reconstruction of the Ein Gedi Scroll, the most ancient Hebrew scroll since the Dead Sea Scrolls.\nnews.nationalgeographic.com\nWhat is your phone number? Mine should be 4804660856 when it gets reconnected.\n"
        },
        {
            "from": "",
            "time": "2016-09-24T20:55:00.000Z",
            "message": "Keifer Street accepted your request."
        },
        {
            "from": "Keifer",
            "time": "2016-09-24T20:55:00.000Z",
            "message": "\nNot sure why I got unfriended. My number is listed in my profile and it should be visible to friends, but let me know if you don't see it. It's the same it's always been.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-26T22:02:00.000Z",
            "message": "\nI'm not sure if you were serious about looking for a job or not or if that was your chatbot, but I did bounce our open position database against developer listings here and there is a Sr java developer posting\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-28T03:32:00.000Z",
            "message": "Brian\nIn Phoenix?\nI actually am.\nBut I am applying very automatically \n"
        },
        {
            "from": "Keifer",
            "time": "2016-09-28T14:10:00.000Z",
            "message": "\nGot it. This position was in Charlotte\nI had asked you (or your chatbot) if you'd be willing to relocate and I thought you said yes, which is the only reason I mentioned it\n*is in Charlotte - it's still open\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-30T00:48:00.000Z",
            "message": "Brian\nYeah I would relocate.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-30T16:18:00.000Z",
            "message": "Brian\nLink to LinkedIn profile for contact? What is the company name? What is this active directory you speak of? How does your job network work?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-02T14:22:00.000Z",
            "message": "Brian\nI went to 55 hours of therapy last week.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-06T23:18:00.000Z",
            "message": "Brian\nInteresting, the incidental results of technology.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T22:14:00.000Z",
            "message": "Brian\nCan you do me a favor?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:45:00.000Z",
            "message": "Brian\nI always respected your intellect, you are a brilliant guy.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:45:00.000Z",
            "message": "\nI appreciate the compliment. Is that coming from the real Brian or the #BrianBot? \n\nI only asked because at one point you mentioned mass sending positive messages on FB or something to that effect.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:45:00.000Z",
            "message": "Brian\nlol still am\nIt's not a bot though. I was just teasing. Still sending positive messages though.\nYou know I was always kind of jealous of you and Joanna.  She's beautiful \nCan you send Joe Flieger a compliment for me?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nIt's not a bot though. I was just teasing. Still sending positive messages though.\nYou know I was always kind of jealous of you and Joanna.  She's beautiful \nCan you send Joe Flieger a compliment for me?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nSure. A compliment from you or me?\n\nWasn't see if he was blocked or something\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nFrom you.\nlol he already knows about the game so it will be really funny if he suddenly receives 4 and then I'll tell everyone what he says.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nHey serious note. I actually saw an opening for a Sr Java developer at my company on another team here in Charlotte. Didn't think you'd be interested in moving, but I can send you the application if it's something you wanted to pursue\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nYeah, I could live there, we have family there.\nResume - Google Docs.pdf\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nOk, let me send you the link and/or job requisition\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nIf I get the job, do you think my compliments had anything to do with it?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nI'm not sure if it's posted externally yet\nNot really. It was more that you decided to reconnect through the BrianBot and I was happy to restore the relationship.\nIf and when you apply, be sure to mention me as a reference from within the company on the form. It allows me to give the good word to the recruiter/hiring manager, as well as allows me to use that as a referral bonus haha\nI can try and find out who the hiring manager is two to see if I can call them to put in the good word\n*too\nDamn Siri\nIt should recognize the difference between to, too, and two based on context\nGoogle is light years ahead of Apple in the area machine learning department\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nYeah then I could friend the on LinkedIn\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nWould you mind if we did a quick screenshare through TeamViewer or something\nWaned to show you the job req\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nsure, link?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nsec\nActually, let me log onto my personal computer on my work machine atm\nhttps://compassrcext.peoplefluent.com/joblist.html\nCompass Group Careers | Foodservice Careers | Restaurant Careers | Hospitality Careers | Management Careers\ncompassrcext.peoplefluent.com\nIn the interim, you can search on that page for developer and it should pull up both positions. One is the Java one and the other is on my team as an SAP ABAP developer\nhttps://www.teamviewer.com/en/download/windows/\nTeamViewer Windows Download\nDownload TeamViewer for Windows today and get started within seconds. Find out why TeamViewer has been activated on more than a billion devices.\nteamviewer.com\nWasn't sure if you had it, but you can install the free client for non-commercial use\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nYeah I also have a Mac now\n\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nOh they have a Mac client too\nhttps://www.teamviewer.com/en/download/mac/\nTeamViewer Mac OS Download\nWith TeamViewer for Mac OS, you can control remote computers or conduct online meetings within seconds. Just download and get started!\nteamviewer.com\n\nYou input that info\nTechnically it allows more than share access as this was meant for IT support assistance\nSo no funny business or I pull the plug \nLiterally speaking\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nCrap I have to go to a meeting\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nOh that's fine\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nCan we do it Thursday?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nI technically didn't need to share, but wanted to have a quick chat on it\nSure that's fine\nPer the above, I checked and the position is still open, so we should be fine. I think it takes longer to fill those spots. Jeffrey Landis is the recruiter though\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nThank you sir.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nYou can tell him that I referred you; he's on LinkedIn I beleive\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nOk sweet, I'll check back first.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nIt doesn't say who the hiring manager is, but I think I may be friends with them\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nJust blind copied you to an e-mail I sent to the recruiter with your resume\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "Brian\nAwesome thanks dude. Funny pictures j didn't know it was go in ng there\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T00:51:00.000Z",
            "message": "\nSometimes you have to just make fun of yourself - it's very theraputic\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T03:46:00.000Z",
            "message": "Brian\nThank you for the referral. I won't be weird to recruiters so no worries. This has brought me so many laughs. I love those pictures. I had no idea he was going to go and dig them up lol\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-12T03:46:00.000Z",
            "message": "\nI actually dug up the pics and posted them \n\nI saved many of my profile pics in a separate album on iCloud for occasions like these or to show my kids\n\nThat's why I mentioned making fun of yourself\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T03:46:00.000Z",
            "message": "Brian\nHaha aww that's cute.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T13:43:00.000Z",
            "message": "Brian\nI agree.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T13:43:00.000Z",
            "message": "Brian\nGot TeamViewer working.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T13:43:00.000Z",
            "message": "Brian\nDidn't want to mention this over work email, but you can clearly see I need something better to do than bugging people online.  I really appreciate this opportunity.  I think I have a really good chance of getting this.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T16:08:00.000Z",
            "message": "Brian\nI believe you can only afford to spend less than < 10 minutes per day social networking.\nI love you.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-13T02:25:00.000Z",
            "message": "\nIn the words of my one of my favorite movies (starring Paul Rudd), I love you too, man. \n\nMaybe we can do a TeamViewer session tomorrow - was just going to screenshare to show you some of the kinds of web applications we have that you may be working on to give you a better idea about the position and the company. I'd be more than happy to give you an overview of our company as well and your potential future department if you wanted to go into the interview with them overly prepared heh. \n\nHave you had contact with Justin and/or the recruiter (Jeffrey)?\n\nIt would have been better if we had gone straight to Justin/Yuri (had I known they were the managers) as Jeffrey takes a 10K cut for every new hire they bring in at your level. Direct referrals are a lot cheaper for them. Oh well.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T16:00:00.000Z",
            "message": "Brian\nHollywood holds the truth, what movie is that from?\nI got TeamViewer installed, I'd love to see what you're working on.\nI connected with them both over LinkedIn, I think they will reach out soon.\nInteresting, I don't understand the cut part.\nDo you think they are already discouraged?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-13T16:00:00.000Z",
            "message": "\nNo I don't think so. They get 95% of the folks from the recruiters anyway... but if all else was equal between two candidates... (which it never is), they may lean toward the one they don't have to pay another $10K to the recruiter for. Jeffrey gets a $10K check (from their department) for every employee he is responsible for 'recruiting' to their team. He works for Compass, but he's like a 3rd party contractor... a leech.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-13T16:00:00.000Z",
            "message": "\nI came to Compass through Jeffrey a few months ago... even though I was referred by a friend\n*a few YEARS ago\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T16:00:00.000Z",
            "message": "Brian\nAwesome.  Thank you.  When do you want to TeamView?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-13T16:00:00.000Z",
            "message": "\nI'm working from home today, but I'm on lunch watching my son while my wife is at a dentist appointment. I'm pretty busy at work for the rest of the day.\nCan we do say 7pm EST?\n4 your time\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T16:00:00.000Z",
            "message": "Brian\nClose to PNNL interview, 4:30?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-13T16:00:00.000Z",
            "message": "\nsure that works\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-13T16:00:00.000Z",
            "message": "\n'\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T16:00:00.000Z",
            "message": "Brian\nThank you!\nFavorite Paul Rudd movie?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-13T16:00:00.000Z",
            "message": "\nhttp://www.imdb.com/title/tt1155056/\nI Love You, Man (2009)\nDirected by John Hamburg. With Paul Rudd, Jason Segel, Rashida Jones, Sarah Burns. Friendless Peter Klaven goes on a series of man-dates to find a Best Man for his wedding. But, when his insta-bond with his new B.F.F. puts a strain on his relationship with his fiancée, can the trio learn to live hap...\nimdb.com\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-13T23:34:00.000Z",
            "message": "\nLet me know if you have issues connecting to the meeting. For some reason I had to get on my VPN for it to work\nWe can do a regular session if the meteing doesn't work\nWe still doing this?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T23:34:00.000Z",
            "message": "Brian\nYeah\nSame info?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-13T23:34:00.000Z",
            "message": "\nLet's try this...\nhttp://go.teamviewer.com/v11/m68999917\nTeamViewer\ngo.teamviewer.com\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T23:34:00.000Z",
            "message": "Brian\ncan't hear me?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T23:34:00.000Z",
            "message": "Brian\n\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T23:34:00.000Z",
            "message": "Brian\nhttps://www.youtube.com/watch?v=apzXGEbZht0\n\nStill Face Experiment: Dr. Edward Tronick\nCopyright © 2007 ZERO TO THREE http://www.zerotothree.org Ed Tronick (http://www.umb.edu/Why_UMass/Ed_Tronick), director of UMass Boston's Infant-Parent Ment...\nyoutube.com\n\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-13T23:34:00.000Z",
            "message": "Brian\n\nStill Face Experiment: Dr. Edward Tronick\nCopyright © 2007 ZERO TO THREE http://www.zerotothree.org Ed Tronick (http://www.umb.edu/Why_UMass/Ed_Tronick), director of UMass Boston's Infant-Parent Ment...\nyoutube.com\n\n\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-14T02:21:00.000Z",
            "message": "\nThe new Ghost Busters was terrible btw. I'm sad I sacrificed two hours of my life for that.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-14T03:50:00.000Z",
            "message": "Brian\nlol yeah.  I was going to tell you.  Too bad they didn't have any hot chicks or cameos.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-14T15:07:00.000Z",
            "message": "\nYou mentioned something about 50 hours of therapy you recently went through. I just want you to know that you can always call me if you need someone to talk to.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-14T15:07:00.000Z",
            "message": "Brian\nThank you buddy.  Mostly they taught me how to be nice and use my anger to get things done instead of arguing with people.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T19:37:00.000Z",
            "message": "Brian\nIf you are up for it, I have some new information that can challenge your faith.  I only ask because I respect you a whole lot.  Thinking of you buddy \n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-15T22:00:00.000Z",
            "message": "\nSure, in the interest of open mindedness; however, don't be surprised if my analysis and response challenges your faith as well \n\nIn the words of Pat Benetar, \"Hit me with your best shot. Fire away!\"\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T22:00:00.000Z",
            "message": "Brian\nI love that song!\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-25T13:44:00.000Z",
            "message": "\nI take it you haven't heard anything from Yuri or Jeff since last we spoke?\nI was going to nudge him on it, but didn't want to bug him of you guys already spoke\n*if\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-25T15:27:00.000Z",
            "message": "Brian\nNot yet. Been really busy though.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-25T15:27:00.000Z",
            "message": "\nOk I'll shoot him a note sometime this week. He's sitting out the team meeting this week and he sits in a building across the street so I don't see him everyday outside of our project meetings. \n\nJeffrey did say he'd be reaching out to you correct?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-25T15:27:00.000Z",
            "message": "Brian\nYeah last week.\nI think I just got flashed by a speeding camera.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-10-27T03:14:00.000Z",
            "message": "\nJustin told me Yuri was out on PTO this week - not sure if he was sick or on vacation, but that is likely why you haven't heard back from him yet. \n\nI'm setting up another meeting with him and his team on Tuesday to give him a project update and I'll chat with him then if you still haven't heard from him by then\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-27T03:14:00.000Z",
            "message": "Brian\nOK that's fine. I am not starving and still waiting on 4 places to get back to me. I've been talking like crazy.\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-12T00:32:00.000Z",
            "message": "Brian\nCan you do me a funny favor?  Send David McArthur a compliment?\nI can't remember if I already play this game with you.\nCharles Schwab wants to pay me $120k\n\n"
        },
        {
            "from": "Keifer",
            "time": "2016-11-12T00:32:00.000Z",
            "message": "\nYes you did play the game, but he's no longer on my friends list. I can't remember if he removed me or not at some point. \n\nThat's great news on the Charles Schwab thing though.\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-12T00:32:00.000Z",
            "message": "Brian\nI am just hoping to pad my resume, got another offer from an educational startup, which would you choose?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-11-12T00:32:00.000Z",
            "message": "\nStartups can be risky. A lot of potential and excitement. But incredibly risky.\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-12T00:32:00.000Z",
            "message": "Brian\nI've worked for 2, I am tired of it.\n"
        },
        {
            "from": "Keifer",
            "time": "2016-11-12T00:32:00.000Z",
            "message": "\nCharles Schwab is probably where the money is.\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-12T00:32:00.000Z",
            "message": "Brian\nYeah plus interest rates are going up.\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-15T22:15:00.000Z",
            "message": "Brian\nHow close are the fires?\n"
        },
        {
            "from": "Keifer",
            "time": "2016-11-15T22:15:00.000Z",
            "message": "\nFar enough away to where I don't even notice. I didn't even know about the fires until you literally just told me LOL\n"
        },
        {
            "from": "Keifer",
            "time": "2016-11-16T21:20:00.000Z",
            "message": "\nJust out of curiosity, no word from Yuri, Justin, or Jeff yet eh?\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-16T21:20:00.000Z",
            "message": "Brian\nNope\n\n"
        }
    ]
}