{
    "thread": "https://www.facebook.com/messages/archived/t/kelsey.kosan",
    "participants": [
        {
            "name": "Kelsey Kosan",
            "description": "Substitute Teacher at Brown Elementary at Natick Public Schools",
            "url": "Former 3rd Grade Teacher at Phoenix Advantage Charter School"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2008-03-25T02:26:00.000Z",
            "message": "Brian\nHey! Hows it going?\n"
        },
        {
            "from": "Kelsey",
            "time": "2008-03-25T02:26:00.000Z",
            "message": "\nWell,\nI just told Jefferey, Someone got a hold of password for my VISTA LOUIE, and webmail account. This person dropped me from all my classes this semester, so now I am going to the registrar tomorrow to get re-enrolled. How's it going with you?\n"
        },
        {
            "from": "Brian",
            "time": "2008-03-25T02:26:00.000Z",
            "message": "Brian\nSounds like a pain, but I am sure it can be fixed. Not the first time it has happened, I know because I work in IT. You should use a more secure password, do you know anyone that would do that to you? I had fun with spring break and been really busy with all Computer Science classes this semester!\n"
        },
        {
            "from": "Kelsey",
            "time": "2008-03-25T02:26:00.000Z",
            "message": "\nOh cool I didn't know you work IT. When do you work? What do you mean this isn't the first time it has happened?\n"
        },
        {
            "from": "Brian",
            "time": "2008-03-25T02:26:00.000Z",
            "message": "Brian\nPeople share their passwords or it gets into the wrong hands all the time. Somehow people get other people's passwords and decide to mess everything up on their account. It has happened before so I am sure the registrar will be understanding. I work for CENS-IT which is the College of Engineering and Natural Sciences. I get paid to do my homework. Do you still work at Safeway?\n"
        },
        {
            "from": "Kelsey",
            "time": "2008-03-25T18:09:00.000Z",
            "message": "\nNo I don't work at Safeway anymore. I had issues with trying to get a couple weeks off for winter break. I know you siad you worked for CENS-IT, but you wouldn't be able to llok into this problem with IT would you?\n\n"
        }
    ]
}