{
    "thread": "https://www.facebook.com/messages/archived/t/leahshanker",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2009-09-01T19:13:00.000Z",
            "message": "Brian\nW/e, I took it down because it was sitting open on my kitchen table, you should have checked it a week ago!  Besides, aren't you in favor of being an IT expert like your e-mail said.  What better way to become so, than to manage, install, configure all these technologies yourself!?  Google Sites and Wordpress do all the hard stuff for you  \n<- Server Admin FTW\n"
        },
        {
            "from": "Brian",
            "time": "2015-10-03T02:02:00.000Z",
            "message": "Brian\nI just started using a Macbook Pro full time and thought you for some reason.  I always admired you and Matt for your technical skillz.  How is life?  My favorite memory is working on Dr Scheme together.  Marriage has taught me a lot about solidarity.\n"
        },
        {
            "from": "Leah",
            "time": "2015-10-03T02:02:00.000Z",
            "message": "\nHey, good to hear from you! Congratulations on your marriage!\nLife's good. I am making wine in southern AZ now - I ran screaming from the tech industry.\nHow are you doing?\n\n"
        },
        {
            "from": "Brian",
            "time": "2015-10-03T18:44:00.000Z",
            "message": "Brian\nDang I don't blame you. I hope I am not in this industry much longer. It's taking an awful toll on my back. I've worked for startups since college. Usually 12 hour days in front of the computer. Lately studysauce.com it's an online course to help students learn how to study. We are making an app like flashcards but they are downloadable and remind you to go through them following the \"forgetting curve\". Bought a house at scottsdale and frank lloyd wright. Added a dayroom to the side of it. Got two little dogs and a bird and gold fish. Wine making sounds awesome! Sounds like the perfect combination of science and the love of wine. Do you like Caduceus? What is Matt up to? I saw his tweet that he left Amazon. I read they overwork their techies too.\n"
        },
        {
            "from": "Brian",
            "time": "2015-10-03T18:44:00.000Z",
            "message": "Brian\nApparently your mom and my wife have met in an art gallery in flagstaff. I'd love for you to meet Iga, she is way cooler than I was in college.\n"
        },
        {
            "from": "Brian",
            "time": "2016-05-26T19:59:00.000Z",
            "message": "Brian\nRemember that User Interfaces class we took together?  That was fun.  I pretty much get to do that full time now.  I've learned it still sucks because I don't get to spend enough time outside.\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-13T02:25:00.000Z",
            "message": "Brian\nHack every industry I need your brain on this.  Now you know as much as I do.\nhttps://www.gatesnotes.com/Books/Mindset-The-New-Psychology-of-Success\nWhat You Believe Affects What You Achieve\nBill Gates reviews the book “Mindset” by author Carol Dweck.\ngatesnotes.com\n"
        },
        {
            "from": "Brian",
            "time": "2016-09-15T15:21:00.000Z",
            "message": "Brian\nI need your brains!  We are on another level!  This is all a game!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T02:11:00.000Z",
            "message": "Brian\nI see you. https://youtu.be/6NXnxTNIWkc\n\n4 Non Blondes - What's Up\nMusic video by 4 Non Blondes performing What's Up. (C) 1992 Interscope Records\nyoutube.com\n\n"
        }
    ]
}