{
    "thread": "https://www.facebook.com/messages/t/Lloydster4",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "Brian",
            "message": "Brian\nI am also looking forward to Rage\n",
            "time": "2011-06-13T05:28:00.000Z"
        },
        {
            "from": "Eric",
            "message": "\nI haven't upgraded my rig for a while now\n",
            "time": "2011-06-13T05:28:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nbut I have months to wait in eager anticipation of its very delayed release\n",
            "time": "2011-06-13T05:28:00.000Z"
        },
        {
            "from": "Eric",
            "message": "\nI wasn't planning to get it, myself, until blake griffin did the tiger jump\nhow easily our minds are shaped by clever marketing....\ntake care, sir\ndrink a boilermaker in my honor!\n",
            "time": "2011-06-13T05:28:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\ngoodnight\n",
            "time": "2011-06-13T05:28:00.000Z"
        },
        {
            "from": "Eric",
            "message": "\nor a bear fight if you want to be a BAMF\n",
            "time": "2011-06-13T05:28:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nWe should hang out sometime soon!\n",
            "time": "2011-07-22T05:39:00.000Z"
        },
        {
            "from": "Eric",
            "message": "\nHey Brian,\n\nMy employer is currently looking for someone with experience in website design.  Do you know anyone that you could recommend?  Any help would be appreciated.\n\n-Eric\n",
            "time": "2012-04-20T22:05:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nSure! Depends on what, specifically, he is looking for.  I do a bit of web-design myself.  However, I would only be available to work a few hours in the evenings, and your employer would have to know visually exactly what he wants.  I always recommend a company I use to work with, redkeysolutions.com, however, I think his best bet is to just go with GoDaddy.  They will design a website and get him all set up with what he needs.\n",
            "time": "2012-04-24T22:50:00.000Z"
        },
        {
            "from": "Eric",
            "message": "\nThanks for the reply.  He has the domains registered through GoDaddy, but we are currently unsatisfied with the aesthetic quality of the sites.  I tried putting them together using the code from his previous site, but I'm only working with a small understanding of HTML and nothing more.\n\nUnfortunately, I don't exactly know what we need to make improvements.  I'm assuming that some Java and CSS would go a long way?  The only website we've published so far is at http://www.cleverlegal.com/\n\nI'd be more than happy to put you in contact with him if it looks like work you'd be interested in.  If not, is this something a college upperclassman could do?  My boss prefers working with people directly.  Though I'm assuming we will need a professional service to help with SEO at some point?\n\nHope everything is going well for you.  I heard you landed yourself some real estate, and it sounds like work is keeping you busy.\n\n-Eric\nHome Page\nCheck out http://cleverlegal.com! Home Page\ncleverlegal.com\n",
            "time": "2012-04-26T22:28:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nThe site looks good to me, what kind of style are you looking for?\n",
            "time": "2012-04-27T02:54:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nQ: What kind of car does Mickey Mouse's wife drive?\nA: A minnie van!\n",
            "time": "2017-11-14T23:55:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nI'm thankful for you!!\nI'm thankful for you!!\nI'm thankful for you!!\n\n",
            "time": "2017-11-23T17:10:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nLiving the dream? Mm\n",
            "time": "2017-11-23T02:32:00.000Z"
        }
    ]
}