[
    {
        "comments": [],
        "description": "Mark McClane  shared  United 4 Truth 's  video .",
        "participants": [
            "https://www.facebook.com/mark.mcclane.357?fref=nf",
            "https://www.facebook.com/mark.mcclane.357?hc_ref=ARQxr0kUD6ORijfVneTSJYoUdWIyLSJDythwMAsQ0iiYK2YutUlYhd7v4l5dDx4OIBE",
            "https://www.facebook.com/United4Truth/?hc_ref=ARQxr0kUD6ORijfVneTSJYoUdWIyLSJDythwMAsQ0iiYK2YutUlYhd7v4l5dDx4OIBE",
            "/United4Truth/videos/490682811304863/?hc_ref=ARQxr0kUD6ORijfVneTSJYoUdWIyLSJDythwMAsQ0iiYK2YutUlYhd7v4l5dDx4OIBE"
        ],
        "post": "https://www.facebook.com/mark.mcclane.357/posts/1996253580659754",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "This is why my  # cannabis  trial is so crucial! We must destroy the stigmas!!!  http://bit.ly/PleadThe5th",
                "from": "https://www.facebook.com/JesusAndTheAngels?fref=ufi&rc=p Erik Kulick",
                "time": "October 26 at 9:30pm"
            },
            {
                "content": "They need to come up with a transdermal patch that transfers the medical marijuana to his bloodstream in controlled doses all day long.",
                "from": "https://www.facebook.com/justin.pinkus?fref=ufi&rc=p Justin Pinkus",
                "time": "November 3 at 3:41am Edited"
            },
            {
                "content": "I’ve seen a couple of people use marijuana to help them with their disabilities but this one literally had me saying “wow” out loud.",
                "from": "https://www.facebook.com/chargerboy87?fref=ufi&rc=p Edgar Mendoza",
                "time": "October 25 at 7:32am"
            },
            {
                "content": "He's lucky he didn't overdose with how much of the pots he just smoked. Extremely dangerous way to be normal, and although his tics stop, his life is probably in shambles from being a marijuana addict. You would think the doctors could give him something safer, like a high-strength opiate he can take multiple times a day. VERY scary means of self medication.",
                "from": "https://www.facebook.com/matt.laforce.16?fref=ufi&rc=p Matt LaForce",
                "time": "November 1 at 4:23pm Edited"
            },
            {
                "content": "\"Marijuana is a terrible drug with zero benefits\".  Riiiiggghhhtt. This isn't the first video I've seen of weed helping people. If you don't want to, don't smoke it. But don't keep it from the people it helps just because you don't partake.",
                "from": "https://www.facebook.com/ZckDugan91?fref=ufi&rc=p Zack Dugan",
                "time": "October 27 at 12:06am"
            },
            {
                "content": "The healing of cannabis isn't what keeps it illegal. It can literally replace all the big industries. (Lumber, plastic, big pharma, clothes....you name it)",
                "from": "https://www.facebook.com/ashlee.daniels.94?fref=ufi&rc=p Ashlee Michael",
                "time": "November 3 at 6:34pm Edited"
            },
            {
                "content": "Damnnnnn i aint shit..... thought he was beatboxing when i first turned this video on. Next joints on me for being a piece of shit.",
                "from": "https://www.facebook.com/profile.php?id=100000998841443&fref=ufi&rc=p Daniel Jackson",
                "time": "October 31 at 4:33am"
            },
            {
                "content": "Marijuana is Gods medicine. I don't care what the problem,  physical and mental.  It's 2017 if you honestly believe that people are just looking for a high, your very ignorant.  Prescription drugs lead to heroin addiction and kills your liver in the process.  Marijuana is the true medicine.",
                "from": "https://www.facebook.com/HersheyFactory?fref=ufi&rc=p Teaira Anderson",
                "time": "October 27 at 4:22am"
            },
            {
                "content": "My ten year old son has complex Tourette’s and it’s horrible, he punches walls, has paralysis tics (can’t move as his muscle lock up), tics that look like he is having a fit, has coprolalia (swearing and other taboo words) and has already said he wants ... See More",
                "from": "https://www.facebook.com/belinda.milne.79?fref=ufi&rc=p Belinda Wsol Milne",
                "time": "October 29 at 10:20pm"
            },
            {
                "content": "Damn I feel bad for him, no one should live that way. And if weed helps him calm like that, they should legalize it already.",
                "from": "https://www.facebook.com/profile.php?id=100009556666837&fref=ufi&rc=p Oliver Clytus",
                "time": "October 28 at 2:14pm"
            },
            {
                "content": "Yes is understandable but what about you that does it without  no need of it! Don’t do drugs guys for it’s not a safe thing to do, some people get hooked on harder drugs because there weak minded and that’s how it starts, suddenly your life turns to ch ... See More",
                "from": "https://www.facebook.com/jesse.sanchez.58152559?fref=ufi&rc=p Jesse Sanchez",
                "time": "October 27 at 2:12pm"
            },
            {
                "content": "For the people saying this is fake, no it is not. Many people who have Tourette Syndome have seen major improvements by smoking marijuana . My son takes CBD oil and it helps reduce his tics and helps with his pain. Marijuana is not legal here, so he has never been able to see how smoking it would improve his symptoms. They need to legalize it already!!",
                "from": "https://www.facebook.com/hillary.fairchild.1?fref=ufi&rc=p Hillary Turner Fairchild",
                "time": "October 25 at 10:15pm"
            },
            {
                "content": "I feel this video is staged. As someone with Tourettes I can tell you he can control it somewhat. You can stop for moments, but the urges to twitch and strain are overwhelming and some cases are more severe than others. Stress does exacerbate it and if ... See More",
                "from": "https://www.facebook.com/salliesweet?fref=ufi&rc=p Jody Koala Baer-Swanson",
                "time": "October 28 at 6:52pm Edited"
            },
            {
                "content": "I love watching videos like this... I love Marijuana as a recreational enjoyment sure. But completely unbiased, seeing the effects on a medical level is amazing. I've seen a man with an extreme type of palsy have the exact same results. This guy here w ... See More",
                "from": "https://www.facebook.com/Prairshrine?fref=ufi&rc=p Ian Lackey",
                "time": "November 2 at 12:48am"
            },
            {
                "content": "Come on people, you cant tell me this shouldnt be legal for someone when it is obviously the only way the poor guy gets any relief. The proof that it is a medicine not a drug is right in front your faces!!!",
                "from": "https://www.facebook.com/profile.php?id=100005153446620&fref=ufi&rc=p Tricia Gammage",
                "time": "October 28 at 4:27pm"
            },
            {
                "content": "The only reason it's illegal in the first place is because of the numerous big pharma companies it would bankrupt!!!! The government playing us like fiddles!!!!",
                "from": "https://www.facebook.com/Josephtits?fref=ufi&rc=p Joe Byrne",
                "time": "October 29 at 10:38pm"
            },
            {
                "content": "If this cures people, why is cannabis still illegal?...I have the answer: because medieval rich businessmen from the medical and pharmaceutical industry succeeded and continue to bribe the right people in our politics to keep the natural marijuana away from us in order to have them sell us their chemicals in infinite forms and ways and steal our financial resources...",
                "from": "https://www.facebook.com/iondaniel.bojinescu?fref=ufi&rc=p Dan Boji",
                "time": "October 26 at 8:44pm Edited"
            },
            {
                "content": "If we weren't meant to use it, our brains and bodies wouldn't have the direct connection chemical receptors for it. To any who say it isn't medicine, or it's dangerous, fuck off with your uneducated stupidity.",
                "from": "https://www.facebook.com/chad.jacobs3?fref=ufi&rc=p Chad Jacobs",
                "time": "October 30 at 5:09pm"
            },
            {
                "content": "This dude needs cannabis oil or tincture. He'd be able to medicate anywhere and get it in his system quicker by placing it under the tongue.",
                "from": "https://www.facebook.com/RazorWar?fref=ufi&rc=p John Fennessy",
                "time": "October 31 at 1:54pm"
            },
            {
                "content": "That absolutely breaks my heart... I'm. Not for Marijuana, but if that's the difference it can make to this man's life... Then smoke away mate, nobody should have to go through life like that.......",
                "from": "https://www.facebook.com/laura.kafizas?fref=ufi&rc=p Loz Kafizas",
                "time": "October 29 at 2:20am"
            },
            {
                "content": "Thank god for weed .. ima burn one now just cuz this stressed me out",
                "from": "https://www.facebook.com/frankie.antonucci?fref=ufi&rc=p Justin Francis",
                "time": "October 28 at 12:53pm"
            },
            {
                "content": "Seeing things like this make my heart break. I feel disgusted with myself for every thinking my life was tough. Im willing to pay some of my taxes to make sure people like this always have some form of thc at thier disposal.",
                "from": "https://www.facebook.com/profile.php?id=100000545882197&fref=ufi&rc=p Chris Thomas",
                "time": "October 31 at 3:01pm"
            },
            {
                "content": "I wish people would study tourettes more to understand that it can cause severe symptoms when it's a severe case of tourettes.  It affects people differently, some have mild symptoms that aren't very noticeable and in others it's very noticeable.  People are so quick to say fake just because they've never met someone like that, research will definitely clear any doubts up for you.",
                "from": "https://www.facebook.com/charlotte.tramell?fref=ufi&rc=p Charlotte Tramell",
                "time": "October 29 at 8:46am"
            },
            {
                "content": "I don't smoke marijuana, but I'm all for the legalization of it to help people such as this man. I've even seen children benefit from this. Better than any other  chemical (pills). Bless this man.",
                "from": "https://www.facebook.com/christalee.gray?fref=ufi&rc=p Christa Lee Gray",
                "time": "October 28 at 2:29pm"
            },
            {
                "content": "The issue i have with this is people are trying too take a small minority of people who need medical marijuana being there are no better alternatives (which are actually very very few cases) and trying to apply them too all scenarios as a way too push there pro weed agenda",
                "from": "https://www.facebook.com/jeremiah.wildt?fref=ufi&rc=p Jeremiah Wildt",
                "time": "October 29 at 9:12am Edited"
            },
            {
                "content": "I swear to God it brings a tear to my eye when I see things like this, and it also goes for countless other conditions and diseases. There are so many natural cures that are illegal and it breaks my heart to see people suffer like this just because we have piece of shit governments and laws  :( ",
                "from": "https://www.facebook.com/el.cummings.1?fref=ufi&rc=p Elvin Brea Jr.",
                "time": "October 27 at 11:25am"
            },
            {
                "content": "Take note people this is illegal because it actually helps people not make them worst and the most important thing about it is that it takes away from the pharmaceutical companys that would rather see you suffer than to heal you!",
                "from": "https://www.facebook.com/SheanScoggins?fref=ufi&rc=p Shean Scoggins",
                "time": "October 27 at 3:06pm"
            },
            {
                "content": "This man needs to come to the Pacific North West so he can get the help he needs. RSO for days, and some of the best nature this world has to offer.",
                "from": "https://www.facebook.com/joey.flores.758?fref=ufi&rc=p Jose Luis Flores",
                "time": "October 26 at 8:35pm"
            },
            {
                "content": "I have a rare form of muscular dystrophy called \"Dermatomysitis\"... I can attest to the muscle relaxation. Weed is a goddamn miracle in my life... I was against it and fed into the stigma, not anymore. Changed my life.",
                "from": "https://www.facebook.com/justinworsham?fref=ufi&rc=p Justin Worsham",
                "time": "November 1 at 6:55pm"
            },
            {
                "content": "I can testify as a person with epilepsy. That when I am having outbreaks and I smoke they stop within 5 minutes. Medical marijuana should definitely be legalized.",
                "from": "https://www.facebook.com/profile.php?id=100009260019918&fref=ufi&rc=p Devin P. Bryant",
                "time": "October 29 at 8:27am"
            },
            {
                "content": "It’s like watching two different people in one person and yet marijuana is the problem I’m tired of these fucking laws although weed is legal in certain states in America the war wages on this should be globally legal with or without illnesses",
                "from": "https://www.facebook.com/lashaun.haywood?fref=ufi&rc=p Lashaun Haywood",
                "time": "October 28 at 8:07pm"
            },
            {
                "content": "I think its true of it's cure. The reason they made it illegal is IT CAN cure a lot of syndromes the cheapest way, will mess up the Pharmas grip on society, will ruin the more \"expensive\" drugs' value.",
                "from": "https://www.facebook.com/LifePO4power?fref=ufi&rc=p Samoht Solacad",
                "time": "October 30 at 5:52am"
            },
            {
                "content": "Marijuana is a wonderful plant and needs to be explored more fully from a medical standpoint. So many people benefit from its amazing properties. We cannot ignore this any longer and need to stop demonizing it over a much worse substance, alcohol, just because it has been fashionable for religious and political zealots to do so for decades.",
                "from": "https://www.facebook.com/brenda.nottingham.7?fref=ufi&rc=p Brenda Nottingham",
                "time": "October 28 at 2:36pm"
            },
            {
                "content": "but jesus and your morals are more important, right society? when will people learn that simple shit like weed has no effect on them or their family. but it could have a lifesaving or life redeeming affect on someone else.",
                "from": "https://www.facebook.com/jake.holmes.790693?fref=ufi&rc=p Jake Holmes",
                "time": "October 31 at 12:08pm"
            },
            {
                "content": "Man...we have some GRADE AAA detectives up in this shit. “He can’t roll a joint!” “This documentary was scripted!” ... See More",
                "from": "https://www.facebook.com/gavin.dulisse?fref=ufi&rc=p Gavin D'Ulisse",
                "time": "November 2 at 1:29pm"
            },
            {
                "content": "To the people who don't use it, you have no clue how helpful this plant can be. The way it relaxes you mentally and physically with out many side effects can be really therapeutic.",
                "from": "https://www.facebook.com/DMaN1528?fref=ufi&rc=p Donnie Lindland",
                "time": "October 31 at 2:36pm"
            },
            {
                "content": "For this man, Cannabis is truly a life changing miracle medication. But for Cannabis, it’s just another day... producing amazing results.",
                "from": "https://www.facebook.com/haidenwayne?fref=ufi&rc=p Haiden Howland",
                "time": "October 26 at 12:25pm"
            },
            {
                "content": "We don't need no fuckin big pharma ..leagalize don't leagalize it don't fuckin matter  people are awake to the mass benefits of bud and no prohibition and wasted taxes will stop it ..good on ya mate keep tokin",
                "from": "https://www.facebook.com/Jradg420?fref=ufi&rc=p Jared Goebel",
                "time": "October 28 at 5:19pm"
            },
            {
                "content": "As little as 3 puffs on a j my tics start to go away half a j im.good for 3 to 4 hours tic free . Weed is the best I been on 20 dif types of meds for Tourette syndrome and nothing works like t.h.c",
                "from": "https://www.facebook.com/greg.mccarthy.50?fref=ufi&rc=p Greg Mccarthy",
                "time": "October 29 at 8:41pm"
            },
            {
                "content": "I fully support the legalization of medicinal marijuana, however Billy is a fuckin liar. How the fuck did he even roll that big ass joint? And no euphoric symptoms at all? Kiss my ass Billy, you fuckin lying sonofabitch.",
                "from": "https://www.facebook.com/marcus.hall.547727?fref=ufi&rc=p Glen Allen",
                "time": "October 26 at 2:27pm"
            },
            {
                "content": "And I didn’t even know that Tourettes could get this bad I hope he’s blessed with a endless supply marijuana",
                "from": "https://www.facebook.com/lashaun.haywood?fref=ufi&rc=p Lashaun Haywood",
                "time": "October 28 at 8:12pm"
            },
            {
                "content": "Kellie Marie  this is incredible. I can see why the government tries so hard to incriminate a medicine that would take away billions of dollars out of the hands of pharmaceutical conpanies.",
                "from": "https://www.facebook.com/chris.n.cureton?fref=ufi&rc=p Nikko Cureton",
                "time": "October 30 at 9:20pm"
            },
            {
                "content": "I have read some of the comments , thankfully most of us have a sense of humor even though we understand how serious and terrible this must be, but tell me again, how is it possible that big pharma controls what must work for you and everything else that they cant control is therefor illegal? Big pharma does not cure they create customers .",
                "from": "https://www.facebook.com/kevan.foxcroft?fref=ufi&rc=p Kevan David Foxcroft",
                "time": "November 2 at 3:23am"
            },
            {
                "content": "Everyone who's making fun of him for drinking coffee seriously needs to do some research! There are also things known as decaffeinated coffee or he just likes to fucking drink coffee. Also in some cases caffeine gives opposite effects on other people,  ... See More",
                "from": "https://www.facebook.com/moondarklingsinergy?fref=ufi&rc=p Emily Sinergy Morales",
                "time": "October 30 at 2:01pm Edited"
            },
            {
                "content": "I feel so bad for this guy.. 😞  seeing this makes me want to spoil him with loads and loads of marihuana tbh",
                "from": "https://www.facebook.com/goldendrums?fref=ufi&rc=p Cliff Trieling",
                "time": "October 28 at 3:57pm"
            },
            {
                "content": "This should be legalized for medicinal use! I looked after a paraplegic guy who has massive limb twitching which hurts him and he is always in pain....but as soon as he had a few puffs of a joint his body would relax nil pain and he would just doze off ... See More",
                "from": "https://www.facebook.com/jacqui.niania.3?fref=ufi&rc=p Jacqui NiaNia",
                "time": "November 3 at 11:47pm Edited"
            },
            {
                "content": "If this is genuine then how can any government be right to withdraw this mans right to make himself well....its not a drug at all but rather a healing herb.. I personally have never tried it and detest the smell. .but if it helps people with awful medical problems then it should be allowed. ..",
                "from": "https://www.facebook.com/profile.php?id=100009083777302&fref=ufi&rc=p Phil Tate",
                "time": "October 29 at 12:46am Edited"
            },
            {
                "content": "People really need to see that this is a miracle drug and the reason you all believe it's a gateway drug and anything negative at all is because we were brainwashed by some form of money hungry government growing up.u were raised only to hear the downs ... See More",
                "from": "https://www.facebook.com/paulie.hubbard?fref=ufi&rc=p Paulie Jerome Hubbard",
                "time": "November 1 at 1:01pm Edited"
            },
            {
                "content": "Problem is no tests have been done, for all he knows the drug could be making his condition worse but you don't see that unless he doesn't smoke it resulting in needing more of the drug. This can not be classed a medical form of use, get the medicinal  ... See More",
                "from": "https://www.facebook.com/billieonair.turner?fref=ufi&rc=p Billie Turner",
                "time": "October 30 at 1:46am"
            },
            {
                "content": "Sadly he has to get this illegally and risk going to prison for something that helps Him tremendously. He’s not abusing it he is simply trying to live normally. This is so Sad... 😞 ",
                "from": "https://www.facebook.com/sara.vargas.7568596?fref=ufi&rc=p Sara Vargas",
                "time": "October 27 at 12:54am"
            }
        ],
        "description": "United 4 Truth AMAZING!  -RJ 01:47 1,811 Views Erik Kulick  was live.  ·  August 20  ·  # Salem ,  # Oregon  PD ( Salem Police Department ) decided to abuse discretion to assault & jail  Cross-dressing Mormon  ( # XdressingMormon ) unconstitutionally for not PROVIDING ID the day before the  # Eclipse  as way to punish & silence  # cannabis  activism!  # Eclipse2017   # CopWatch   # MMJ   # LGBTQ   # Jesus Kellie Marie",
        "participants": [
            "https://www.facebook.com/United4Truth/?ref=nf&hc_ref=ARQdNTP-dKd_pKUE6wun8Wo4N92CaQcfkuMJaqK3SG_HwS1n0yrrvLDa8nm0tuIXII0",
            "https://www.facebook.com/JesusAndTheAngels?fref=ufi&rc=p",
            "https://www.facebook.com/JesusAndTheAngels?hc_ref=ARQqZ5g-x5YZGlSv6E6_GVlfnA-OkodL4egeK5USqZZ8PDAC_TxBZCdGfu77qb18S-4",
            "https://www.facebook.com/SalemPoliceDept/?fref=mentions",
            "https://www.facebook.com/erikmkulick/?fref=mentions",
            "https://www.facebook.com/justin.pinkus?fref=ufi&rc=p",
            "https://www.facebook.com/chargerboy87?fref=ufi&rc=p",
            "https://www.facebook.com/matt.laforce.16?fref=ufi&rc=p",
            "https://www.facebook.com/mar.cus.9216778?fref=ufi&rc=p",
            "https://www.facebook.com/ZckDugan91?fref=ufi&rc=p",
            "https://www.facebook.com/ashlee.daniels.94?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000998841443&fref=ufi&rc=p",
            "https://www.facebook.com/HersheyFactory?fref=ufi&rc=p",
            "https://www.facebook.com/belinda.milne.79?fref=ufi&rc=p",
            "https://www.facebook.com/belinda.milne.79?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009556666837&fref=ufi&rc=p",
            "https://www.facebook.com/jesse.sanchez.58152559?fref=ufi&rc=p",
            "https://www.facebook.com/hillary.fairchild.1?fref=ufi&rc=p",
            "https://www.facebook.com/salliesweet?fref=ufi&rc=p",
            "https://www.facebook.com/DreWMcCormack92?fref=ufi&rc=p",
            "https://www.facebook.com/Prairshrine?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100005153446620&fref=ufi&rc=p",
            "https://www.facebook.com/Josephtits?fref=ufi&rc=p",
            "https://www.facebook.com/iondaniel.bojinescu?fref=ufi&rc=p",
            "https://www.facebook.com/chad.jacobs3?fref=ufi&rc=p",
            "https://www.facebook.com/RazorWar?fref=ufi&rc=p",
            "https://www.facebook.com/laura.kafizas?fref=ufi&rc=p",
            "https://www.facebook.com/frankie.antonucci?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000545882197&fref=ufi&rc=p",
            "https://www.facebook.com/charlotte.tramell?fref=ufi&rc=p",
            "https://www.facebook.com/christalee.gray?fref=ufi&rc=p",
            "https://www.facebook.com/jeremiah.wildt?fref=ufi&rc=p",
            "https://www.facebook.com/el.cummings.1?fref=ufi&rc=p",
            "https://www.facebook.com/SheanScoggins?fref=ufi&rc=p",
            "https://www.facebook.com/joey.flores.758?fref=ufi&rc=p",
            "https://www.facebook.com/justinworsham?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009260019918&fref=ufi&rc=p",
            "https://www.facebook.com/lashaun.haywood?fref=ufi&rc=p",
            "https://www.facebook.com/LifePO4power?fref=ufi&rc=p",
            "https://www.facebook.com/brenda.nottingham.7?fref=ufi&rc=p",
            "https://www.facebook.com/jake.holmes.790693?fref=ufi&rc=p",
            "https://www.facebook.com/gavin.dulisse?fref=ufi&rc=p",
            "https://www.facebook.com/DMaN1528?fref=ufi&rc=p",
            "https://www.facebook.com/haidenwayne?fref=ufi&rc=p",
            "https://www.facebook.com/Jradg420?fref=ufi&rc=p",
            "https://www.facebook.com/greg.mccarthy.50?fref=ufi&rc=p",
            "https://www.facebook.com/marcus.hall.547727?fref=ufi&rc=p",
            "https://www.facebook.com/lashaun.haywood?fref=ufi&rc=p",
            "https://www.facebook.com/chris.n.cureton?fref=ufi&rc=p",
            "https://www.facebook.com/kellie.marie.37?hc_location=ufi",
            "https://www.facebook.com/kevan.foxcroft?fref=ufi&rc=p",
            "https://www.facebook.com/moondarklingsinergy?fref=ufi&rc=p",
            "https://www.facebook.com/goldendrums?fref=ufi&rc=p",
            "https://www.facebook.com/jacqui.niania.3?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009083777302&fref=ufi&rc=p",
            "https://www.facebook.com/paulie.hubbard?fref=ufi&rc=p",
            "https://www.facebook.com/billieonair.turner?fref=ufi&rc=p",
            "https://www.facebook.com/sara.vargas.7568596?fref=ufi&rc=p",
            "https://www.facebook.com/JesusAndTheAngels?fref=ufi&rc=p",
            "https://www.facebook.com/justin.pinkus?fref=ufi&rc=p",
            "https://www.facebook.com/chargerboy87?fref=ufi&rc=p",
            "https://www.facebook.com/matt.laforce.16?fref=ufi&rc=p",
            "https://www.facebook.com/mar.cus.9216778?fref=ufi&rc=p",
            "https://www.facebook.com/ZckDugan91?fref=ufi&rc=p",
            "https://www.facebook.com/ashlee.daniels.94?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000998841443&fref=ufi&rc=p",
            "https://www.facebook.com/HersheyFactory?fref=ufi&rc=p",
            "https://www.facebook.com/belinda.milne.79?fref=ufi&rc=p",
            "https://www.facebook.com/belinda.milne.79?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009556666837&fref=ufi&rc=p",
            "https://www.facebook.com/jesse.sanchez.58152559?fref=ufi&rc=p",
            "https://www.facebook.com/hillary.fairchild.1?fref=ufi&rc=p",
            "https://www.facebook.com/salliesweet?fref=ufi&rc=p",
            "https://www.facebook.com/DreWMcCormack92?fref=ufi&rc=p",
            "https://www.facebook.com/Prairshrine?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100005153446620&fref=ufi&rc=p",
            "https://www.facebook.com/Josephtits?fref=ufi&rc=p",
            "https://www.facebook.com/iondaniel.bojinescu?fref=ufi&rc=p",
            "https://www.facebook.com/chad.jacobs3?fref=ufi&rc=p",
            "https://www.facebook.com/RazorWar?fref=ufi&rc=p",
            "https://www.facebook.com/laura.kafizas?fref=ufi&rc=p",
            "https://www.facebook.com/frankie.antonucci?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000545882197&fref=ufi&rc=p",
            "https://www.facebook.com/charlotte.tramell?fref=ufi&rc=p",
            "https://www.facebook.com/christalee.gray?fref=ufi&rc=p",
            "https://www.facebook.com/jeremiah.wildt?fref=ufi&rc=p",
            "https://www.facebook.com/el.cummings.1?fref=ufi&rc=p",
            "https://www.facebook.com/SheanScoggins?fref=ufi&rc=p",
            "https://www.facebook.com/joey.flores.758?fref=ufi&rc=p",
            "https://www.facebook.com/justinworsham?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009260019918&fref=ufi&rc=p",
            "https://www.facebook.com/lashaun.haywood?fref=ufi&rc=p",
            "https://www.facebook.com/LifePO4power?fref=ufi&rc=p",
            "https://www.facebook.com/brenda.nottingham.7?fref=ufi&rc=p",
            "https://www.facebook.com/jake.holmes.790693?fref=ufi&rc=p",
            "https://www.facebook.com/gavin.dulisse?fref=ufi&rc=p",
            "https://www.facebook.com/DMaN1528?fref=ufi&rc=p",
            "https://www.facebook.com/haidenwayne?fref=ufi&rc=p",
            "https://www.facebook.com/Jradg420?fref=ufi&rc=p",
            "https://www.facebook.com/greg.mccarthy.50?fref=ufi&rc=p",
            "https://www.facebook.com/marcus.hall.547727?fref=ufi&rc=p",
            "https://www.facebook.com/lashaun.haywood?fref=ufi&rc=p",
            "https://www.facebook.com/chris.n.cureton?fref=ufi&rc=p",
            "https://www.facebook.com/kevan.foxcroft?fref=ufi&rc=p",
            "https://www.facebook.com/moondarklingsinergy?fref=ufi&rc=p",
            "https://www.facebook.com/goldendrums?fref=ufi&rc=p",
            "https://www.facebook.com/jacqui.niania.3?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009083777302&fref=ufi&rc=p",
            "https://www.facebook.com/paulie.hubbard?fref=ufi&rc=p",
            "https://www.facebook.com/billieonair.turner?fref=ufi&rc=p",
            "https://www.facebook.com/sara.vargas.7568596?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/United4Truth/videos/490682811304863/",
        "photos": []
    },
    {
        "comments": [],
        "description": "Erik Kulick Salem Police Department Cross-dressing Mormon",
        "participants": [
            "https://www.facebook.com/JesusAndTheAngels?hc_ref=ARQqZ5g-x5YZGlSv6E6_GVlfnA-OkodL4egeK5USqZZ8PDAC_TxBZCdGfu77qb18S-4",
            "https://www.facebook.com/SalemPoliceDept/?fref=mentions",
            "https://www.facebook.com/erikmkulick/?fref=mentions"
        ],
        "post": "https://www.facebook.com/United4Truth/videos/490682811304863/",
        "photos": []
    },
    {
        "comments": [],
        "description": "Mark McClane  shared  Love What Matters 's  video .",
        "participants": [
            "https://www.facebook.com/mark.mcclane.357?fref=nf",
            "https://www.facebook.com/mark.mcclane.357?hc_ref=ARQYXSnSgHDl1ZYFaldsyaXOuGE1OWxelptXPHSIRgrEiMH7AAzYNKYUBJHO6AAd9u4",
            "https://www.facebook.com/lovewhatreallymatters/?hc_ref=ARQYXSnSgHDl1ZYFaldsyaXOuGE1OWxelptXPHSIRgrEiMH7AAzYNKYUBJHO6AAd9u4",
            "/lovewhatreallymatters/videos/1723511164337941/?hc_ref=ARQYXSnSgHDl1ZYFaldsyaXOuGE1OWxelptXPHSIRgrEiMH7AAzYNKYUBJHO6AAd9u4"
        ],
        "post": "https://www.facebook.com/mark.mcclane.357/posts/1996205930664519",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "Credit:  https://twitter.com/JoshPherigo",
                "from": "https://www.facebook.com/lovewhatreallymatters/?rc=p Love What Matters",
                "time": "November 4 at 8:45pm"
            },
            {
                "content": "I've never been so excited watching a hat being thrown around!!  👏🏼 👏🏼 👏🏼  It's amazing what we can do when we come together!!  ❤️ ",
                "from": "https://www.facebook.com/profile.php?id=100001401531426&fref=ufi&rc=p Nicole Rivera",
                "time": "November 4 at 8:25pm"
            },
            {
                "content": "Fake , those are professional hat throwers in crowd, fake news all over",
                "from": "https://www.facebook.com/hrnjicevic?fref=ufi&rc=p Šjor Barba Ibre",
                "time": "November 4 at 8:55pm"
            },
            {
                "content": "This is weirdly addictive viewing. Love it and going to show it to my year 1 students as a demonstration of teamwork! X",
                "from": "https://www.facebook.com/amy.anderson.581?fref=ufi&rc=p Amy Anderson",
                "time": "November 4 at 8:27pm"
            },
            {
                "content": "How come we can do this awesome task of returning a hat but can't have a normal conversation on the internet?",
                "from": "https://www.facebook.com/matt.snell.146?fref=ufi&rc=p Matt Snell",
                "time": "November 4 at 8:59pm"
            },
            {
                "content": "I wish the world was always like this  💙 ",
                "from": "https://www.facebook.com/tracy.eilers?fref=ufi&rc=p Tracy Eilers",
                "time": "November 4 at 8:31pm"
            },
            {
                "content": "This is actually oddly heartwarming!  <3   :) ",
                "from": "https://www.facebook.com/kimberly.oakley1?fref=ufi&rc=p Kimberly Oakley",
                "time": "November 4 at 8:24pm"
            },
            {
                "content": "That is what Houston is all about. Neighbors helping neighbors.",
                "from": "https://www.facebook.com/megan.angeloseunson?fref=ufi&rc=p Megan Angelos Eunson",
                "time": "November 4 at 8:24pm"
            },
            {
                "content": "The guy yelling “f**k yeahhhhh!!”  😂 😂 😂 ",
                "from": "https://www.facebook.com/nikole.machonis?fref=ufi&rc=p Nicole Carmody",
                "time": "November 4 at 8:48pm"
            },
            {
                "content": "Am I the only one that cannot stop watching this..",
                "from": "https://www.facebook.com/isaiah.r.lopez?fref=ufi&rc=p Lopez Fam",
                "time": "November 4 at 8:30pm"
            },
            {
                "content": "Not fake. Not professional hat throwers!  This is TEXAS!  We know how to have fun and how to love each other. There is no place like TEXAS!!",
                "from": "https://www.facebook.com/norma.frenchspencer?fref=ufi&rc=p Norma French Spencer",
                "time": "November 5 at 2:34am"
            },
            {
                "content": "I teach Social Citizenship to students k-4 in PA. We just did a lesson on teamwork. Can't wait to show my older students this perfect example.",
                "from": "https://www.facebook.com/jeremy.gibney.9?fref=ufi&rc=p Jeremy Gibney",
                "time": "November 4 at 9:00pm"
            },
            {
                "content": "Harvey hit us hard and strangers helping strangers has been happening over here ever since! It’s been one of the worst things that’s ever happened to me, yet one of the best!",
                "from": "https://www.facebook.com/cindyq?fref=ufi&rc=p Cindy Quintanilla",
                "time": "November 5 at 12:35am"
            },
            {
                "content": "I so love this.  Second video I've seen of it so far and it hasn't gotten old.  The excitement of everyone as it goes up each row and is caught is just awesome.  Always nice to see some positive in life.",
                "from": "https://www.facebook.com/melissa.dick1?fref=ufi&rc=p Melissa McColgan",
                "time": "November 4 at 8:52pm"
            },
            {
                "content": "I love this kind of stuff.... where random things make you feel so connected to other humans!!! Whyyy can't it be this way all the time, people?!?  # loveiswaymorefun",
                "from": "https://www.facebook.com/shannon.o.collins?fref=ufi&rc=p Shannon O'Brien Collins",
                "time": "November 5 at 1:34am"
            },
            {
                "content": "I've never seen a crowd so happy to return something back to its rightful owner in my life. But then again...we have all been in those shoes...or topped with that hat (-;",
                "from": "https://www.facebook.com/sara.emily.sab?fref=ufi&rc=p Sara Emily",
                "time": "November 4 at 10:58pm"
            },
            {
                "content": "This is Houston it’s what we are",
                "from": "https://www.facebook.com/jacob.barnett.188?fref=ufi&rc=p Jacob Barnett",
                "time": "November 4 at 9:01pm"
            },
            {
                "content": "This is how Houston really is, how we all Help and come together in a time of need. So proud that the city I was born and raised in has a nice video of true humanity to be proud of.",
                "from": "https://www.facebook.com/rlbermduez?fref=ufi&rc=p Rose Bermudez",
                "time": "November 5 at 12:53pm"
            },
            {
                "content": "Love it! Just a caution to teachers planning to use it for a lesson. You may want to end the clip before that last loud yell. I believe it’s a very enthusiastic f-bomb.",
                "from": "https://www.facebook.com/pamela.roach.18?fref=ufi&rc=p Pamela Roach",
                "time": "November 4 at 10:01pm"
            },
            {
                "content": "Like a wallet returned with all the cash intact, this warms my soul. Just good humanity being kind to each other.  🙂 ",
                "from": "https://www.facebook.com/JaggedEdge808?fref=ufi&rc=p Lauren Matchett King",
                "time": "November 4 at 10:22pm"
            },
            {
                "content": "Born here. I hate the crowds and the noise, but I still love my city. Third generation Houstonian. My Grandpa bought land everybody told him he was stupid for buying. They put 610 through, and he put an Exxon station there. Made lots of money. He moved here in the 50's from the town our family settled in the 1800's near Nacogdoches.",
                "from": "https://www.facebook.com/chisum.michelle?fref=ufi&rc=p Michelle Chisum",
                "time": "17 hrs Edited"
            },
            {
                "content": "Proof that we are not as divided as the media makes it seem. Want more? Go out and talk to your neighbors. Start a conversation with the checkout lady and bank tellers and gas station employees. 99% of the time youll get a friendly response.",
                "from": "https://www.facebook.com/jess.alley18?fref=ufi&rc=p Jess Alley",
                "time": "November 6 at 3:07pm"
            },
            {
                "content": "That's cool!  I live here in Houston and a friend of mine told me about this… For those that are saying fake news… Not true. This really happened!",
                "from": "https://www.facebook.com/debra.chimelak?fref=ufi&rc=p Debra Stewart Chimelak",
                "time": "November 6 at 11:59am"
            },
            {
                "content": "🇨🇱  That’s what you get when you’re in our great state!!!  We’ll give you courtesy and respect and probably give your hat back to you!!",
                "from": "https://www.facebook.com/haleynansmith?fref=ufi&rc=p Haley Smith",
                "time": "November 4 at 11:37pm"
            },
            {
                "content": "This is Houston-we take care of each other-the rest of the world got to see it in action during Harvey-love my city  ❤️ ❤️ ",
                "from": "https://www.facebook.com/katiekrealty?fref=ufi&rc=p Katie Wilkinson Paulsen",
                "time": "November 5 at 4:13pm"
            },
            {
                "content": "Houston Texans are the best!!!!! Love this so much! Thank you Astros for bringing much happiness to our city again!  😍 😍 😍 ",
                "from": "https://www.facebook.com/sonja.dieterichs?fref=ufi&rc=p Sonja Cortez Dieterichs",
                "time": "2 hrs"
            },
            {
                "content": "Love my city, of Houston!!!!",
                "from": "https://www.facebook.com/brenda.gonzalez.1610092?fref=ufi&rc=p Brenda Gonzalez",
                "time": "November 4 at 8:32pm"
            },
            {
                "content": "Because HOUSTON has proven over and over that we stand STRONG!!  # lovemycity   # houstonstrong   # worldserieschamps",
                "from": "https://www.facebook.com/adriana.castorenanarvaez?fref=ufi&rc=p Adriana Maltos Castorena-Narvaez",
                "time": "23 hrs"
            },
            {
                "content": "It made no difference what your skin color was, just a bunch of Fun loving People enjoying the day, too bad it can’t be like this all the time.",
                "from": "https://www.facebook.com/suzie.stevenson.94?fref=ufi&rc=p Suzie Stevenson",
                "time": "November 4 at 11:09pm"
            },
            {
                "content": "Loving moments like this happen all over Houston every single day.  It just took a World Series for everyone else to notice.   ❤️ ",
                "from": "https://www.facebook.com/allisoncmarek?fref=ufi&rc=p Allison Marek",
                "time": "November 5 at 12:02am"
            },
            {
                "content": "I can't stop watching this every time it's shared!  😂 😂  THIS should be a sport!  # teamwork   😂 😂 ",
                "from": "https://www.facebook.com/loveslilies?fref=ufi&rc=p Juliette Rivas",
                "time": "November 4 at 8:24pm"
            },
            {
                "content": "For some reason this is totally awesome and draws you in with ease. Reminds me to rejoice with those who rejoice, and weep with those who weep.  Thanks for sharing!",
                "from": "https://www.facebook.com/jason.styba?fref=ufi&rc=p Jason Styba",
                "time": "November 5 at 12:35am"
            },
            {
                "content": "Local Houston news says this is real and it describes Houston in a nutshell.  Most diverse city in Texas.  Another version of what happened during Harvey.",
                "from": "https://www.facebook.com/ann.riner?fref=ufi&rc=p Ann Lovell Riner",
                "time": "November 5 at 7:15pm"
            },
            {
                "content": "Wow amazingly wonderful what the Houston Astros did for the people of Houston and fans everywhere  😍 😍 😍 ",
                "from": "https://www.facebook.com/betsy.payne.35?fref=ufi&rc=p Betsy Payne",
                "time": "November 5 at 4:21pm"
            },
            {
                "content": "This is awesome, I'm just curious, how did anyone on the bottom know it needed to go back up?  Like maybe someone just threw it down there.  At any rate it is still cool to watch.",
                "from": "https://www.facebook.com/stacy.tinsley.5?fref=ufi&rc=p Stacy Tinsley",
                "time": "November 5 at 6:32am"
            },
            {
                "content": "Jana Braden Greene ,  # HoustonStrong ByTheWay, \"IWantMyHatBack\"IsTheNameOfAReallyGreatBookToReadTheGrandbean. I am unsure why my phone did talk to text but no spaces in between.",
                "from": "https://www.facebook.com/johanna.eldridge?fref=ufi&rc=p Johanna Eldridge",
                "time": "November 4 at 10:49pm"
            },
            {
                "content": "So what if this is a set-up?  So what if they are professional hat throwers?  First, what are the odds of someone video'ing this garage at the same moment when this happened?  Second, WHO CARES???  It was fun to watch and shows us how, if we work together, we can do anything.",
                "from": "https://www.facebook.com/M0Curley?fref=ufi&rc=p Mo Curley",
                "time": "November 5 at 6:23pm"
            },
            {
                "content": "Always somebody got to be negative about something good oh well that person looses out on a good feelin must be a miserable person to try and make everyone feel bad hmmm so sad.",
                "from": "https://www.facebook.com/tinad.cookwelch?fref=ufi&rc=p Tina Welch",
                "time": "November 5 at 4:14am"
            },
            {
                "content": "Got very excited watching this...teamwork is amazing when WE can all come together... way to go people!!!",
                "from": "https://www.facebook.com/penny.silva.75?fref=ufi&rc=p Penny Silva",
                "time": "November 4 at 11:03pm"
            },
            {
                "content": "It is f ing amazing to me that more people would show up to celebrate winning than to show up and fight for our democracy!",
                "from": "https://www.facebook.com/profile.php?id=100005778707642&fref=ufi&rc=p Kathy Robertson",
                "time": "November 5 at 4:48am Edited"
            },
            {
                "content": "That was awesome! I watched it multiple times despite knowing the outcome, it was ridiculously exhilarating!",
                "from": "https://www.facebook.com/deb.gwynn?fref=ufi&rc=p Deb Gwynn",
                "time": "November 5 at 1:39am"
            },
            {
                "content": "This! This is how we need to stand together as Americans! No Democrats vs. Republicans, no millennials vs. Older folks, no race wars... together, United We Return Hats.",
                "from": "https://www.facebook.com/MarleenaDawn?fref=ufi&rc=p Marleena Dawn",
                "time": "20 hrs Edited"
            },
            {
                "content": "I love watching this! Everyone rooting for the hat to continue its way upwards to its owner  ❤  I was even cheering at home.   😁   # houstonstrong",
                "from": "https://www.facebook.com/cathy.t.griffin.9?fref=ufi&rc=p Cathy Tran Griffin",
                "time": "6 hrs"
            },
            {
                "content": "I love this!  This helps me to believe that, when given the opportunity, even when it does not benefit them, most people will choose good.   <3 ",
                "from": "https://www.facebook.com/CarolinesHopeJournal?fref=ufi&rc=p Carolines Hope Journal",
                "time": "November 5 at 9:24pm"
            },
            {
                "content": "Thank goodness it wasn't Verlander throwing it back. We all know what the outcome would've of been  🙄 🙄 🙄 ",
                "from": "https://www.facebook.com/enrique.corrales.7?fref=ufi&rc=p Enrique Corrales",
                "time": "November 4 at 9:58pm"
            },
            {
                "content": "Gotta love Texans! A place where people genuinely care about one another. Most places, most people wouldn’t spit on you if you were on fire.",
                "from": "https://www.facebook.com/douglas.razo?fref=ufi&rc=p Douglas Razo",
                "time": "November 5 at 5:17pm"
            },
            {
                "content": "I've seen this a few times. But I stop and watch it every time I come across it  :)  can't help but smile  :) ",
                "from": "https://www.facebook.com/vanessa.bm1?fref=ufi&rc=p Vanessa Bm",
                "time": "November 5 at 1:54am"
            },
            {
                "content": "Crazy. When I saw this video I was listening to Luke Bryan's new song...\"Most people are good\". I believe that  😁 .",
                "from": "https://www.facebook.com/lauren.campos.50?fref=ufi&rc=p Lauren Campos",
                "time": "November 5 at 10:44am"
            },
            {
                "content": "Carlos Perez  I'm no Huston fan but this is nice of them you know if this would have been in LA  the hat would have been long gone",
                "from": "https://www.facebook.com/emily.banalesantuna?fref=ufi&rc=p Emily Banales-Antuna",
                "time": "November 5 at 4:21am"
            },
            {
                "content": "In the grand scheme of things this is very small, but it just goes to show that we can work together!",
                "from": "https://www.facebook.com/ktoadvine1?fref=ufi&rc=p Kelly B Toadvine",
                "time": "10 hrs"
            }
        ],
        "description": "Love What Matters \"Watching people return this dropped hat at the Houston parade today was unreasonably thrilling! It was a really incredible experience to see such a spontaneous show of unity among strangers.\"  For our best love stories, subscribe to our free email newsletter:  http://bit.ly/29l733Q   # LoveWhatMatters  Credit: Josh Pherigo Jana Braden Greene Carlos Perez",
        "participants": [
            "https://www.facebook.com/lovewhatreallymatters/?ref=nf&hc_ref=ART7wuZe2tyuQWizbEuJ-AhPO34yGHNyPFOx8AibXssIBxEY5gfegiw7Fo2WrzcBIBs",
            "https://www.facebook.com/lovewhatreallymatters/?rc=p",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Ftwitter.com%2FJoshPherigo&h=ATMyHd3B-A3kh5zRXn40TZKEqwdOSWynrIDj9_6CcBMtpFzRkxBicXt9bfpxt45SDqGZ2qZnU3_h657qDkr36HALbnjV3B1O8Juhz8Zqt2Lzx6wPliddozWy7Q4Zn6Rfk-vZdCYeMXRDSIA3upFzVxz7MD1OtAuEvx6OGYFpmSI1HL5rT1yYeg-HZyt8TouoVFLWPd-VOMWdKinRBbhBnTNfvP2dj_tSumUbHTKP3DfCLxFRZST9BZ35",
            "https://www.facebook.com/profile.php?id=100001401531426&fref=ufi&rc=p",
            "https://www.facebook.com/hrnjicevic?fref=ufi&rc=p",
            "https://www.facebook.com/hrnjicevic?fref=ufi&rc=p",
            "https://www.facebook.com/amy.anderson.581?fref=ufi&rc=p",
            "https://www.facebook.com/matt.snell.146?fref=ufi&rc=p",
            "https://www.facebook.com/tracy.eilers?fref=ufi&rc=p",
            "https://www.facebook.com/kimberly.oakley1?fref=ufi&rc=p",
            "https://www.facebook.com/megan.angeloseunson?fref=ufi&rc=p",
            "https://www.facebook.com/nikole.machonis?fref=ufi&rc=p",
            "https://www.facebook.com/isaiah.r.lopez?fref=ufi&rc=p",
            "https://www.facebook.com/norma.frenchspencer?fref=ufi&rc=p",
            "https://www.facebook.com/jeremy.gibney.9?fref=ufi&rc=p",
            "https://www.facebook.com/cindyq?fref=ufi&rc=p",
            "https://www.facebook.com/melissa.dick1?fref=ufi&rc=p",
            "https://www.facebook.com/shannon.o.collins?fref=ufi&rc=p",
            "https://www.facebook.com/sara.emily.sab?fref=ufi&rc=p",
            "https://www.facebook.com/jacob.barnett.188?fref=ufi&rc=p",
            "https://www.facebook.com/rlbermduez?fref=ufi&rc=p",
            "https://www.facebook.com/pamela.roach.18?fref=ufi&rc=p",
            "https://www.facebook.com/JaggedEdge808?fref=ufi&rc=p",
            "https://www.facebook.com/chisum.michelle?fref=ufi&rc=p",
            "https://www.facebook.com/jess.alley18?fref=ufi&rc=p",
            "https://www.facebook.com/debra.chimelak?fref=ufi&rc=p",
            "https://www.facebook.com/haleynansmith?fref=ufi&rc=p",
            "https://www.facebook.com/katiekrealty?fref=ufi&rc=p",
            "https://www.facebook.com/sonja.dieterichs?fref=ufi&rc=p",
            "https://www.facebook.com/brenda.gonzalez.1610092?fref=ufi&rc=p",
            "https://www.facebook.com/adriana.castorenanarvaez?fref=ufi&rc=p",
            "https://www.facebook.com/suzie.stevenson.94?fref=ufi&rc=p",
            "https://www.facebook.com/allisoncmarek?fref=ufi&rc=p",
            "https://www.facebook.com/loveslilies?fref=ufi&rc=p",
            "https://www.facebook.com/jason.styba?fref=ufi&rc=p",
            "https://www.facebook.com/ann.riner?fref=ufi&rc=p",
            "https://www.facebook.com/betsy.payne.35?fref=ufi&rc=p",
            "https://www.facebook.com/stacy.tinsley.5?fref=ufi&rc=p",
            "https://www.facebook.com/johanna.eldridge?fref=ufi&rc=p",
            "https://www.facebook.com/jana.greene?hc_location=ufi",
            "https://www.facebook.com/M0Curley?fref=ufi&rc=p",
            "https://www.facebook.com/tinad.cookwelch?fref=ufi&rc=p",
            "https://www.facebook.com/penny.silva.75?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100005778707642&fref=ufi&rc=p",
            "https://www.facebook.com/deb.gwynn?fref=ufi&rc=p",
            "https://www.facebook.com/MarleenaDawn?fref=ufi&rc=p",
            "https://www.facebook.com/cathy.t.griffin.9?fref=ufi&rc=p",
            "https://www.facebook.com/CarolinesHopeJournal?fref=ufi&rc=p",
            "https://www.facebook.com/enrique.corrales.7?fref=ufi&rc=p",
            "https://www.facebook.com/douglas.razo?fref=ufi&rc=p",
            "https://www.facebook.com/vanessa.bm1?fref=ufi&rc=p",
            "https://www.facebook.com/lauren.campos.50?fref=ufi&rc=p",
            "https://www.facebook.com/emily.banalesantuna?fref=ufi&rc=p",
            "https://www.facebook.com/CarlosEstevanPerez?hc_location=ufi",
            "https://www.facebook.com/ktoadvine1?fref=ufi&rc=p",
            "https://www.facebook.com/lovewhatreallymatters/?rc=p",
            "https://www.facebook.com/profile.php?id=100001401531426&fref=ufi&rc=p",
            "https://www.facebook.com/hrnjicevic?fref=ufi&rc=p",
            "https://www.facebook.com/hrnjicevic?fref=ufi&rc=p",
            "https://www.facebook.com/amy.anderson.581?fref=ufi&rc=p",
            "https://www.facebook.com/matt.snell.146?fref=ufi&rc=p",
            "https://www.facebook.com/tracy.eilers?fref=ufi&rc=p",
            "https://www.facebook.com/kimberly.oakley1?fref=ufi&rc=p",
            "https://www.facebook.com/megan.angeloseunson?fref=ufi&rc=p",
            "https://www.facebook.com/nikole.machonis?fref=ufi&rc=p",
            "https://www.facebook.com/isaiah.r.lopez?fref=ufi&rc=p",
            "https://www.facebook.com/norma.frenchspencer?fref=ufi&rc=p",
            "https://www.facebook.com/jeremy.gibney.9?fref=ufi&rc=p",
            "https://www.facebook.com/cindyq?fref=ufi&rc=p",
            "https://www.facebook.com/melissa.dick1?fref=ufi&rc=p",
            "https://www.facebook.com/shannon.o.collins?fref=ufi&rc=p",
            "https://www.facebook.com/sara.emily.sab?fref=ufi&rc=p",
            "https://www.facebook.com/jacob.barnett.188?fref=ufi&rc=p",
            "https://www.facebook.com/rlbermduez?fref=ufi&rc=p",
            "https://www.facebook.com/pamela.roach.18?fref=ufi&rc=p",
            "https://www.facebook.com/JaggedEdge808?fref=ufi&rc=p",
            "https://www.facebook.com/chisum.michelle?fref=ufi&rc=p",
            "https://www.facebook.com/jess.alley18?fref=ufi&rc=p",
            "https://www.facebook.com/debra.chimelak?fref=ufi&rc=p",
            "https://www.facebook.com/haleynansmith?fref=ufi&rc=p",
            "https://www.facebook.com/katiekrealty?fref=ufi&rc=p",
            "https://www.facebook.com/sonja.dieterichs?fref=ufi&rc=p",
            "https://www.facebook.com/brenda.gonzalez.1610092?fref=ufi&rc=p",
            "https://www.facebook.com/adriana.castorenanarvaez?fref=ufi&rc=p",
            "https://www.facebook.com/suzie.stevenson.94?fref=ufi&rc=p",
            "https://www.facebook.com/allisoncmarek?fref=ufi&rc=p",
            "https://www.facebook.com/loveslilies?fref=ufi&rc=p",
            "https://www.facebook.com/jason.styba?fref=ufi&rc=p",
            "https://www.facebook.com/ann.riner?fref=ufi&rc=p",
            "https://www.facebook.com/betsy.payne.35?fref=ufi&rc=p",
            "https://www.facebook.com/stacy.tinsley.5?fref=ufi&rc=p",
            "https://www.facebook.com/johanna.eldridge?fref=ufi&rc=p",
            "https://www.facebook.com/M0Curley?fref=ufi&rc=p",
            "https://www.facebook.com/tinad.cookwelch?fref=ufi&rc=p",
            "https://www.facebook.com/penny.silva.75?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100005778707642&fref=ufi&rc=p",
            "https://www.facebook.com/deb.gwynn?fref=ufi&rc=p",
            "https://www.facebook.com/MarleenaDawn?fref=ufi&rc=p",
            "https://www.facebook.com/cathy.t.griffin.9?fref=ufi&rc=p",
            "https://www.facebook.com/CarolinesHopeJournal?fref=ufi&rc=p",
            "https://www.facebook.com/enrique.corrales.7?fref=ufi&rc=p",
            "https://www.facebook.com/douglas.razo?fref=ufi&rc=p",
            "https://www.facebook.com/vanessa.bm1?fref=ufi&rc=p",
            "https://www.facebook.com/lauren.campos.50?fref=ufi&rc=p",
            "https://www.facebook.com/emily.banalesantuna?fref=ufi&rc=p",
            "https://www.facebook.com/ktoadvine1?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/lovewhatreallymatters/videos/1723511164337941/",
        "photos": []
    },
    {
        "comments": [],
        "description": "Mark McClane  shared  Yale Climate Connections 's  post .",
        "participants": [
            "https://www.facebook.com/mark.mcclane.357?fref=nf",
            "https://www.facebook.com/mark.mcclane.357?hc_ref=ARSoik8ZfFJL62JMuLh3leyP0XD4yOO-TxvWlsvZ68KAGsyignbAQ5zy6XaQ4WHDUiI",
            "https://www.facebook.com/YaleClimateConnections/?hc_ref=ARSoik8ZfFJL62JMuLh3leyP0XD4yOO-TxvWlsvZ68KAGsyignbAQ5zy6XaQ4WHDUiI",
            "https://www.facebook.com/YaleClimateConnections/?ref=nf&hc_ref=ARS5Y9gmPRZ2EwVbSRbtHPxEVW1A9raAW6nGaVCVuMZf55LVT-oY4IfyKOjnLfDxGdQ",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fyaleclimateconnections.org%2F2017%2F11%2Fmelting-permafrost-puts-alaska-homes-on-shaky-ground%2F&h=ATNDjcMGLQQrHZkJC8jocaxN00NtYNOnhbAkehYDbmDhkvaqkTIiiZ5Qk61030n1X3okgmbK_QtRLZSSwkwXm7YXCic0KMWLdn5TsHastzG4jLbQL3ru1eSNd-x-XAbfYnf8SpyluSGWU_mhktxYwDjNrp8AhRHK6wCBzUqySinjP90wynUYWwFGFkqNPcP4G1_y5bAeYbl3Gzc6WFLqUy_NbbApMCXsX5jkwcFxlQngaAJOtXS-NGObSOX8XNvVI4uw2fAwdwWymNSOEja8D_U"
        ],
        "post": "https://www.facebook.com/mark.mcclane.357/posts/1996197810665331",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "And they say there's no climate change.Look around people.It's happening at a faster pace than we thought it would.Only those who live by the sea or ocean are the ones who notice first because they are the ones being effected by it first.",
                "from": "https://www.facebook.com/profile.php?id=1539578342&fref=ufi&rc=p Maureen Smetzer",
                "time": "8 hrs"
            },
            {
                "content": "I don't care about the buildings and roads. They can be rebuilt if needed. We brought this on ourselves. I care about the defenseless biota, which is at the mercy of greedy humans.",
                "from": "https://www.facebook.com/sally.landaal?fref=ufi&rc=p Sally Landaal",
                "time": "8 hrs"
            },
            {
                "content": "We are the instrument that is killing our only home and yet we elect the very people who fund and protect an industry that is an archaic life destroying fuel and our consumption and consumerism is the driving force behind this archaic fossil fuel. If the Oil and Gas industry was a virus or another animal we would exterminate it, but yet we stay addicted to this industry.",
                "from": "https://www.facebook.com/cathern.murphy?fref=ufi&rc=p Cay Murphy",
                "time": "5 hrs"
            },
            {
                "content": "It's interesting that the people of the American state where global warming is the most obvious and the least deniable vote consistently for men who pretend it doesn't even exist and are working hard to make it even worse.",
                "from": "https://www.facebook.com/jim.hoff.7906?fref=ufi&rc=p Jim Hoff",
                "time": "3 hrs Edited"
            },
            {
                "content": "This is the first climate change post I've ever come across without any ignorant deniers and their usual bs. That's a start I guess... We are so screwed no matter what though.  🌎 ⏳ ",
                "from": "https://www.facebook.com/javier.masareje.3?fref=ufi&rc=p Javier Masareje",
                "time": "1 hr"
            },
            {
                "content": "Let that sink in. (Pun intended). The thing we considered permanently frozen just melted.  Time to get our act together, before something else we take as a given fades away",
                "from": "https://www.facebook.com/nate.denicola.7?fref=ufi&rc=p Nate DeNicola",
                "time": "2 hrs"
            },
            {
                "content": "people want to think there's nothing going on here i believe this is a big threat then killing People in a war saving the planet is true war climate change kill's faster then any thing every day  it effect's our food chain we need to put Trump and his Administration take them out of office  before there's nothing left to live on or food to eat !!",
                "from": "https://www.facebook.com/Matthew20016?fref=ufi&rc=p Matthew Fanolis",
                "time": "55 mins Edited"
            },
            {
                "content": "People just refuse to change their way of life until mother nature does it for them.. And she will...",
                "from": "https://www.facebook.com/donna.diasio?fref=ufi&rc=p Donna R. Diasio",
                "time": "5 hrs"
            },
            {
                "content": "Cut your own co2 footprint in half. Cancel plane tickets.  Cut your co2 footprint in half again.  Talk about doing that.  Call out environmental groups  that encourage world adventure travel. If this is real, and we say it is, the most satisfying life would have to  be the lowest-co2 life.  If this is real,  it's not possible  we can be happy violating the laws of physics that are causing the problem.",
                "from": "https://www.facebook.com/rebecca.hammond.75?fref=ufi&rc=p Rebecca Hammond",
                "time": "6 hrs"
            },
            {
                "content": "Yep, and they love republicans. I was born there but I'm gone",
                "from": "https://www.facebook.com/profile.php?id=100011022012626&fref=ufi&rc=p Cherry Diane Hemingway",
                "time": "7 hrs"
            },
            {
                "content": "I morn the Knowledge melting into the Oceans, Frozen Artifacts, held in Cold Storage, until Humans could Find & Understand them. And Ancient Virus’s!   Massive amounts of Sequestered Material, kept from the Environment, for Tens of Thousands of years . ... See More",
                "from": "https://www.facebook.com/Elio6247?fref=ufi&rc=p Paul Boehme",
                "time": "7 hrs"
            },
            {
                "content": "On the plus side, Palin will be even CLOSER to Russia from there",
                "from": "https://www.facebook.com/riff.erus?fref=ufi&rc=p Riff Erusicus",
                "time": "4 hrs Edited"
            },
            {
                "content": "Permafrost is more important than homes built where they should not be in the first place",
                "from": "https://www.facebook.com/danuta.szabunia?fref=ufi&rc=p Danuta Szabunia",
                "time": "6 hrs"
            },
            {
                "content": "Big business aught to be ashamed of themselves!  Smdh! 😠 ",
                "from": "https://www.facebook.com/michele.sheron?fref=ufi&rc=p Michele Sheron",
                "time": "6 hrs"
            },
            {
                "content": "Permafrost is not so perma these days.",
                "from": "https://www.facebook.com/brian.t.knight?fref=ufi&rc=p Brian Knight",
                "time": "3 hrs"
            },
            {
                "content": "There's a moral there somewhere-",
                "from": "https://www.facebook.com/profile.php?id=100010759396180&fref=ufi&rc=p Dennis Fisher",
                "time": "8 hrs"
            },
            {
                "content": "Is it allowing long dormant viruses to be released?",
                "from": "https://www.facebook.com/koach.harrington?fref=ufi&rc=p David Harrington",
                "time": "4 hrs"
            },
            {
                "content": "With any luck it will take Sarah Palin's.",
                "from": "https://www.facebook.com/barbara.danger.9?fref=ufi&rc=p BarBara Danger",
                "time": "55 mins"
            },
            {
                "content": "Everything crumbling like meatloaf. Should have mixed egg in as a binder.",
                "from": "https://www.facebook.com/benjamin.froehlich.3?fref=ufi&rc=p Benjamin Froehlich",
                "time": "5 hrs"
            },
            {
                "content": "Time to move, their ancestors would have.............",
                "from": "https://www.facebook.com/julie.besslermain?fref=ufi&rc=p Julie Bessler Main",
                "time": "2 hrs"
            },
            {
                "content": "Kinda like something out of \"The Graduate\" movie: THINK METHANE.",
                "from": "https://www.facebook.com/humates?fref=ufi&rc=p JFox Gibbons",
                "time": "2 hrs"
            },
            {
                "content": "Pollution for profit,Trump and Pruitt!",
                "from": "https://www.facebook.com/brock.anderson.5477?fref=ufi&rc=p Brock Anderson",
                "time": "5 hrs"
            },
            {
                "content": "Fake pictures, Fake News & FAKE CLIMATE CHANGE!",
                "from": "https://www.facebook.com/heinz.kropp.7?fref=ufi&rc=p Heinz Kropp",
                "time": "3 hrs"
            },
            {
                "content": "Inconvenient Truth",
                "from": "https://www.facebook.com/ghettobilly?fref=ufi&rc=p Cliff Foster",
                "time": "7 hrs"
            },
            {
                "content": "",
                "from": "https://www.facebook.com/williamfraker?fref=ufi&rc=p William Fraker",
                "time": "1 hr"
            },
            {
                "content": "Yikes.",
                "from": "https://www.facebook.com/shirley.alford.52?fref=ufi&rc=p Shirley Alford",
                "time": "7 hrs"
            },
            {
                "content": "Not a good sign.........",
                "from": "https://www.facebook.com/jane.bush.1656?fref=ufi&rc=p Jane Bush",
                "time": "5 hrs"
            },
            {
                "content": "Yikkes",
                "from": "https://www.facebook.com/don.evenson.3?fref=ufi&rc=p Don Evenson",
                "time": "7 hrs"
            },
            {
                "content": "Sad",
                "from": "https://www.facebook.com/kathy.elliott.1656?fref=ufi&rc=p Kathy Elliott",
                "time": "8 hrs"
            },
            {
                "content": "The PDO did it.",
                "from": "https://www.facebook.com/pete.finnegan.1?fref=ufi&rc=p Pete Finnegan",
                "time": "7 hrs"
            },
            {
                "content": " :( ",
                "from": "https://www.facebook.com/frank.r.harr?fref=ufi&rc=p Frank Royce Harr",
                "time": "5 hrs"
            },
            {
                "content": "Welcome to the melt down!",
                "from": "https://www.facebook.com/talulah.hinton?fref=ufi&rc=p Tallulah Adsila Hinton",
                "time": "1 hr"
            }
        ],
        "description": "Yale Climate Connections Alaska's permafrost is melting, putting some people’s homes at risk.",
        "participants": [
            "https://www.facebook.com/YaleClimateConnections/?ref=nf&hc_ref=ARRRyLRP-JTkIXxKijm0UTsMRPUR7kZz52GpxUrZQtpLWKEArTsV2JY1cXzzS8KAl0I",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fyaleclimateconnections.org%2F2017%2F11%2Fmelting-permafrost-puts-alaska-homes-on-shaky-ground%2F&h=ATPdY_rq6Yf_gpO0JhGc4grWsbXKyOIiui-uyLphjT0-4MmPkVC9dZ4kuq3bF_VHnpqq0ZKLLnKaajJgJdka_7c7szNq09eGlvQu283PTs1AODzeK6fQBFNwV1Vhn5_zCYIYHEsyxZDeZb4eLWCFuzRKO-hD7NxOkmLKR7h82RGBePgXc__bXQbkW2sGh1ypicr3WAkfkjmIqVD2ZKcYt3zfLEl0D9kleRekiQrRUL29wjD4jRbtsRkcr47GVufaGqVbB0VDambAHkhfNGEAxxupRkaosZA",
            "https://www.facebook.com/profile.php?id=1539578342&fref=ufi&rc=p",
            "https://www.facebook.com/sally.landaal?fref=ufi&rc=p",
            "https://www.facebook.com/cathern.murphy?fref=ufi&rc=p",
            "https://www.facebook.com/jim.hoff.7906?fref=ufi&rc=p",
            "https://www.facebook.com/javier.masareje.3?fref=ufi&rc=p",
            "https://www.facebook.com/nate.denicola.7?fref=ufi&rc=p",
            "https://www.facebook.com/Matthew20016?fref=ufi&rc=p",
            "https://www.facebook.com/donna.diasio?fref=ufi&rc=p",
            "https://www.facebook.com/rebecca.hammond.75?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011022012626&fref=ufi&rc=p",
            "https://www.facebook.com/Elio6247?fref=ufi&rc=p",
            "https://www.facebook.com/riff.erus?fref=ufi&rc=p",
            "https://www.facebook.com/danuta.szabunia?fref=ufi&rc=p",
            "https://www.facebook.com/michele.sheron?fref=ufi&rc=p",
            "https://www.facebook.com/brian.t.knight?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010759396180&fref=ufi&rc=p",
            "https://www.facebook.com/koach.harrington?fref=ufi&rc=p",
            "https://www.facebook.com/barbara.danger.9?fref=ufi&rc=p",
            "https://www.facebook.com/benjamin.froehlich.3?fref=ufi&rc=p",
            "https://www.facebook.com/julie.besslermain?fref=ufi&rc=p",
            "https://www.facebook.com/humates?fref=ufi&rc=p",
            "https://www.facebook.com/brock.anderson.5477?fref=ufi&rc=p",
            "https://www.facebook.com/heinz.kropp.7?fref=ufi&rc=p",
            "https://www.facebook.com/ghettobilly?fref=ufi&rc=p",
            "https://www.facebook.com/williamfraker?fref=ufi&rc=p",
            "https://www.facebook.com/shirley.alford.52?fref=ufi&rc=p",
            "https://www.facebook.com/jane.bush.1656?fref=ufi&rc=p",
            "https://www.facebook.com/don.evenson.3?fref=ufi&rc=p",
            "https://www.facebook.com/kathy.elliott.1656?fref=ufi&rc=p",
            "https://www.facebook.com/pete.finnegan.1?fref=ufi&rc=p",
            "https://www.facebook.com/frank.r.harr?fref=ufi&rc=p",
            "https://www.facebook.com/talulah.hinton?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1539578342&fref=ufi&rc=p",
            "https://www.facebook.com/sally.landaal?fref=ufi&rc=p",
            "https://www.facebook.com/cathern.murphy?fref=ufi&rc=p",
            "https://www.facebook.com/jim.hoff.7906?fref=ufi&rc=p",
            "https://www.facebook.com/javier.masareje.3?fref=ufi&rc=p",
            "https://www.facebook.com/nate.denicola.7?fref=ufi&rc=p",
            "https://www.facebook.com/Matthew20016?fref=ufi&rc=p",
            "https://www.facebook.com/donna.diasio?fref=ufi&rc=p",
            "https://www.facebook.com/rebecca.hammond.75?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011022012626&fref=ufi&rc=p",
            "https://www.facebook.com/Elio6247?fref=ufi&rc=p",
            "https://www.facebook.com/riff.erus?fref=ufi&rc=p",
            "https://www.facebook.com/danuta.szabunia?fref=ufi&rc=p",
            "https://www.facebook.com/michele.sheron?fref=ufi&rc=p",
            "https://www.facebook.com/brian.t.knight?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010759396180&fref=ufi&rc=p",
            "https://www.facebook.com/koach.harrington?fref=ufi&rc=p",
            "https://www.facebook.com/barbara.danger.9?fref=ufi&rc=p",
            "https://www.facebook.com/benjamin.froehlich.3?fref=ufi&rc=p",
            "https://www.facebook.com/julie.besslermain?fref=ufi&rc=p",
            "https://www.facebook.com/humates?fref=ufi&rc=p",
            "https://www.facebook.com/brock.anderson.5477?fref=ufi&rc=p",
            "https://www.facebook.com/heinz.kropp.7?fref=ufi&rc=p",
            "https://www.facebook.com/ghettobilly?fref=ufi&rc=p",
            "https://www.facebook.com/williamfraker?fref=ufi&rc=p",
            "https://www.facebook.com/shirley.alford.52?fref=ufi&rc=p",
            "https://www.facebook.com/jane.bush.1656?fref=ufi&rc=p",
            "https://www.facebook.com/don.evenson.3?fref=ufi&rc=p",
            "https://www.facebook.com/kathy.elliott.1656?fref=ufi&rc=p",
            "https://www.facebook.com/pete.finnegan.1?fref=ufi&rc=p",
            "https://www.facebook.com/frank.r.harr?fref=ufi&rc=p",
            "https://www.facebook.com/talulah.hinton?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/YaleClimateConnections/posts/1693279130691751",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "ours were, if anything, more brilliant than I had ever seen in my few years in central MO, which is also worrisome. It was a colorful as one might expect in the upper midwest or the upper east coast.",
                "from": "https://www.facebook.com/lunamom?fref=ufi&rc=p Diana Curtis",
                "time": "November 6 at 5:06pm"
            },
            {
                "content": "are you affiliated with the Yale Climate Conference,Yale School of Management?If so,I would certainly be interested in accepting your invitation to participate in the Group  Jim G.",
                "from": "https://www.facebook.com/jim.greenfield.92?fref=ufi&rc=p Jim Greenfield",
                "time": "23 hrs"
            }
        ],
        "description": "Yale Climate Connections Bad news for anybody who likes to go leaf peeping.  🍁 🍃 🍂",
        "participants": [
            "https://www.facebook.com/YaleClimateConnections/?ref=nf&hc_ref=ARR8FrcTW6j6bWCDbqi7XLi4MU5_hXvJ62ua0HDPxoRVLj_5X4jdSRSC-uU3YCQZo7U",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fyaleclimateconnections.org%2F2017%2F11%2Fclimate-change-could-dull-fall-colors&h=ATO6VvDQV59gau9rhneUXCBWpAh4GOhsWH6gbmXVwCsc0it1MGMgpOqBYzVkdxxMlDC9jmbpVk1op2sChJadEkFGTiBJrUCcfAtqclmQ_gw5RwUyLKFtif_nNUs3Zq0ynqccv2AUH1FjAxfdWbYx_cUcMVZapoRcMAizaJ6Umpdh0WqvqhiR5u5lGKtM2KaMYjRO-EYqY8UkVRBzW4yADoS4xpvX2e4qA_zsmTqU8RcTIVzWz96LK6rYVSJkMizQgM4_u20vsY4QzZptp7Upd3qrUdCWUa8",
            "https://www.facebook.com/lunamom?fref=ufi&rc=p",
            "https://www.facebook.com/jim.greenfield.92?fref=ufi&rc=p",
            "https://www.facebook.com/lunamom?fref=ufi&rc=p",
            "https://www.facebook.com/jim.greenfield.92?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/YaleClimateConnections/posts/1693279130691751",
        "photos": []
    },
    {
        "comments": [],
        "description": "Yale Climate Connections More asthma attacks are expected in a warmer climate. Learn more about how to protect yourself:  https://www.yaleclimateconnections.org/…/more-asthma-attac…/",
        "participants": [
            "https://www.facebook.com/YaleClimateConnections/?ref=nf&hc_ref=ARSpMuq3Al9BmQIjpSQg-KKTBwVIN3BSS_Szp6ftkcir7plnZE4FIhR4-fkjckTG8M0"
        ],
        "post": "https://www.facebook.com/YaleClimateConnections/posts/1693279130691751",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "Science doesn't lie or  play partisan politics. A polluted and damaged planet is the legacy you want to leave your kids and grandkids?",
                "from": "https://www.facebook.com/angela.westhouse?fref=ufi&rc=p Angela Westhouse",
                "time": "November 3 at 3:19pm Edited"
            },
            {
                "content": "We are *in* climate change now. It’s become “the weather.” Prepare for adversity, because it’s only gonna get worse.",
                "from": "https://www.facebook.com/andrewmiller78?fref=ufi&rc=p Andrew Miller",
                "time": "November 3 at 3:56pm"
            }
        ],
        "description": "Yale Climate Connections “I had been a conscientious objector to the Vietnam War in the late sixties,” Grady McGonagill says. “I decided I was a conscientious objector to climate change.”",
        "participants": [
            "https://www.facebook.com/YaleClimateConnections/?ref=nf&hc_ref=ARSsAyLIiNilwYjPFJvYc7uLbQ9bE0K60nC07N6HdlfZiWAfALOKeVQUHD078zuWlWI",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.yaleclimateconnections.org%2F2017%2F11%2Fseniors-organize-against-climate-change%2F&h=ATPa1gx0SKIAIUsQOlbmDJV_zdLiXIDeZPGYMzw7w1AJjt-PFXIACdBOfad3r2VJrKHxZ9q1d_GfssWFv8HQWWGLTCu0ybZVhX59SzV2x3ATEwJZ-8sg5WhgFoUK2mJ8Bwr2lq7-DNnXlcfOe6Gza22Rzpa1qA-33Ae5VF5nHbNkCbjW_h4lx81qV_4DMOYq5EXpm3XmiNqz7suze-wFrVrVDUhKYT51uuMuQN8xVLi_LzVfAx_dUzfiv7OT1vpwx5C4AEP1h7fBjpYm7qPUBAfqADYzkR0",
            "https://www.facebook.com/angela.westhouse?fref=ufi&rc=p",
            "https://www.facebook.com/andrewmiller78?fref=ufi&rc=p",
            "https://www.facebook.com/angela.westhouse?fref=ufi&rc=p",
            "https://www.facebook.com/andrewmiller78?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/YaleClimateConnections/posts/1693279130691751",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "Jalynn, it is good to know about a young person actively learning the ins and outs of climate change.  You and others like you will be needed to share ideas with organizations, cities, and states not yet committed to taking action.  Education and educating others is so important.",
                "from": "https://www.facebook.com/profile.php?id=100000852946237&fref=ufi&rc=p Margaret Waters",
                "time": "November 2 at 2:30pm"
            },
            {
                "content": "Teens like Jaylynn are our future and our hope.",
                "from": "https://www.facebook.com/peggy.gunter.14?fref=ufi&rc=p Peggy Gunter",
                "time": "November 2 at 4:24pm"
            }
        ],
        "description": "Yale Climate Connections “You are the solution in your community. You can be a change for the better.” — Jalynn Webb",
        "participants": [
            "https://www.facebook.com/YaleClimateConnections/?ref=nf&hc_ref=ARR-1Z94FJihWBIQx6_JmniLo2DE3rM6pzQNebz9cu1Xhmr1vozU5Bfr4bU9AUJ-o24",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.yaleclimateconnections.org%2F2017%2F11%2Fa-teens-wake-up-call-on-climate%2F&h=ATOrPBICm2vh8WVCYepbFD_Z9q4MWdUvWIR7Qcgrblj-tm6QzlYqs5MdB2rYfr5jHQfhi2I0COrSOGJkCFwc1pe4td9_iAhdRSyZxrAw2uFC0_n7rOZUX7v53C7eS1ixcKLd43pqWBHbNfmbfBqiKUo7ZvWmIp6FmluJlpN3hRtYhkWiFpOplUJ8nvh2koxLuhuS1KX6TVkzVHEhJgahFwTzRBVRyCkddfMceR7Hlfw7ayaP7RRgOVVVKp0FvHWBYyu4e2PwxQmTLPSjMRt3swCFfflDCLo",
            "https://www.facebook.com/profile.php?id=100000852946237&fref=ufi&rc=p",
            "https://www.facebook.com/peggy.gunter.14?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000852946237&fref=ufi&rc=p",
            "https://www.facebook.com/peggy.gunter.14?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/YaleClimateConnections/posts/1693279130691751",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "JT Neumann ~  Buddy your ignorance is showing!  Solar actually saves the environment ~ it's renewable!  You sound like a Trump Supporter and Fox News listener ~ who are paid to promote fossil fuels!  Not too smart...  Fossil fuels are on their way out ~   ;) ",
                "from": "https://www.facebook.com/greg.fitzsimmons?fref=ufi&rc=p Greg Fitzsimmons",
                "time": "November 2 at 3:03am"
            },
            {
                "content": "The Governor of Florida made it illegal to run your house on solar only. They will take your home and jail for a year. GOP is one crooked party. Look it up if you think I'm BSing",
                "from": "https://www.facebook.com/yostnw?fref=ufi&rc=p Bob Yost",
                "time": "November 2 at 4:27am"
            }
        ],
        "description": "Yale Climate Connections This new program aims to bring solar power to low-income renters in more than 200,000 households statewide.",
        "participants": [
            "https://www.facebook.com/YaleClimateConnections/?ref=nf&hc_ref=ARSAFsjmev1pt4Zj3ZkzV6k8txeWVtN5px1Abco5Cwdojakk0fEeDXkxJlVmxLW0rkg",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.yaleclimateconnections.org%2F2017%2F11%2Fcalifornia-law-helps-low-income-people-go-solar%2F&h=ATPIIpQVFjLEBGcfTNjCCXfWSygBo_dv4N-zDeBpwm25zAiUM-vkCUVKUkdtFFeerr2oW8UZM1ieRoyBTPys5KqQcJZijs_CVgMuvOkw_VmpYAk4HTj3GfsMJOxDaq7-AcWbG3ZTaurIg2WmQSRssf75oe27aikNDAUk1Q75LHG1e6ZCwfup18xfC9YrlmMv_Nx1VpddZbrRCbfn-nb1ENK9begMAwxATE_ZlchlwBjktnQ-N0lufwslpqtUZwq9z4WamqABs6m9oPF-YIGBEOPe1zQ4f5M",
            "https://www.facebook.com/greg.fitzsimmons?fref=ufi&rc=p",
            "https://www.facebook.com/yostnw?fref=ufi&rc=p",
            "https://www.facebook.com/greg.fitzsimmons?fref=ufi&rc=p",
            "https://www.facebook.com/yostnw?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/YaleClimateConnections/posts/1693279130691751",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "We have to cause palm oil stocks to plummet.   Its also killing of the Orangutans habitat. I tried top make candles from palm oil.   Horrid!!",
                "from": "https://www.facebook.com/LyndaLBD?fref=ufi&rc=p Lynda L B Duke",
                "time": "October 31 at 5:42pm Edited"
            },
            {
                "content": "Yeah, yeah, many people would be giving out homemade stuff with decent ingredients if the press didn't keep the parents so paranoid that they won't let the kids eat it",
                "from": "https://www.facebook.com/juliette.noether?fref=ufi&rc=p Juliette Noether",
                "time": "October 31 at 3:47pm"
            }
        ],
        "description": "Yale Climate Connections Halloween candy isn’t just causing stomach aches.",
        "participants": [
            "https://www.facebook.com/YaleClimateConnections/?ref=nf&hc_ref=ART_ynX4BghON-KmpCYaB3hB4DpcZ7h80DvxdBxUTcpjX3VbChqeFTBRpzkHsQjnD_Y",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.yaleclimateconnections.org%2F2017%2F10%2Fhalloween-candys-link-to-climate-change%2F&h=ATNUEPlPh5tKtnp84tjjHwUKT9xi7WXn2p_d_9zqNtT44uOyzosxfU5K_3v0_i75485RxwCf9vXVt9983MDZYAskctce4G-QUwQGDgZCrqjdRCaeO9zCmX2iXe5VJdFYJ4EvZOMBikEXGmR0n-5wPqm8axr3X_VFPa4wuJS-ZKJRnBOhR9r6qO4g1-zrTD2NCbgHhYOoU2doTsK3Kd-A995jmzhf-uKjNJGko-MBhsOa3MqovjMbJ-77fG5KF3iJtO3wAQwqP4jyg-4bLCXQJsTYiv_a6M8",
            "https://www.facebook.com/LyndaLBD?fref=ufi&rc=p",
            "https://www.facebook.com/juliette.noether?fref=ufi&rc=p",
            "https://www.facebook.com/LyndaLBD?fref=ufi&rc=p",
            "https://www.facebook.com/juliette.noether?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/YaleClimateConnections/posts/1693279130691751",
        "photos": []
    },
    {
        "comments": [],
        "description": "Mark McClane  shared  explore.org 's  live video . explore.org",
        "participants": [
            "https://www.facebook.com/mark.mcclane.357?fref=nf",
            "https://www.facebook.com/mark.mcclane.357?hc_ref=ARR_78KwVcCrgirxrqChcx5A4ayhE7QLfO7qwQLHxJIdmZJx6jSpm7X5eCdI7j0_j9A",
            "https://www.facebook.com/ExploreOrg/?hc_ref=ARR_78KwVcCrgirxrqChcx5A4ayhE7QLfO7qwQLHxJIdmZJx6jSpm7X5eCdI7j0_j9A",
            "/ExploreOrg/videos/10155006397115334/?hc_ref=ARR_78KwVcCrgirxrqChcx5A4ayhE7QLfO7qwQLHxJIdmZJx6jSpm7X5eCdI7j0_j9A",
            "https://www.facebook.com/ExploreOrg/?hc_ref=ARSiYsCOMjTQHB_LCs_OjLfQUXq6lVwo7lWWx5OGtNw0HIdk83idqIphr30zqtz9jK0"
        ],
        "post": "https://www.facebook.com/mark.mcclane.357/posts/1995884187363360",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "https://goo.gl/f3FGlo",
                "from": "https://www.facebook.com/ExploreOrg/?rc=p explore.org",
                "time": "21 hrs"
            },
            {
                "content": "How deep are those guys going to dig?     I love watching this.  I wish I could go to the beach right now.",
                "from": "https://www.facebook.com/profile.php?id=100008309871357&fref=ufi&rc=p Sherry Ogan",
                "time": "34 mins"
            },
            {
                "content": "Good morning world in the name of God.",
                "from": "https://www.facebook.com/profile.php?id=100010101965203&fref=ufi&rc=p Ana Cecilia Cattan",
                "time": "20 hrs"
            },
            {
                "content": "Thanks for sharing...I really enjoyed it..",
                "from": "https://www.facebook.com/thomas.rowe.3762?fref=ufi&rc=p Thomas Rowe",
                "time": "20 hrs"
            },
            {
                "content": "Aloha from the High Desert in So CA ❤️ ",
                "from": "https://www.facebook.com/janice.vanhorne.1?fref=ufi&rc=p Janice Van Horne",
                "time": "20 hrs"
            },
            {
                "content": "Wish I had my pant's rolled up and there right now!!!!!!",
                "from": "https://www.facebook.com/peggy.meritt.9?fref=ufi&rc=p Peggy Meritt",
                "time": "21 hrs"
            },
            {
                "content": "Seriously just amazing or you are crazy Bahahaha",
                "from": "https://www.facebook.com/profile.php?id=100011980598332&fref=ufi&rc=p Colleen Truscott",
                "time": "21 hrs"
            },
            {
                "content": "Love the beach....anywhere...everywhere",
                "from": "https://www.facebook.com/soniaregina.sales.3?fref=ufi&rc=p Sonia Regina Sales",
                "time": "21 hrs"
            },
            {
                "content": "I was just there in June! Amazing to say the least!",
                "from": "https://www.facebook.com/damon.damico.9?fref=ufi&rc=p Damon D'Amico",
                "time": "20 hrs"
            },
            {
                "content": "Beautiful, from Gladwin, Michigan!",
                "from": "https://www.facebook.com/martie.cunningham1?fref=ufi&rc=p Martie Cunningham",
                "time": "20 hrs"
            },
            {
                "content": "So blissfully AMAZING. THANK YOU FOR SHARING SUCH BEAUTY",
                "from": "https://www.facebook.com/weiman.diana?fref=ufi&rc=p Diana Weiman",
                "time": "20 hrs"
            },
            {
                "content": "oh how I was there right now, instead of Montreal, Canada ,with rain and snow  coming soon  :'( ",
                "from": "https://www.facebook.com/Francine.Frosia?fref=ufi&rc=p Francine Eufrosinia",
                "time": "20 hrs"
            },
            {
                "content": "Beautiful ! God sure does paint a Beautiful picture !",
                "from": "https://www.facebook.com/karen.garner.9212?fref=ufi&rc=p Karen Garner",
                "time": "20 hrs"
            },
            {
                "content": "Love the glow of the water!",
                "from": "https://www.facebook.com/judy.morgan.35?fref=ufi&rc=p Judy Morgan",
                "time": "20 hrs"
            },
            {
                "content": "What is a wonderful world....",
                "from": "https://www.facebook.com/luciana.arifin.7?fref=ufi&rc=p Luciana Arifin",
                "time": "21 hrs"
            },
            {
                "content": "Beautiful!!! Thanks for sharing. Hi from Loveland, Colorado.",
                "from": "https://www.facebook.com/kathy.speed.1?fref=ufi&rc=p Kathy Speed",
                "time": "21 hrs"
            },
            {
                "content": "Be in Hawaii in February  .Can't wait.",
                "from": "https://www.facebook.com/profile.php?id=100009896538945&fref=ufi&rc=p Beryl Robinson",
                "time": "20 hrs"
            },
            {
                "content": "We were here seven years ago absolutely  beautiful.",
                "from": "https://www.facebook.com/bennyjane.smith?fref=ufi&rc=p Benny-Jane Smith",
                "time": "20 hrs"
            },
            {
                "content": "The waves are large or small seasonally.",
                "from": "https://www.facebook.com/elizabeth.guerrero.3154?fref=ufi&rc=p Elizabeth Guerrero",
                "time": "20 hrs"
            },
            {
                "content": "It is 32 degrees in South Dakota so this looks wonderful....",
                "from": "https://www.facebook.com/marvel.jensen.1?fref=ufi&rc=p Marvel Jensen",
                "time": "20 hrs"
            },
            {
                "content": "Thats beautiful ocean that heard wave went smooth",
                "from": "https://www.facebook.com/profile.php?id=100005722095294&fref=ufi&rc=p Liandre Mclaren",
                "time": "20 hrs"
            },
            {
                "content": "A lot of people enjoying the sunset on the beach  🌴  HELLO from Melbourne,Florida !",
                "from": "https://www.facebook.com/janet.ross.5?fref=ufi&rc=p Janet Ross",
                "time": "21 hrs"
            },
            {
                "content": "My favorite place so gorgeous tonight 🌊 ",
                "from": "https://www.facebook.com/kelly.berlandi?fref=ufi&rc=p Kelly Whitney",
                "time": "20 hrs"
            },
            {
                "content": "Beautiful....wish i was there",
                "from": "https://www.facebook.com/profile.php?id=100011425835570&fref=ufi&rc=p Lisa Rowland Lewis",
                "time": "20 hrs"
            },
            {
                "content": "Definitely where I would love to play with my pup",
                "from": "https://www.facebook.com/louise.michalkow.1?fref=ufi&rc=p Louise Michalkow",
                "time": "20 hrs"
            },
            {
                "content": "Tucson, AZ..love ALL the Hawaiian Islands!",
                "from": "https://www.facebook.com/susan.buelna.5?fref=ufi&rc=p Susan Buelna",
                "time": "20 hrs"
            },
            {
                "content": "wow..thanks for the day",
                "from": "https://www.facebook.com/polina.deighton?fref=ufi&rc=p Polina Deighton",
                "time": "21 hrs"
            },
            {
                "content": "Great shot",
                "from": "https://www.facebook.com/philip.pena1?fref=ufi&rc=p Philip Pena",
                "time": "20 hrs"
            },
            {
                "content": "The sun has gone and the water is glowing pink.  So beautiful.",
                "from": "https://www.facebook.com/profile.php?id=100008309871357&fref=ufi&rc=p Sherry Ogan",
                "time": "32 mins"
            },
            {
                "content": "That is wonderful. So peaceful.",
                "from": "https://www.facebook.com/shtodd3?fref=ufi&rc=p Sara Harper Todd",
                "time": "21 hrs"
            },
            {
                "content": "Beautifil  ❤️ ❤️ ❤️ ❤️ ❤️ ❤️ ❤️ ",
                "from": "https://www.facebook.com/miryam.pina.5?fref=ufi&rc=p Miryam Piña",
                "time": "21 hrs"
            },
            {
                "content": "Ooooo...nice!",
                "from": "https://www.facebook.com/profile.php?id=100009021840981&fref=ufi&rc=p Bonnie Holleman Scanlan",
                "time": "21 hrs"
            },
            {
                "content": "",
                "from": "https://www.facebook.com/profile.php?id=100010552119927&fref=ufi&rc=p Pan Pwint",
                "time": "20 hrs"
            },
            {
                "content": "Thanks from México city",
                "from": "https://www.facebook.com/profile.php?id=100013229828048&fref=ufi&rc=p Grace Cruz",
                "time": "20 hrs"
            },
            {
                "content": "I could watch all night!!",
                "from": "https://www.facebook.com/christina.dailey1?fref=ufi&rc=p Christina Williams Dailey",
                "time": "20 hrs"
            },
            {
                "content": "Amazing watching from Ludlow ME",
                "from": "https://www.facebook.com/cindy.reeves.75?fref=ufi&rc=p Cindy McGuire Reeves",
                "time": "21 hrs"
            },
            {
                "content": "Just got home from there 😎 ",
                "from": "https://www.facebook.com/kathy.lockhartpenrose?fref=ufi&rc=p Kathy M Lockhart Penrose",
                "time": "21 hrs"
            },
            {
                "content": "Nice   !   Hi , From Knoxville , TN  !",
                "from": "https://www.facebook.com/theo.snowden.5?fref=ufi&rc=p Theo Snowden",
                "time": "20 hrs"
            },
            {
                "content": "Missed  that place!",
                "from": "https://www.facebook.com/profile.php?id=100000579861862&fref=ufi&rc=p Jaime R. Reatiraza",
                "time": "21 hrs"
            },
            {
                "content": "Beautiful from Guam",
                "from": "https://www.facebook.com/profile.php?id=100011892270861&fref=ufi&rc=p Merv Cruz",
                "time": "20 hrs"
            },
            {
                "content": "I know",
                "from": "https://www.facebook.com/profile.php?id=100011980598332&fref=ufi&rc=p Colleen Truscott",
                "time": "21 hrs"
            },
            {
                "content": "Relaxing and beautiful",
                "from": "https://www.facebook.com/laurie.gaulin?fref=ufi&rc=p Laurie Gaulin",
                "time": "21 hrs"
            },
            {
                "content": "Beautiful  ⛅  sunset",
                "from": "https://www.facebook.com/winsom.sinclair?fref=ufi&rc=p Winsom Sinclair",
                "time": "21 hrs"
            },
            {
                "content": "Next best thing to being there!  😁 ",
                "from": "https://www.facebook.com/judy.morgan.35?fref=ufi&rc=p Judy Morgan",
                "time": "20 hrs"
            },
            {
                "content": "Good night",
                "from": "https://www.facebook.com/profile.php?id=100013229828048&fref=ufi&rc=p Grace Cruz",
                "time": "20 hrs"
            },
            {
                "content": "Beautiful",
                "from": "https://www.facebook.com/profile.php?id=100013229828048&fref=ufi&rc=p Grace Cruz",
                "time": "20 hrs"
            },
            {
                "content": "Lovely view thank you  ❤️ ",
                "from": "https://www.facebook.com/maryfrances.locklearstarner?fref=ufi&rc=p Mary Frances Locklear Starner",
                "time": "21 hrs"
            },
            {
                "content": "Beautiful..",
                "from": "https://www.facebook.com/profile.php?id=100007784130408&fref=ufi&rc=p Dolores Martinez Barker",
                "time": "20 hrs"
            },
            {
                "content": "So beautiful",
                "from": "https://www.facebook.com/winsom.sinclair?fref=ufi&rc=p Winsom Sinclair",
                "time": "21 hrs"
            },
            {
                "content": "Beautiful Sunset!!!!!",
                "from": "https://www.facebook.com/tina.webbdomme?fref=ufi&rc=p Tina Webb-Domme",
                "time": "20 hrs"
            }
        ],
        "description": "explore.org  was live. Catch some waves and the sunset from Waimea Bay, the birth place of big wave surfing.  Watch more at  http://explore.org/waimea",
        "participants": [
            "https://www.facebook.com/ExploreOrg/?ref=nf&hc_ref=ARRQCetgEDvbH3EHNUNu8zCFmFQKipRKYK_yhvXHsDaSUZuY8fXwN20izvMoJehwAKA",
            "https://www.facebook.com/ExploreOrg/?hc_ref=ARQA-aioqFNd2OsOpzxXqsoGFy_kbqT1pOZFQSNpfwB3_DIL3kFJtKsFUQUM3KPsR2U",
            "https://www.facebook.com/ExploreOrg/?rc=p",
            "https://l.facebook.com/l.php?u=https%3A%2F%2Fgoo.gl%2Ff3FGlo&h=ATNLVDKU5_SEnfWjg9w4KYXBcofNLEjq1An8kBfttZXgk4dQ3n904Uwk_VEF8LvyETb7dOOVEdVy_K4vw7rkaDEfXSZPZQnIsbYI_wFX2DHkRH8AauEy-mUZg6CFBSPEvQwzcWoOQC1dE9_ZHi8CRoy4RR3aRMWXAAWFtOjwqO9Uf61-xC-dmYBiziWRwf9cZF379JuynnE4lPVqXcYUY2V8sSnZnULzqisJ9YVP7w4YMY0G84eXKELk",
            "https://www.facebook.com/profile.php?id=100008309871357&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010101965203&fref=ufi&rc=p",
            "https://www.facebook.com/thomas.rowe.3762?fref=ufi&rc=p",
            "https://www.facebook.com/janice.vanhorne.1?fref=ufi&rc=p",
            "https://www.facebook.com/peggy.meritt.9?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011980598332&fref=ufi&rc=p",
            "https://www.facebook.com/soniaregina.sales.3?fref=ufi&rc=p",
            "https://www.facebook.com/damon.damico.9?fref=ufi&rc=p",
            "https://www.facebook.com/martie.cunningham1?fref=ufi&rc=p",
            "https://www.facebook.com/weiman.diana?fref=ufi&rc=p",
            "https://www.facebook.com/Francine.Frosia?fref=ufi&rc=p",
            "https://www.facebook.com/karen.garner.9212?fref=ufi&rc=p",
            "https://www.facebook.com/judy.morgan.35?fref=ufi&rc=p",
            "https://www.facebook.com/luciana.arifin.7?fref=ufi&rc=p",
            "https://www.facebook.com/kathy.speed.1?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009896538945&fref=ufi&rc=p",
            "https://www.facebook.com/bennyjane.smith?fref=ufi&rc=p",
            "https://www.facebook.com/elizabeth.guerrero.3154?fref=ufi&rc=p",
            "https://www.facebook.com/marvel.jensen.1?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100005722095294&fref=ufi&rc=p",
            "https://www.facebook.com/janet.ross.5?fref=ufi&rc=p",
            "https://www.facebook.com/kelly.berlandi?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011425835570&fref=ufi&rc=p",
            "https://www.facebook.com/louise.michalkow.1?fref=ufi&rc=p",
            "https://www.facebook.com/susan.buelna.5?fref=ufi&rc=p",
            "https://www.facebook.com/polina.deighton?fref=ufi&rc=p",
            "https://www.facebook.com/philip.pena1?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100008309871357&fref=ufi&rc=p",
            "https://www.facebook.com/shtodd3?fref=ufi&rc=p",
            "https://www.facebook.com/miryam.pina.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009021840981&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010552119927&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100013229828048&fref=ufi&rc=p",
            "https://www.facebook.com/christina.dailey1?fref=ufi&rc=p",
            "https://www.facebook.com/cindy.reeves.75?fref=ufi&rc=p",
            "https://www.facebook.com/kathy.lockhartpenrose?fref=ufi&rc=p",
            "https://www.facebook.com/theo.snowden.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000579861862&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011892270861&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011980598332&fref=ufi&rc=p",
            "https://www.facebook.com/laurie.gaulin?fref=ufi&rc=p",
            "https://www.facebook.com/winsom.sinclair?fref=ufi&rc=p",
            "https://www.facebook.com/judy.morgan.35?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100013229828048&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100013229828048&fref=ufi&rc=p",
            "https://www.facebook.com/maryfrances.locklearstarner?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100007784130408&fref=ufi&rc=p",
            "https://www.facebook.com/winsom.sinclair?fref=ufi&rc=p",
            "https://www.facebook.com/tina.webbdomme?fref=ufi&rc=p",
            "https://www.facebook.com/ExploreOrg/?rc=p",
            "https://www.facebook.com/profile.php?id=100008309871357&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010101965203&fref=ufi&rc=p",
            "https://www.facebook.com/thomas.rowe.3762?fref=ufi&rc=p",
            "https://www.facebook.com/janice.vanhorne.1?fref=ufi&rc=p",
            "https://www.facebook.com/peggy.meritt.9?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011980598332&fref=ufi&rc=p",
            "https://www.facebook.com/soniaregina.sales.3?fref=ufi&rc=p",
            "https://www.facebook.com/damon.damico.9?fref=ufi&rc=p",
            "https://www.facebook.com/martie.cunningham1?fref=ufi&rc=p",
            "https://www.facebook.com/weiman.diana?fref=ufi&rc=p",
            "https://www.facebook.com/Francine.Frosia?fref=ufi&rc=p",
            "https://www.facebook.com/karen.garner.9212?fref=ufi&rc=p",
            "https://www.facebook.com/judy.morgan.35?fref=ufi&rc=p",
            "https://www.facebook.com/luciana.arifin.7?fref=ufi&rc=p",
            "https://www.facebook.com/kathy.speed.1?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009896538945&fref=ufi&rc=p",
            "https://www.facebook.com/bennyjane.smith?fref=ufi&rc=p",
            "https://www.facebook.com/elizabeth.guerrero.3154?fref=ufi&rc=p",
            "https://www.facebook.com/marvel.jensen.1?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100005722095294&fref=ufi&rc=p",
            "https://www.facebook.com/janet.ross.5?fref=ufi&rc=p",
            "https://www.facebook.com/kelly.berlandi?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011425835570&fref=ufi&rc=p",
            "https://www.facebook.com/louise.michalkow.1?fref=ufi&rc=p",
            "https://www.facebook.com/susan.buelna.5?fref=ufi&rc=p",
            "https://www.facebook.com/polina.deighton?fref=ufi&rc=p",
            "https://www.facebook.com/philip.pena1?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100008309871357&fref=ufi&rc=p",
            "https://www.facebook.com/shtodd3?fref=ufi&rc=p",
            "https://www.facebook.com/miryam.pina.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009021840981&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010552119927&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100013229828048&fref=ufi&rc=p",
            "https://www.facebook.com/christina.dailey1?fref=ufi&rc=p",
            "https://www.facebook.com/cindy.reeves.75?fref=ufi&rc=p",
            "https://www.facebook.com/kathy.lockhartpenrose?fref=ufi&rc=p",
            "https://www.facebook.com/theo.snowden.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000579861862&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011892270861&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011980598332&fref=ufi&rc=p",
            "https://www.facebook.com/laurie.gaulin?fref=ufi&rc=p",
            "https://www.facebook.com/winsom.sinclair?fref=ufi&rc=p",
            "https://www.facebook.com/judy.morgan.35?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100013229828048&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100013229828048&fref=ufi&rc=p",
            "https://www.facebook.com/maryfrances.locklearstarner?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100007784130408&fref=ufi&rc=p",
            "https://www.facebook.com/winsom.sinclair?fref=ufi&rc=p",
            "https://www.facebook.com/tina.webbdomme?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/ExploreOrg/videos/10155006397115334/",
        "photos": []
    },
    {
        "comments": [],
        "description": "Mark McClane  shared  Lock him up 's  post .",
        "participants": [
            "https://www.facebook.com/mark.mcclane.357?fref=nf",
            "https://www.facebook.com/mark.mcclane.357?hc_ref=ARRzJvpEK1Adl2K5btndfO6Ksp-SrjCIV_FVx6CmKgj_1JLu0Cw168HU97QcrsAsgcs",
            "https://www.facebook.com/lockhimupnow/?hc_ref=ARRzJvpEK1Adl2K5btndfO6Ksp-SrjCIV_FVx6CmKgj_1JLu0Cw168HU97QcrsAsgcs"
        ],
        "post": "https://www.facebook.com/mark.mcclane.357/posts/1995701267381652",
        "photos": []
    },
    {
        "comments": [],
        "description": "Mark McClane  shared  Police The Police 's  video .",
        "participants": [
            "https://www.facebook.com/mark.mcclane.357?fref=nf",
            "https://www.facebook.com/mark.mcclane.357?hc_ref=ARTSkKItQiKKpHKFt5mVRWxF1FUE4KQ7BTq9cwyrrxjbretRufi-7IOTJ9HTedtltps",
            "https://www.facebook.com/policethepoliceACP/?hc_ref=ARTSkKItQiKKpHKFt5mVRWxF1FUE4KQ7BTq9cwyrrxjbretRufi-7IOTJ9HTedtltps",
            "/policethepoliceACP/videos/1965393950144258/?hc_ref=ARTSkKItQiKKpHKFt5mVRWxF1FUE4KQ7BTq9cwyrrxjbretRufi-7IOTJ9HTedtltps"
        ],
        "post": "https://www.facebook.com/mark.mcclane.357/posts/1995270807424698",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "Wow they just violated a few constitutional rights and amendments! Somebody is going to get paid!!  👍 👍 👍 ",
                "from": "https://www.facebook.com/profile.php?id=100007376375489&fref=ufi&rc=p Roll Out",
                "time": "November 4 at 9:07pm"
            },
            {
                "content": "Neighbors stay inside ...we don't want you recording what we are about to do to what is probably the wrong house . If you choose to use your own property we will violate your rights with impunity!",
                "from": "https://www.facebook.com/blaine.jensen.71?fref=ufi&rc=p Blaine Jensen",
                "time": "November 4 at 9:09pm"
            },
            {
                "content": "Dude was standing in his own yard across the street. How is that interfering? How is telling him to go inside a lawful order? It looked to me like they were trespassing. It also looked like they were butthurt because a lowly citizen didn't obey the commands of the lords.  This is what freedom looks like in America. You are free to do as you are told.",
                "from": "https://www.facebook.com/ben.sutter.5?fref=ufi&rc=p Ben Sutter",
                "time": "November 4 at 9:15pm"
            },
            {
                "content": "Fine examples like this are the answer to why people don't trust the police. Honestly I'd trust the bloods, crip, mob, and hell's angels before I ever trust a cop.",
                "from": "https://www.facebook.com/profile.php?id=100011674779449&fref=ufi&rc=p Echo Grey",
                "time": "November 4 at 9:55pm Edited"
            },
            {
                "content": "Didn't they just go onto his property without a warrant and no reason to arrest him, but did it anyway? Prepare for the trumped up charge of resisting arrest when he should have just plainly shot those pigs for coming at him illegal and kidnapping him.",
                "from": "https://www.facebook.com/profile.php?id=100022602564043&fref=ufi&rc=p Michael Howard",
                "time": "November 4 at 9:19pm Edited"
            },
            {
                "content": "They are about to kill somebody so they don't want nobody to film them. Don't call the police to your house. You will regret it.",
                "from": "https://www.facebook.com/profile.php?id=100005448213712&fref=ufi&rc=p James Turner",
                "time": "November 4 at 9:57pm"
            },
            {
                "content": "Hey dum ass all you had to do was to listen to them. And you would have been fine. Theirs a reason they asked you to go in. It was for your safety. Can't fix stupid. Hope you slept good",
                "from": "https://www.facebook.com/mike.hess.9887?fref=ufi&rc=p Mike Hess",
                "time": "November 5 at 12:17am"
            },
            {
                "content": "People saying he could get shot standing outside. Yea he could shot. No different than sitting in his house. Vinyl siding, osb, fiberglass insulation, and 1/2 inch drywall doesn't stop bullets.",
                "from": "https://www.facebook.com/ben.sutter.5?fref=ufi&rc=p Ben Sutter",
                "time": "November 4 at 9:32pm"
            },
            {
                "content": "I'm not sure what the issue is. The neighbors were told to stay inside and stay away from windows. The SWAT team was there. Obviously this wasnt a minor thing. It was for saftey reasons but no, there is always that one person who doesn't comply, causes ... See More",
                "from": "https://www.facebook.com/tawnyaeaston?fref=ufi&rc=p Tawnya Coomer",
                "time": "November 4 at 10:26pm"
            },
            {
                "content": "Cunts are fucked in the head They left their job just to arrest someone who’s on their yard and doing nothing harmful to anyone",
                "from": "https://www.facebook.com/youngwizze?fref=ufi&rc=p Patrick Sillah",
                "time": "November 4 at 9:13pm Edited"
            },
            {
                "content": "SO thankful for all the brave men and women fighting overseas for the rights and freedoms we have in this nation...",
                "from": "https://www.facebook.com/profile.php?id=820230400&fref=ufi&rc=p J.d. Daruvalla",
                "time": "November 4 at 9:19pm"
            },
            {
                "content": "Cops really hate cameras and hate being filmed. They hate the fact they have camera in their car and body cams on them. It's odd how they don't want anyone to see what they are doing or have proof of what they are doing. I thought they are all good guys serving and protecting us? What are they trying to hide? Only someone who is up to no good cares about being filmed.",
                "from": "https://www.facebook.com/cody.klumbis?fref=ufi&rc=p Code Klumbis",
                "time": "November 4 at 9:34pm"
            },
            {
                "content": "This is fucking bullshit.  We are under military occupation. America has been invaded by a domestic occupying force that entirely disregards our constitution.   ... See More",
                "from": "https://www.facebook.com/nick.mandaville?fref=ufi&rc=p Nick Mandaville",
                "time": "November 5 at 2:20am Edited"
            },
            {
                "content": "American cops are out of control bullies and someone has to reign them in or war is going to break out on AMerican streets. They abuse their powers routinely with impunity and show no respect for the rights of citizens. They only respect their own authority as if it we sacrosanct. They need to have serious limiting rules of engagement imp[osed upon them and be held accountable for failure to comply.",
                "from": "https://www.facebook.com/les.braden?fref=ufi&rc=p Les Braden",
                "time": "November 4 at 9:28pm"
            },
            {
                "content": "If the officer had said it is actually in a he guys best interest and safety to go inside things would be different. So now, I guess the cop wasn't needed since his is now arresting and innocent stupid man. Or the officer was to make sure there weren't ... See More",
                "from": "https://www.facebook.com/AlisonsNiche?fref=ufi&rc=p Alison Fox",
                "time": "November 4 at 9:39pm"
            },
            {
                "content": "Cops think saying “this is a lawful order” actually makes it a lawful order.  In reality, the majority of “orders” a cop gives are unlawful and entirely against the most basic fundamental principles of “Freedom.” ... See More",
                "from": "https://www.facebook.com/james.vaughn.9?fref=ufi&rc=p James Vaughn",
                "time": "November 4 at 11:16pm"
            },
            {
                "content": "What a circus America is becoming.  The world is laughing and at the same time scared. Trump as head of state endangering the whole world and daily stories not about Islam terrorist but about homegrown terrorist, a totally runaway police, racisme,  hat ... See More",
                "from": "https://www.facebook.com/hans.loos.5?fref=ufi&rc=p Hans Loos",
                "time": "November 4 at 11:59pm Edited"
            },
            {
                "content": "if they are serving a \"legitimate\" search warrant to the address.  they broadcasted out.  you cant order other residents to stay in their homes.  those illegal acts need to be met with fire power.  put your hands on me.  i will DEFEND myself up to the lost of their life.  ooh rah",
                "from": "https://www.facebook.com/freddy.kapone?fref=ufi&rc=p Freddy Kapone",
                "time": "November 4 at 11:27pm Edited"
            },
            {
                "content": "This is why I hate most cops he wasn't bothering anything they were doing and.  Before anyone says it was for his safety what he wants to risk is totally up to him another reason seat belt laws are bs",
                "from": "https://www.facebook.com/robert.coppola.37?fref=ufi&rc=p Robert Coppola",
                "time": "November 4 at 9:49pm"
            },
            {
                "content": "They didn't have a warrant to be on his property, so they had no authority to make commands and arrest him in the same.  Clear as day, they can fuck off, do their little childish raid for a plant, and leave the filmer alone.",
                "from": "https://www.facebook.com/cbburtraw?fref=ufi&rc=p Christopher Burtraw",
                "time": "November 5 at 12:52am"
            },
            {
                "content": "Infringing upon the rights of others to perform your job duties makes you the criminal. Police who violate our rights should be jailed and fired. This kind of behavior can not stand and should be dealt with seriously and swiftly to prevent police from thinking they are above the law and acting accordingly.",
                "from": "https://www.facebook.com/colormekissed69?fref=ufi&rc=p Sarah Farrell",
                "time": "November 5 at 2:17pm"
            },
            {
                "content": "Maybe he should have fucking listened? People whine about cops doing shit like this but why couldn't that guy just go in his damn house and look out his window?",
                "from": "https://www.facebook.com/ama.diaz.9828?fref=ufi&rc=p Ama Dìaz",
                "time": "November 4 at 10:29pm"
            },
            {
                "content": "The issue here stems from lack of trust in the police department.  There was a time when you would do what they say without question, but because they have a reputation of f'n with people we become defensive and question their every action.",
                "from": "https://www.facebook.com/carl.m.morris?fref=ufi&rc=p Carl Malcolm Morris",
                "time": "November 5 at 6:31am"
            },
            {
                "content": "Are not these the Domestic Enemies that we swore to fight in our oath to our Homeland? let's keep this in mind for the next elections.",
                "from": "https://www.facebook.com/jorpal25?fref=ufi&rc=p Jorge Palma",
                "time": "November 4 at 10:45pm"
            },
            {
                "content": "1) Ban police unions 2) Require every law enforcement officer at every level to carry liability insurance. ... See More",
                "from": "https://www.facebook.com/rafael.crescente1?fref=ufi&rc=p Rafael Crescente",
                "time": "November 5 at 5:03pm"
            },
            {
                "content": "Could you legally shoot theseswat guys out of fear for your life since you are standing your ground? I know, next thing will be the whole Damn department shooting up your house lmao, I guess you'd never be able to take them to court being 6 ft under lol",
                "from": "https://www.facebook.com/TrillionaireLoc?fref=ufi&rc=p Jay Zeus",
                "time": "November 5 at 11:33am Edited"
            },
            {
                "content": "I dont know swat tactics bit when a swat team tells you to stay inside and away from windows, its probably for the best. If bullets start flying, he'd want to sue. He couldn't film from in his house?",
                "from": "https://www.facebook.com/chris.saltmarch?fref=ufi&rc=p Chris Kimura Saltmarch",
                "time": "November 5 at 8:07am"
            },
            {
                "content": "Every day they take it a little further, every day we see a new example of police brutality. Never stop recording. Cops work for us and must be held accountable for their actions.",
                "from": "https://www.facebook.com/jeremy.gentol?fref=ufi&rc=p Jeremy Gentol",
                "time": "November 4 at 9:43pm"
            },
            {
                "content": "The charges are only to justify their violation of his rights. He will be able to sue the shit out of them for false arrest and charges, false detainer and assault ,kidnapping .confinement. Who the fuck do these monsters think they are ?",
                "from": "https://www.facebook.com/william.bassett.167189?fref=ufi&rc=p William Bassett",
                "time": "November 4 at 10:56pm"
            },
            {
                "content": "Just because they say it’s for his own safety to go inside doesn’t mean he has to listen to them. Ok it might be for his own Safety but if he wants to be unsafe on HIS PROPERTY well then he is the dumbass being unsafe. The fact is the people have right ... See More",
                "from": "https://www.facebook.com/brian.depasquale.9?fref=ufi&rc=p Brian DePasquale",
                "time": "November 5 at 1:16am"
            },
            {
                "content": "The facts are: The person being served a warrant can break out into gunfire at any moment. No one should be putting themselves in danger by wanting to see what's going on!!",
                "from": "https://www.facebook.com/terri.turner.1447?fref=ufi&rc=p Terri Turner",
                "time": "November 4 at 10:57pm"
            },
            {
                "content": "so the swat team comes to your neighborhood and tells you to stay inside and away from windows.  they are raiding a house for god knows what.  adn instead, you go out and film with flash.  then argue when they tell you it is a lawful order to go inside ... See More",
                "from": "https://www.facebook.com/lorry.abel?fref=ufi&rc=p Lorry Abel",
                "time": "4 hrs"
            },
            {
                "content": "When serving a warrant officers have the right to clear the area.  This knucklehead was just being a dick. He should have been shot in the throat  with rubber bullets for being a pita. He would be the first person to sue if he got hurt during the course of serving a warrant across the street. No rights were violated. GTFO of the way.",
                "from": "https://www.facebook.com/brian.winger.33?fref=ufi&rc=p Brian Winger",
                "time": "November 6 at 7:05am"
            },
            {
                "content": "these fucking morons need to realize we all have camera and we are allowed to film them...If they arrest you or break your phone or camera,,, someone  is paying for my broken shit... this is why a lot of no longer trust the police, you would think that ... See More",
                "from": "https://www.facebook.com/BruceTantishjr?fref=ufi&rc=p Bruce MrBruno Tantish",
                "time": "November 5 at 12:53pm"
            },
            {
                "content": "What about surveillance cameras? What's the difference between someone recording from their yard and a machine doing it? Also this reminds me of when they stormed J Cole's home and destroyed his cameras.",
                "from": "https://www.facebook.com/warren.williams.543?fref=ufi&rc=p Warren Williams",
                "time": "November 5 at 10:36pm"
            },
            {
                "content": "Idiot,   learn from this...   bait them.   They are concerned you are part if it.  You guys can shot them in the back.  Thats their excuse.   Next time take a few steps back and dont say shit but this is my property and stepping on it is trespassing an ... See More",
                "from": "https://www.facebook.com/gsnopel?fref=ufi&rc=p Glen R Snopel",
                "time": "November 5 at 5:01pm"
            },
            {
                "content": "Try living in a commonwealth. ...  I've been held with no bond for 8 days on a charge that didn't even exist. Simply because he felt he could.  Fortunately when I finally obtained a preliminary hearing the judge asked the prosecutor WTF is this bullshit?  \" Get that man out of there this instant\"",
                "from": "https://www.facebook.com/masonbaker1954?fref=ufi&rc=p Mason Baker",
                "time": "November 5 at 5:54pm"
            },
            {
                "content": "Wow, that's some awesome video of 1933 Germany. How did they get that video so clear, and why where they speaking English?",
                "from": "https://www.facebook.com/dan.hughes.1612?fref=ufi&rc=p Dan Hughes",
                "time": "November 5 at 1:10pm"
            },
            {
                "content": "If you think this guy wasn't doing anything wrong you're a fucking idiot and you're the reason why there's so much tension in this country between everyone some idiot Surfer standing next to us for operation is an extremely huge liability. If I was one ... See More",
                "from": "https://www.facebook.com/patrick.bland.54?fref=ufi&rc=p Patrick Bland",
                "time": "2 hrs"
            },
            {
                "content": "Somebody made a mistake! Reminds me of an old Russian dissenters joke! It goes that somebody had the secret police show up in force at his address. That somebodies happiest moment in life was to tell them that they got the wrong address!",
                "from": "https://www.facebook.com/allen.jepsen?fref=ufi&rc=p Alan Jepsen",
                "time": "November 4 at 10:31pm"
            },
            {
                "content": "Dude is gonna get rich. cops did not handle this properly. If anybody violated the law, it was those 2. And, this is why cops get shot, people hate and have no more respect for law enforcement. They break the law they're supposed to be upholding. Sad.  # FORMERFED",
                "from": "https://www.facebook.com/carlos.elizondo.33?fref=ufi&rc=p Carlos Elizondo",
                "time": "November 5 at 5:04pm"
            },
            {
                "content": "He was asked to go inside for his own safety, you fuqtard. They clearly said on the megaphone. It was a dangerous situation, so much so that swat had to serve the warrant. Mother fuqen imbecile. Get a fuqen job!!!",
                "from": "https://www.facebook.com/7Saints?fref=ufi&rc=p Rob Johnson",
                "time": "19 hrs"
            },
            {
                "content": "Frankly they do not know if the person they are looking for is in the house across the street or could possibly be the person filming them. Get out of the line of fire and into your house. If stuff goes down they can not afford to look behind them. Just get in your house when they are executing these types of warrants for crying out loud.",
                "from": "https://www.facebook.com/profile.php?id=100000492230697&fref=ufi&rc=p Micah Redmond",
                "time": "November 5 at 10:29pm"
            },
            {
                "content": "Why were you out there? I could give a rats ass and I would have been in bed beating up some pussy. These snowflakes these days feel the need to film police and do dumb shit, well you win dumb prizes.",
                "from": "https://www.facebook.com/DukieJohns?fref=ufi&rc=p John Johns",
                "time": "14 hrs"
            },
            {
                "content": "I would own them you can be in your own yard where you pay property tax and your mortgage regardless of what’s going on around you. Unless they’ve declared martial law they can suck ass.",
                "from": "https://www.facebook.com/derrick.osborne.10?fref=ufi&rc=p Derrick Osborne",
                "time": "November 4 at 11:30pm Edited"
            },
            {
                "content": "They were “serving and protecting” him. What a joke these toy soldiers are. I wonder if the guy in the front yard made the guy in body armor “fear for his life”. Smh  🤦‍♂️ ",
                "from": "https://www.facebook.com/scott.malone.9849?fref=ufi&rc=p Scott Malone",
                "time": "November 5 at 2:26am"
            },
            {
                "content": "It's not a lawful order just because you said it was there Robocop wtf is this anyway Kuwait? Those don't look like cops they look like military deployed  on American soil that's illegal too",
                "from": "https://www.facebook.com/gilbert.rodriguez.376?fref=ufi&rc=p Gilbert Rodriguez",
                "time": "November 4 at 10:58pm"
            },
            {
                "content": "And you liberal lying Democrat dogs have no clue of what Law and Order means because of Hillary Clinton and Obama being in office for 8 years you snowflakes have no idea what discipline is or directions or Law & Order but you will find out",
                "from": "https://www.facebook.com/findeer7?fref=ufi&rc=p Michael Ward",
                "time": "November 5 at 7:07pm"
            },
            {
                "content": "Didn't know that neighborhoods are combat zones, can the soldier crap. No one is impressed, especially veterans. Little boys acting like their important.",
                "from": "https://www.facebook.com/Johnbaldone?fref=ufi&rc=p John Ellis",
                "time": "November 4 at 11:37pm Edited"
            },
            {
                "content": "\"This is the Police State.  Stay indoors and don't see or think about what we are doing feet from your homes.  Do not step foot on your own private property outside your house or you will be unlawfully arrested and subject to re-education. Obey!\"",
                "from": "https://www.facebook.com/sigtermans?fref=ufi&rc=p Roger Sigtermans",
                "time": "November 5 at 7:41pm"
            }
        ],
        "description": "Police The Police By a SWAT team, nonetheless...  Full Story:  http://bit.ly/1usux8h",
        "participants": [
            "https://www.facebook.com/policethepoliceACP/?ref=nf&hc_ref=ARSxE1U3OUFowPP8lM3M-eJkoczvVlpsH1536Jtw_2AyXO-CusR9NAct5-2R4hBML7c",
            "https://www.facebook.com/profile.php?id=100007376375489&fref=ufi&rc=p",
            "https://www.facebook.com/felony.shelton?fref=ufi&rc=p",
            "https://www.facebook.com/blaine.jensen.71?fref=ufi&rc=p",
            "https://www.facebook.com/ben.sutter.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011674779449&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100022602564043&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100005448213712&fref=ufi&rc=p",
            "https://www.facebook.com/mike.hess.9887?fref=ufi&rc=p",
            "https://www.facebook.com/ben.sutter.5?fref=ufi&rc=p",
            "https://www.facebook.com/tawnyaeaston?fref=ufi&rc=p",
            "https://www.facebook.com/youngwizze?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=820230400&fref=ufi&rc=p",
            "https://www.facebook.com/cody.klumbis?fref=ufi&rc=p",
            "https://www.facebook.com/nick.mandaville?fref=ufi&rc=p",
            "https://www.facebook.com/les.braden?fref=ufi&rc=p",
            "https://www.facebook.com/AlisonsNiche?fref=ufi&rc=p",
            "https://www.facebook.com/james.vaughn.9?fref=ufi&rc=p",
            "https://www.facebook.com/hans.loos.5?fref=ufi&rc=p",
            "https://www.facebook.com/freddy.kapone?fref=ufi&rc=p",
            "https://www.facebook.com/robert.coppola.37?fref=ufi&rc=p",
            "https://www.facebook.com/cbburtraw?fref=ufi&rc=p",
            "https://www.facebook.com/colormekissed69?fref=ufi&rc=p",
            "https://www.facebook.com/ama.diaz.9828?fref=ufi&rc=p",
            "https://www.facebook.com/carl.m.morris?fref=ufi&rc=p",
            "https://www.facebook.com/jorpal25?fref=ufi&rc=p",
            "https://www.facebook.com/rafael.crescente1?fref=ufi&rc=p",
            "https://www.facebook.com/TrillionaireLoc?fref=ufi&rc=p",
            "https://www.facebook.com/chris.saltmarch?fref=ufi&rc=p",
            "https://www.facebook.com/jeremy.gentol?fref=ufi&rc=p",
            "https://www.facebook.com/william.bassett.167189?fref=ufi&rc=p",
            "https://www.facebook.com/brian.depasquale.9?fref=ufi&rc=p",
            "https://www.facebook.com/terri.turner.1447?fref=ufi&rc=p",
            "https://www.facebook.com/lorry.abel?fref=ufi&rc=p",
            "https://www.facebook.com/brian.winger.33?fref=ufi&rc=p",
            "https://www.facebook.com/BruceTantishjr?fref=ufi&rc=p",
            "https://www.facebook.com/warren.williams.543?fref=ufi&rc=p",
            "https://www.facebook.com/gsnopel?fref=ufi&rc=p",
            "https://www.facebook.com/masonbaker1954?fref=ufi&rc=p",
            "https://www.facebook.com/dan.hughes.1612?fref=ufi&rc=p",
            "https://www.facebook.com/patrick.bland.54?fref=ufi&rc=p",
            "https://www.facebook.com/allen.jepsen?fref=ufi&rc=p",
            "https://www.facebook.com/carlos.elizondo.33?fref=ufi&rc=p",
            "https://www.facebook.com/7Saints?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000492230697&fref=ufi&rc=p",
            "https://www.facebook.com/DukieJohns?fref=ufi&rc=p",
            "https://www.facebook.com/derrick.osborne.10?fref=ufi&rc=p",
            "https://www.facebook.com/scott.malone.9849?fref=ufi&rc=p",
            "https://www.facebook.com/gilbert.rodriguez.376?fref=ufi&rc=p",
            "https://www.facebook.com/findeer7?fref=ufi&rc=p",
            "https://www.facebook.com/Johnbaldone?fref=ufi&rc=p",
            "https://www.facebook.com/sigtermans?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100007376375489&fref=ufi&rc=p",
            "https://www.facebook.com/felony.shelton?fref=ufi&rc=p",
            "https://www.facebook.com/blaine.jensen.71?fref=ufi&rc=p",
            "https://www.facebook.com/ben.sutter.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011674779449&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100022602564043&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100005448213712&fref=ufi&rc=p",
            "https://www.facebook.com/mike.hess.9887?fref=ufi&rc=p",
            "https://www.facebook.com/ben.sutter.5?fref=ufi&rc=p",
            "https://www.facebook.com/tawnyaeaston?fref=ufi&rc=p",
            "https://www.facebook.com/youngwizze?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=820230400&fref=ufi&rc=p",
            "https://www.facebook.com/cody.klumbis?fref=ufi&rc=p",
            "https://www.facebook.com/nick.mandaville?fref=ufi&rc=p",
            "https://www.facebook.com/les.braden?fref=ufi&rc=p",
            "https://www.facebook.com/AlisonsNiche?fref=ufi&rc=p",
            "https://www.facebook.com/james.vaughn.9?fref=ufi&rc=p",
            "https://www.facebook.com/hans.loos.5?fref=ufi&rc=p",
            "https://www.facebook.com/freddy.kapone?fref=ufi&rc=p",
            "https://www.facebook.com/robert.coppola.37?fref=ufi&rc=p",
            "https://www.facebook.com/cbburtraw?fref=ufi&rc=p",
            "https://www.facebook.com/colormekissed69?fref=ufi&rc=p",
            "https://www.facebook.com/ama.diaz.9828?fref=ufi&rc=p",
            "https://www.facebook.com/carl.m.morris?fref=ufi&rc=p",
            "https://www.facebook.com/jorpal25?fref=ufi&rc=p",
            "https://www.facebook.com/rafael.crescente1?fref=ufi&rc=p",
            "https://www.facebook.com/TrillionaireLoc?fref=ufi&rc=p",
            "https://www.facebook.com/chris.saltmarch?fref=ufi&rc=p",
            "https://www.facebook.com/jeremy.gentol?fref=ufi&rc=p",
            "https://www.facebook.com/william.bassett.167189?fref=ufi&rc=p",
            "https://www.facebook.com/brian.depasquale.9?fref=ufi&rc=p",
            "https://www.facebook.com/terri.turner.1447?fref=ufi&rc=p",
            "https://www.facebook.com/lorry.abel?fref=ufi&rc=p",
            "https://www.facebook.com/brian.winger.33?fref=ufi&rc=p",
            "https://www.facebook.com/BruceTantishjr?fref=ufi&rc=p",
            "https://www.facebook.com/warren.williams.543?fref=ufi&rc=p",
            "https://www.facebook.com/gsnopel?fref=ufi&rc=p",
            "https://www.facebook.com/masonbaker1954?fref=ufi&rc=p",
            "https://www.facebook.com/dan.hughes.1612?fref=ufi&rc=p",
            "https://www.facebook.com/patrick.bland.54?fref=ufi&rc=p",
            "https://www.facebook.com/allen.jepsen?fref=ufi&rc=p",
            "https://www.facebook.com/carlos.elizondo.33?fref=ufi&rc=p",
            "https://www.facebook.com/7Saints?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000492230697&fref=ufi&rc=p",
            "https://www.facebook.com/DukieJohns?fref=ufi&rc=p",
            "https://www.facebook.com/derrick.osborne.10?fref=ufi&rc=p",
            "https://www.facebook.com/scott.malone.9849?fref=ufi&rc=p",
            "https://www.facebook.com/gilbert.rodriguez.376?fref=ufi&rc=p",
            "https://www.facebook.com/findeer7?fref=ufi&rc=p",
            "https://www.facebook.com/Johnbaldone?fref=ufi&rc=p",
            "https://www.facebook.com/sigtermans?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/policethepoliceACP/videos/1965393950144258/",
        "photos": []
    },
    {
        "comments": [],
        "description": "Brian Cullinan http://www.motherjones.com/…/cca-private-prisons-correctio…/",
        "participants": [
            "https://www.facebook.com/megamindbc?fref=nf",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.motherjones.com%2Fpolitics%2F2016%2F06%2Fcca-private-prisons-corrections-corporation-inmates-investigation-bauer%2F&h=ATPyjXAaOfE8Sn7iVjeCEbdjW0fBXTIgFz2UsTdaLBTc1O_HUFuLwxO2UuPjV_WvGYI44BpD7TFZ7HLj9rHmsdsvsgcbGSFRgvj9rhWQ-aNuprZk-De5QsuCpJVs1A3fCovaTRdX6oxexshdbKUeYql7AirATWY97DxS39fMeI46ucY2OuvgXBShI0hh8yDKpD2FX2X9QqJuXhmciQQfUaRdss8Or7fsiQXGR3oOG_Xd8tAuDDk1HtK5lcV0_U1_TiHThuR5OWK_zWkodICCc1zg"
        ],
        "post": "https://www.facebook.com/policethepoliceACP/videos/1965393950144258/",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "It looks cool but the other trailers for the expansions actually looked a lot cooler.",
                "from": "https://www.facebook.com/profile.php?id=100011999326053&fref=ufi Robert Macbee",
                "time": "November 5 at 6:12pm"
            }
        ],
        "description": "Kristin Niblett  shared  World of Warcraft 's  video . Dayna Davidson ,  Mark McClane",
        "participants": [
            "https://www.facebook.com/kristin.pollockniblett?fref=nf",
            "https://www.facebook.com/kristin.pollockniblett?hc_ref=ARTZEQeNHwYhaaPwxRdDBYZeLJRD_qikYN-_vXbU2cMTemGG_34pzfpiyby0pdp7Qao",
            "https://www.facebook.com/Warcraft/?hc_ref=ARTZEQeNHwYhaaPwxRdDBYZeLJRD_qikYN-_vXbU2cMTemGG_34pzfpiyby0pdp7Qao",
            "/Warcraft/videos/10155717724984034/?hc_ref=ARTZEQeNHwYhaaPwxRdDBYZeLJRD_qikYN-_vXbU2cMTemGG_34pzfpiyby0pdp7Qao",
            "https://www.facebook.com/dayna.davidson?fref=mentions",
            "https://www.facebook.com/mark.mcclane.357?fref=mentions",
            "https://www.facebook.com/profile.php?id=100011999326053&fref=ufi",
            "https://www.facebook.com/profile.php?id=100011999326053&fref=ufi"
        ],
        "post": "https://www.facebook.com/kristin.pollockniblett/posts/10156376871063797",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "If you're going to burn down Teldrassil, I hope Silvermoon and Undercity get turned into parking lots.",
                "from": "https://www.facebook.com/marek.grynis?fref=ufi&rc=p Marc Greene",
                "time": "November 3 at 10:26pm"
            },
            {
                "content": "Just when I thought I had beaten my addiction, this and classic servers come out. Damn you blizzard, damn you to hell.  😂 ❤️ ",
                "from": "https://www.facebook.com/coty.britt.9?fref=ufi&rc=p Coty Britt",
                "time": "November 3 at 10:24pm"
            },
            {
                "content": "After all the calamitous adversaries we've faced, hellbent on destroying all we stand for.... you make an entire expansion based around petty PvP squabbles. I just... don't understand. # dammitBlizz",
                "from": "https://www.facebook.com/gilarin?fref=ufi&rc=p Robert Marsh",
                "time": "November 3 at 10:29pm"
            },
            {
                "content": "Blizard y u do dis. Y you make epic trailer for very poorly executed content. Y u make me wana come back and gank hoes BLIZZARD Y U DO DIS",
                "from": "https://www.facebook.com/Asteward2113?fref=ufi&rc=p Antonio Steward",
                "time": "November 3 at 10:27pm"
            },
            {
                "content": "Unsure why many of you are complaining about the theme. Im unsure if you boys and girls remember, but at the very start of Legion when Vol'Jin and Varian died we both despised each other. Sylvannas made a choice and Genn decided to hunt her down. I'd barely call it \"working together\"",
                "from": "https://www.facebook.com/matthewjohhn?fref=ufi&rc=p Matthew Hewston",
                "time": "November 3 at 10:41pm"
            },
            {
                "content": "So we spend basically every expansion working together and now finally we fight eachother. This could either be a very good or very bad idea.",
                "from": "https://www.facebook.com/SoulofGabriel?fref=ufi&rc=p Kevin Ashcroft",
                "time": "November 3 at 10:24pm"
            },
            {
                "content": "As long as it's not just another expansion of coddling the Alliance and painting the Horde as the bad guys again. It was bad enough that our Dark Lady's storyline got cut after Stormheim (and even then was barely present in Stormheim to begin with, des ... See More",
                "from": "https://www.facebook.com/VladiMatt?fref=ufi&rc=p Matt Murphy",
                "time": "November 3 at 10:37pm"
            },
            {
                "content": "Based off these comments I am happy I quit playing and my thoughts of returning to azeroth were quickly dismantled.  The community of WoW has become so toxic and full of salt it's very sad.",
                "from": "https://www.facebook.com/michael.noone.501?fref=ufi&rc=p Michael Noone",
                "time": "November 3 at 10:45pm"
            },
            {
                "content": "If you burn Teldrassil, I may die. I'm still not over what you did to Auberdine, Darkshore, and Ashenvale in Cataclysm.",
                "from": "https://www.facebook.com/hyperkaleighmia?fref=ufi&rc=p Cèilidh Tea",
                "time": "November 4 at 1:01am"
            },
            {
                "content": "Legion sounded like it was really good. Thank you for doing this, and convincing me not to resubscribe again.  ... See More",
                "from": "https://www.facebook.com/christopher.ledenbach?fref=ufi&rc=p Christopher Ledenbach",
                "time": "November 3 at 11:02pm"
            },
            {
                "content": "Yes yes yes Vanilla realms soon.....yes no more mouth breathers ganking any lowbie now on any faction heavy PVP realm....no more PVP or PVE realms...you want to PVP then you better be ready to stand up against player that is just as geared as you and same levels.  The mouth breathers are crying in their milk now.",
                "from": "https://www.facebook.com/MouserD?fref=ufi&rc=p Terri Gray",
                "time": "November 3 at 10:34pm"
            },
            {
                "content": "I haven't played seriously since raiding heroic Lich King...and I've always enjoyed the cinematic videos for each new expansion, until this one.  It just seems so dull and there is no real story.  Oh look, horde is fighting alliance now, still, for 2 new islands.  woohoo.  I miss my old friends on here, and I have a million positive memories, but I'm glad to be done with this.",
                "from": "https://www.facebook.com/chris.pruss?fref=ufi&rc=p Chris Pruss",
                "time": "November 4 at 12:56am"
            },
            {
                "content": "People keep saying that America has been a part of its longest war in history but I’m like “yeah? y’all haven’t even seen how long Azeroth has been bickering.” From what I can tell on this map, this looks like the American and North Korean expansion and it may also include Russia, which looks like its up top and may be bonus content.",
                "from": "https://www.facebook.com/RigelBennett?fref=ufi&rc=p Rigel Bennett",
                "time": "November 5 at 2:07pm Edited"
            },
            {
                "content": "I don't suppose you guys intend to raise the character cap from 50 to 100? Because... man, I have a lot of alts, and this is going to add even more to my list. Plus, we need more room on our servers! 3 new subraces for each faction? Even if you only play one faction, that's three spaces needed when you're already at 12 characters on a server.",
                "from": "https://www.facebook.com/jdwiser?fref=ufi&rc=p JD Wiser",
                "time": "November 3 at 10:37pm"
            },
            {
                "content": "Yawn. After all we do fighting together to save our planet, we continue to allow blizzard to feed us filler expansions!? Ill bet a years subscription and a new computer it ends with both sides fighting the same bad guy. Was not happy with this reveal. WoD had a better intro and was garbage...",
                "from": "https://www.facebook.com/lyle.a.roy?fref=ufi&rc=p Lyle Albert Roy II",
                "time": "November 3 at 10:38pm"
            },
            {
                "content": "I hope that after this, we will be done with this red vs blue stuff. It confines you to a very specific kind of narrative, especially since we know the horde side of the story. Get it done and over with and then we can deal with the old gods and maybe some titans that might have gotten \"lost\" somewhere and evaded the massacre.",
                "from": "https://www.facebook.com/jean.southeast?fref=ufi&rc=p Jean B Minani Umuhirwa",
                "time": "November 3 at 10:33pm"
            },
            {
                "content": "Expansion looks good and all but hopefully honor and conquest points come back. I shouldn't have to pve to PvP. The logic is really stupid to even think of that.",
                "from": "https://www.facebook.com/lusterdk?fref=ufi&rc=p Cody Tomblin",
                "time": "November 3 at 10:36pm"
            },
            {
                "content": "A new expansion this soon!? Aren't you guys gonna do more for Legion first? And please, whatever you do, DO NOT make those artifact skins no longer available once you release the new expansion!",
                "from": "https://www.facebook.com/alexander.babitsky.1?fref=ufi&rc=p Alexander Babitsky",
                "time": "November 3 at 11:17pm"
            },
            {
                "content": "Alright. I had serious thoughts of coming back one day but this right here has burned that to a crisp. I can reminisce in the memories of this great game because it is being overwritten by expansions.",
                "from": "https://www.facebook.com/MTMSPRUCE?fref=ufi&rc=p Lance England",
                "time": "November 3 at 10:54pm"
            },
            {
                "content": "World of Warcraft  Idk how u do this but u need to keep it up!! expansion trailler was ur best trailler ever, after I watched orview Im sooooo hyped, Legion was great but it looks like battle for azeroth will be AMAZING. Cant w8 till I will get into a new content with my DK, FOR AZEROTH!",
                "from": "https://www.facebook.com/profile.php?id=100003991017121&fref=ufi&rc=p Damian Miętus",
                "time": "November 3 at 10:30pm"
            },
            {
                "content": "My problem with this expansion is we’ve done this before. In Pandaria we have the horde and allied landing zones. In Draenor we have Ashran PVP zone and world PVP. This is basically that put together. Meh...",
                "from": "https://www.facebook.com/donald.bensen?fref=ufi&rc=p Donald Bensen",
                "time": "November 4 at 12:04am Edited"
            },
            {
                "content": "So  World of Warcraft , with 6 new races can we get max characters raised above 50? Been playing 11 years sure amounts to a lot of alts",
                "from": "https://www.facebook.com/sarah.spencer.391?fref=ufi&rc=p Sarah Spencer",
                "time": "November 3 at 11:36pm"
            },
            {
                "content": "This is the first xpac that I can safely say hasn't enticed me to return to wow.  Honestly, it's kind of a relief.  I can just leave it in the past.  It was fun while it lasted, but this is certainly a dying franchise.",
                "from": "https://www.facebook.com/utskier?fref=ufi&rc=p Tanner Phillips",
                "time": "November 4 at 1:11am"
            },
            {
                "content": "🤦🏾‍♂️ really  Blizzard  we gotta burn teldrassil  🙄 , you spent all of Legion pooping on the night elves and the druids but i guess that wasn't enough.",
                "from": "https://www.facebook.com/darius.bennett.54?fref=ufi&rc=p Darius Bennett",
                "time": "November 4 at 1:25am"
            },
            {
                "content": "Faction conflict is the whole point of World of Warcraft. Peace does not last forever. You can't expect them to be all rainbows and butterflies forever. History always repeats itself. There will always be hatred and war. Especially against 2 factions that have been against each other for years.",
                "from": "https://www.facebook.com/Toksiin.K?fref=ufi&rc=p Kylee Gray",
                "time": "November 4 at 2:55pm"
            },
            {
                "content": "FACTION ALLEGIANCES ARE BACK! That used to be the biggest part of this game was the loyalty you had for your faction. I remember getting yelled at in the street by Alli scum when I was wearing a horde shirt. It just doesn't happen anymore.  I'm so keen for this and I really hope it's executed right",
                "from": "https://www.facebook.com/corey.jay.397?fref=ufi&rc=p Corey Jay",
                "time": "November 3 at 11:33pm"
            },
            {
                "content": "I think the title of the expansion is meant to throw us off. Battle of Azeroth isn’t us fighting each other primarily, it’s not For The Horde, it’s not For The Alliance....it’s FOR AZEROTH! To save her!",
                "from": "https://www.facebook.com/orlando.jose.16?fref=ufi&rc=p Orlando J. Figueroa",
                "time": "November 3 at 11:23pm"
            },
            {
                "content": "So, basically, four rehashes of existing races (Tauren , Draenei and more 2 elf-based races)? Oh, and I guess rehashes of dwarves and trolls too. ... See More",
                "from": "https://www.facebook.com/jeremy.durand.5?fref=ufi&rc=p Jeremy Durand",
                "time": "November 3 at 11:12pm Edited"
            },
            {
                "content": "This expansion is why I have maxed at least one Horde and one Alliance toon per expansion since I started playing, as I’ve always wanted to see both sides of the story.  Don’t worry though, my heart is with the Horde. I’ve only one max-level Alliance  ... See More",
                "from": "https://www.facebook.com/rondy.reeves?fref=ufi&rc=p Rondy M. Reeves Jr.",
                "time": "November 4 at 4:20am Edited"
            },
            {
                "content": "So, let me get this straight... you go from demons invading from an entirely different plane of existence, threatening to absolutely murder the entire world, and at the head of which is a fallen god that is older than time itself, absolutely indestructible and all-knowing enough to destroy galaxies with a mere thought... And then the new expansion after that is pirates.",
                "from": "https://www.facebook.com/travis.rushforth?fref=ufi&rc=p Travis Rushforth",
                "time": "November 4 at 6:28am"
            },
            {
                "content": "I'm buying it. They brought back the old school BC battle in Nagrand to occupy territory. Thank god they are ringing more world pvp participation back in the game.  Nico Talley Tim Kieschnick  and vanilla servers!!!!!!!",
                "from": "https://www.facebook.com/aurian.ghaemmaghami?fref=ufi&rc=p Aurian Ghaemmaghami",
                "time": "November 3 at 11:01pm"
            },
            {
                "content": "so despite AFTER ALLLL THATS HAPPENED you telling me Azeroth is just like America where we start a civil war because of little differences......  we just gone ignore the fact that we had to go through like 2-3 expansions of both factions working together  😂 😂 ",
                "from": "https://www.facebook.com/Ifitaintaboutthemoney?fref=ufi&rc=p Corey Smith",
                "time": "November 4 at 3:00am"
            },
            {
                "content": "This is the very first time I have not been impressed with a trailer release of WoW. Sorry folks but this looks very bland with no thought behind it as if it was thrown together last minute.  😞 ",
                "from": "https://www.facebook.com/bubba.wells.10?fref=ufi&rc=p Bubba Wells",
                "time": "November 4 at 2:12am"
            },
            {
                "content": "All these people wanting world of peacecraft. These 2 factions have been fighting since this was an RTS game and you want peace now? If you don't like it then move on, the world.....of Warcraft will continue to be filled with well...war.",
                "from": "https://www.facebook.com/Arobb143?fref=ufi&rc=p Aaron Robbins",
                "time": "November 4 at 3:47pm"
            },
            {
                "content": "Am i the only one that feels that blizzard needs to give us some cool down time to let the old expansion sink in, before they launch the new one? Comeon",
                "from": "https://www.facebook.com/soham.patil.m?fref=ufi&rc=p Soham Patil",
                "time": "November 3 at 10:39pm"
            },
            {
                "content": "I think the Old Gods are manipulating the people of Azeroth. Because we have defeated the Legion, now they are at their wits end. So now they must turn the people of Azeroth against each other in order to distract us from them so they can finally take  ... See More",
                "from": "https://www.facebook.com/michelle.hinojosa.50?fref=ufi&rc=p Michelle Hinojosa",
                "time": "November 4 at 10:13pm"
            },
            {
                "content": "SO if lorderon is under siege and Teldrassil is burnt.... are the undead and night elves swapping starting zones!?!?!",
                "from": "https://www.facebook.com/brendan.mcleod.37?fref=ufi&rc=p Brendan McLeod",
                "time": "November 3 at 10:23pm"
            },
            {
                "content": "People need to realize that this expansion isn't filler. It's vital to the plot moving forward.  Think about this: After The Avengers assemble, they eventually learn to work together as a team, destroy a crazy space army, and defeat Ultron. It's hard  ... See More",
                "from": "https://www.facebook.com/blueshoals.1337?fref=ufi&rc=p Gabriel Garcia",
                "time": "November 6 at 4:53pm Edited"
            },
            {
                "content": "Since time travel magic exists,  I was hoping reversing the destruction of other worlds done by the Legion, with Alliance and Horde clamoring allegiances.  Azeroth has been through a lot, and now its people back to bickering and destroying each other?  ... See More",
                "from": "https://www.facebook.com/eric.risen1?fref=ufi&rc=p Eric Risen",
                "time": "November 4 at 9:30am"
            },
            {
                "content": "So are NE going to get some representation in EK now that you are erasing them from Kalimdor? Maybe actually updating Gilneas to reflect it has been in Alliance hands since Cata. I think it would be poetic to have the Gilneans host the Night Elf refugees.  Not that I expect anything like this to happen. You will update Orgrimmar again with a new forsaken district though.",
                "from": "https://www.facebook.com/bradford.graves.5?fref=ufi&rc=p Bradford Graves",
                "time": "November 5 at 9:11pm"
            },
            {
                "content": "Are you kidding me? After all we've learned while fighting against the legion. Now we're taking huge steps back and pitting Alliance against Horde all over again....And the Zandalari isn't anything new. We fought against them in Cata and Pandaria.",
                "from": "https://www.facebook.com/Raven.Martin?fref=ufi&rc=p Raven Rose Martin",
                "time": "November 4 at 2:43am"
            },
            {
                "content": "I like the theme but it feels like you're hiding the reason why the horde and alliance have escalated to fighting again. I'm confused about the coloring on the maps too - are you suggesting undercity gets conquered by the alliance and the horde conquers/burns teldrassil? Pretty bold moves if that's correct",
                "from": "https://www.facebook.com/rfeil?fref=ufi&rc=p Ryan Feil",
                "time": "Yesterday at 12:09am Edited"
            },
            {
                "content": "Seems like after going into space and defeating the greatest evil that was the cause for the wars between the two factions in the first place they go back to fighting each other? Seems like a huge step backwards",
                "from": "https://www.facebook.com/steve.ryder.39?fref=ufi&rc=p Steve Ryder",
                "time": "November 4 at 2:42am"
            },
            {
                "content": "Where do all these islands come from are they hidden via a spell from the old gods that mysteriously fade when the time is right lol",
                "from": "https://www.facebook.com/jeremy.maskell?fref=ufi&rc=p Jeremy Maskell",
                "time": "November 3 at 10:49pm"
            },
            {
                "content": "You see, this, this is why I do not push myself hard for gear level. In just over a year of legion, now we hear another expansion is coming, 10 more levels which means..yes,  your 900+gear, will be near trash once again and here comes what..1200?  Ive gone from a hard core RP, must get the gear must get this n that to ..hey lets do this its fun like ya know, fly into the capitol and see who dies last.",
                "from": "https://www.facebook.com/lloyd.neil.1?fref=ufi&rc=p Lloyd Neil",
                "time": "November 4 at 1:30am"
            },
            {
                "content": "I'm sorry but this looks like the worst expansion ever....it's so plain with no backstory to it....stick with Legion and improve that before even considering anything else, please.",
                "from": "https://www.facebook.com/paige.goettl?fref=ufi&rc=p Paige Goettl",
                "time": "November 4 at 3:10am"
            },
            {
                "content": "# SavetheWorldTrees  I want to see Shaldrassil in its uncorrupted glory again. But oh no, not Teldrassil. I started out as a Night Elf. 8(",
                "from": "https://www.facebook.com/20KGoldenPheasants?fref=ufi&rc=p Sammi Dixon",
                "time": "November 3 at 11:43pm"
            },
            {
                "content": "I hit like, then unlike. So I could like it again. Super pumped for this! Hopefully the quality from Legion continues or improves!",
                "from": "https://www.facebook.com/liam.norris.7?fref=ufi&rc=p Liam Norris",
                "time": "November 3 at 11:04pm"
            },
            {
                "content": "Anyone else disappointed with this? This has been done. Been playing since WOTLK, almost 10 years. This expansion has been done. I feel like this is death of WOW by a thousand expansions. Not sure what I was expecting but this was very meh.",
                "from": "https://www.facebook.com/nick.stevenson.125?fref=ufi&rc=p Nick Stevenson",
                "time": "November 4 at 1:51am Edited"
            },
            {
                "content": "Hunter Isaiah Eddy Anthony  this is really gonna be lit. New races for each faction too! And pvp is going back to the classic ways, unlike crappy legion pvp lol. World at war  💯 ",
                "from": "https://www.facebook.com/profile.php?id=100001498275116&fref=ufi&rc=p Victor Zapata",
                "time": "November 4 at 8:47pm"
            }
        ],
        "description": "World of Warcraft See what's coming in World of Warcraft: Battle For Azeroth!   🔎   http://blizz.ly/BattleForAzeroth World of Warcraft World of Warcraft Blizzard Nico Talley Tim Kieschnick Hunter Isaiah Eddy Anthony",
        "participants": [
            "https://www.facebook.com/Warcraft/?ref=nf&hc_ref=ARQpK5p1RoSzvZsr3gXg-js_O7Vv5bWSG-9_MRkIeocDbLFQV4FbZwRarfC2FVjJHcI",
            "https://www.facebook.com/marek.grynis?fref=ufi&rc=p",
            "https://www.facebook.com/VladiMatt?fref=ufi&rc=p",
            "https://www.facebook.com/coty.britt.9?fref=ufi&rc=p",
            "https://www.facebook.com/gilarin?fref=ufi&rc=p",
            "https://www.facebook.com/michaelbanti?fref=ufi&rc=p",
            "https://www.facebook.com/Asteward2113?fref=ufi&rc=p",
            "https://www.facebook.com/matthewjohhn?fref=ufi&rc=p",
            "https://www.facebook.com/SoulofGabriel?fref=ufi&rc=p",
            "https://www.facebook.com/melvin.kunoz?fref=ufi&rc=p",
            "https://www.facebook.com/VladiMatt?fref=ufi&rc=p",
            "https://www.facebook.com/michael.noone.501?fref=ufi&rc=p",
            "https://www.facebook.com/hyperkaleighmia?fref=ufi&rc=p",
            "https://www.facebook.com/christopher.ledenbach?fref=ufi&rc=p",
            "https://www.facebook.com/MouserD?fref=ufi&rc=p",
            "https://www.facebook.com/chris.pruss?fref=ufi&rc=p",
            "https://www.facebook.com/RigelBennett?fref=ufi&rc=p",
            "https://www.facebook.com/jdwiser?fref=ufi&rc=p",
            "https://www.facebook.com/lyle.a.roy?fref=ufi&rc=p",
            "https://www.facebook.com/jean.southeast?fref=ufi&rc=p",
            "https://www.facebook.com/lusterdk?fref=ufi&rc=p",
            "https://www.facebook.com/alexander.babitsky.1?fref=ufi&rc=p",
            "https://www.facebook.com/MTMSPRUCE?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100003991017121&fref=ufi&rc=p",
            "https://www.facebook.com/Warcraft/?hc_location=ufi",
            "https://www.facebook.com/donald.bensen?fref=ufi&rc=p",
            "https://www.facebook.com/sarah.spencer.391?fref=ufi&rc=p",
            "https://www.facebook.com/pages/World-of-Warcraft/109564695729405?hc_location=ufi",
            "https://www.facebook.com/utskier?fref=ufi&rc=p",
            "https://www.facebook.com/darius.bennett.54?fref=ufi&rc=p",
            "https://www.facebook.com/Blizzard/?hc_location=ufi",
            "https://www.facebook.com/Toksiin.K?fref=ufi&rc=p",
            "https://www.facebook.com/corey.jay.397?fref=ufi&rc=p",
            "https://www.facebook.com/orlando.jose.16?fref=ufi&rc=p",
            "https://www.facebook.com/jeremy.durand.5?fref=ufi&rc=p",
            "https://www.facebook.com/rondy.reeves?fref=ufi&rc=p",
            "https://www.facebook.com/travis.rushforth?fref=ufi&rc=p",
            "https://www.facebook.com/aurian.ghaemmaghami?fref=ufi&rc=p",
            "https://www.facebook.com/nico.talley?hc_location=ufi",
            "https://www.facebook.com/timkieschnick?hc_location=ufi",
            "https://www.facebook.com/Ifitaintaboutthemoney?fref=ufi&rc=p",
            "https://www.facebook.com/bubba.wells.10?fref=ufi&rc=p",
            "https://www.facebook.com/Arobb143?fref=ufi&rc=p",
            "https://www.facebook.com/soham.patil.m?fref=ufi&rc=p",
            "https://www.facebook.com/michelle.hinojosa.50?fref=ufi&rc=p",
            "https://www.facebook.com/brendan.mcleod.37?fref=ufi&rc=p",
            "https://www.facebook.com/blueshoals.1337?fref=ufi&rc=p",
            "https://www.facebook.com/eric.risen1?fref=ufi&rc=p",
            "https://www.facebook.com/bradford.graves.5?fref=ufi&rc=p",
            "https://www.facebook.com/Raven.Martin?fref=ufi&rc=p",
            "https://www.facebook.com/rfeil?fref=ufi&rc=p",
            "https://www.facebook.com/steve.ryder.39?fref=ufi&rc=p",
            "https://www.facebook.com/jeremy.maskell?fref=ufi&rc=p",
            "https://www.facebook.com/lloyd.neil.1?fref=ufi&rc=p",
            "https://www.facebook.com/paige.goettl?fref=ufi&rc=p",
            "https://www.facebook.com/20KGoldenPheasants?fref=ufi&rc=p",
            "https://www.facebook.com/liam.norris.7?fref=ufi&rc=p",
            "https://www.facebook.com/nick.stevenson.125?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100001498275116&fref=ufi&rc=p",
            "https://www.facebook.com/hunter.rios.5?hc_location=ufi",
            "https://www.facebook.com/isaiah.graham.14?hc_location=ufi",
            "https://www.facebook.com/eddy.rodriguez.562?hc_location=ufi",
            "https://www.facebook.com/AJ238NY1?hc_location=ufi",
            "https://www.facebook.com/marek.grynis?fref=ufi&rc=p",
            "https://www.facebook.com/VladiMatt?fref=ufi&rc=p",
            "https://www.facebook.com/coty.britt.9?fref=ufi&rc=p",
            "https://www.facebook.com/gilarin?fref=ufi&rc=p",
            "https://www.facebook.com/michaelbanti?fref=ufi&rc=p",
            "https://www.facebook.com/Asteward2113?fref=ufi&rc=p",
            "https://www.facebook.com/matthewjohhn?fref=ufi&rc=p",
            "https://www.facebook.com/SoulofGabriel?fref=ufi&rc=p",
            "https://www.facebook.com/melvin.kunoz?fref=ufi&rc=p",
            "https://www.facebook.com/VladiMatt?fref=ufi&rc=p",
            "https://www.facebook.com/michael.noone.501?fref=ufi&rc=p",
            "https://www.facebook.com/hyperkaleighmia?fref=ufi&rc=p",
            "https://www.facebook.com/christopher.ledenbach?fref=ufi&rc=p",
            "https://www.facebook.com/MouserD?fref=ufi&rc=p",
            "https://www.facebook.com/chris.pruss?fref=ufi&rc=p",
            "https://www.facebook.com/RigelBennett?fref=ufi&rc=p",
            "https://www.facebook.com/jdwiser?fref=ufi&rc=p",
            "https://www.facebook.com/lyle.a.roy?fref=ufi&rc=p",
            "https://www.facebook.com/jean.southeast?fref=ufi&rc=p",
            "https://www.facebook.com/lusterdk?fref=ufi&rc=p",
            "https://www.facebook.com/alexander.babitsky.1?fref=ufi&rc=p",
            "https://www.facebook.com/MTMSPRUCE?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100003991017121&fref=ufi&rc=p",
            "https://www.facebook.com/donald.bensen?fref=ufi&rc=p",
            "https://www.facebook.com/sarah.spencer.391?fref=ufi&rc=p",
            "https://www.facebook.com/utskier?fref=ufi&rc=p",
            "https://www.facebook.com/darius.bennett.54?fref=ufi&rc=p",
            "https://www.facebook.com/Toksiin.K?fref=ufi&rc=p",
            "https://www.facebook.com/corey.jay.397?fref=ufi&rc=p",
            "https://www.facebook.com/orlando.jose.16?fref=ufi&rc=p",
            "https://www.facebook.com/jeremy.durand.5?fref=ufi&rc=p",
            "https://www.facebook.com/rondy.reeves?fref=ufi&rc=p",
            "https://www.facebook.com/travis.rushforth?fref=ufi&rc=p",
            "https://www.facebook.com/aurian.ghaemmaghami?fref=ufi&rc=p",
            "https://www.facebook.com/Ifitaintaboutthemoney?fref=ufi&rc=p",
            "https://www.facebook.com/bubba.wells.10?fref=ufi&rc=p",
            "https://www.facebook.com/Arobb143?fref=ufi&rc=p",
            "https://www.facebook.com/soham.patil.m?fref=ufi&rc=p",
            "https://www.facebook.com/michelle.hinojosa.50?fref=ufi&rc=p",
            "https://www.facebook.com/brendan.mcleod.37?fref=ufi&rc=p",
            "https://www.facebook.com/blueshoals.1337?fref=ufi&rc=p",
            "https://www.facebook.com/eric.risen1?fref=ufi&rc=p",
            "https://www.facebook.com/bradford.graves.5?fref=ufi&rc=p",
            "https://www.facebook.com/Raven.Martin?fref=ufi&rc=p",
            "https://www.facebook.com/rfeil?fref=ufi&rc=p",
            "https://www.facebook.com/steve.ryder.39?fref=ufi&rc=p",
            "https://www.facebook.com/jeremy.maskell?fref=ufi&rc=p",
            "https://www.facebook.com/lloyd.neil.1?fref=ufi&rc=p",
            "https://www.facebook.com/paige.goettl?fref=ufi&rc=p",
            "https://www.facebook.com/20KGoldenPheasants?fref=ufi&rc=p",
            "https://www.facebook.com/liam.norris.7?fref=ufi&rc=p",
            "https://www.facebook.com/nick.stevenson.125?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100001498275116&fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/Warcraft/videos/10155717724984034/",
        "photos": []
    },
    {
        "comments": [],
        "description": "Robert Macbee  shared  Party Legends 's  post . Lucas   Brandon   Mark   Senior  Well all thats missing is Cooper",
        "participants": [
            "https://www.facebook.com/profile.php?id=100011999326053&fref=nf",
            "https://www.facebook.com/profile.php?id=100011999326053&hc_ref=ART_x2Bc8H3tADAvwY9WVikq0IQBkZ7wQisB2ysj_Q2xQXYL2xIA0zP_d2RYvsUg_3s",
            "https://www.facebook.com/Party-Legends-1897017636981638/?hc_ref=ART_x2Bc8H3tADAvwY9WVikq0IQBkZ7wQisB2ysj_Q2xQXYL2xIA0zP_d2RYvsUg_3s",
            "https://www.facebook.com/lucas.cason.7?fref=mentions",
            "https://www.facebook.com/senior.nibleetos?fref=mentions",
            "https://www.facebook.com/mark.mcclane.357?fref=mentions",
            "https://www.facebook.com/mime.jone?fref=mentions"
        ],
        "post": "https://www.facebook.com/permalink.php?story_fbid=331234570619851&id=100011999326053",
        "photos": []
    },
    {
        "comments": [],
        "description": "Mark McClane  shared  Anti-Fascist News 's  post .",
        "participants": [
            "https://www.facebook.com/mark.mcclane.357?fref=nf",
            "https://www.facebook.com/mark.mcclane.357?hc_ref=ARTZc3NROZYZwqbnqymK55xqMksMGkA4mKk3dCCVVDejfGOVjyiEvabMxTcYE9oONDw",
            "https://www.facebook.com/antifascistnews/?hc_ref=ARTZc3NROZYZwqbnqymK55xqMksMGkA4mKk3dCCVVDejfGOVjyiEvabMxTcYE9oONDw"
        ],
        "post": "https://www.facebook.com/mark.mcclane.357/posts/1994049454213500",
        "photos": []
    },
    {
        "comments": [],
        "description": "Mark McClane  shared  Tulsi Gabbard 's  post .",
        "participants": [
            "https://www.facebook.com/mark.mcclane.357?fref=nf",
            "https://www.facebook.com/mark.mcclane.357?hc_ref=ARRXy-OyMTXImJGrsSrL-mdQFsTAy-eFs-EOJmkpzoYt-tBts5umwZ-LOAeR4llzQ68",
            "https://www.facebook.com/VoteTulsi/?hc_ref=ARRXy-OyMTXImJGrsSrL-mdQFsTAy-eFs-EOJmkpzoYt-tBts5umwZ-LOAeR4llzQ68"
        ],
        "post": "https://www.facebook.com/mark.mcclane.357/posts/1994048014213644",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "And THIS is why I find myself as a fiscally conservative, socially liberal, libertarian leaning supporter of Tulsi Gabbard.",
                "from": "https://www.facebook.com/salbasia?fref=ufi&rc=p Dan Dickerson",
                "time": "November 3 at 2:52pm"
            },
            {
                "content": "It's time for a People's Party. The DNC from its roots with Southern Dixiecrats to it's recent outright ignoring of the will of the people it supposedly represents is too antiquated and broken.",
                "from": "https://www.facebook.com/adam.couture.58?fref=ufi&rc=p Adam Couture",
                "time": "November 3 at 2:53pm"
            },
            {
                "content": "Amen to this. Totally reorganize. I just unsubscribed from every Democratic emails I received. I want an honest, American values and ideals candidate. Let's get back to what is important to the 165 million of us who voted Democrat. We can win in 2018 and 2020.",
                "from": "https://www.facebook.com/robert.garritano?fref=ufi&rc=p Robert Garritano",
                "time": "November 3 at 3:06pm"
            },
            {
                "content": "Tulsi should know this as well or better than anyone. What we need is to get rid of IT, the DNC, is to corrupt to save. Either clean house of everyone in the DNC and make everyone of them reapply under a new platform. Or scrap it and start a new govern ... See More",
                "from": "https://www.facebook.com/thomas.crevenna?fref=ufi&rc=p Andrew Crevenna",
                "time": "November 3 at 2:47pm"
            },
            {
                "content": "Tulsi, you need to leave that corrupt party. \"Independent\" isn't just a lack of party affiliation, it's a mode of thought.",
                "from": "https://www.facebook.com/MXNerdy?fref=ufi&rc=p Steve Cox",
                "time": "November 3 at 5:07pm"
            },
            {
                "content": "Wow! Congresswoman/Major Gabbard gets it. I hope she runs for the senate as an independent on the next election. I don’t live in Hawaii, so I couldn’t vote for her. However, I would definitely make a contribution to her campaign.",
                "from": "https://www.facebook.com/tonynel.grajales?fref=ufi&rc=p Tony Nel Grajales",
                "time": "November 3 at 2:56pm"
            },
            {
                "content": "I think Rand Paul / Tulsi Gabbard would be a good ticket in 2024.  It would merge the libertarian and honest wings of the democratic party together into a super group.   Rand is going to be President eventually, Tulsi would make a great VP and eventual successor.  Bring balance back to politics... get rid of the parties.",
                "from": "https://www.facebook.com/nicholas.hevey?fref=ufi&rc=p Nicholas Hevey",
                "time": "November 3 at 6:31pm"
            },
            {
                "content": "how bout 100% publicly funded elections? figure a way to vet candidates.......make it illegal -a high crime-for any politician to accept one cent.....create the new zeitgeist . Congresspeople stop spending half their time in Congress raising $......and they begin representing the people who voted them in- not corporate sponsors.",
                "from": "https://www.facebook.com/profile.php?id=693960122&fref=ufi&rc=p Paul Anderson",
                "time": "November 3 at 8:49pm"
            },
            {
                "content": "The DNC cannot be reformed. They are corrupt  corporate shills. Start a new party, cease the means of production!",
                "from": "https://www.facebook.com/stephan.simes.9?fref=ufi&rc=p Stephan Simes",
                "time": "November 3 at 3:20pm"
            },
            {
                "content": "Wow...but if our campaign finance laws are broken....does that mean that Hillary broke United States finance campaign laws and has thus defrauded many party primaries to win the nomination, and thus broken Federal Election Laws!?",
                "from": "https://www.facebook.com/denis.drahus?fref=ufi&rc=p Denis Drahus",
                "time": "November 3 at 3:16pm Edited"
            },
            {
                "content": "All Donors should Sue DNC to get there $ Back...Put Crooked Hillary behind bars ...and Start a New Clean Moderate Party...Independent’s Party.  Require members to have a minimal level of political intelligence...no weak minded rara “I’m voting for her because she is a woman” or “he will be the 1st black president”...",
                "from": "https://www.facebook.com/robin.mellor.7?fref=ufi&rc=p Robin Mellor",
                "time": "November 3 at 3:29pm"
            },
            {
                "content": "Here come the TRump humper trolls!  They infest the sites of progressives like Tulsi, like cockroaches.   They are all over Bernie's pages too.,  Tulsi has some great points and Bernie himself recommended all these reforms when he was running for the nomination  and he reiterated them after he did not win the nomination,.  He called for reforms, which is a good thing.",
                "from": "https://www.facebook.com/flick.rahke.1?fref=ufi&rc=p Flick Rahke",
                "time": "November 3 at 7:05pm"
            },
            {
                "content": "Dear Congessawoman Gabbard- PLEASE leave the broken, corrupt vessel that is the Democratic party. We the people WILL support you and the other progressive candidates who do, but we cannot and will not support any party that betrays us for the private dollars it whores itself out to. Public paid public servants is what we need...and we can get that with a 3rd party.",
                "from": "https://www.facebook.com/jason.mollette.7?fref=ufi&rc=p Jason Mollette",
                "time": "November 3 at 3:07pm"
            },
            {
                "content": "What surprised me about Brazile's revelations concerning the Hillary campaign's control of the DNC was that during the campaign, Brazile was a 100% Hillary supporter, even to the extent of unfairly & unethically revealing to her a question that would be asked at a candidates' town hall.",
                "from": "https://www.facebook.com/profile.php?id=624795249&fref=ufi&rc=p R.G. Campbell",
                "time": "November 4 at 6:00am"
            },
            {
                "content": "Demand the DNC release their budget so they aren't able to have a legalized money laundering scheme with less than 1% of the budget going towards state candidates like they lied about.",
                "from": "https://www.facebook.com/adam.king.37266?fref=ufi&rc=p Adam King",
                "time": "November 3 at 3:00pm"
            },
            {
                "content": "way to go, Tulsi. Please keep telling the less informed that since the democrats have the money that it takes nowadays, that change must come from within. Any 3rd party attempt would run out of money way too early.",
                "from": "https://www.facebook.com/chuck.chinook?fref=ufi&rc=p Chuck Chinook",
                "time": "November 4 at 4:45am"
            },
            {
                "content": "But you quit your leadership position in the DNC...yet you stump as a change agent...so your leadership method is to quit and complain?",
                "from": "https://www.facebook.com/richard.onderko?fref=ufi&rc=p Richard Onderko",
                "time": "November 5 at 2:46am"
            },
            {
                "content": "Signing petitions, sending emails and calling our representatives does not appear to have much effect. Representatives appear to only be listening to donors, party leadership and political insiders. Not a  good trend to say the least.",
                "from": "https://www.facebook.com/terry.egan.10?fref=ufi&rc=p Terry Egan",
                "time": "November 3 at 5:02pm"
            },
            {
                "content": "I would love to hear Tulsi's opinion of Independents, starting a new party vs reforming the Democratic Party. I'm no expert, but starting a new party has all the decks stacked against it. The two party system saw to that. Starting a new party in all 50 ... See More",
                "from": "https://www.facebook.com/thomas.crevenna?fref=ufi&rc=p Andrew Crevenna",
                "time": "November 3 at 3:44pm"
            },
            {
                "content": "You are there. Raise hell in a public way. The Democrat party is FUBAR. It can only be repaired from within. If you truly believe what you say then I would like to see you on every news network opening up every latrine and letting the smell out.",
                "from": "https://www.facebook.com/thomas.sweeney.5015?fref=ufi&rc=p Thomas Sweeney",
                "time": "November 3 at 4:09pm"
            },
            {
                "content": "I dont agree with same day registration as it leaves too much room for voter fraud, but I do agree with eliminating Super delegates.   We should require ID’s to vote and allow a 2 year window to give people time to obtain birth certificates, and all ot ... See More",
                "from": "https://www.facebook.com/mike.kilpatrick1?fref=ufi&rc=p Mike Kilpatrick",
                "time": "November 4 at 5:54am"
            },
            {
                "content": "Can we please get a Gabbard/Sanders 2020 ticket!? Or vice versa? Whatever you feel comfortable with we will support you especially if it involves 2020",
                "from": "https://www.facebook.com/DiegoReynosoFP?fref=ufi&rc=p Diego Reynoso",
                "time": "November 3 at 7:57pm"
            },
            {
                "content": "Representative Gabbard, we, the people, are ready for your correct ideas and strong leadership.  Thank you for keeping the message relevant to solutions to the flaws in our democracy, rather than throw around blame or glorify yourself.  The people trust you, and want you to step forward and lead.",
                "from": "https://www.facebook.com/dechen.thurman?fref=ufi&rc=p Dechen Karl Thurman",
                "time": "November 4 at 1:31am"
            },
            {
                "content": "The dnc lost my vote. I will never vote Democrat ever again! Start a new party with laws against corporate influence!!!!",
                "from": "https://www.facebook.com/gabriel.fierstine?fref=ufi&rc=p Gabriel Fierstine",
                "time": "November 3 at 7:41pm"
            },
            {
                "content": "You cannot have same-day registration and open registration is not have a law is written please stop trying to change the rules to fit your needs that's the problem with the Democratic Party if it doesn't work out for you you want to change the rules just stop all the nonsense and everything will be fine but by trying to change the rules that's what upsets people",
                "from": "https://www.facebook.com/rick.ford.1656?fref=ufi&rc=p Rick Ford",
                "time": "November 3 at 9:59pm Edited"
            },
            {
                "content": "Please tulsi find a way to distance yourself from the dems. We need a party that is willing to work a middle path. The extremes the right and left have made us suffer through is beyond reasonable. We need a unification party.",
                "from": "https://www.facebook.com/gabriel.fierstine?fref=ufi&rc=p Gabriel Fierstine",
                "time": "November 3 at 11:26pm"
            },
            {
                "content": "There are more than a few of us, who want you in High Office, Tulsi. If the DEMS are too stupid to put you up as their Candidate in the 2020 election, then you'll have to do something else. I myself am an Independent. I despise the DNC....AND the RNC. We DEMAND that you are on that ballot.....  <3 ",
                "from": "https://www.facebook.com/karl.starke.7?fref=ufi&rc=p Karl Starke",
                "time": "November 6 at 6:58am"
            },
            {
                "content": "I'm a big fan Tulsi, and I'm glad your speaking publicly about the necessary overhaul of the DNC. I just ask that you lose the platitudes at the end of this video because as a younger voter it feels inauthentic. You're a proven Champion and you have my vote, but please keep the tone of change strong and without platitudes. You can win.",
                "from": "https://www.facebook.com/chase.palmieri?fref=ufi&rc=p Chase Palmieri",
                "time": "November 4 at 3:51pm"
            },
            {
                "content": "But WHY are we supposed to donate through ActBlue? Same rip off scheme as last time!? I would donate to Tulsi directly, but NOT through the same corrupt organization that she’s speaking against!? WTH?",
                "from": "https://www.facebook.com/craigcycle?fref=ufi&rc=p Craig Hockmeyer",
                "time": "November 3 at 7:20pm"
            },
            {
                "content": "I would hope we would also see Bernie push to have all primaries, no caucuses. I know many think the problem was superdelegates, but he mostly won caucuses where he couldn't get the delegates. Let's push for one person one vote. Caucuses are undemocratic",
                "from": "https://www.facebook.com/smithchr2015?fref=ufi&rc=p Chris Smith",
                "time": "November 5 at 10:09am"
            },
            {
                "content": "I admire your integrity and your efforts.  I will vote for any candidate with a platform of issues benefiting people regardless of party.  I wish you luck reforming the DNC.  If you and others are successful, and the platform is right, I may come back.  In the meantime, I'm not wasting another dollar or vote.",
                "from": "https://www.facebook.com/forrest.blocker?fref=ufi&rc=p Forrest Blocker",
                "time": "November 4 at 2:14am"
            },
            {
                "content": "Bernie and Tulsi over the Green party in 2020.... that's the Ticket. . The corrupt DNC ,will not change for another 50 years.",
                "from": "https://www.facebook.com/profile.php?id=100000502835431&fref=ufi&rc=p Lester R. Parker II",
                "time": "November 3 at 4:58pm Edited"
            },
            {
                "content": "The election outcome is a blessing. Trump has the special kind of crazy needed to go up against Child Trafficking and the pedophilia epidemic. The country needs 4 years of his scouring. No Democrat evinced that kind of courage, not even the most courag ... See More",
                "from": "https://www.facebook.com/DoreenEllenBellDotan?fref=ufi&rc=p Doreen Ellen Bell-Dotan",
                "time": "November 4 at 7:04pm Edited"
            },
            {
                "content": "The DNC doesn't have an obligation to anyone but its members.  That's not corruption, that's the way the system has always been.  America needs more parties, get out there and start one.",
                "from": "https://www.facebook.com/joseph.zullo.5?fref=ufi&rc=p Joseph Zullo",
                "time": "November 6 at 6:41pm"
            },
            {
                "content": "Sterling T Steves  we are not alone. I support her (and contributed via Bernie's fundraising efforts) because her policies are principled in democratic values and NOT DNC authority.",
                "from": "https://www.facebook.com/sillee8?fref=ufi&rc=p Leslie Lausch",
                "time": "November 3 at 10:39pm Edited"
            },
            {
                "content": "The question is: Did Obama intentionally create a debt, and enjoy the benefit of that money, and also pay it off very slowly so that he could say to Hillary: Pay off the debt (or a large part of it) and the Presidency is yours.",
                "from": "https://www.facebook.com/DoreenEllenBellDotan?fref=ufi&rc=p Doreen Ellen Bell-Dotan",
                "time": "November 4 at 7:46pm"
            },
            {
                "content": "Aren't superdelegates a safety net to protect us from electing crazy people like DT.  If so, it's too bad the Republicans didn't have them.",
                "from": "https://www.facebook.com/michele.maryanski?fref=ufi&rc=p Michele Maryanski",
                "time": "November 3 at 10:14pm"
            },
            {
                "content": "So the Clinton campaign bypassed individual campaign contribution limits by funneling money from the DNC, state, and local parties into her campaign? That sounds a lot like a Ponzi Scheme.",
                "from": "https://www.facebook.com/profile.php?id=100009660730043&fref=ufi&rc=p Steven Wendel",
                "time": "November 3 at 4:23pm"
            },
            {
                "content": "You are preaching to the choir. Democrats are just waiting for our elected officials to do something about superdelegates and campaign finance reform/Citizen’s United.",
                "from": "https://www.facebook.com/evelyn.thomas3?fref=ufi&rc=p Evelyn Thomas",
                "time": "November 6 at 4:04am Edited"
            },
            {
                "content": "Hello Representative Tulsi.  I think you should start a new party.  That would be better than fixing a party that is full of self serving people.  Call it the People's party.  That is what we need.",
                "from": "https://www.facebook.com/profile.php?id=100004510036676&fref=ufi&rc=p Kenneth C Richardson",
                "time": "November 3 at 10:58pm"
            },
            {
                "content": "My friends are getting notices that I like and signed your petition. I didn't. Please do not  continue to mislead the people of Hawaii.",
                "from": "https://www.facebook.com/lynneronderko?fref=ufi&rc=p Lynn Robinson-Onderko",
                "time": "November 5 at 2:43am"
            },
            {
                "content": "Plan ahead. There is plenty of advance notice for citizens to register to vote, if they wanted to vote. Same day is for the weak minded and lazy.  If they were getting something for nothing...they would find a way to be wherever, whenever.",
                "from": "https://www.facebook.com/AngryCamel?fref=ufi&rc=p Matteo Kirsner",
                "time": "November 6 at 5:07am"
            },
            {
                "content": "Ian Russell  this is going to be our 1st female vice.president.... Just my prediction. Write it down so when it happens you know who said it 1st.",
                "from": "https://www.facebook.com/matthew.gallegos.589?fref=ufi&rc=p Matthew Gallegos",
                "time": "November 4 at 5:30am"
            },
            {
                "content": "Tulsi needs to be the head of the Democratic Party. The party of unions and middle class and the party of peace could be saved and she can save it.",
                "from": "https://www.facebook.com/donald.klepack?fref=ufi&rc=p Donald Klepack",
                "time": "November 3 at 10:52pm"
            },
            {
                "content": "You can't make changes in the org unless you are part of it.  You resigned your leverage and credibility.",
                "from": "https://www.facebook.com/teri.heede?fref=ufi&rc=p Teri Heede",
                "time": "November 5 at 3:01am Edited"
            },
            {
                "content": "I wanna see the Democratic Party revived and restored to its not-so-corrupt glory and I’m proud to see you do that, Gabbard! # tulsiforpresident2020",
                "from": "https://www.facebook.com/zgmiletich?fref=ufi&rc=p Zack Miletich",
                "time": "November 4 at 9:48pm Edited"
            },
            {
                "content": "I love this woman. . She puts principle over party..Much like Rand Paul with the GOP. I would love to see a Paul/Gabbard Libertarian ticket 2020",
                "from": "https://www.facebook.com/michael.anderson.750331?fref=ufi&rc=p Michael Anderson",
                "time": "November 4 at 5:44am"
            },
            {
                "content": "Great video! Please be a leading light within the party  to reform this corruption. The Dems must become the party of working people again if it wants to win!!",
                "from": "https://www.facebook.com/chris.chalk.370?fref=ufi&rc=p Chris Chalk",
                "time": "November 3 at 8:02pm"
            },
            {
                "content": "Like her. Could the message point the finger less to Clinton, and acknowledge that the responsibility is of the Democratic party as a whole? Thoughts?",
                "from": "https://www.facebook.com/armando.j.ariza?fref=ufi&rc=p Armando J Ariza",
                "time": "November 4 at 12:52pm"
            },
            {
                "content": "The machine is going to bury you inside the DNC... You and Rand Paul would make a excellent problem for both establishments, but alone you will be Ron Paul blacked out... You should find a new party.",
                "from": "https://www.facebook.com/balmarode?fref=ufi&rc=p Brian Almarode",
                "time": "November 3 at 4:40pm"
            }
        ],
        "description": "Tulsi Gabbard We must bring about real campaign finance reform. The DNC must get rid of the undemocratic system of superdelegates, who have the power to swing an election, making up one-third of the votes any candidate needs to secure the nomination. The DNC must push for open or same-day registration in Democratic primaries in every state across the country to ease and encourage voter engagement instead of making it more difficult. If there is any hope of strengthening our party, they must stop this ‘more of the same’ mentality and start caring more about people than protecting the status quo.  https://www.votetulsi.com/node/33057 Sterling T Steves Ian Russell",
        "participants": [
            "https://www.facebook.com/VoteTulsi/?ref=nf&hc_ref=ARTOgDZRbD0oq3MHxg8_ZToVSnFmltUlY6MBFhGz7yFWRUllVQWF_SlvspWoVPp1dtM",
            "https://www.facebook.com/salbasia?fref=ufi&rc=p",
            "https://www.facebook.com/adam.couture.58?fref=ufi&rc=p",
            "https://www.facebook.com/robert.garritano?fref=ufi&rc=p",
            "https://www.facebook.com/thomas.crevenna?fref=ufi&rc=p",
            "https://www.facebook.com/MXNerdy?fref=ufi&rc=p",
            "https://www.facebook.com/tonynel.grajales?fref=ufi&rc=p",
            "https://www.facebook.com/nicholas.hevey?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=693960122&fref=ufi&rc=p",
            "https://www.facebook.com/stephan.simes.9?fref=ufi&rc=p",
            "https://www.facebook.com/denis.drahus?fref=ufi&rc=p",
            "https://www.facebook.com/robin.mellor.7?fref=ufi&rc=p",
            "https://www.facebook.com/flick.rahke.1?fref=ufi&rc=p",
            "https://www.facebook.com/jason.mollette.7?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=624795249&fref=ufi&rc=p",
            "https://www.facebook.com/adam.king.37266?fref=ufi&rc=p",
            "https://www.facebook.com/chuck.chinook?fref=ufi&rc=p",
            "https://www.facebook.com/richard.onderko?fref=ufi&rc=p",
            "https://www.facebook.com/terry.egan.10?fref=ufi&rc=p",
            "https://www.facebook.com/thomas.crevenna?fref=ufi&rc=p",
            "https://www.facebook.com/thomas.sweeney.5015?fref=ufi&rc=p",
            "https://www.facebook.com/mike.kilpatrick1?fref=ufi&rc=p",
            "https://www.facebook.com/DiegoReynosoFP?fref=ufi&rc=p",
            "https://www.facebook.com/dechen.thurman?fref=ufi&rc=p",
            "https://www.facebook.com/gabriel.fierstine?fref=ufi&rc=p",
            "https://www.facebook.com/rick.ford.1656?fref=ufi&rc=p",
            "https://www.facebook.com/gabriel.fierstine?fref=ufi&rc=p",
            "https://www.facebook.com/karl.starke.7?fref=ufi&rc=p",
            "https://www.facebook.com/chase.palmieri?fref=ufi&rc=p",
            "https://www.facebook.com/craigcycle?fref=ufi&rc=p",
            "https://www.facebook.com/smithchr2015?fref=ufi&rc=p",
            "https://www.facebook.com/forrest.blocker?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000502835431&fref=ufi&rc=p",
            "https://www.facebook.com/DoreenEllenBellDotan?fref=ufi&rc=p",
            "https://www.facebook.com/joseph.zullo.5?fref=ufi&rc=p",
            "https://www.facebook.com/sillee8?fref=ufi&rc=p",
            "https://www.facebook.com/sterlingsteves?hc_location=ufi",
            "https://www.facebook.com/DoreenEllenBellDotan?fref=ufi&rc=p",
            "https://www.facebook.com/michele.maryanski?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009660730043&fref=ufi&rc=p",
            "https://www.facebook.com/evelyn.thomas3?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100004510036676&fref=ufi&rc=p",
            "https://www.facebook.com/lynneronderko?fref=ufi&rc=p",
            "https://www.facebook.com/AngryCamel?fref=ufi&rc=p",
            "https://www.facebook.com/matthew.gallegos.589?fref=ufi&rc=p",
            "https://www.facebook.com/ian.russell.1401?hc_location=ufi",
            "https://www.facebook.com/donald.klepack?fref=ufi&rc=p",
            "https://www.facebook.com/teri.heede?fref=ufi&rc=p",
            "https://www.facebook.com/zgmiletich?fref=ufi&rc=p",
            "https://www.facebook.com/michael.anderson.750331?fref=ufi&rc=p",
            "https://www.facebook.com/chris.chalk.370?fref=ufi&rc=p",
            "https://www.facebook.com/armando.j.ariza?fref=ufi&rc=p",
            "https://www.facebook.com/balmarode?fref=ufi&rc=p",
            "https://www.facebook.com/salbasia?fref=ufi&rc=p",
            "https://www.facebook.com/adam.couture.58?fref=ufi&rc=p",
            "https://www.facebook.com/robert.garritano?fref=ufi&rc=p",
            "https://www.facebook.com/thomas.crevenna?fref=ufi&rc=p",
            "https://www.facebook.com/MXNerdy?fref=ufi&rc=p",
            "https://www.facebook.com/tonynel.grajales?fref=ufi&rc=p",
            "https://www.facebook.com/nicholas.hevey?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=693960122&fref=ufi&rc=p",
            "https://www.facebook.com/stephan.simes.9?fref=ufi&rc=p",
            "https://www.facebook.com/denis.drahus?fref=ufi&rc=p",
            "https://www.facebook.com/robin.mellor.7?fref=ufi&rc=p",
            "https://www.facebook.com/flick.rahke.1?fref=ufi&rc=p",
            "https://www.facebook.com/jason.mollette.7?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=624795249&fref=ufi&rc=p",
            "https://www.facebook.com/adam.king.37266?fref=ufi&rc=p",
            "https://www.facebook.com/chuck.chinook?fref=ufi&rc=p",
            "https://www.facebook.com/richard.onderko?fref=ufi&rc=p",
            "https://www.facebook.com/terry.egan.10?fref=ufi&rc=p",
            "https://www.facebook.com/thomas.crevenna?fref=ufi&rc=p",
            "https://www.facebook.com/thomas.sweeney.5015?fref=ufi&rc=p",
            "https://www.facebook.com/mike.kilpatrick1?fref=ufi&rc=p",
            "https://www.facebook.com/DiegoReynosoFP?fref=ufi&rc=p",
            "https://www.facebook.com/dechen.thurman?fref=ufi&rc=p",
            "https://www.facebook.com/gabriel.fierstine?fref=ufi&rc=p",
            "https://www.facebook.com/rick.ford.1656?fref=ufi&rc=p",
            "https://www.facebook.com/gabriel.fierstine?fref=ufi&rc=p",
            "https://www.facebook.com/karl.starke.7?fref=ufi&rc=p",
            "https://www.facebook.com/chase.palmieri?fref=ufi&rc=p",
            "https://www.facebook.com/craigcycle?fref=ufi&rc=p",
            "https://www.facebook.com/smithchr2015?fref=ufi&rc=p",
            "https://www.facebook.com/forrest.blocker?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100000502835431&fref=ufi&rc=p",
            "https://www.facebook.com/DoreenEllenBellDotan?fref=ufi&rc=p",
            "https://www.facebook.com/joseph.zullo.5?fref=ufi&rc=p",
            "https://www.facebook.com/sillee8?fref=ufi&rc=p",
            "https://www.facebook.com/DoreenEllenBellDotan?fref=ufi&rc=p",
            "https://www.facebook.com/michele.maryanski?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100009660730043&fref=ufi&rc=p",
            "https://www.facebook.com/evelyn.thomas3?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100004510036676&fref=ufi&rc=p",
            "https://www.facebook.com/lynneronderko?fref=ufi&rc=p",
            "https://www.facebook.com/AngryCamel?fref=ufi&rc=p",
            "https://www.facebook.com/matthew.gallegos.589?fref=ufi&rc=p",
            "https://www.facebook.com/donald.klepack?fref=ufi&rc=p",
            "https://www.facebook.com/teri.heede?fref=ufi&rc=p",
            "https://www.facebook.com/zgmiletich?fref=ufi&rc=p",
            "https://www.facebook.com/michael.anderson.750331?fref=ufi&rc=p",
            "https://www.facebook.com/chris.chalk.370?fref=ufi&rc=p",
            "https://www.facebook.com/armando.j.ariza?fref=ufi&rc=p",
            "https://www.facebook.com/balmarode?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/VoteTulsi/videos/1581926125197134/",
        "photos": []
    }
]