[
    {
        "comments": [],
        "description": "Nancy Rose  shared  NBC News 's  post . It's like he purposefully finds the absolute worst person he can and hires them!!! Again, only a total idiot would be a republican.",
        "participants": [
            "https://www.facebook.com/mary.jane.522?fref=nf",
            "https://www.facebook.com/mary.jane.522?hc_ref=ARScWbY4bf54GFCsezNYNpvNJxWa1ARnP_swvED0q09Bm6ceKSIDDkX5EuWwq14zKCo",
            "https://www.facebook.com/NBCNews/?hc_ref=ARScWbY4bf54GFCsezNYNpvNJxWa1ARnP_swvED0q09Bm6ceKSIDDkX5EuWwq14zKCo",
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARQ04sThPARM6CFlEFiJLgWlVKEkJyp-ITP_6wkUAiovT0GEOmRqFrLhVItGjHarwYA",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2jw1Yvy&h=ATPxP3xPamuOgQxWCMAfAWad-rJELXYMgGanYQkoiQ0_Fl8tlBR4clBUw-PBjQsMzzffppgZWL-_lbgykwZ5G3viM50Iz0YfKUAppAXhlce7_eQiiF12nFK0B61i0rsDZSefWBg2vDnJfhnoi1Aykmn8kGjW-EKEPQuz52eKJ_C6K9FVFkNjFTNBP7yBkLN6F803JAkzlv96Pqyln-ewzPr5u8hwZAx7IXKAS-6qBZHH4wCY9L7x1AtcyrKkuVQFR0EamW2lQ6Mg73f5U6NMWAc"
        ],
        "post": "https://www.facebook.com/mary.jane.522/posts/10210458382075490",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "Yup...makes perfect sense.  And people want Trump gone (don't worry, so do I)..but we have to remember...when Pence gets the White House, he WILL have the backing of the Supreme Court, the Senate, The Congress...and then we truly will be screwed.  They are buying time with Trump, We need to turn the Senate and Congress BLUE in 2018 or this Country will really be finished.",
                "from": "https://www.facebook.com/maurice.stpierre.9?fref=ufi&rc=p Maurice St Pierre",
                "time": "November 16 at 7:18am"
            },
            {
                "content": "Many of the same people who oppose same sex marriage are getting ready to elect a child molester to the U.S. Senate.",
                "from": "https://www.facebook.com/simon.teixeira.9022?fref=ufi&rc=p Simon Teixeira",
                "time": "November 16 at 7:15am"
            },
            {
                "content": "Incredible...he routinely picks the worst of the worst to head our agencies.  Upside down and backwards\\",
                "from": "https://www.facebook.com/HeleneTreckemeMeyer?fref=ufi&rc=p Helene Meyer",
                "time": "November 16 at 7:24am"
            },
            {
                "content": "Omg..are we going to wake up one morning and fine out that Russia has taken over our country..How the hell does the republicans allow this to happen to our country..??? Have all the republicans become Putins puppets too..??",
                "from": "https://www.facebook.com/janet.johnson.58958?fref=ufi&rc=p Janet Johnson",
                "time": "November 16 at 7:31am Edited"
            },
            {
                "content": "Every Cabinet pick he has made, has been completely unqualified for the position. Why should this one be any different  🙄 ",
                "from": "https://www.facebook.com/peg.nunley?fref=ufi&rc=p Peg Richardson Nunley",
                "time": "November 16 at 7:40am"
            },
            {
                "content": "It’s like trump deliberately chooses the most unqualified candidates he can find for every job. Maybe part of Brannon’s grand plan for complete anarchy now being executed from outside the White House",
                "from": "https://www.facebook.com/shona.salver?fref=ufi&rc=p Shona Randall Salver",
                "time": "November 16 at 8:26am Edited"
            },
            {
                "content": "Every day Trump makes a mockery of American ideals & institutions & every day makes Americans less & less safe. History is reflecting each & every vile act.",
                "from": "https://www.facebook.com/darci.ricker?fref=ufi&rc=p Darci Ricker",
                "time": "November 16 at 7:36am"
            },
            {
                "content": "Man, I cannot WAIT for next year's Midterms. It's time to clean House (and Senate) and get lots of young blood (read: non-crazy) in there!",
                "from": "https://www.facebook.com/lingoboi?fref=ufi&rc=p Michael von Siegel",
                "time": "November 16 at 8:21am Edited"
            },
            {
                "content": "Do they even interview these people for these positions? What business would hire someone without at least a background check, especially for a government position?",
                "from": "https://www.facebook.com/rosemary.rodriguezsifuentes?fref=ufi&rc=p Rosemary Rodriguez Sifuentes",
                "time": "November 16 at 7:18am"
            },
            {
                "content": "Another degenerate appointed by Trump when is congress going to act to get rid of Trump?  Trump is nothing but a disgrace to the country and he is doing his utmost to destroy our country and its ecology. How can the Senate approve such an _ SS HOLE??",
                "from": "https://www.facebook.com/silvio.ranieri?fref=ufi&rc=p Silvio Ranieri",
                "time": "November 16 at 7:58am"
            },
            {
                "content": "Congress is proving every day that they do not care about qualifications. They do not care about the people .   They are approving everyone nominated just to get their “agenda” done.",
                "from": "https://www.facebook.com/karen.mirando.9?fref=ufi&rc=p Karen Mirando",
                "time": "November 16 at 11:46am"
            },
            {
                "content": "they didn't have to dig very deep to find that one.  The former Rhino Resources CEO's name was already well known at the Department of Justice for mining safety violations.",
                "from": "https://www.facebook.com/david.shehorn?fref=ufi&rc=p David Shehorn",
                "time": "November 16 at 8:24am"
            },
            {
                "content": "I wonder if those guys are just trying to push us to the absolute max, I don't know about anyone else but I've just had it with them . Calling them is joke  they do not listen and do as they want . Let's just vote all these two face bad boys out!!",
                "from": "https://www.facebook.com/martha.mcelligott.9?fref=ufi&rc=p Martha McElligott",
                "time": "November 16 at 7:46am"
            },
            {
                "content": "Business will prevail. Supply and demand. More demand for solar and wind power than coal. Don't forget hydro, too.",
                "from": "https://www.facebook.com/msawalker1954?fref=ufi&rc=p Anne Walker",
                "time": "November 16 at 7:32am"
            },
            {
                "content": "Just as unqualified as all his other appointments... America is getting taken over by big business..its in the plan...Sad",
                "from": "https://www.facebook.com/judy.puniwai?fref=ufi&rc=p Judy Carvalho Puniwai",
                "time": "November 16 at 8:21am"
            },
            {
                "content": "Trump's plan puts the most unethical and unqualified in charge of each department.  Then they sabotage the previous progress.  They'll destroy everything and Trump will boast about it and himself!",
                "from": "https://www.facebook.com/bonnie.blincoe?fref=ufi&rc=p Bonnie Blincoe",
                "time": "November 16 at 8:07am"
            },
            {
                "content": "Why would he pick anyone that makes sense for the position? He hasn't with any of the others that he has filled.",
                "from": "https://www.facebook.com/beckie.thompson1?fref=ufi&rc=p Beckie Snyder",
                "time": "November 16 at 7:35am"
            },
            {
                "content": "I wonder how much cash this guy gave Donnie's campaign? He seems to nominate his money cronies regardless of qualifications. No biggie to Republicans though, they elected a reality show celebrity with zero morals, ethics, or qualifications to be POTUS.",
                "from": "https://www.facebook.com/susan.s.lehman.7?fref=ufi&rc=p Susan Stover Lehman",
                "time": "November 16 at 2:35pm"
            },
            {
                "content": "No boss wants his employees to be smarter than him.  Trump isnt qualified, mentally or emotionally for his position, so why would you think that the people who works for him would be... And they said..\" hes a good businessman, his chosen staff will direct and guide him through his presidency...like a CEO with the best top employees... Uh..no...yall forgot he was a narcissist...lol ... See More",
                "from": "https://www.facebook.com/sophia.morrislewis?fref=ufi&rc=p Sophia Morris",
                "time": "November 16 at 8:02am"
            },
            {
                "content": "I seriously do not understand why the people being appointed are antitheses to the position they will be holding. Is this deliberate? Surely there is no dearth of qualified people suited for the cabinet.",
                "from": "https://www.facebook.com/monin.navarro?fref=ufi&rc=p Monin Navarro",
                "time": "November 16 at 9:15am"
            },
            {
                "content": "Why are republicans so set on destroying our country and the world?  Do they have a secret formula for eating, breathing and drinking money?",
                "from": "https://www.facebook.com/kathleen.gulbransen?fref=ufi&rc=p Kathleen Gulbransen",
                "time": "November 16 at 9:11am Edited"
            },
            {
                "content": "Trumps goes out and finds the one person that has the worst reputation in which ever area he is making a nomination and says let's get him, he is the worst there is and that is what we want to tear down this country.",
                "from": "https://www.facebook.com/NCbulldoglover?fref=ufi&rc=p Phyllis Bacon Copley",
                "time": "November 16 at 6:43pm"
            },
            {
                "content": "And when he gets all health and safety regs removed for all American workers everywhere, gets rid of all of the healthcare and 401K benefits, declares all discrimination just fine, and gets rid of that pesky minimum wage he feels is too high, then he can bring HIS and Ivanka's jobs back to the US! MAGA, yep....",
                "from": "https://www.facebook.com/mary.middleton.9849?fref=ufi&rc=p Mary Middleton",
                "time": "November 16 at 3:46pm"
            },
            {
                "content": "The president is destroying this country from within. Everyday, we slide further down. Our environment is degraded, our health is in peril, and our existence is just a button push away. When will we rise up and take back our country?",
                "from": "https://www.facebook.com/janet.johnson.5895834?fref=ufi&rc=p Janet Johnson",
                "time": "November 16 at 1:46pm"
            },
            {
                "content": "Well that will take care of the coal miners wanting their jobs back......enough of them get sick or killed they may decide to accept the retraining....diabolical thought process but trumpian for sure",
                "from": "https://www.facebook.com/rosanne.bopp?fref=ufi&rc=p Rosanne Bopp",
                "time": "November 16 at 12:55pm"
            },
            {
                "content": "Each and every Trump pick has been/will be appointed by this Republican Senate.  They will blindly put into place each inappropriate candidate trump puts forth.  The Republicans are complicit.  They must be held accountable for their actions and they way to do that is to vote them out of office.",
                "from": "https://www.facebook.com/lorraine.horn.56?fref=ufi&rc=p Lorraine Horn",
                "time": "November 16 at 12:11pm"
            },
            {
                "content": "Well maybe it's good for those idiots who refuse to move on and do something else with their lives. They are being shown exactly what their lives and safety mean to this administration.",
                "from": "https://www.facebook.com/divadebbie?fref=ufi&rc=p Dadiva Debbie",
                "time": "November 16 at 1:25pm"
            },
            {
                "content": "I sincerely hope our next Dem President can reverse all these mafia appointees, this is criminal. The Republican party is totally out of touch with this country and no longer do their job which is taking care of this country and its citizens. shame shame on them.  vote blue everyone in all the upcoming elections and vote all these jerks out of office.",
                "from": "https://www.facebook.com/rita.casey.1069?fref=ufi&rc=p Rita Casey",
                "time": "November 16 at 1:50pm"
            },
            {
                "content": "I’ve watched a man die of black lung disease.. I doubt this bozo even knows what is.. certainly not trump. Don’t get it on a golf course",
                "from": "https://www.facebook.com/fromleigh?fref=ufi&rc=p Leigh Wilson",
                "time": "November 16 at 8:25am"
            },
            {
                "content": "The senate is useless. They have confirmed every single one of Trump's unqualified incompetent hacks.  Under what circumstances would they NOT confirm someone ???",
                "from": "https://www.facebook.com/tatyana.meresh?fref=ufi&rc=p Tatyana Mereshensky",
                "time": "November 16 at 1:55pm"
            },
            {
                "content": "A perfect example of the fox guarding the chickens.  And still people support #45. Unbelievable.  I bet the miners will be happy.  Especially when they are all back at work mining coal to be used as airplane fuel.",
                "from": "https://www.facebook.com/janice.mortensen.31?fref=ufi&rc=p Janice Mortensen",
                "time": "November 16 at 4:29pm"
            },
            {
                "content": "There continue to be no surprises from the Trump administration. If anyone thinks he ever intended to do anything other than to look out for himself and his ilk, then they are seriously a special kind of stupid. This man has no regard for anyone or any ... See More",
                "from": "https://www.facebook.com/aherne.trish?fref=ufi&rc=p Trish Aherne",
                "time": "November 16 at 10:56am Edited"
            },
            {
                "content": "Pathetic! 45 has nominated unqualified people to most cabinet members. Zatezalo, former coal executive, is worse than unqualified! He is guilty of mine safety and health violations.....the very health and safety regulations he is now charged to prevent! 45 says he loves coal and will take care of the miners. Two words 45 overuses, \"believe me,\" have generally indicated a lack of truth telling.",
                "from": "https://www.facebook.com/jean.morgansettle?fref=ufi&rc=p Jean Morgan Settle",
                "time": "November 17 at 6:52am"
            },
            {
                "content": "The Senate is a bunch of GOP losers. The rest of the world is going clean energy, we are going backwards thanks to Trump and the GOP.  How much did the GOP senators get from the mining and oil industries?  So corrupt!!!",
                "from": "https://www.facebook.com/madalyn.r.mcgovern?fref=ufi&rc=p Madalyn Rubin McGovern",
                "time": "November 16 at 4:44pm Edited"
            },
            {
                "content": "It is almost like Donald is trying to prove how messed up the Senate and House are.  I think in the end, he is going to say \"and these are your true Republicans.\"",
                "from": "https://www.facebook.com/jacqueline.brisbane?fref=ufi&rc=p Jacqueline Denise",
                "time": "November 16 at 2:11pm Edited"
            },
            {
                "content": "Yet another example why I don't fully believe Corker, McCain, Graham, Flake, etc. when they criticize the president.  They continue to be all talk and no action.",
                "from": "https://www.facebook.com/stephanie.calaman?fref=ufi&rc=p Stephanie Calaman",
                "time": "November 16 at 4:20pm Edited"
            },
            {
                "content": "OMG! Talk about a fox in the henhouse! How sad that even those who thought they were going to be helped by the serial liar are now losing so much of the protection that they desperately need and with no gains in return.",
                "from": "https://www.facebook.com/dhlocker?fref=ufi&rc=p Donald Locker",
                "time": "November 17 at 1:26pm"
            },
            {
                "content": "God save us from Trump and this worthless Senate.  Their only concern is business and money - never people.  This guy will probably make it more dangerous for coal miners, not safer.  Safety costs, and companies don't want to pay.  Hope you miners are ok with this....",
                "from": "https://www.facebook.com/jim.ash.5268?fref=ufi&rc=p Jim Ash",
                "time": "November 16 at 4:12pm"
            },
            {
                "content": "Trump announced, \"It is time to drain the swamp in Washington, D.C. This is why I'm proposing a package of ethics reforms to make our government honest once again.\"  Yep, your selections for you Cabinet members ... Flynn, Price, Perry, DeVos, Ross  ... ... See More",
                "from": "https://www.facebook.com/stephen.knoles?fref=ufi&rc=p Stephen Knoles",
                "time": "November 16 at 3:33pm"
            },
            {
                "content": "Trump and his administration and all the Republicans are definitely trying to kill all the poor elderly and lower-income Families. They no more care about us then they do a cockroach all they care about is getting richer. America needs to wake up we ne ... See More",
                "from": "https://www.facebook.com/susie.rouse.5?fref=ufi&rc=p Susie Rouse",
                "time": "November 17 at 12:32am"
            },
            {
                "content": "Unbelievable. So angry. Every protection for environment and common folk is being removed. Our only defense is the ballot box and an INFORMED electorate. If you are purposely ignorant you are a traitor in a democratic republic",
                "from": "https://www.facebook.com/marychristine.fitzhugh?fref=ufi&rc=p Mary Christine Fitzhugh",
                "time": "November 16 at 9:50pm"
            },
            {
                "content": "Yet another appointee totally unfit for the job. The depressing saga of the US administration rolls along. At some point the nightmare will end.",
                "from": "https://www.facebook.com/hugh.gayler.58?fref=ufi&rc=p Hugh Gayler",
                "time": "November 17 at 4:18pm"
            },
            {
                "content": "I was not aware that lead mines were unsafer than any other mines. Maybe this gentlemam will give demonstrations of unsafe acts for us.?",
                "from": "https://www.facebook.com/bill.r.dyck?fref=ufi&rc=p Bill R Dyck",
                "time": "November 16 at 7:32am Edited"
            },
            {
                "content": "Daym. If I was a miner, now's the time to go back to school and get a degree in green energy or work for a solar panel manufacturer.",
                "from": "https://www.facebook.com/Angelwings1966?fref=ufi&rc=p Angeliki de Morgan",
                "time": "November 16 at 6:12pm"
            },
            {
                "content": "Good thing tRump promised miners to make their jobs safer.  Think what would have happened if he didn't care what happened and only thought about campaign donors.",
                "from": "https://www.facebook.com/michael.moerland?fref=ufi&rc=p Michael Moerland",
                "time": "November 17 at 12:18am"
            },
            {
                "content": "America has the highest safety record when it comes to mining coal and we have the cleanest coal. Obama supporters want America to buy the dirtiest coal mined by slaves like we did the past 8 years. Say NO TO SLAVERY ‼️ 🇺🇸 🇺🇸 🇺🇸 ",
                "from": "https://www.facebook.com/paul.a.shelton.71?fref=ufi&rc=p Pablo Shelton",
                "time": "November 16 at 3:29pm"
            },
            {
                "content": "Well, since most of those mines are in trump voter states , I'm good with it. Black lung and mine disasters are what want , there ya go.",
                "from": "https://www.facebook.com/roger.olson1?fref=ufi&rc=p Roger Olson",
                "time": "November 16 at 11:17am"
            },
            {
                "content": "I wonder if the average republican knows or even cares how bad Trump is making the GOP look, by appointing the most incompetent people he can find?",
                "from": "https://www.facebook.com/willard.d.russell?fref=ufi&rc=p Willard D Russell",
                "time": "November 16 at 3:56pm"
            },
            {
                "content": "How bout Trump stops with all these ridiculous picks, and not be allowed to change any laws, or have anybody sworn in, until his investigation is completed, as well as his taxes released?? This is stuff that should have been done, before they let him step into office!!   🙄 ",
                "from": "https://www.facebook.com/lou.lopez.5099940?fref=ufi&rc=p Lou Lopez",
                "time": "November 16 at 7:24am"
            },
            {
                "content": "Donald knows how to pick anyone who is not a truthful, clean living human.  Every one of his picks have been a person with a shady background",
                "from": "https://www.facebook.com/carolyn.tramontana?fref=ufi&rc=p Carolyn Tramontana",
                "time": "November 16 at 1:52pm"
            }
        ],
        "description": "NBC News The Senate confirmed a former coal executive with a record of serious safety violations to become the nation’s top regulator of miner health and safety.",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARQzv-rAxylPt_OdgmnfmWw8ioMSFoRzpR8u091UYefsUDidxVmRC28dcpBeA4sngAQ",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2jw1Yvy&h=ATPYZMXePcPNUGaEj_oks5NoZL5I_lT2I3Vf9FZDdADdvqbHE9ptsQRCCgI9LAMiKpsr-ucIlSeAGg4RTMIZ5T35lf-WBMeksqYiE3rA9N5rLqIUeYLt0H0wyyMVqMi2Ejou74sqvUHoJm3KSQYZGhG9U3WtMt6kuAqjBDIXwyDfkjBMoqMb_gm7AJI4Jdig0ckovUsjez8GGiMftBiiSCTo0GCSUWkMz5QZ5uEyX4sqelFyehMitPA_E5wEGxreXFLhAmp42L7qnvBhV1oRYx5y_Thq3c0",
            "https://www.facebook.com/maurice.stpierre.9?fref=ufi&rc=p",
            "https://www.facebook.com/simon.teixeira.9022?fref=ufi&rc=p",
            "https://www.facebook.com/HeleneTreckemeMeyer?fref=ufi&rc=p",
            "https://www.facebook.com/janet.johnson.58958?fref=ufi&rc=p",
            "https://www.facebook.com/peg.nunley?fref=ufi&rc=p",
            "https://www.facebook.com/shona.salver?fref=ufi&rc=p",
            "https://www.facebook.com/darci.ricker?fref=ufi&rc=p",
            "https://www.facebook.com/lingoboi?fref=ufi&rc=p",
            "https://www.facebook.com/rosemary.rodriguezsifuentes?fref=ufi&rc=p",
            "https://www.facebook.com/silvio.ranieri?fref=ufi&rc=p",
            "https://www.facebook.com/karen.mirando.9?fref=ufi&rc=p",
            "https://www.facebook.com/david.shehorn?fref=ufi&rc=p",
            "https://www.facebook.com/martha.mcelligott.9?fref=ufi&rc=p",
            "https://www.facebook.com/msawalker1954?fref=ufi&rc=p",
            "https://www.facebook.com/judy.puniwai?fref=ufi&rc=p",
            "https://www.facebook.com/bonnie.blincoe?fref=ufi&rc=p",
            "https://www.facebook.com/beckie.thompson1?fref=ufi&rc=p",
            "https://www.facebook.com/susan.s.lehman.7?fref=ufi&rc=p",
            "https://www.facebook.com/sophia.morrislewis?fref=ufi&rc=p",
            "https://www.facebook.com/monin.navarro?fref=ufi&rc=p",
            "https://www.facebook.com/kathleen.gulbransen?fref=ufi&rc=p",
            "https://www.facebook.com/NCbulldoglover?fref=ufi&rc=p",
            "https://www.facebook.com/mary.middleton.9849?fref=ufi&rc=p",
            "https://www.facebook.com/janet.johnson.5895834?fref=ufi&rc=p",
            "https://www.facebook.com/rosanne.bopp?fref=ufi&rc=p",
            "https://www.facebook.com/lorraine.horn.56?fref=ufi&rc=p",
            "https://www.facebook.com/divadebbie?fref=ufi&rc=p",
            "https://www.facebook.com/rita.casey.1069?fref=ufi&rc=p",
            "https://www.facebook.com/fromleigh?fref=ufi&rc=p",
            "https://www.facebook.com/tatyana.meresh?fref=ufi&rc=p",
            "https://www.facebook.com/janice.mortensen.31?fref=ufi&rc=p",
            "https://www.facebook.com/aherne.trish?fref=ufi&rc=p",
            "https://www.facebook.com/jean.morgansettle?fref=ufi&rc=p",
            "https://www.facebook.com/madalyn.r.mcgovern?fref=ufi&rc=p",
            "https://www.facebook.com/jacqueline.brisbane?fref=ufi&rc=p",
            "https://www.facebook.com/stephanie.calaman?fref=ufi&rc=p",
            "https://www.facebook.com/dhlocker?fref=ufi&rc=p",
            "https://www.facebook.com/jim.ash.5268?fref=ufi&rc=p",
            "https://www.facebook.com/stephen.knoles?fref=ufi&rc=p",
            "https://www.facebook.com/susie.rouse.5?fref=ufi&rc=p",
            "https://www.facebook.com/marychristine.fitzhugh?fref=ufi&rc=p",
            "https://www.facebook.com/hugh.gayler.58?fref=ufi&rc=p",
            "https://www.facebook.com/bill.r.dyck?fref=ufi&rc=p",
            "https://www.facebook.com/Angelwings1966?fref=ufi&rc=p",
            "https://www.facebook.com/michael.moerland?fref=ufi&rc=p",
            "https://www.facebook.com/paul.a.shelton.71?fref=ufi&rc=p",
            "https://www.facebook.com/roger.olson1?fref=ufi&rc=p",
            "https://www.facebook.com/willard.d.russell?fref=ufi&rc=p",
            "https://www.facebook.com/lou.lopez.5099940?fref=ufi&rc=p",
            "https://www.facebook.com/carolyn.tramontana?fref=ufi&rc=p",
            "https://www.facebook.com/maurice.stpierre.9?fref=ufi&rc=p",
            "https://www.facebook.com/simon.teixeira.9022?fref=ufi&rc=p",
            "https://www.facebook.com/HeleneTreckemeMeyer?fref=ufi&rc=p",
            "https://www.facebook.com/janet.johnson.58958?fref=ufi&rc=p",
            "https://www.facebook.com/peg.nunley?fref=ufi&rc=p",
            "https://www.facebook.com/shona.salver?fref=ufi&rc=p",
            "https://www.facebook.com/darci.ricker?fref=ufi&rc=p",
            "https://www.facebook.com/lingoboi?fref=ufi&rc=p",
            "https://www.facebook.com/rosemary.rodriguezsifuentes?fref=ufi&rc=p",
            "https://www.facebook.com/silvio.ranieri?fref=ufi&rc=p",
            "https://www.facebook.com/karen.mirando.9?fref=ufi&rc=p",
            "https://www.facebook.com/david.shehorn?fref=ufi&rc=p",
            "https://www.facebook.com/martha.mcelligott.9?fref=ufi&rc=p",
            "https://www.facebook.com/msawalker1954?fref=ufi&rc=p",
            "https://www.facebook.com/judy.puniwai?fref=ufi&rc=p",
            "https://www.facebook.com/bonnie.blincoe?fref=ufi&rc=p",
            "https://www.facebook.com/beckie.thompson1?fref=ufi&rc=p",
            "https://www.facebook.com/susan.s.lehman.7?fref=ufi&rc=p",
            "https://www.facebook.com/sophia.morrislewis?fref=ufi&rc=p",
            "https://www.facebook.com/monin.navarro?fref=ufi&rc=p",
            "https://www.facebook.com/kathleen.gulbransen?fref=ufi&rc=p",
            "https://www.facebook.com/NCbulldoglover?fref=ufi&rc=p",
            "https://www.facebook.com/mary.middleton.9849?fref=ufi&rc=p",
            "https://www.facebook.com/janet.johnson.5895834?fref=ufi&rc=p",
            "https://www.facebook.com/rosanne.bopp?fref=ufi&rc=p",
            "https://www.facebook.com/lorraine.horn.56?fref=ufi&rc=p",
            "https://www.facebook.com/divadebbie?fref=ufi&rc=p",
            "https://www.facebook.com/rita.casey.1069?fref=ufi&rc=p",
            "https://www.facebook.com/fromleigh?fref=ufi&rc=p",
            "https://www.facebook.com/tatyana.meresh?fref=ufi&rc=p",
            "https://www.facebook.com/janice.mortensen.31?fref=ufi&rc=p",
            "https://www.facebook.com/aherne.trish?fref=ufi&rc=p",
            "https://www.facebook.com/jean.morgansettle?fref=ufi&rc=p",
            "https://www.facebook.com/madalyn.r.mcgovern?fref=ufi&rc=p",
            "https://www.facebook.com/jacqueline.brisbane?fref=ufi&rc=p",
            "https://www.facebook.com/stephanie.calaman?fref=ufi&rc=p",
            "https://www.facebook.com/dhlocker?fref=ufi&rc=p",
            "https://www.facebook.com/jim.ash.5268?fref=ufi&rc=p",
            "https://www.facebook.com/stephen.knoles?fref=ufi&rc=p",
            "https://www.facebook.com/susie.rouse.5?fref=ufi&rc=p",
            "https://www.facebook.com/marychristine.fitzhugh?fref=ufi&rc=p",
            "https://www.facebook.com/hugh.gayler.58?fref=ufi&rc=p",
            "https://www.facebook.com/bill.r.dyck?fref=ufi&rc=p",
            "https://www.facebook.com/Angelwings1966?fref=ufi&rc=p",
            "https://www.facebook.com/michael.moerland?fref=ufi&rc=p",
            "https://www.facebook.com/paul.a.shelton.71?fref=ufi&rc=p",
            "https://www.facebook.com/roger.olson1?fref=ufi&rc=p",
            "https://www.facebook.com/willard.d.russell?fref=ufi&rc=p",
            "https://www.facebook.com/lou.lopez.5099940?fref=ufi&rc=p",
            "https://www.facebook.com/carolyn.tramontana?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2147762458577106",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "A complete FOOL wrote this article....  # idiot",
                "from": "https://www.facebook.com/randy.etheridge?fref=ufi&rc=p Randy Etheridge",
                "time": "Just now"
            },
            {
                "content": "STOP this dirty campaign against guns. Almost all gun owners are responsible and model citizens. If you look at the pattern of these mass shootings, you'll realize that majority of mass shooters have an affiliation toward Democratic party. By the way, I'm all for tighter gun regulation so Democrats don't get their hands on guns.",
                "from": "https://www.facebook.com/becca.cara?fref=ufi&rc=p Becca Cara Martinez",
                "time": "Just now Edited"
            }
        ],
        "description": "NBC News \"Killing another human being, even a “bad” one, is not easy,\" writes U.S. army veteran Charles Clymer for NBC News THINK. \"This is not “Call of Duty”.\"",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARR3m1tD2AgXJn0a3nQVTuVz9JIZMiPG_rvME5p51lP1IS3RhWVTxdwEO792NU0ajE4",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2jFiRDT&h=ATM0ZVBavX8u0BNBElaZCCxwKTmDsnOVsWNwVYJMDRN-QWsg2qw9hzRloK3ORMiz7CIZoZONDwMrCkViQolF1kqrI0BWX0q_UArmGc9w2WDPQSQ1pfcPUq5y3Em4oXH-w82VQcZEGo6FHy1X-D9wQeKrRg4RCvshHv8OnTaICxQHVROgOH511uRhbpATVi-wa2QDpmOkDgo7LO5UVxCwBGuaJGLrIuRHZMfLnopoVNVf-2y4PBr7icpztXsfoqg7_gEitV4BlzFkKFtBpoEGstEC6titu5U",
            "https://www.facebook.com/randy.etheridge?fref=ufi&rc=p",
            "https://www.facebook.com/becca.cara?fref=ufi&rc=p",
            "https://www.facebook.com/randy.etheridge?fref=ufi&rc=p",
            "https://www.facebook.com/becca.cara?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2147762458577106",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "There will be people to pick the fruit believe me. Reminds me of when we began not allow smoking in public places... if you remember everyone was up in arms restaurants were going to go out of business.. bars were not going to have any customers. Surpr ... See More",
                "from": "https://www.facebook.com/jane.wolf.wiesenburger?fref=ufi&rc=p Jane M Wiesenburger",
                "time": "43 mins Edited"
            },
            {
                "content": "I simply don't care, my country is on its way to being sovereign again, and it's worth paying every price for.",
                "from": "https://www.facebook.com/thomas.mckiernan.7?fref=ufi&rc=p Thomas McKiernan",
                "time": "50 mins Edited"
            }
        ],
        "description": "NBC News “Looking two to three years into the future, where’s the confidence that there are people around to pick the fruit? We can’t live in a world without confidence that we will have labor to harvest.”",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARTJC1lvxj3ZxhqPBSXEF3Y8tzT0rkYV3OB4xMQNI1pCZkgyprUGLtuX2upsicsGLC8",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2B0sxx7&h=ATOx7p_3s7nLHOTAzfEAm9nSK1g5U4txLnbnZhoW1l6JzGdMh2OgmK53dQUJBTgZm_PK-FpgiceUHFXLnrDQ2vNPbw3E4ntoNFC_Jp5M9qbQXN5UWW6iqVG8HH6fz5OVAgI9D377vZKcghvcz_EF9-QgF7y5nqujGKwUjOHpiT50ytggzoTbLiNmnlzqSBAw9OwJwkFf0RAMd_LqHsvVOklW-8LS61iRmFoK2XTwdFXQHrjWxfVh27_3DW0NfEhqlt1xE26pme5fCtlXOOKPznyLDyS3TSg",
            "https://www.facebook.com/jane.wolf.wiesenburger?fref=ufi&rc=p",
            "https://www.facebook.com/thomas.mckiernan.7?fref=ufi&rc=p",
            "https://www.facebook.com/jane.wolf.wiesenburger?fref=ufi&rc=p",
            "https://www.facebook.com/thomas.mckiernan.7?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2147762458577106",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "no one cares foot ball is a  Dieing  game and will be dead ... disrespect America and you toss away your overpaid lifestyle",
                "from": "https://www.facebook.com/gary.wellington.98?fref=ufi&rc=p Gary Dean Wellington",
                "time": "10 mins"
            },
            {
                "content": "Any of them caught in another country stealing?",
                "from": "https://www.facebook.com/Marc.A.Breslin?fref=ufi&rc=p Marc Breslin",
                "time": "1 hr"
            }
        ],
        "description": "NBC News Some of them have even established themselves as future Heisman Trophy contenders, while others have flown under the radar.",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARQleSsO0MW7WMfjXwxZcZ-WPFFmOuA5JhiWOd5wLZUVLTu_EeZ5STgMIb48wwoq354",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2jFxXtn&h=ATP2GPiKYFiyJAJEdBS01jV-Yvnu1Tu6NqQ9qJrDow9buK7CzSZ9XmXBJjlWY4rRBIbHOfmu0p5FvFG8qPJCR_81a3jLOdRAt3phHy5bwyzli-qQJChnMLhM4xbG_uvOSLFa4rS8iyDchMbgIgTov4Gf-Aac70Uf5NW9nqOdhC5OPQfUwdRodcJGhZaEaXSPYCpJc3cBH-gmfyo-5yPGPeoO-NO5X_rI_TRa5zV15V__TAf101IP8MiFu51dmyLG2hvf0YV_XBLZ2mS7fiTmF9jBOZd8lhU",
            "https://www.facebook.com/gary.wellington.98?fref=ufi&rc=p",
            "https://www.facebook.com/Marc.A.Breslin?fref=ufi&rc=p",
            "https://www.facebook.com/gary.wellington.98?fref=ufi&rc=p",
            "https://www.facebook.com/Marc.A.Breslin?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2147762458577106",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "California is nuts not to do the same. It's just insane not to convict others of infecting others with hiv and the person knowingly they were infected",
                "from": "https://www.facebook.com/michael.gall1?fref=ufi&rc=p Michael Raymond Gall",
                "time": "3 hrs"
            },
            {
                "content": "Sharing is caring. Time tested and all parents agree, until its HIV. What have we learned? When in doubt rub one out.",
                "from": "https://www.facebook.com/jamie.deraimo?fref=ufi&rc=p Jamie Deraimo",
                "time": "3 hrs Edited"
            }
        ],
        "description": "NBC News The 27-year-old intentionally infected five men with HIV and attempted to infect five others, a U.K. court ruled.",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARTWmmJyLwhXpaCfuM_g_OvGZIxj5bn7oQzpqTtcH4dHCe548k70v5DSbtEbdwBnMgM",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2jCse7F&h=ATNk-ExX7MNPQXKek-DKetM_rrVdwdxRq8suzA0rQtTrN0sypnIMewhxcvnYjolqdXbQTWIoapCQEytj3N-foa5v-3PmKlRrXL1H59P66BYGd5R8fn0ztOEFTRlp2NQysNUy5jsp5oQgLg-TJ_DLkt1qiua7_Th1TlbBzXN5IUzmxaEWPSeWxDEB1fY60ZAwzMISviXgZnvABmpu9KVnbFFz7leFfyK5IwV1D4_Egag0CeFNQsO45yz3t-qRO-B1QQNABRfiI9s89g_53nWBqcXvoJow69I",
            "https://www.facebook.com/michael.gall1?fref=ufi&rc=p",
            "https://www.facebook.com/jamie.deraimo?fref=ufi&rc=p",
            "https://www.facebook.com/michael.gall1?fref=ufi&rc=p",
            "https://www.facebook.com/jamie.deraimo?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2147762458577106",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "My grandfather told me that he saw The Titanic, and from the beginning he warned all the people that the ship would sink, but they ignored him. However,he warned them again on several occasions, until they kicked him out the cinema.",
                "from": "https://www.facebook.com/romeo.r.cruise?fref=ufi&rc=p Romeo Randy Cruise",
                "time": "4 hrs"
            },
            {
                "content": "Our planet is... well, I love seeing pictures of earth... it's amazing!!  Our planet is amazing!!  I'm always in awe of it....",
                "from": "https://www.facebook.com/profile.php?id=100011533121094&fref=ufi&rc=p Lizbeth Esters",
                "time": "4 hrs"
            }
        ],
        "description": "NBC News The video shows how our planet has changed over the last two decades.   via  NBC News MACH",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARQXQd7v1jU4SMxbVhe8YK9EeveGiCE_0f17wjrOvnuyVkZ-xWh_DfOjMzDr5JTtbPY",
            "https://www.facebook.com/NBCNewsMACH/?fref=mentions",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2B2vkpx&h=ATOtym25XbiiAL0GaAlTlahWMpmP_5wd99pFzSKYyx3IfwxRKaz3BqTPrHsMFM6Q6S529zPiOqIzJfjsuK-rtbJjWd3-pEy1VwkLFjrtd43C5JRqqPIRR21ddV2amwEy5B3WBZ0mi2t3avmsESKHVUU-3h4CpasSvOAbwIwucuwLOaBjIa8ebBBLvDUcHfU08CTQ-_aGBau0c9OHOCSB8F4b9mWQZ-ZLsf3prpU1VyUqWDg0s2GFD5pojKzwoOrnKoWkmHvREFKoWI5zK8rhkQ0oR5mCdaA",
            "https://www.facebook.com/romeo.r.cruise?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011533121094&fref=ufi&rc=p",
            "https://www.facebook.com/romeo.r.cruise?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011533121094&fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2147762458577106",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "Most stressful job I've ever done. And it's not just the overarching stress like you feel at an office job, there are also situations constantly coming up that are stressful moment to moment. It is constant",
                "from": "https://www.facebook.com/christopher.flint.9?fref=ufi&rc=p Christopher Flint",
                "time": "5 hrs"
            },
            {
                "content": "No one who has ever spent any time in the food service/hospitality industry would ever say that is it is a \"carefree\" occupation. The little blurb of yours is pretty much insulting to every employee in the industry.",
                "from": "https://www.facebook.com/t.s.looney?fref=ufi&rc=p Skot Looney",
                "time": "4 hrs"
            }
        ],
        "description": "NBC News Bartending might seem like a fun, carefree job — how stressful could it be to make craft cocktails and pour wine and microbrews to thirsty guests? Very, according to U.S. News & World Reports.  via  NBC News BETTER",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARQOOgTUClVuDTEwm5dKA-T5q_2FyHJSR2zcx0y3jfnmlMjEFyf2ejFoueazlHnyx9E",
            "https://www.facebook.com/NBCNewsBetter/?fref=mentions",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2jFsmmz&h=ATPEEnEDvd6hgs1JcrXOv95W_Q0WmM5MNCbgWNBsSbkZ2wktEAI1gZhDmKQEQvvyGxIQQmm8dyk4qFycMLAjVRZvMyTltiS50XlYxCjpMOHK4_xvCw0FrptVke7Zikq5ZQh_CgkNd-CZt6kcpokqwjE7hRjK1po_iNlbIWiJxhS8F0jBfaYO7-Z8dySIYz07XQNDlQBqEj1HikXkbqXlW84OmXjGXxB3_Si17HqzmFm22r6bWRMUJT63Chmf8lu9hiAQD_gVWtdAOJlWyhawzlk4-sm7oqg",
            "https://www.facebook.com/christopher.flint.9?fref=ufi&rc=p",
            "https://www.facebook.com/t.s.looney?fref=ufi&rc=p",
            "https://www.facebook.com/christopher.flint.9?fref=ufi&rc=p",
            "https://www.facebook.com/t.s.looney?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2147762458577106",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "It’s way too much, I say it before and I’m saying it again insanity is taking over the USA. It’s scary",
                "from": "https://www.facebook.com/maria.resendes.790?fref=ufi&rc=p Maria Resendes",
                "time": "6 hrs"
            },
            {
                "content": "seriously...someone was seriously stressed to go out and look for a horse to do yoga with...try a park bench...they say",
                "from": "https://www.facebook.com/ROMANGONZALEZtx?fref=ufi&rc=p Roman Gonzalez",
                "time": "3 hrs"
            }
        ],
        "description": "NBC News Morning workout put a hitch in your giddy-up? You might want to try horse yoga.   Watch more on \"Stay Tuned\":  http://bit.ly/2h3aIVW",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARQOfuYnyNGV6ntOyT75NcV2LLM4yI4ILWNT5EaH0Bf6dq2vEFtQ1WwShg9pRwNFCzY",
            "https://www.facebook.com/maria.resendes.790?fref=ufi&rc=p",
            "https://www.facebook.com/ROMANGONZALEZtx?fref=ufi&rc=p",
            "https://www.facebook.com/maria.resendes.790?fref=ufi&rc=p",
            "https://www.facebook.com/ROMANGONZALEZtx?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2147762458577106",
        "photos": []
    },
    {
        "comments": [],
        "description": "Nancy Rose  shared  NBC News 's  post . Seriously you voted for a mentally ill man who has no one's interests at heart but his own! If Obama did it, he wants it undone, regardless of what damage it does!!! He's a fucking idiot!",
        "participants": [
            "https://www.facebook.com/mary.jane.522?fref=nf",
            "https://www.facebook.com/mary.jane.522?hc_ref=ARTpirXIuVegOd-wtsPme9YIG86DMRB7ZogxZFKL76yHJuC0cZepaH10kBYLP7hAqMI",
            "https://www.facebook.com/NBCNews/?hc_ref=ARTpirXIuVegOd-wtsPme9YIG86DMRB7ZogxZFKL76yHJuC0cZepaH10kBYLP7hAqMI",
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARQFmrtA78xUIWbDwz2pIxksZYIQ0wmzIjeEOjuF4Cwm9NwLGCQZxz7XZ6TO7N1wWc8",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2AT0IH5&h=ATPc77mg-BoP0dAyNiKbq9w0b9S3cq65MCTPfX-6hC8RyGtukFxt9bd3fUKgf3VjyMIL86AWINgCMMCubHjl97OZThflCuDD8ygIRDm2X2EDKFPvU3nj0LukKrNnBYOliliT-tUWY28fi8dj-svQ2VYwCWKQNQAfhWcu8KlFVR3Kud8O5fDFb6A8U-IU8VQZnEIUmQRjTd83QFb_bWYnYrIwz0QjlJY9_0030-2jeL2An5EwHfuulPZTQeQTyL9kZgwoNylNEsiCJdnWo8PldAU"
        ],
        "post": "https://www.facebook.com/mary.jane.522/posts/10210458213871285",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "It's like he is literally trying to be the most evil, hated man in United States history. He is disgusting, he has no respect, or love for the environment. All he cares about is money. I wouldn't be the least bit heart broken if he ceased to exist. I hate him.",
                "from": "https://www.facebook.com/carmariebee?fref=ufi&rc=p Carmen Bennett-Durkin",
                "time": "November 16 at 2:22pm"
            },
            {
                "content": "Hey any Republican: care to explain the value of this? (other than undoing anything with the letters Obama in it?)",
                "from": "https://www.facebook.com/randy.fox.16?fref=ufi&rc=p Randy Fox",
                "time": "November 16 at 2:24pm"
            },
            {
                "content": "I don't think I've ever in my 64 years hated and despised another human being as much as I hate Trump. He is heartless, soulless, cruel all for the sake of obliterating anything that has Obama's name on it.",
                "from": "https://www.facebook.com/annmarie.campagna.7?fref=ufi&rc=p Annmarie Campagna",
                "time": "November 16 at 2:36pm Edited"
            },
            {
                "content": "i have never been a hater, but trump has made me one...he is destroying our country and dividing the people , all in the name of power and wealth, fo he can rule the world....step down and do everyone a favor....so not my president",
                "from": "https://www.facebook.com/maude.fuoco.7?fref=ufi&rc=p Maude Fuoco",
                "time": "November 16 at 2:22pm"
            },
            {
                "content": "Aka the Eric and Donald Trump Jr. Amusements Act.",
                "from": "https://www.facebook.com/firstgentrekkie?fref=ufi&rc=p Sharon Foster",
                "time": "November 16 at 2:22pm"
            },
            {
                "content": "This basically will KILL the last beloved elephants on the planet. He is giving poachers and hunters the greenlight to kill these gentle intelligent animals that God has given us. I am stunned and horrified. TAKE A STAND EVERYONE!!!!!!",
                "from": "https://www.facebook.com/amelia.keene?fref=ufi&rc=p Amelia Prentice Keene",
                "time": "November 16 at 2:25pm Edited"
            },
            {
                "content": "I don’t understand how he won. When everyone denies voting for him. There has to be a special place in hell for him & all his followers.",
                "from": "https://www.facebook.com/sara.takesgun?fref=ufi&rc=p Sara Rose Kindness",
                "time": "November 16 at 2:26pm"
            },
            {
                "content": "Again, it’s just things with Obama’s name attributed to it. What sense does this make? Please? Any Trumpster that is struggling to find work or pay bills, how does trophy heads of defenseless animals help you in your daily life?",
                "from": "https://www.facebook.com/DAMNlookatHIM?fref=ufi&rc=p Brandon Shackelford",
                "time": "November 16 at 2:25pm"
            },
            {
                "content": "I despise this family and the administration for destroying everything good this country stood for. Shame on the voters most of all!",
                "from": "https://www.facebook.com/jani.brooks?fref=ufi&rc=p Jani Brooks",
                "time": "November 16 at 2:24pm"
            },
            {
                "content": "Susan Butler   😡 😡 😡 😭 😭 😭  Disgusting!  Dictator Trump can’t pass his own legislation so instead he will spend his presidency undoing everything Obama did.  Nothing more than a Jealous, petulant child.",
                "from": "https://www.facebook.com/kimberly.baker3?fref=ufi&rc=p Kimberly Baker",
                "time": "November 16 at 3:00pm"
            },
            {
                "content": "Okay, let me get this straight.  Can't pass a healthcare bill, a tax bill, fill his appointments after 11 months in office, institute meaningful immigration reform, build a wall, or make good on the multitude of other promises made during the election, but he can take time out of his \"busy\" schedule to appease trophy hunters?  Good to know where his priorities lie.",
                "from": "https://www.facebook.com/paula.w.waters?fref=ufi&rc=p Paula Welch Waters",
                "time": "November 16 at 3:01pm"
            },
            {
                "content": "Can we reflect for a moment on the irony of a GOP Administration sanctioning the slaughter of elephants?",
                "from": "https://www.facebook.com/mi.black.5?fref=ufi&rc=p Matt Vacek",
                "time": "November 16 at 2:32pm"
            },
            {
                "content": "Would this be happening if Tr ump's sons weren't hunters?  Don't get me wrong, I'm not anti-hunting just anti-hunting endangered animals.",
                "from": "https://www.facebook.com/colleen.taylor.186?fref=ufi&rc=p Colleen Quinn Taylor",
                "time": "November 16 at 2:25pm"
            },
            {
                "content": "This is one of the worst things his has done yet...I guess little Donny Jr and Eric need their Elephant trophy to complete their collection of animal heads. What I ask you, What about this is going to Make America Great Again?",
                "from": "https://www.facebook.com/susan.e.miller?fref=ufi&rc=p Susan Elizabeth Miller",
                "time": "November 16 at 2:29pm"
            },
            {
                "content": "Who does this help in our country? His sons and maybe some freaky friends but certainly not the average American. These poor creatures killed for entertainment. I can’t believe this crap.",
                "from": "https://www.facebook.com/toni.haas1?fref=ufi&rc=p Toni Mitchell Haas",
                "time": "November 16 at 2:30pm"
            },
            {
                "content": "That’s because Donny Jr and Eric are big game hunters and want to bring those trophy’s home with them.  Nothing is sacred to Trump. He doesn’t believe in climate change. He doesn’t believe these magnificent animals are going to be gone off this earth.  ... See More",
                "from": "https://www.facebook.com/barb.mclaneschutte?fref=ufi&rc=p Barb McLane Schutte",
                "time": "November 16 at 2:29pm"
            },
            {
                "content": "since the two male spawn of the current occupant of the white house are 'big game hunters'... is anyone else surprised?  really?  This is all about them.  And as a friend pointed out, this ban was implemented by Obama and that pathetic toddler who took his seat is so petty, that anything from that era must be purged.",
                "from": "https://www.facebook.com/karen.santiano?fref=ufi&rc=p Karen Santiano",
                "time": "November 16 at 2:30pm"
            },
            {
                "content": "He obviously couldn't care less about the elephants...especially since President Obama signed legislation to protect them. This presidency is about 2 things to this maggot: 1. Undo everything Obama did because of his total envy and hatred of the man. 2. Do whatever he can to make sure the 1%ers keep their wealth. I guarantee most of his minions support him because of #1.",
                "from": "https://www.facebook.com/yvonne.chatmon.7?fref=ufi&rc=p Yvonne Chatmon",
                "time": "November 16 at 2:38pm Edited"
            },
            {
                "content": "little trump can’t pass any legislation so he continues to reverse any and everything Obama. The same man that complained about executive orders. He’s one sick puppy",
                "from": "https://www.facebook.com/randee.scruggs?fref=ufi&rc=p Randee Scruggs",
                "time": "November 16 at 2:40pm"
            },
            {
                "content": "It's going to take the next Democratic administration YEARS to undo the bs and hellish policy of this Republican clown show!!!  :-( ",
                "from": "https://www.facebook.com/susan.r.hawkins?fref=ufi&rc=p Susan Ramsey Hawkins",
                "time": "November 16 at 2:52pm"
            },
            {
                "content": "Junior must want a trophy. We know how important it is to keep our children happy. After all he did coordinate the meeting with the Russians/Wikileaks.",
                "from": "https://www.facebook.com/gail.johnston.14?fref=ufi&rc=p Gail Johnston",
                "time": "November 16 at 2:26pm Edited"
            },
            {
                "content": "Another headline meant to stir the sheep. If you read the story you realize that Zimbabwe fish and game decided to let selective hunting for the health of the species and also generate income to put back into conservation efforts. You liberals are so easily manipulated by the press.",
                "from": "https://www.facebook.com/randy.reiff.7?fref=ufi&rc=p Randy Reiff",
                "time": "November 16 at 2:49pm"
            },
            {
                "content": "President Bonespur can't make anything of his own accord happen he has to feel some sort of accomplishment by undoing what his predecessor did. I guess it's easier for him.  # slapsforehead  He is such a spiteful person, it is NOT normal.  I am soo ashamed right now  😟 😢 ",
                "from": "https://www.facebook.com/coreyAperez?fref=ufi&rc=p Corey OdyseaRaven Perez",
                "time": "November 16 at 2:28pm"
            },
            {
                "content": "Maybe Donny Jr. will mount an elephant head in the White House. A fitting epitaph for the demise of the Republican Party.",
                "from": "https://www.facebook.com/curtiss.roberts.56?fref=ufi&rc=p Curtiss Roberts",
                "time": "November 16 at 2:48pm"
            },
            {
                "content": "Appalling = abhorrent, abominable, offensive, awful, disgusting, distasteful, dreadful, evil, foul, fulsome, gross, hideous, horrendous, horrible, horrid, loathsome, nasty, nauseating, nauseous, noisome, noxious, obnoxious, obscene, odious, rancid, repellent (also repellant), repugnant, repulsive, revolting, scandalous, shocking, sickening, ugly. To say the least.",
                "from": "https://www.facebook.com/tianinebreese?fref=ufi&rc=p Nancy Breese",
                "time": "November 16 at 3:19pm"
            },
            {
                "content": "A step to far, sir. A step to far. You should be ashamed of yourself but I see that you are incapable of such emotions therefore we MUST teach you this valuable lesson. Winter is coming.",
                "from": "https://www.facebook.com/jpntx?fref=ufi&rc=p John Porter",
                "time": "November 16 at 2:39pm"
            },
            {
                "content": "To those arguing that the herds need thinning out. This is true, and the hunting benefits the local communities, but this isn’t about that is it? This is facilitating the boasting that you’ve killed a wild animal! Showing off a trophy to prove you can  ... See More",
                "from": "https://www.facebook.com/jackie.bailey.509?fref=ufi&rc=p Jackie Bailey",
                "time": "November 16 at 3:47pm Edited"
            },
            {
                "content": "If President Obama implemented it 45 will reverse it!   The things racism, envy, jealousy and hate will make you do",
                "from": "https://www.facebook.com/vickie.knoxcarroll?fref=ufi&rc=p Vickie Knox-carroll",
                "time": "November 16 at 3:45pm"
            },
            {
                "content": "He is not only pillaging his own country but is also going all the way to inflict damage on others as well. This disgusting excuse for a human continues to induce revulsion with no end in sight.",
                "from": "https://www.facebook.com/cyril.abraham.18?fref=ufi&rc=p Cyril Abraham",
                "time": "November 16 at 5:05pm Edited"
            },
            {
                "content": "Stunningly horrifying news. Killing these animals is done solely for sport, nobody eats elephants. This is another form of entertainment for wealthy people.",
                "from": "https://www.facebook.com/linda.wood.7146?fref=ufi&rc=p Linda Wood",
                "time": "November 16 at 2:55pm"
            },
            {
                "content": "Shame on him! This is disgusting...im all for hunting and using all of what you kill. But not elephants, lions etc. Or bringing back here...ughh",
                "from": "https://www.facebook.com/shelby.beaverhausen?fref=ufi&rc=p Shelby Staudenmaier Beaverhausen",
                "time": "November 16 at 2:35pm"
            },
            {
                "content": "And this purpose would be for what????  Never-mind,  PRESIDENT OBAMA'S name was on it.  I've never seen a grown man act so childish in all my life.",
                "from": "https://www.facebook.com/vicki.boggsstonewall?fref=ufi&rc=p Vicki Boggs Stonewall",
                "time": "November 16 at 3:32pm"
            },
            {
                "content": "No matter what he does, you cannot erase or overturn that Obama was president. Perhaps concentrating on current problems would be more productive.",
                "from": "https://www.facebook.com/patricia.schroyer.5?fref=ufi&rc=p Patricia Schroyer",
                "time": "November 16 at 2:49pm"
            },
            {
                "content": "That administration is full of hate. They’re purposely undoing every rule/policy that President Barack Obama put into place because they despise the very existence of that man. It’s shameful.",
                "from": "https://www.facebook.com/candyce.m.williams?fref=ufi&rc=p Candyce Williams",
                "time": "November 16 at 3:41pm"
            },
            {
                "content": "This joke of a man is the most putrid thing we have ever had in the Whitehouse !  Someone must have lined his pockets to have this overturned.... I'll be happy when he is finally impeached!!",
                "from": "https://www.facebook.com/lilmissinnocent1?fref=ufi&rc=p Rachel Menard",
                "time": "November 16 at 2:57pm"
            },
            {
                "content": "Judging from these comments, the majority of you failed to read the article and only read the headline. Just goes to show your gullibility. Certain animals must be killed for conservation efforts in order to preserve a species. Similar to hunting elk or deer or wolves. All you gotta do is read the article instead of jumping to conclusions just because you hate someone. Clearly shows just how intolerant the left is.",
                "from": "https://www.facebook.com/profile.php?id=1304206943&fref=ufi&rc=p Dana Van Becelaere-Cadotte",
                "time": "November 16 at 2:45pm"
            },
            {
                "content": "Rump is looking for anything with an Obama signature so he can overturn it. Good, bad or neutral Rumps ego says he must obliterate it just like the Taliban did with the Buddhist statues in Afghanistan.",
                "from": "https://www.facebook.com/profile.php?id=1711350612&fref=ufi&rc=p Chris Morris",
                "time": "November 16 at 6:15pm"
            },
            {
                "content": "Of course, trumpy reinforces killing. Also he is so jealous of Mr Obama that he is trying to overturn anything that has an Obama name even close to it. Poor baby dumpling so insecure. Hahahahaha",
                "from": "https://www.facebook.com/nancy.pierce.75?fref=ufi&rc=p Nancy Pierce",
                "time": "November 16 at 3:10pm"
            },
            {
                "content": "trump does the things he wants he doesn't care about America or the people.  The only thing that matters to him is money and power",
                "from": "https://www.facebook.com/david.rickman.505?fref=ufi&rc=p David Rickman",
                "time": "November 16 at 3:17pm"
            },
            {
                "content": "Eric and Donny Jr. like to kill things in Zimbabwe.  Now, they're daddy made it alright for them to bring home the  biggest of trophies.  Does anyone really care if this wipes out the elephant population?  Is it really that important?  I don't want to see the elephants exterminated, but if it's sooooo important for Beavis and Butthead to have the trophy, more power to them, I guess.",
                "from": "https://www.facebook.com/ryan.cantrell1?fref=ufi&rc=p Ryan Cantrell",
                "time": "November 16 at 2:52pm"
            },
            {
                "content": "He's like that little spoiled brat that needs attention. Doesn't matter if it's good attention ir bad. As long as he gets it.  Give one good reason for doing this? He doesn't care at all about the future of this earth or anything, only right now while he's still here.",
                "from": "https://www.facebook.com/suzie.varnesholcomb?fref=ufi&rc=p Suzie Varnes Holcomb",
                "time": "November 16 at 2:34pm"
            },
            {
                "content": "Elephants are dying at alarming rates due to ivory poaching. We need to set the example. In addition It’s past time we stopped the tradition of shooting defenseless animals.  If you want to call hunting a sport give the “hunter” a knife and see what happens.",
                "from": "https://www.facebook.com/sean.p.milligan.7?fref=ufi&rc=p Sean Patrick Milligan",
                "time": "November 16 at 2:56pm"
            },
            {
                "content": "Cry cry cry, you liberals are the whiners of the world  You don't have a problem with women killing babies, go figure elephants life worth more than an unborn child, that's why you voted for Hillary Clinton the baby killer  !!",
                "from": "https://www.facebook.com/bill.day.315080?fref=ufi&rc=p Bill Day",
                "time": "November 17 at 1:58pm Edited"
            },
            {
                "content": "Trump reverses ban on importing elephant trophies from Africa. The latest in his \"What is the most horrible thing we can think of to do today?\" actions.",
                "from": "https://www.facebook.com/peter.craven.9?fref=ufi&rc=p Peter Craven",
                "time": "November 16 at 2:36pm"
            },
            {
                "content": "The POTUS and his administration are fixated on President Obama's actions...both good and bad.  This reversal is at best simple-minded stupidity!",
                "from": "https://www.facebook.com/marcosj.madrid?fref=ufi&rc=p Marcos J Madrid",
                "time": "November 16 at 4:23pm"
            },
            {
                "content": "This is just unreal.  Trump is so jealous of Obama that he is undoing all the sensible things Obama did.  Trump is truly a very sick person!",
                "from": "https://www.facebook.com/marilyn.cahill.5?fref=ufi&rc=p Marilyn Cahill",
                "time": "November 16 at 4:14pm"
            },
            {
                "content": "Trump just checked this repeal off of his President Obama list.  This is Trump, still being vindictive and cruel at the expense of endangered animals.",
                "from": "https://www.facebook.com/profile.php?id=100010444242499&fref=ufi&rc=p Barbara Mortimore",
                "time": "November 16 at 7:47pm"
            },
            {
                "content": "How does this and so many other Executive Actions taken by POTUS make America great again? How does this improve the quality of life the millions of Americans who voted for Donald Trump were seeking? It doesn’t ... it is simply an off-shoot of his petty desire to reverse every single action of the Obama administration.",
                "from": "https://www.facebook.com/mindy.berman?fref=ufi&rc=p Mindy Sall Berman",
                "time": "November 16 at 5:16pm"
            },
            {
                "content": "Now why would they fo that?  Any good reason, except Obama's  name was attached to stopping it.  Trump has done nothing for the good of our image, and the goodness this country stood for.  SIckening!",
                "from": "https://www.facebook.com/brenda.thompson.71868?fref=ufi&rc=p Brenda Thompson",
                "time": "November 16 at 3:32pm"
            },
            {
                "content": "For what reason?  Because President Barack Obama's name was associated with the ban.  The current president is so insecure he can't abide anything positive tied to the former president.",
                "from": "https://www.facebook.com/janice.mortensen.31?fref=ufi&rc=p Janice Mortensen",
                "time": "November 16 at 4:13pm"
            }
        ],
        "description": "NBC News The move overturns a 2014 rule implemented by former President Obama that banned hunters from bringing the trophy heads of elephants they’d killed back to the U.S. Susan Butler",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARQFqpCRYUXhuqrrtTUwR64XnfP478prfCVPh_ZTJUhHGXd6D_0AIMSTDgvtDEwH4Cc",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2AT0IH5&h=ATNIaN1DjgdH2dNv2UNN0zPj6OMYXHyKtjxHW3T-qucCoOfhlWrYusJsj_BPyWFfPgzoSWmBvuv1pqvU040kpQxPZ2OpNwQ_gw2Q1wX0nJtvx6fzGuEvwyUJr4fyTv_x81a84zI5087YYXbwjbWQDWeOXibcjW-5vUm7crXVXN205vm7sdyBcgYCuMk1QlIwuvMf9HFPWLjJCfqS_6VkBiPKO4pvneW4ShvRIxUXIedqXGtTYHZiVlKekmXZBuwQ-4cF3NEE4irBJz-zsF3RW-Nw0XX-lpE",
            "https://www.facebook.com/carmariebee?fref=ufi&rc=p",
            "https://www.facebook.com/randy.fox.16?fref=ufi&rc=p",
            "https://www.facebook.com/randy.fox.16?fref=ufi&rc=p",
            "https://www.facebook.com/annmarie.campagna.7?fref=ufi&rc=p",
            "https://www.facebook.com/maude.fuoco.7?fref=ufi&rc=p",
            "https://www.facebook.com/firstgentrekkie?fref=ufi&rc=p",
            "https://www.facebook.com/amelia.keene?fref=ufi&rc=p",
            "https://www.facebook.com/sara.takesgun?fref=ufi&rc=p",
            "https://www.facebook.com/DAMNlookatHIM?fref=ufi&rc=p",
            "https://www.facebook.com/lifeguardsteve?fref=ufi&rc=p",
            "https://www.facebook.com/jani.brooks?fref=ufi&rc=p",
            "https://www.facebook.com/kimberly.baker3?fref=ufi&rc=p",
            "https://www.facebook.com/susan.butler.9828?hc_location=ufi",
            "https://www.facebook.com/paula.w.waters?fref=ufi&rc=p",
            "https://www.facebook.com/mi.black.5?fref=ufi&rc=p",
            "https://www.facebook.com/colleen.taylor.186?fref=ufi&rc=p",
            "https://www.facebook.com/susan.e.miller?fref=ufi&rc=p",
            "https://www.facebook.com/toni.haas1?fref=ufi&rc=p",
            "https://www.facebook.com/barb.mclaneschutte?fref=ufi&rc=p",
            "https://www.facebook.com/karen.santiano?fref=ufi&rc=p",
            "https://www.facebook.com/yvonne.chatmon.7?fref=ufi&rc=p",
            "https://www.facebook.com/randee.scruggs?fref=ufi&rc=p",
            "https://www.facebook.com/susan.r.hawkins?fref=ufi&rc=p",
            "https://www.facebook.com/gail.johnston.14?fref=ufi&rc=p",
            "https://www.facebook.com/randy.reiff.7?fref=ufi&rc=p",
            "https://www.facebook.com/coreyAperez?fref=ufi&rc=p",
            "https://www.facebook.com/curtiss.roberts.56?fref=ufi&rc=p",
            "https://www.facebook.com/tianinebreese?fref=ufi&rc=p",
            "https://www.facebook.com/jpntx?fref=ufi&rc=p",
            "https://www.facebook.com/jackie.bailey.509?fref=ufi&rc=p",
            "https://www.facebook.com/vickie.knoxcarroll?fref=ufi&rc=p",
            "https://www.facebook.com/cyril.abraham.18?fref=ufi&rc=p",
            "https://www.facebook.com/linda.wood.7146?fref=ufi&rc=p",
            "https://www.facebook.com/shelby.beaverhausen?fref=ufi&rc=p",
            "https://www.facebook.com/vicki.boggsstonewall?fref=ufi&rc=p",
            "https://www.facebook.com/patricia.schroyer.5?fref=ufi&rc=p",
            "https://www.facebook.com/candyce.m.williams?fref=ufi&rc=p",
            "https://www.facebook.com/lilmissinnocent1?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1304206943&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1711350612&fref=ufi&rc=p",
            "https://www.facebook.com/nancy.pierce.75?fref=ufi&rc=p",
            "https://www.facebook.com/david.rickman.505?fref=ufi&rc=p",
            "https://www.facebook.com/ryan.cantrell1?fref=ufi&rc=p",
            "https://www.facebook.com/suzie.varnesholcomb?fref=ufi&rc=p",
            "https://www.facebook.com/sean.p.milligan.7?fref=ufi&rc=p",
            "https://www.facebook.com/bill.day.315080?fref=ufi&rc=p",
            "https://www.facebook.com/peter.craven.9?fref=ufi&rc=p",
            "https://www.facebook.com/marcosj.madrid?fref=ufi&rc=p",
            "https://www.facebook.com/marilyn.cahill.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010444242499&fref=ufi&rc=p",
            "https://www.facebook.com/mindy.berman?fref=ufi&rc=p",
            "https://www.facebook.com/brenda.thompson.71868?fref=ufi&rc=p",
            "https://www.facebook.com/janice.mortensen.31?fref=ufi&rc=p",
            "https://www.facebook.com/carmariebee?fref=ufi&rc=p",
            "https://www.facebook.com/randy.fox.16?fref=ufi&rc=p",
            "https://www.facebook.com/randy.fox.16?fref=ufi&rc=p",
            "https://www.facebook.com/annmarie.campagna.7?fref=ufi&rc=p",
            "https://www.facebook.com/maude.fuoco.7?fref=ufi&rc=p",
            "https://www.facebook.com/firstgentrekkie?fref=ufi&rc=p",
            "https://www.facebook.com/amelia.keene?fref=ufi&rc=p",
            "https://www.facebook.com/sara.takesgun?fref=ufi&rc=p",
            "https://www.facebook.com/DAMNlookatHIM?fref=ufi&rc=p",
            "https://www.facebook.com/lifeguardsteve?fref=ufi&rc=p",
            "https://www.facebook.com/jani.brooks?fref=ufi&rc=p",
            "https://www.facebook.com/kimberly.baker3?fref=ufi&rc=p",
            "https://www.facebook.com/paula.w.waters?fref=ufi&rc=p",
            "https://www.facebook.com/mi.black.5?fref=ufi&rc=p",
            "https://www.facebook.com/colleen.taylor.186?fref=ufi&rc=p",
            "https://www.facebook.com/susan.e.miller?fref=ufi&rc=p",
            "https://www.facebook.com/toni.haas1?fref=ufi&rc=p",
            "https://www.facebook.com/barb.mclaneschutte?fref=ufi&rc=p",
            "https://www.facebook.com/karen.santiano?fref=ufi&rc=p",
            "https://www.facebook.com/yvonne.chatmon.7?fref=ufi&rc=p",
            "https://www.facebook.com/randee.scruggs?fref=ufi&rc=p",
            "https://www.facebook.com/susan.r.hawkins?fref=ufi&rc=p",
            "https://www.facebook.com/gail.johnston.14?fref=ufi&rc=p",
            "https://www.facebook.com/randy.reiff.7?fref=ufi&rc=p",
            "https://www.facebook.com/coreyAperez?fref=ufi&rc=p",
            "https://www.facebook.com/curtiss.roberts.56?fref=ufi&rc=p",
            "https://www.facebook.com/tianinebreese?fref=ufi&rc=p",
            "https://www.facebook.com/jpntx?fref=ufi&rc=p",
            "https://www.facebook.com/jackie.bailey.509?fref=ufi&rc=p",
            "https://www.facebook.com/vickie.knoxcarroll?fref=ufi&rc=p",
            "https://www.facebook.com/cyril.abraham.18?fref=ufi&rc=p",
            "https://www.facebook.com/linda.wood.7146?fref=ufi&rc=p",
            "https://www.facebook.com/shelby.beaverhausen?fref=ufi&rc=p",
            "https://www.facebook.com/vicki.boggsstonewall?fref=ufi&rc=p",
            "https://www.facebook.com/patricia.schroyer.5?fref=ufi&rc=p",
            "https://www.facebook.com/candyce.m.williams?fref=ufi&rc=p",
            "https://www.facebook.com/lilmissinnocent1?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1304206943&fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1711350612&fref=ufi&rc=p",
            "https://www.facebook.com/nancy.pierce.75?fref=ufi&rc=p",
            "https://www.facebook.com/david.rickman.505?fref=ufi&rc=p",
            "https://www.facebook.com/ryan.cantrell1?fref=ufi&rc=p",
            "https://www.facebook.com/suzie.varnesholcomb?fref=ufi&rc=p",
            "https://www.facebook.com/sean.p.milligan.7?fref=ufi&rc=p",
            "https://www.facebook.com/bill.day.315080?fref=ufi&rc=p",
            "https://www.facebook.com/peter.craven.9?fref=ufi&rc=p",
            "https://www.facebook.com/marcosj.madrid?fref=ufi&rc=p",
            "https://www.facebook.com/marilyn.cahill.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100010444242499&fref=ufi&rc=p",
            "https://www.facebook.com/mindy.berman?fref=ufi&rc=p",
            "https://www.facebook.com/brenda.thompson.71868?fref=ufi&rc=p",
            "https://www.facebook.com/janice.mortensen.31?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2148252808528071",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "A complete FOOL wrote this article....  # idiot",
                "from": "https://www.facebook.com/randy.etheridge?fref=ufi&rc=p Randy Etheridge",
                "time": "Just now"
            },
            {
                "content": "STOP this dirty campaign against guns. Almost all gun owners are responsible and model citizens. If you look at the pattern of these mass shootings, you'll realize that majority of mass shooters have an affiliation toward Democratic party. By the way, I'm all for tighter gun regulation so Democrats don't get their hands on guns.",
                "from": "https://www.facebook.com/becca.cara?fref=ufi&rc=p Becca Cara Martinez",
                "time": "Just now Edited"
            }
        ],
        "description": "NBC News \"Killing another human being, even a “bad” one, is not easy,\" writes U.S. army veteran Charles Clymer for NBC News THINK. \"This is not “Call of Duty”.\"",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARRL4tLeOZQpw7GeYp6yGTAGUZbsqdXLTWCcMuOVhF7Gm2NvJzZySvSKi0mAcrDh9rY",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2jFiRDT&h=ATN8fHBF-TinrjoQIZIhQl8hPpYCrYt8t4i9AmxufIT03KdZ2uTZHx8Zg5UU11fDSq4A_Mdgkvafm4GEfW_JvDzdKJBx6tEjF9yCb6WoPi1kL25Hip-M_lowB1RiLzmja03K1G6iwvKc-0gE8Miq0bNO0B2LfmimZPJZQb2OobCY1tRUOFrrUXyjZKuYBJpN757fAmZuDABpma2Yo1zf991lO_Rr6o_3bs-nReiKhR7Zrot1HOblnu1x-9l2WkRbtwAb_JX07qXXkTWMkuQPFNVDYE7BcCQ",
            "https://www.facebook.com/randy.etheridge?fref=ufi&rc=p",
            "https://www.facebook.com/becca.cara?fref=ufi&rc=p",
            "https://www.facebook.com/randy.etheridge?fref=ufi&rc=p",
            "https://www.facebook.com/becca.cara?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2148252808528071",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "There will be people to pick the fruit believe me. Reminds me of when we began not allow smoking in public places... if you remember everyone was up in arms restaurants were going to go out of business.. bars were not going to have any customers. Surpr ... See More",
                "from": "https://www.facebook.com/jane.wolf.wiesenburger?fref=ufi&rc=p Jane M Wiesenburger",
                "time": "43 mins Edited"
            },
            {
                "content": "I simply don't care, my country is on its way to being sovereign again, and it's worth paying every price for.",
                "from": "https://www.facebook.com/thomas.mckiernan.7?fref=ufi&rc=p Thomas McKiernan",
                "time": "50 mins Edited"
            }
        ],
        "description": "NBC News “Looking two to three years into the future, where’s the confidence that there are people around to pick the fruit? We can’t live in a world without confidence that we will have labor to harvest.”",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARRAIEXGGSQZeoRU0YSLliyJUh_wfFpKwnTFHhWmeNwOPipYS8uCv6Xw4xhM0ymc3Hw",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2B0sxx7&h=ATO_CPCadHroc_swd32JSK1kv5jcItw5YbndNv4bKNUT2tcYDz3ALHegGl4EQ6XXmks9xKe5JX8h0k0_f1iSGkTIlmd3Sbvdd1KDeaRSc4pyLI3URdM0nj2QGN4Lncg3XvGhC3E6ghltQfmdSl-8tT4gbRNyjuZ1wRcu0rM_ZewSHvgpkEpAWSUGRBBNbHkLbQsEmysHPx0aDXny83mVpgENYiSWkaQ9C0hjkVzbVhnkB6peqi89bwnAutin6VYZKRqNh351uFnhiBhBlQGFUaH7X58p4Iw",
            "https://www.facebook.com/jane.wolf.wiesenburger?fref=ufi&rc=p",
            "https://www.facebook.com/thomas.mckiernan.7?fref=ufi&rc=p",
            "https://www.facebook.com/jane.wolf.wiesenburger?fref=ufi&rc=p",
            "https://www.facebook.com/thomas.mckiernan.7?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2148252808528071",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "no one cares foot ball is a  Dieing  game and will be dead ... disrespect America and you toss away your overpaid lifestyle",
                "from": "https://www.facebook.com/gary.wellington.98?fref=ufi&rc=p Gary Dean Wellington",
                "time": "10 mins"
            },
            {
                "content": "Any of them caught in another country stealing?",
                "from": "https://www.facebook.com/Marc.A.Breslin?fref=ufi&rc=p Marc Breslin",
                "time": "1 hr"
            }
        ],
        "description": "NBC News Some of them have even established themselves as future Heisman Trophy contenders, while others have flown under the radar.",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARTmOqqa8uekG5LKFdUWv6jKTx_uBoV0cypJD6wwSjs8Nlu4T45IltFo1xi0lZJaBqY",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2jFxXtn&h=ATPqDTYzqX-M_a6OYAIGV54IA0zp65oL1eej8JwEsxtV_CL3HVkfbG-xaP-V26QOydsq3CKBX0_lDHQ3zvCQH5CCuObNpOJfd8KpgBE7euprvFIIHn-ijH-qothg9MSZjtwxjUhGUAl5508932xSLdVOnXfduFStMVjsVGqnlwKthLV4mQDBevUV5_JJ7Ol6ymGSKmdPu5u8UpFVc-tZbzlaB-Br-U8MAT2SQ0vfO--uQCpYeXPG5iMq9PCmV2PDjtCyV1J-0oaINaZzynEFxhkW4Eyg64c",
            "https://www.facebook.com/gary.wellington.98?fref=ufi&rc=p",
            "https://www.facebook.com/Marc.A.Breslin?fref=ufi&rc=p",
            "https://www.facebook.com/gary.wellington.98?fref=ufi&rc=p",
            "https://www.facebook.com/Marc.A.Breslin?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2148252808528071",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "California is nuts not to do the same. It's just insane not to convict others of infecting others with hiv and the person knowingly they were infected",
                "from": "https://www.facebook.com/michael.gall1?fref=ufi&rc=p Michael Raymond Gall",
                "time": "3 hrs"
            },
            {
                "content": "Sharing is caring. Time tested and all parents agree, until its HIV. What have we learned? When in doubt rub one out.",
                "from": "https://www.facebook.com/jamie.deraimo?fref=ufi&rc=p Jamie Deraimo",
                "time": "3 hrs Edited"
            }
        ],
        "description": "NBC News The 27-year-old intentionally infected five men with HIV and attempted to infect five others, a U.K. court ruled.",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARTmmFKXW_8DnB1DfKgTlXS3Lae1ZxLODjgj9j9OB6TtoqNkpfDr-dyRGPKbvL-JXYM",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2jCse7F&h=ATMOfJKg9ICswxleDafeFry4z_RxsGaEsZhWJkChzor3ztGZXaPYUEiIe0c9Zzsu9LX_jwZh1pLGp6Usszf8z7mHCCM5K6FDhOIio-W8K11IJez12DOyW6usYTWtaiE9TPJ6OlS-kwlCrtp1n6sLOoUnGF59M3_CGskkaBaxlLmBeJ4YG3CLcBPu1X8jYAeSdyiadkhcu3t1Y7OA8PIRUMDnWRKCK2VLIiNLLYhvTgDrk-sesPxgaxVajc6GiLduFo9Dwh5N3w41IoNvXzJUDf8NHJLyxRI",
            "https://www.facebook.com/michael.gall1?fref=ufi&rc=p",
            "https://www.facebook.com/jamie.deraimo?fref=ufi&rc=p",
            "https://www.facebook.com/michael.gall1?fref=ufi&rc=p",
            "https://www.facebook.com/jamie.deraimo?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2148252808528071",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "My grandfather told me that he saw The Titanic, and from the beginning he warned all the people that the ship would sink, but they ignored him. However,he warned them again on several occasions, until they kicked him out the cinema.",
                "from": "https://www.facebook.com/romeo.r.cruise?fref=ufi&rc=p Romeo Randy Cruise",
                "time": "4 hrs"
            },
            {
                "content": "Our planet is... well, I love seeing pictures of earth... it's amazing!!  Our planet is amazing!!  I'm always in awe of it....",
                "from": "https://www.facebook.com/profile.php?id=100011533121094&fref=ufi&rc=p Lizbeth Esters",
                "time": "4 hrs"
            }
        ],
        "description": "NBC News The video shows how our planet has changed over the last two decades.   via  NBC News MACH",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARTxqSjXZQVRJvimH6wnQ-WPp9UlBeBcx9WxwTCgDTNu8XbO4VXG6Fzer15lcXKR3AA",
            "https://www.facebook.com/NBCNewsMACH/?fref=mentions",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2B2vkpx&h=ATPgL2p6BadY-x1AarjKvLxGfYRJAiooDIVtqDoJV2KMVnC7QGVNlo_GP2HnYp50ZjtfHmnnV2pXL6xA89Bv25evxGY47XB4o3_rVsnWO3V8_0DTuMjWyTX0EVjL4hzW1XXl5WpdFnGgN_-bM3qLvrj-0NDp_NpA9AdNugv8kQD_GPic8QU1gHPTHEoVVvQYu59TSu5chpKrcDunqQfp26mx1vlBX_tXsNbDN9aSkDKT2jusB430Dq6g5D06qCbk2dyOViRQ7e2L3AMWxvltYu3xb3DxlA4",
            "https://www.facebook.com/romeo.r.cruise?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011533121094&fref=ufi&rc=p",
            "https://www.facebook.com/romeo.r.cruise?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011533121094&fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2148252808528071",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "Most stressful job I've ever done. And it's not just the overarching stress like you feel at an office job, there are also situations constantly coming up that are stressful moment to moment. It is constant",
                "from": "https://www.facebook.com/christopher.flint.9?fref=ufi&rc=p Christopher Flint",
                "time": "5 hrs"
            },
            {
                "content": "No one who has ever spent any time in the food service/hospitality industry would ever say that is it is a \"carefree\" occupation. The little blurb of yours is pretty much insulting to every employee in the industry.",
                "from": "https://www.facebook.com/t.s.looney?fref=ufi&rc=p Skot Looney",
                "time": "4 hrs"
            }
        ],
        "description": "NBC News Bartending might seem like a fun, carefree job — how stressful could it be to make craft cocktails and pour wine and microbrews to thirsty guests? Very, according to U.S. News & World Reports.  via  NBC News BETTER",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARTU-EVLrqzaOIv3jdaT4VXihi_dpQsflsadBuLUnje7tzLRbPIwghu9q9Co9CO4IkU",
            "https://www.facebook.com/NBCNewsBetter/?fref=mentions",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Fnbcnews.to%2F2jFsmmz&h=ATN8OIg05BABdhy4LKj1bX5LcWI1iO6gwvi-Now9i3FYw1BN4mUZ0J3J7WeewTjoVWA3OXDJ6Qdileya1KX7R6pbgXwBhBUaxcwB7ozkqA9nPvmdWKKRz7xtTtl9c0RF7HZJ-GL0C7bAYQrmLDtkqjaGj8WDn0LzGc3tFKtKgBiJ5BsrTR6DXCj3CHIqf0OfZzOxmAfP08OWWI0j4n1UsnuAFkC9zgrKj2MjYLgeCDDBDYU7Wfuii0o8tE7PDIsb4gxW3VeY-duhYnDi58p12FJy10cZpQM",
            "https://www.facebook.com/christopher.flint.9?fref=ufi&rc=p",
            "https://www.facebook.com/t.s.looney?fref=ufi&rc=p",
            "https://www.facebook.com/christopher.flint.9?fref=ufi&rc=p",
            "https://www.facebook.com/t.s.looney?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2148252808528071",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "It’s way too much, I say it before and I’m saying it again insanity is taking over the USA. It’s scary",
                "from": "https://www.facebook.com/maria.resendes.790?fref=ufi&rc=p Maria Resendes",
                "time": "6 hrs"
            },
            {
                "content": "seriously...someone was seriously stressed to go out and look for a horse to do yoga with...try a park bench...they say",
                "from": "https://www.facebook.com/ROMANGONZALEZtx?fref=ufi&rc=p Roman Gonzalez",
                "time": "3 hrs"
            }
        ],
        "description": "NBC News Morning workout put a hitch in your giddy-up? You might want to try horse yoga.   Watch more on \"Stay Tuned\":  http://bit.ly/2h3aIVW",
        "participants": [
            "https://www.facebook.com/NBCNews/?ref=nf&hc_ref=ARTvpGUEqC8hwmgHFjCxmd38rd4Aq-m5H9cVKM9QksDyZxCBm3TQYF2vuJHnTtgVhNU",
            "https://www.facebook.com/maria.resendes.790?fref=ufi&rc=p",
            "https://www.facebook.com/ROMANGONZALEZtx?fref=ufi&rc=p",
            "https://www.facebook.com/maria.resendes.790?fref=ufi&rc=p",
            "https://www.facebook.com/ROMANGONZALEZtx?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/NBCNews/posts/2148252808528071",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "The poachers can try to kill them. Herds are often protected by armed government workers",
                "from": "https://www.facebook.com/profile.php?id=100008674039141&fref=ufi AD Robinson",
                "time": "November 17 at 1:08pm"
            }
        ],
        "description": "Nancy Rose Anyone who supports Trump who has done NOTHING but destroy our environment, increased racist attacks by more than double, and commit UNDISPUTED treason is a fucking MORON! Stupid doesn't even begin to cover it!! Only a complete and total idiot would put up with being lied to so often!!",
        "participants": [
            "https://www.facebook.com/mary.jane.522?fref=nf",
            "https://l.facebook.com/l.php?u=http%3A%2F%2Freverepress.com%2Fnews%2Ftrump-reverses-ban-elephant-trophies-africa%2F&h=ATNFIxGJwbXsyX4tOSb7qKs8ITVf62trvDwz4AfIYh6BjbmtqeyOz7flzsJ23WQOYVaFPMqgXDHJUigvT6Onj_vu7jAdVCOePeFiXhwPN_RwFNlS6Cf6c5UQOrlFhFWjGUyflbcwNIMvpY0D13J38GUk49mpZMKMuQVJoKVukSEnCZzuiNFTyrfhZ0-ehGNPqbOc5iqYrq5sMhTJkeVc49ogtGWT0yweJYJNT-Tw28jHqC6A3mHlDs2avdDdnUEh43LzIomrTjrySKE_xA",
            "https://www.facebook.com/profile.php?id=100008674039141&fref=ufi",
            "https://www.facebook.com/profile.php?id=100008674039141&fref=ufi"
        ],
        "post": "https://www.facebook.com/mary.jane.522/posts/10210458062507501",
        "photos": []
    },
    {
        "comments": [],
        "description": "Nancy Rose  shared  The Other 98% 's  post .",
        "participants": [
            "https://www.facebook.com/mary.jane.522?fref=nf",
            "https://www.facebook.com/mary.jane.522?hc_ref=ARTzWzr-JFy94KrgUOjtHTJA2yaMVReLGJRYsF3RQ3cSysK5y2Wipy--63x5hogYoqQ",
            "https://www.facebook.com/TheOther98/?hc_ref=ARTzWzr-JFy94KrgUOjtHTJA2yaMVReLGJRYsF3RQ3cSysK5y2Wipy--63x5hogYoqQ"
        ],
        "post": "https://www.facebook.com/mary.jane.522/posts/10210434178390413",
        "photos": []
    },
    {
        "comments": [],
        "description": "Nancy Rose  shared  The Other 98% 's  post .",
        "participants": [
            "https://www.facebook.com/mary.jane.522?fref=nf",
            "https://www.facebook.com/mary.jane.522?hc_ref=ARRHjd59TmLPX0n13ECh1efDxMh_ZYOy4x-f4V9lv5egr_vzLLqFI2LwuGKooIRwrFo",
            "https://www.facebook.com/TheOther98/?hc_ref=ARRHjd59TmLPX0n13ECh1efDxMh_ZYOy4x-f4V9lv5egr_vzLLqFI2LwuGKooIRwrFo"
        ],
        "post": "https://www.facebook.com/mary.jane.522/posts/10210434178030404",
        "photos": []
    }
]