[
    {
        "comments": [
            {
                "content": "Congratulations  Melissa. Love, Abba",
                "from": "https://www.facebook.com/saeed.fazli.96?fref=ufi Saeed Fazli",
                "time": "8 hrs"
            },
            {
                "content": "Way to go .",
                "from": "https://www.facebook.com/smartfoodmaker?fref=ufi Syed Zaffar Ali",
                "time": "6 hrs"
            },
            {
                "content": "Congratulations  Melissa.",
                "from": "https://www.facebook.com/syed.fazli?fref=ufi Syed Fazli",
                "time": "6 hrs"
            },
            {
                "content": "Congratulations !",
                "from": "https://www.facebook.com/barbara.sideri.12?fref=ufi Barbara Sideri",
                "time": "6 hrs"
            },
            {
                "content": "Congrats  🎈 ",
                "from": "https://www.facebook.com/ismat.fazli?fref=ufi Ismat Fazli",
                "time": "33 mins"
            },
            {
                "content": "Congratulations   🎈 ",
                "from": "https://www.facebook.com/barbara.young.75641?fref=ufi Barbara Young",
                "time": "30 mins"
            }
        ],
        "description": "Melissa Fazli  added  2 new photos . Just received my certificate and award from the Religious Freedom Center.  🎉 🤗",
        "participants": [
            "https://www.facebook.com/melissa.fazli?fref=nf",
            "https://www.facebook.com/melissa.fazli?hc_ref=ARRkrSS_w0o4gMD4CSucPWWm3lwypqFd1lMSO9lfw7TojFDAUnhdOIca9rDmydk08FM",
            "https://www.facebook.com/saeed.fazli.96?fref=ufi",
            "https://www.facebook.com/smartfoodmaker?fref=ufi",
            "https://www.facebook.com/syed.fazli?fref=ufi",
            "https://www.facebook.com/barbara.sideri.12?fref=ufi",
            "https://www.facebook.com/ismat.fazli?fref=ufi",
            "https://www.facebook.com/barbara.young.75641?fref=ufi",
            "https://www.facebook.com/saeed.fazli.96?fref=ufi",
            "https://www.facebook.com/smartfoodmaker?fref=ufi",
            "https://www.facebook.com/syed.fazli?fref=ufi",
            "https://www.facebook.com/barbara.sideri.12?fref=ufi",
            "https://www.facebook.com/ismat.fazli?fref=ufi",
            "https://www.facebook.com/barbara.young.75641?fref=ufi"
        ],
        "post": "https://www.facebook.com/melissa.fazli/posts/10214601157686736",
        "photos": [
            "https://www.facebook.com/photo.php?fbid=10214601157326727&set=pcb.10214601157686736&type=3",
            "https://www.facebook.com/photo.php?fbid=10214601157406729&set=pcb.10214601157686736&type=3"
        ]
    },
    {
        "comments": [],
        "description": "Melissa Fazli  shared a memory. One year ago and Trump is still a bully. Like Page Hillary Clinton  ·  November 2, 2016  ·  \"I've been bullied for being Muslim. ... It hurts, you know.\"  This is the Trump Effect: Play -1:17 Auto 1080p 720p 480p 360p 240p Captions More Settings Additional Visual Settings Enter Fullscreen Mute Click for more It looks like you may be having problems playing this video. If so, please try restarting your browser. Close Posted by  Hillary Clinton 966,283 Views 966,283 Views Brian Cullinan 5.8K Comments 12K Shares 966K Views 19K 5.6K 2.7K 29K   Melissa Fazli and 29K others",
        "participants": [
            "https://www.facebook.com/melissa.fazli?fref=nf",
            "https://www.facebook.com/melissa.fazli?hc_ref=ARTIj08eNygFiEEfV8r4MFAt4S1PlKoyjSKqjg-48G3iXESeCe-lL1Y4_aXNvRJQk3s",
            "https://www.facebook.com/hillaryclinton/?ref=nf&hc_ref=ARQwA7snzKOJWueYgNE5ZdVgZyqSJikr3ZF_5eUiEN2TD33wNN6aJWqFbJ_herIeXWk"
        ],
        "post": "https://www.facebook.com/melissa.fazli/posts/10214546101070355",
        "photos": []
    },
    {
        "comments": [],
        "description": "",
        "participants": [
            "https://www.facebook.com/hillaryclinton/?ref=nf&hc_ref=ARQwA7snzKOJWueYgNE5ZdVgZyqSJikr3ZF_5eUiEN2TD33wNN6aJWqFbJ_herIeXWk"
        ],
        "post": "https://www.facebook.com/melissa.fazli/posts/10214546101070355",
        "photos": []
    },
    {
        "comments": [
            {
                "content": "I will sum this up in a few words. If Trump by some miracle gets elected, how about all you Trump followers go to the woman that Trump raped when she was thirteen years old, look her in the eyes and tell her that you voted for the man that raped her and molested dozens of women.",
                "from": "https://www.facebook.com/henry.cooter?fref=ufi&rc=p John Arthur Cooter",
                "time": "November 2, 2016 at 8:20pm"
            },
            {
                "content": "Using kids again? Hillary campaign cannot be lower! If your little feelings are hurt by what other people said, grow up and grow stronger!",
                "from": "https://www.facebook.com/profile.php?id=100011595042598&fref=ufi&rc=p Yu Elie Feng",
                "time": "November 2, 2016 at 8:22pm"
            },
            {
                "content": "So Hillary, just wanted to ask since the FBI has induced their investigation during your campaign, how does it feel to be 'aborted' 6 days before your Presidential \"delivery'?",
                "from": "https://www.facebook.com/Treasuredwife?fref=ufi&rc=p Brandi Irene Burton",
                "time": "November 2, 2016 at 8:50pm Edited"
            },
            {
                "content": "I imagine Barack Obama felt the same way when your failed 2OO8 presidential campaign leaked the phony picture of him in Muslim robes and you refused to acknowledge that he belonged to a Christian church. But you stick to the high road, don't you, Hill?  Choices.",
                "from": "https://www.facebook.com/profile.php?id=100011121847467&fref=ufi&rc=p Jennifer Cole",
                "time": "November 2, 2016 at 8:24pm"
            },
            {
                "content": "Yes...when Brazile was giving Hillary Clinton the questions to the second debate. Then after the debate, the only thing the liberals could talk about was how Trump was hovering over Clinton. It kinda reminds me of how the democrats was accusing Trump of inciting violence, when all along it was Hillary Clinton that was hiring people to start the violence. They go low we go high. Ha! what a joke.",
                "from": "https://www.facebook.com/robert.rankin.33?fref=ufi&rc=p Robert Rankin",
                "time": "November 2, 2016 at 8:29pm"
            },
            {
                "content": "Ummmm....this is the same woman who accepts money from Saudi Arabia.....yeah.....real women's rights movement there.....how about if a woman is raped, she is at fault and often times stoned to death?....no driving rights, no voting rights, basically treated like a dog....but let's keep taking that money huh?.....yeah.....hypocrite.",
                "from": "https://www.facebook.com/profile.php?id=100005094850274&fref=ufi&rc=p Robert Butterworth",
                "time": "November 2, 2016 at 8:24pm"
            },
            {
                "content": "Big Democratic donor Benjamin Barber is caught on video during a NC fundraiser, saying blacks who are Republicans are \"F--ked in the head\" and refers to Republicans as \"murderers\". When they go low, we go high. Right Hillary?",
                "from": "https://www.facebook.com/Taralyne1?fref=ufi&rc=p Tara Larsen",
                "time": "November 2, 2016 at 8:21pm"
            },
            {
                "content": "I hope to live in a world were my daughters can look up to Hillary, that's only going to happen if she gets jailed in a very tall tower",
                "from": "https://www.facebook.com/gabriel.kearns?fref=ufi&rc=p Gabriel Kearns",
                "time": "November 2, 2016 at 8:26pm"
            },
            {
                "content": "Hilary supports abortion in the final weeks of the baby's development.  Please reconsider your position. Untold innocent lives matter. ... See More",
                "from": "https://www.facebook.com/Douglasschiro?fref=ufi&rc=p Timothy Douglass",
                "time": "November 2, 2016 at 8:23pm"
            },
            {
                "content": "The one sad thing I've noticed about some of the Trump supporters I've encountered, is how quick they are to personally insult someone, they come to false conclusions about your personal life and political views, and become personally offended when you ... See More",
                "from": "https://www.facebook.com/yessenia.rodriguez.142?fref=ufi&rc=p Jess Rodriguez",
                "time": "November 3, 2016 at 5:24am Edited"
            },
            {
                "content": "For every troll who posts below in the next 30 minutes... I'm donating $1 to Hillary.",
                "from": "https://www.facebook.com/ashleigh.jobson?fref=ufi&rc=p Ashleigh Corsino",
                "time": "November 2, 2016 at 8:20pm"
            },
            {
                "content": "Quit spewing hate and tell us why you lie about everything. Only a few more days and Trump will win and you will pay for your crimes",
                "from": "https://www.facebook.com/ryan.smetana.5?fref=ufi&rc=p Ryan Smetana",
                "time": "November 2, 2016 at 8:27pm"
            },
            {
                "content": "I'm a muslim and I think Trump is better than Clinton . Because Clinton supports terrorist groups in syria this groups try to destroy America and humanity so I hope all Americans will vote for Trump . Muslims with Trump .",
                "from": "https://www.facebook.com/profile.php?id=1032060342&fref=ufi&rc=p Omar Al-Jaafari",
                "time": "November 2, 2016 at 10:09pm"
            },
            {
                "content": "Wow, Hillary says she's tired of the divisive, dark, negative vision of Trump supporters.  Wowza! Pot calling the kettle black, eh?  Aren't  Bernie and Hillary supporters the ones that threw eggs at a woman's face and spit on her while closing her into ... See More",
                "from": "https://www.facebook.com/christycrossbones?fref=ufi&rc=p Christy TK Dotson",
                "time": "November 2, 2016 at 8:32pm"
            },
            {
                "content": "How is Hillary qualified when she cannot remember what was in her important emails when she was Secretary of State? She has memory lapses, it's in the FBI records, she could not recall some much information. That's scary....",
                "from": "https://www.facebook.com/jb.ball.33?fref=ufi&rc=p JB Ball",
                "time": "November 2, 2016 at 8:37pm"
            },
            {
                "content": "Hillary Clinton bullies American's All of us who don't support her have been called some type of name .. BY HER. We've been mocked for political choice, religious choices, age... You name it! ... See More",
                "from": "https://www.facebook.com/jordyn.lahey?fref=ufi&rc=p Jordyn Lahey-White",
                "time": "November 2, 2016 at 8:25pm"
            },
            {
                "content": "Why would I be dumb enough to vote for damaged baggage. You have to much lady and your trust went out the window.",
                "from": "https://www.facebook.com/profile.php?id=100008258437853&fref=ufi&rc=p Kathleen Little",
                "time": "November 2, 2016 at 8:23pm"
            },
            {
                "content": "lol get ready to be deported and hillyskank is going with you , she will be shipped unarmed to benghazi! hillary bill and chelsea for benghazi! uh oh, i attacked hillbilly, one of her 30 supporters needs to defend her! lol come rescue hillybean.",
                "from": "https://www.facebook.com/pam.melnick?fref=ufi&rc=p Pam Melnick",
                "time": "November 2, 2016 at 8:33pm"
            },
            {
                "content": "That video of Trump supposedly mocking a guy was proven fake when the whole video was run. Another cheap CLINTON smear. Never happened. The shame of it. The way Clinton uses kids, and never really does anything for them. All TALK, see you in 4 years",
                "from": "https://www.facebook.com/ken.clenney?fref=ufi&rc=p Kenneth Clenney",
                "time": "November 2, 2016 at 8:49pm"
            },
            {
                "content": "Hillary is as corrupt as the come. We can build the wall for free out of her emails! She was on the lolita express which is a pedophile plane. Her husband wants to get into the whitehouse to bang the secretarys",
                "from": "https://www.facebook.com/chris.mann.963871?fref=ufi&rc=p Chris Mann",
                "time": "November 2, 2016 at 8:38pm"
            },
            {
                "content": "Cooperate with the FBI, give them the names of Clinton foundation's donors please. 6 days to stop this nonsense, you go behind bars and let everyone rest.",
                "from": "https://www.facebook.com/profile.php?id=100004422466814&fref=ufi&rc=p Felix Clifford",
                "time": "November 2, 2016 at 8:33pm Edited"
            },
            {
                "content": "Im a half white half hispanic Jew, the son of two immigrants, and I have Mexican family, so I cannot say immigrants are bad. But there are a lot of them and with any population of people there will be good and bad folks. The problen with illegal immigr ... See More",
                "from": "https://www.facebook.com/jzlotolow?fref=ufi&rc=p Jordan Zlotolow",
                "time": "November 2, 2016 at 8:37pm"
            },
            {
                "content": "The very reason why Trump should be thrown far, far away from his false dream of taking over the White House! Hillary is far more equipped & suited for the job. She has the potential, ability & courage that America needs at this stage. The end of all the 3 debates should've made this clear & obvious.",
                "from": "https://www.facebook.com/zoran.saher?fref=ufi&rc=p Zoran Saher",
                "time": "November 2, 2016 at 8:29pm Edited"
            },
            {
                "content": "I encourage anyone who believes Hillary's garbage to visit the Al Jazeera Facebook page and read the comments related to Hillary and Obama. Muslims around the world despise both Hillary and Obama. Those two have created humanitarian disasters in the Middle East. Don't be fooled by her rhetoric.",
                "from": "https://www.facebook.com/kay.collake?fref=ufi&rc=p Kay Kawana Collake",
                "time": "November 2, 2016 at 8:46pm"
            },
            {
                "content": "then why do you stand up and speak about that horrible political cult and the raping and mutilating young girls? And if you're a woman in that culture, I'd think you are already used to being hurt, physically and mentally. It is no religion.",
                "from": "https://www.facebook.com/p3gaus?fref=ufi&rc=p Pamela Gausman",
                "time": "November 2, 2016 at 8:22pm Edited"
            },
            {
                "content": "Trump has NOT made it ok to bully anyone. I've been around for a long time, a child of the 50's and 60's. Do you think this bullying stuff is new? It has ALWAYS been here. It has nothing to do with Trump. I was picked on as a child and I know many more who were bullied as well. Do not call it the Trump Effect. It is the result of pure evil and that is all. Hillary, YOU should know!",
                "from": "https://www.facebook.com/kim.grabarek?fref=ufi&rc=p Kim Jeason Grabarek",
                "time": "November 2, 2016 at 9:13pm"
            },
            {
                "content": "How can anyone support a corrupt lying criminal who sold our uranium to the Russians to line her pockets, knew about weiner sexting years ago and didn't report it, put our security at risk, cheated to get the nomination...she is a liar will say and do  ... See More",
                "from": "https://www.facebook.com/monica.clemmer?fref=ufi&rc=p Monica Clemmer",
                "time": "November 2, 2016 at 8:46pm"
            },
            {
                "content": "Sad when a candidate can only run on division, deliberately trying to divide and cause misunderstandings between all Americans. not their policies or decisions of the past. Trump said he will work for all our dreams of prosperity, school choice, he wants to bring us together as Americans.",
                "from": "https://www.facebook.com/becky.french.37819?fref=ufi&rc=p Becky French",
                "time": "November 2, 2016 at 8:43pm"
            },
            {
                "content": "Liar. Trump has never said one single ill word against any Muslim. He said he wants to protect our country by examining the intentions of whom enters it.",
                "from": "https://www.facebook.com/catherine.spellman?fref=ufi&rc=p Catherine Spellman",
                "time": "November 2, 2016 at 8:27pm Edited"
            },
            {
                "content": "More word twisting and lies. Hillary can't run on her own merit. Only thing to fall back on is corruption and lies and don't forget her pervert husband.",
                "from": "https://www.facebook.com/vickiwright5565?fref=ufi&rc=p Vicki Wright",
                "time": "November 2, 2016 at 8:40pm"
            },
            {
                "content": "Pfffffffffffffft,,,, Everyone has been bullied at some point in their lives. We muslims have been scoffed long before Trump ever decided to run for president... This video is ridiculous!!",
                "from": "https://www.facebook.com/imtiaz.khalil.528?fref=ufi&rc=p Imtiaz Khalil",
                "time": "November 2, 2016 at 9:43pm"
            },
            {
                "content": "Hey democraps...Bernie supporter here from canada, how does it feel to lose the election over donald trump  😂 😂 😂 ? Democraps be like: hillary is winning in a landslide 😂 😂 😂  with Bernie, you would have easily beat Trump in a general according to many polls. Yet you allowed Hillary stole the nominee. Good luck!",
                "from": "https://www.facebook.com/glen.zaphiel?fref=ufi&rc=p Glen Zaphiel",
                "time": "November 2, 2016 at 8:23pm"
            },
            {
                "content": "So are y'all still gonna vote for  her?...With Weiners emails and the Wicki Leaks emails... She is going to be impeached,if she wins, and possibly jailed ( Please God) so you will get Tim Kaine... He's a buffoon... Do y'all really want that?",
                "from": "https://www.facebook.com/lydia.keiser?fref=ufi&rc=p Lydia Sheppard Keiser",
                "time": "November 2, 2016 at 9:25pm Edited"
            },
            {
                "content": "I would trust PeeWee Herman sitting behind me in a movie theater while out on a date with O J Simpson, drinking at Bill Cosby's bar with Flint Michigan ice cubes, after taking elevator rides with Ray Rice, all while Casey Anthony babysits for me before I would trust HER to walk my dog!!!",
                "from": "https://www.facebook.com/terry.calkins?fref=ufi&rc=p Terry Calkins",
                "time": "November 2, 2016 at 8:36pm"
            },
            {
                "content": "Hilary is a creep and so is her husband! Clinton foundation worth over 3 billion and they pay out less than 6%. They are going to jail! Ask the people of Haiti",
                "from": "https://www.facebook.com/bill.giampolo?fref=ufi&rc=p Bill Giampolo",
                "time": "November 2, 2016 at 8:30pm"
            },
            {
                "content": "We count on you  Hillary Clinton  to make a change ; you're the right person for the right job ; we count on you to make the world we're living in better ! Let's hope america vote for you so you could be the president of the world most powerful nation, the first female president of the USA  :) ",
                "from": "https://www.facebook.com/benameur.bilel?fref=ufi&rc=p Ben Ameur",
                "time": "November 2, 2016 at 8:27pm"
            },
            {
                "content": "A Lie Named Hillary ..  I oppose her because she cannot tell the truth to save her life. Any public servant who has the gall to issue a list of terms the press cannot utter, as if disposing the corpse of free will, is helplessly deluded and a petulant  ... See More",
                "from": "https://www.facebook.com/julie.sabuda?fref=ufi&rc=p Julie Sabuda",
                "time": "November 2, 2016 at 8:34pm"
            },
            {
                "content": "I look at it this way, the president said everyone makes mistakes. So if Hillary was a doctor and she was specialist will all this experience, but committed a gross negligence on a patient, I would not have her do my surgery. Think before you vote",
                "from": "https://www.facebook.com/patricia.feyrer.5?fref=ufi&rc=p Patricia Feyrer",
                "time": "November 2, 2016 at 8:56pm"
            },
            {
                "content": "These kids break my heart when I listen to what they are enduring because Trump is such a rotten example. I pray we do the right thing and elect Hillary Clinton. Trump is so far beneath the dignity of the office of President.",
                "from": "https://www.facebook.com/robin.g.cooper.7?fref=ufi&rc=p Robin Goldhar Cooper",
                "time": "November 2, 2016 at 8:56pm"
            },
            {
                "content": "Trump is gonna be the best president this cou try has ever seen. Law and order for the people by the people. Drain the swamp of the Clinton corruption. This e who don't agree can live on the other side of the wall lpl",
                "from": "https://www.facebook.com/gina.m.domino?fref=ufi&rc=p Gina Domino",
                "time": "November 2, 2016 at 9:12pm"
            },
            {
                "content": "I know this much: democrats bring in the immigrants and refugees, offer them free food, healthcare and sub-standard housing in exchange for their loyalty to vote the straight dem ticket. Even Obama mentions this in his book...'how poor they were but so ... See More",
                "from": "https://www.facebook.com/wendy.bloome?fref=ufi&rc=p Wendy Walker Marlatt",
                "time": "November 2, 2016 at 8:42pm"
            },
            {
                "content": "lol hillary was told yesterday to sit down and shut up. lol  they told her she will be going to prison along with obawmaw baraq hussein the muzz terrorist, lol sit down and shut up and if you think you are going to sick your muzz on us hillybean , we say bring it on, lol we can't wait! bacon and pig blood is served.",
                "from": "https://www.facebook.com/pam.melnick?fref=ufi&rc=p Pam Melnick",
                "time": "November 2, 2016 at 8:35pm"
            },
            {
                "content": "Hmmmm.  Playing the Muslim card... The disabled card... And there gender card.... Wow, you are dispirate in your Falk from power aren't you. Your morals, ethics and consciousness are all messed up... Your will have time while in prison to see a doctor about those.",
                "from": "https://www.facebook.com/andrew.casebier?fref=ufi&rc=p Andrew Casebier",
                "time": "November 3, 2016 at 1:56am"
            },
            {
                "content": "You are a Muslim Mrs Clinton? Well, that explains all of your actions of late, concerning Christians, and abortion. Dont get me wrong, there is nothing wrong with a peaceful Muslim. What we worry about is your tolerance for some that might be terrorists.",
                "from": "https://www.facebook.com/charlotte.drobnicki?fref=ufi&rc=p Charlotte Drobnicki",
                "time": "November 3, 2016 at 2:38pm Edited"
            },
            {
                "content": "Hillary beliefs have, in the worst way, \"bullied\" the lives of the unborn! Our Children are watching! How do they understand? This is a sick ad from a presidential candidate is for the killing of American unborn children!",
                "from": "https://www.facebook.com/mary.favia.7?fref=ufi&rc=p Mary Leen Favia",
                "time": "November 2, 2016 at 10:28pm"
            },
            {
                "content": "It's really sad when you have a dirt bag like trump influencing a group of people to treat others this way.   He should be disqualified by that alone, but he hasn't been so we have to get out and vote!!!   His change is not the change we need!",
                "from": "https://www.facebook.com/renee.mudd.3?fref=ufi&rc=p Renee Mudd",
                "time": "November 2, 2016 at 8:48pm"
            },
            {
                "content": "It's very important for the Kremlin to get Trump into the Whitehouse or they wouldn't be spending billions of dollars on flooding the web with Trolls and hackers",
                "from": "https://www.facebook.com/graham.roberts.397?fref=ufi&rc=p Graham Roberts",
                "time": "November 2, 2016 at 8:23pm"
            },
            {
                "content": "Trump is a doer...Hillary is a talker..the problem is Hillary has been talking for 30 years and done nothing. Time to end this conversation. I voted for  # TRUMP  yesterday...I'd highly recommend the rest of you follow suit!",
                "from": "https://www.facebook.com/kelly.haderknowles?fref=ufi&rc=p Kelly Hader Knowles",
                "time": "November 2, 2016 at 9:18pm"
            },
            {
                "content": "I voted for you because i want to keep America and its dreams. I see that we are all stronger together as your slogan, and i believe it. There is no black, white, yellow, brown America, there is just United States of America! One day if things are falling apart, i can tell my kid that I stood up for what's right and that I am proud to have voted for you to be the first Madam President of the United States.",
                "from": "https://www.facebook.com/HuynhPhiTienAsia?fref=ufi&rc=p Huỳnh Phi Tiễn",
                "time": "November 3, 2016 at 9:01am"
            },
            {
                "content": "How can America seriously even be considering voting Hilary Clinton in as our US President? She is the only First Lady to ever be indicted on charges! Also she is being investigated currently by the FBI and possibly facing jail time if proven guilty. H ... See More",
                "from": "https://www.facebook.com/debbie.hastings.714?fref=ufi&rc=p Debbie Hastings Smialek",
                "time": "November 3, 2016 at 12:28am"
            }
        ],
        "description": "Hillary Clinton \"I've been bullied for being Muslim. ... It hurts, you know.\"  This is the Trump Effect: Hillary Clinton",
        "participants": [
            "https://www.facebook.com/hillaryclinton/?ref=nf&hc_ref=ARSxFCEqywrtV4uG70ZrpcPXeG3BtGEw5ESvPqmZqcYIl5pNiA95mW6rTnrU0Z0S8R0",
            "https://www.facebook.com/henry.cooter?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011595042598&fref=ufi&rc=p",
            "https://www.facebook.com/Treasuredwife?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011121847467&fref=ufi&rc=p",
            "https://www.facebook.com/robert.rankin.33?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100005094850274&fref=ufi&rc=p",
            "https://www.facebook.com/Taralyne1?fref=ufi&rc=p",
            "https://www.facebook.com/gabriel.kearns?fref=ufi&rc=p",
            "https://www.facebook.com/Douglasschiro?fref=ufi&rc=p",
            "https://www.facebook.com/yessenia.rodriguez.142?fref=ufi&rc=p",
            "https://www.facebook.com/ashleigh.jobson?fref=ufi&rc=p",
            "https://www.facebook.com/ryan.smetana.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1032060342&fref=ufi&rc=p",
            "https://www.facebook.com/christycrossbones?fref=ufi&rc=p",
            "https://www.facebook.com/jb.ball.33?fref=ufi&rc=p",
            "https://www.facebook.com/jordyn.lahey?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100008258437853&fref=ufi&rc=p",
            "https://www.facebook.com/pam.melnick?fref=ufi&rc=p",
            "https://www.facebook.com/ken.clenney?fref=ufi&rc=p",
            "https://www.facebook.com/chris.mann.963871?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100004422466814&fref=ufi&rc=p",
            "https://www.facebook.com/jzlotolow?fref=ufi&rc=p",
            "https://www.facebook.com/zoran.saher?fref=ufi&rc=p",
            "https://www.facebook.com/kay.collake?fref=ufi&rc=p",
            "https://www.facebook.com/p3gaus?fref=ufi&rc=p",
            "https://www.facebook.com/kim.grabarek?fref=ufi&rc=p",
            "https://www.facebook.com/monica.clemmer?fref=ufi&rc=p",
            "https://www.facebook.com/becky.french.37819?fref=ufi&rc=p",
            "https://www.facebook.com/catherine.spellman?fref=ufi&rc=p",
            "https://www.facebook.com/vickiwright5565?fref=ufi&rc=p",
            "https://www.facebook.com/imtiaz.khalil.528?fref=ufi&rc=p",
            "https://www.facebook.com/glen.zaphiel?fref=ufi&rc=p",
            "https://www.facebook.com/lydia.keiser?fref=ufi&rc=p",
            "https://www.facebook.com/terry.calkins?fref=ufi&rc=p",
            "https://www.facebook.com/bill.giampolo?fref=ufi&rc=p",
            "https://www.facebook.com/benameur.bilel?fref=ufi&rc=p",
            "https://www.facebook.com/hillaryclinton/?hc_location=ufi",
            "https://www.facebook.com/julie.sabuda?fref=ufi&rc=p",
            "https://www.facebook.com/patricia.feyrer.5?fref=ufi&rc=p",
            "https://www.facebook.com/robin.g.cooper.7?fref=ufi&rc=p",
            "https://www.facebook.com/gina.m.domino?fref=ufi&rc=p",
            "https://www.facebook.com/wendy.bloome?fref=ufi&rc=p",
            "https://www.facebook.com/pam.melnick?fref=ufi&rc=p",
            "https://www.facebook.com/andrew.casebier?fref=ufi&rc=p",
            "https://www.facebook.com/charlotte.drobnicki?fref=ufi&rc=p",
            "https://www.facebook.com/mary.favia.7?fref=ufi&rc=p",
            "https://www.facebook.com/renee.mudd.3?fref=ufi&rc=p",
            "https://www.facebook.com/graham.roberts.397?fref=ufi&rc=p",
            "https://www.facebook.com/kelly.haderknowles?fref=ufi&rc=p",
            "https://www.facebook.com/HuynhPhiTienAsia?fref=ufi&rc=p",
            "https://www.facebook.com/debbie.hastings.714?fref=ufi&rc=p",
            "https://www.facebook.com/henry.cooter?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011595042598&fref=ufi&rc=p",
            "https://www.facebook.com/Treasuredwife?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100011121847467&fref=ufi&rc=p",
            "https://www.facebook.com/robert.rankin.33?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100005094850274&fref=ufi&rc=p",
            "https://www.facebook.com/Taralyne1?fref=ufi&rc=p",
            "https://www.facebook.com/gabriel.kearns?fref=ufi&rc=p",
            "https://www.facebook.com/Douglasschiro?fref=ufi&rc=p",
            "https://www.facebook.com/yessenia.rodriguez.142?fref=ufi&rc=p",
            "https://www.facebook.com/ashleigh.jobson?fref=ufi&rc=p",
            "https://www.facebook.com/ryan.smetana.5?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=1032060342&fref=ufi&rc=p",
            "https://www.facebook.com/christycrossbones?fref=ufi&rc=p",
            "https://www.facebook.com/jb.ball.33?fref=ufi&rc=p",
            "https://www.facebook.com/jordyn.lahey?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100008258437853&fref=ufi&rc=p",
            "https://www.facebook.com/pam.melnick?fref=ufi&rc=p",
            "https://www.facebook.com/ken.clenney?fref=ufi&rc=p",
            "https://www.facebook.com/chris.mann.963871?fref=ufi&rc=p",
            "https://www.facebook.com/profile.php?id=100004422466814&fref=ufi&rc=p",
            "https://www.facebook.com/jzlotolow?fref=ufi&rc=p",
            "https://www.facebook.com/zoran.saher?fref=ufi&rc=p",
            "https://www.facebook.com/kay.collake?fref=ufi&rc=p",
            "https://www.facebook.com/p3gaus?fref=ufi&rc=p",
            "https://www.facebook.com/kim.grabarek?fref=ufi&rc=p",
            "https://www.facebook.com/monica.clemmer?fref=ufi&rc=p",
            "https://www.facebook.com/becky.french.37819?fref=ufi&rc=p",
            "https://www.facebook.com/catherine.spellman?fref=ufi&rc=p",
            "https://www.facebook.com/vickiwright5565?fref=ufi&rc=p",
            "https://www.facebook.com/imtiaz.khalil.528?fref=ufi&rc=p",
            "https://www.facebook.com/glen.zaphiel?fref=ufi&rc=p",
            "https://www.facebook.com/lydia.keiser?fref=ufi&rc=p",
            "https://www.facebook.com/terry.calkins?fref=ufi&rc=p",
            "https://www.facebook.com/bill.giampolo?fref=ufi&rc=p",
            "https://www.facebook.com/benameur.bilel?fref=ufi&rc=p",
            "https://www.facebook.com/julie.sabuda?fref=ufi&rc=p",
            "https://www.facebook.com/patricia.feyrer.5?fref=ufi&rc=p",
            "https://www.facebook.com/robin.g.cooper.7?fref=ufi&rc=p",
            "https://www.facebook.com/gina.m.domino?fref=ufi&rc=p",
            "https://www.facebook.com/wendy.bloome?fref=ufi&rc=p",
            "https://www.facebook.com/pam.melnick?fref=ufi&rc=p",
            "https://www.facebook.com/andrew.casebier?fref=ufi&rc=p",
            "https://www.facebook.com/charlotte.drobnicki?fref=ufi&rc=p",
            "https://www.facebook.com/mary.favia.7?fref=ufi&rc=p",
            "https://www.facebook.com/renee.mudd.3?fref=ufi&rc=p",
            "https://www.facebook.com/graham.roberts.397?fref=ufi&rc=p",
            "https://www.facebook.com/kelly.haderknowles?fref=ufi&rc=p",
            "https://www.facebook.com/HuynhPhiTienAsia?fref=ufi&rc=p",
            "https://www.facebook.com/debbie.hastings.714?fref=ufi&rc=p"
        ],
        "post": "https://www.facebook.com/hillaryclinton/videos/1309824979074028/",
        "photos": []
    }
]