{
    "thread": "https://www.facebook.com/messages/archived/t/mrsdesireerose",
    "participants": [
        {
            "name": "Desiree Martinez\n(Ford)",
            "description": "Owner at All-In-One Social Media",
            "url": "Nerdy Panda (Owner) at Pink Media, LLC"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2011-07-21T17:45:00.000Z",
            "message": "Brian\nDesiree,\n\nMy mother, Linda McVey referred me to your business Pink Media.  I am working on a startup Sitewatch, and we would like to start getting some attention and improve our SEO ranking, she thought you would be able to help.  We would like to improve some of the content and wording of our website and develop our presence online.  Our website is https://sitewat.ch, please contact me at your earliest convenience by e-mail (bjcullinan@gmail.com) and we can set up a time to meet over phone (4804660856) or in person.\n\nThank you,\n-Brian\nWelcome\nSitewatch is your own personal search engine that finds problems with your website before hackers use them to break in. Here are some companies that have benefited from Sitewatch:\nsitewat.ch\n"
        },
        {
            "from": "Desiree",
            "time": "2011-07-22T22:11:00.000Z",
            "message": "\nHey Brian! I left you a voicemail today to talk, but I wanted to connect with you here as well. My boyfriend works for an awesome SEO company and think he would be the best fit for what you described above. \n\nSo you know, my company does social media marketing and graphic design. If you ever need that please let me know.\n\nCall me to schedule a time to talk.3038323019\n"
        },
        {
            "from": "Desiree",
            "time": "2011-08-04T23:09:00.000Z",
            "message": "\nHey I have a question for you: what do you know about Facebook apps and coding for them?\n"
        },
        {
            "from": "Brian",
            "time": "2011-08-09T00:48:00.000Z",
            "message": "Brian\nI can write a Facebook App.  I haven't written one, but it looks really easy.\n"
        },
        {
            "from": "Desiree",
            "time": "2011-08-10T16:56:00.000Z",
            "message": "\nWould you be open to having a new conversation together. I have created Pink Engagements (www.pinkengagements.com) and would like to turn it into an app similar to www.pagemodo.com\n\nLet me know if you are interested and we can schedule a conversation. Additionally, I am trying to keep this on the DL so please don't share with others.\n\nDesiree\nPink Engagments\nI know you are incredibly excited and looking forward to a great life with the person you love. But first comes the wedding. Are you ready?\npinkengagements.com\n"
        },
        {
            "from": "Desiree",
            "time": "2011-08-15T16:10:00.000Z",
            "message": "\nhey!\nhow are you?\n"
        },
        {
            "from": "Brian",
            "time": "2011-08-15T16:10:00.000Z",
            "message": "Brian\nHi, I am well\n"
        },
        {
            "from": "Desiree",
            "time": "2011-08-15T16:10:00.000Z",
            "message": "\nhave you gotten to look at that stuff I sent?\nhow I things with getting the pricing all worked out so we can get your rocking with internet marketing\n"
        },
        {
            "from": "Brian",
            "time": "2011-08-15T16:10:00.000Z",
            "message": "Brian\nYes, thank you.  We are working hard so it might be a few months.  We may have to rebrand because of trademarking issues.\n"
        },
        {
            "from": "Desiree",
            "time": "2011-08-15T16:10:00.000Z",
            "message": "\noh no\nwhat a pain\n\n"
        },
        {
            "from": "Brian",
            "time": "2011-08-15T16:10:00.000Z",
            "message": "Brian\nyeah\n"
        }
    ]
}