{
    "thread": "https://www.facebook.com/messages/t/NateJonesTheCerebralThinker?filter=unread",
    "participants": [
        {
            "name": "Nate Jones",
            "description": "",
            "url": "https://www.facebook.com/NateJonesTheCerebralThinker"
        }
    ],
    "messages": [
        {
            "time": "2017-11-26T17:27:00.000Z",
            "from": [],
            "message": "You are now connected on Messenger."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nAre you a scientologist?\nI have another question for you too, collaborated with a friend of mine to come up with it."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nHa! Are you kidding me?\nI'm an agnostic atheist! lol"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nBut not scientologist?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nHell no!\nI don't follow woo woo bullshit of any kind!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nOk, I think you'll like this one and help me improve it.  Here's my question.  On Earth, natural selection is a process where desirable traits in living things continue living, and undesirable traits are eventually purged from the species.  This is initiated from accidental changes to a species (e.g. a bird born with an unnaturally long beak, or a slightly different shade might be determined by mates as a good trait or a bad trait)."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nYou follow me so far right?\nMaybe I should word it better."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nYes\nGot it"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nHere's the question, outside of natural selection on earth, is there a natural selection that occurs universally, and what would be the natural benefit of life?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nHmm. Interesting!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nHa!  Woohoo!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nI'll make a post about it and tag you in it. How's that?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nSure lol"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nIt's actually a fascinating question!\nThat is the type of stuff I lie in bed at night wondering about! lol"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nMan, took forever for me to come up with something that might stump them.  I've been a member of Atheist beings all year."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nThumbs Up Sign"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nPersonally, I don't know how to describe my beliefs, I wasn't evading your questions earlier.  I believe Jesus existed, but I don't believe that believing in him is the only requirement for a happy life.  Some people find it to be enough.  I also don't believe that afterlife or death are the only options.  Any suggestions you have on that I'd be open to hearing."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nOkay, we're getting somewhere. You believe that Jesus existed. Okay. Do you believe he was God? Divine? A prophet?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nYes, I believe those are all possible.  But that's not to say he was \"supernatural\".  Obviously prophecy can only be proven in hindsight with our current technology called \"writing things down\".\nFor example, if I am brainstorming all the possible times the arctic shelf could collapse, and I have been around the block.  If I guess precisely the day and time before it happens, it doesn't make me a prophet."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nYou say it's \"possible\". But, what do you actually believe to be true? Was Jesus God in the flesh? Yes or no? This is what determines whether you are a Theist or an atheist."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nThat's the other hard part.  I believe we are all part God.  So if I say yes, Jesus was God.  That still doesn't make him supernatural."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nAny god is considered \"supernatural\" because he/she/it is not bound by nature, as humans are.\nWe must be clear that we are both using the same definition of \"god\".\nIf you are refferring to \"god\" as in \"The Universe\", then yes we are all a part of the Universe and therefore all a part of \"god\". Einstein used the term \"god\" in tbis sense.\nThat is called a \"Pantheist\". Someone who believes the entire universe to be what we call god.\nBut ... That is entirely different from the traditional and dictionary definition of the term \"god\". This definition is referring to a supernatural deity that is typically all-powerful or at least more powerful than humans. Those that believe in this definition are Theists."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nYeah, I read about Pantheism, it's kind of cool and makes sense.\nBut I think I found the root of the issue.  What you believe to be supernatural and what I believe to be supernatural are different."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nI have seen too much not to share.  When I was in college I was wide-eyed, the world is my oyster, I have nothing to fear.  Last year, I was terrified, I lost my mind, went to therapy, and soon realized, I am still here.  Every day that I don't wake up with a headache is a miracle for me.  What I realized now is, when you take responsibility for other people outside yourself, it is both dangerous and mind-warping.  Your brain begins to think of longer and longer affects of your actions.  You piece things together in history that were never taught in history class.  Many people begin to experience this in their 20s and 30s, when they get married and have kids.  What I recently realized is, I am learning the same thing now, before the age that synaptic pruning takes place, what he learned in his 70s (he's an old minister).  That is, how to not live in fear.  Fear is the opposite of faith and they are mutually exclusive."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\n* used the word realized twice, that is a mistake, I should have said, my minister friend taught me how to articulate that last part about fear.\nSo, I ask you the same thing I asked him, he answered 1987 to 2016.  I said \"When did you stop living in fear?\"\nCan you answer that?  I can give you an exact day that I stopped living in fear."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nThat's why it's important to know whether or not we are talking about the same thing.\nThat's why we have dictionaries, lol"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nAlthough, on a side note ... Dictionaries are written by fallible humans and are not authorities in and of themselves.\nDictionaries merely tell us how society uses words!\nIf someone wants to know the root of a word, he/she must do an etymological search.\nEtymology is a fascinating study!\nBut, before we go on ... Let me try establish some basic information about your beliefs!\n\nAccording to the dictionary definition of the term \"god\", would you say that Jesus was a god?\nI don't think I agree that \"fear is the opposite of faith. Faith is about beliefs. Fear is just an emotion. Totally unrelated.\nStill trying to determine if you're a Theist or an atheist. It isn't really that hard! lol\nIf you believe in any type of dictionary definition of a god, then you are a Theist. If not, then you're an atheist.\nMany Buddhists are atheists!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nI'm not an atheist buddhism but I love the study and practice of buddhism, and I do study and practice.\nBible Gateway passage: Proverbs 8:17 - English Standard Version\nI love those who love me, and those who seek me diligently find me.\nbiblegateway.com\nSorry link isn't related.\nI agree with the last 3 definitions of god.\nThe 1st one about authority, as a scientist I must, by training, question everything including the righteous."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nSo, not the first 2 definitions?\nIf you don't believe the first two definitions, then it sounds like you're an atheist."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nNo, 2, 3, and 4\nI agree with"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nLook, this is what my moral authority just told me: \"I could spend (or waste?) a crap top of additional, precious time answering your questions and it would likely never change anything. You’re treating it like a heartless, curious thought experiment rather than taking anything I say to heart.\"  No wonder people argue about this shit, they can't even process their own damn beliefs."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nThere's only two possibilities: Theist or atheist. Everyone is either one or the other. There is no neutral zone."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nBut it's in the definition, it says (in certain other religions)"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nNone of your last statement is even remotely true. It matters alot. I don't know you and explaining to me what you believe helps me to know you better. It's a real simple question and you have done a fantastic job of dodging it. None of the things you have said define what you believe. They are nice sentiments and I pretty much agree with them. But, so what? That still doesn't tell me what the hell you believe! LOL I just want to know if I'm talking to a Theist or an atheist. Very simple, bro!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nOkay, so you say you believe in definitions 2, 3, 4. Looks like there is also a fifth. Anyhow, since you believe in #2, that makes you a Theist."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nI believe God is a superhuman being or spirit worshiped as having power over nature or human fortunes; a deity."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nFINALLY! Thank you! Then you are a Theist. Was that so hard? Haha!\nYou're right, it is a heartless question! It deals with the intellect, not the heart (emotions)."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nBut I have tons of evidence.\nI've been collecting."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nThe things you were saying regarding emotional matters are irrellevant to the intellectual discussion at hand.\n\nPeople of various religions and even no religion can express deep emotional truths. That's great and all ... But, it doesn't tell me of you believe in a invisible sky daddy or not. \n\nNow, I know!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nEvidence for a god? Is that what you mean?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nIf that is what you mean, then I would say that our emotions can deceive us. \n\nYou probably don't know this about me, but I was in Christian ministry for 18 years. I studied Systematic Theology in Bible college. I preached on stage in church. I'm quite familiar with matters of the heart (emotions). I used to be a very strong believer.\n\nThen, I started using critical thinking and tried to find empirical evidence for the god that I believed in. When I turned up empty handed, I had to be intellectually honest with myself. That's the day I became an atheist. Gods, deities, etc. are merely human concepts and there is no tangible evidence for these things."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nTo summarize, I think supernatural things happen all the time, and you think faith is the opposite of critical thinking?\nWhat if I told you empathy help you learn to read minds?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nWhat if I told you that the James Randi Foundation offered a one million dollar prize to anyone who can demonstrate supernatural abilities, this would include reading mindsb and no one ever claimed the prize?\nWhy didn't anyone ever claim the prize? Easy! Because supernatural abilities don't exist. There isn't any evidence that empathy helps read minds!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nThey died of heartbreak too soon, we didn't have the technology to track and prove it."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nSounds like you choose to believe things without scientific evidence! You're free to do as you wish as you wish, but I don't see it as very wise because it sets you up to fall for any ole scam out there!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nThis guy might be satan: \nhttps://www.youtube.com/watch?v=ja2NEfCEoJk\n10 Of The Most Dramatic Derren Brown Moments\nRelive, in no particular order, 10 of the most nail biting and, frankly, disturbing scenes from Derren's shows over the years. For more subscribe to our chan...\nyoutube.com"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nIf something is unproven, there is no need to believe in it!\nWr must rely on evidence!\nDeren Brown is awesome! He has exposed many, many scammers!\nHe and James Randi have both exposed psychic frauds!\nSee, this is why I wanted to know more about your beliefs. It reveals a lot about a person! I can clearly see that you choose to believe in woo woo for no apparent good reason.\nDoesn't sound very scientific for a scientist (I think you called yourself that).\nI'm sure you're a decent human being and all ... But, this isn't about that!\n\nThis is about beliefs and why people believe what they believe. \n\nMost of my atheist friends and I are also skeptics and we only believe things when evidence backs it up!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nWhat if I had a test method to prove it, but it takes a lifetime to prove?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nThen no one should believe in it until the time that it is proven. That's how science works!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nBut it will be too late for me.\nIsn't that sad?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nWhen the evidence is peer-reviewed and proven to be a fact, the whole world will know that it is true. Simple!"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nBut what it was easier to test now, if someone believed me?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nIn my experience and observations, supernatural things always end up having a very natural explanation."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nOk, want one?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nI find that most people who believe things without proof are quite gullible. Not always, but most of the time.\nGo for it!\nWe really should be having this discussion on my Timeline, though.\nRather than private messaging."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nWhen a person tries to take power over you: \nhttp://fortune.com/2017/11/29/libya-slave-trade/\nThere are certain ways to escape it: \nhttp://www.cracked.com/article_20504_the-5-most-badass-ways-people-escaped-from-slavery.html\nLibya Slave Trade: What You Don't Know, But Should\nAn estimated 400,000 to 1 million migrants may now be trapped in Libya.\nfortune.com\nProve to me that is not \"superhuman\""
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nYou are privileged ... I rarely respind to private messages because I get so many, mostly from foreign people wanting money or wanting to save my soul. lol"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nLook how different is the language used in those two articles.  Both of them considered historically factual, but one of them uses mystical wording.\nIt's like a very real problem is downplayed using speech.  I believe this is all a part of a mass coordinated effort that only children of God could design.  Can process improvement be considered Godly?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nI read both articles and did not see anything \"superhuman\". Many explanations could be provided and pysychic abilities isn't one of them. LOL\nI don't need to \"prove\" that it's not superhuman. You first need to prove that it IS. The one making the claim always has the burden of proof."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nOk.  I'll collect more evidence.  It will take me some time, checkin next week / month?"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nChildren of God? I don't believe in any gods, much less any \"children of God\". lol\nFeel free\nI always keep an open mind."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nhttps://www.vanityfair.com/news/2016/08/peter-thiel-wants-to-inject-himself-with-young-peoples-blood\nPeter Thiel Wants to Inject Himself With Young People’s Blood\nThe Silicon Valley billionaire reportedly sees blood transfusions as the pathway to radical life extension.\nvanityfair.com\nYou said super human, that includes living longer than a normal human."
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nHowever, if you actually produce true evidence, I'll fucking send you \n$1000.00\n!!! LOL"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Brian",
            "message": "Brian\nAnd my previously stated coordinated effort.  I just have to prove the coordination.\nhttps://m.youtube.com/watch?v=PQynVVwlcSE\nHow a mathematician dissects a coincidence\nCan you unknot a twist of fate with logic? Vox's Phil Edwards asked mathematician Joseph Mazur about his book, Fluke, and one of its most incredible stories....\nyoutube.com"
        },
        {
            "time": "2017-12-14T00:10:00.000Z",
            "from": "Nate",
            "message": "Nate\nThat's not superhuman. No. That's doing something by a natural means.\nEven the Marvel comic mutants in the X-Men series are not considered \"superhuman\". They have merely been genetically altered. Not the same thing!\nSuperhuman or supernatural would be something like the ability to fly without the use of machines. lol\nOr to walk on water."
        }
    ]
}