{
    "thread": "https://www.facebook.com/messages/archived/t/paul.prinke",
    "participants": [
        {
            "name": "Paul Prinke",
            "description": "Lives in Phoenix, Arizona",
            "url": "From Livingston, New Jersey"
        }
    ],
    "messages": [
        {
            "from": "Paul",
            "time": "2010-08-12T17:07:00.000Z",
            "message": "\nBrian... What you coding in? PHP by chance?  I am launching a company and need some help finishing my project if you would like to help.  Specific application for small to mid size call centers using sencha js suite.\n\nLet me know.\nPaul\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-12T23:48:00.000Z",
            "message": "Brian\nI am a huge fan of PHP.  Unfortunately, I will be very busy with school this fall as it is my last semester.  I may be available for the next few weeks if you need a consultant?\n"
        },
        {
            "from": "Paul",
            "time": "2010-08-12T23:48:00.000Z",
            "message": "\nLet me set up a web conference so I can show what we have and get your feedback.  We can then think about the consulting arrangement.\n\nYou available later around 7:30?\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-12T23:48:00.000Z",
            "message": "Brian\nPossibly, going to eat now, I'll keep you posted.\n"
        },
        {
            "from": "Paul",
            "time": "2010-08-12T23:48:00.000Z",
            "message": "\nlet me know, we are doing the gym thing now.  I will be available at 7:00.  Whats a good email to send web conference stuff over?\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-13T01:40:00.000Z",
            "message": "Brian\nHave friends over, can we do this during business hours tomorrow?\n"
        },
        {
            "from": "Paul",
            "time": "2010-08-13T01:40:00.000Z",
            "message": "\nNo problem... before or after lunch will work.  I work from home.\n"
        },
        {
            "from": "Paul",
            "time": "2010-08-16T13:49:00.000Z",
            "message": "\nFriday was a busy day after all.   What's your schedule look like for today?\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-16T15:18:00.000Z",
            "message": "Brian\nI am out of town this week an only have access to my phone.\n"
        },
        {
            "from": "Paul",
            "time": "2010-08-19T04:57:00.000Z",
            "message": "\nLet me know what your schedule looks like for next week or weekend.  We are moving fast and need development help.\n"
        },
        {
            "from": "Brian",
            "time": "2010-08-27T17:25:00.000Z",
            "message": "Brian\nHey, week has been hectic from getting back from vacation.  How does your 4'oclock look?  Not sure if you have moved on, but if you would like to give me a call then, my number is 614-425-6054.  Send me a development server address and some code and I will look through it, email address is bjcullinan@gmail.com.  I have a lot of experience with php security and user interfaces, so I think I can help.\n"
        },
        {
            "from": "Paul",
            "time": "2010-09-13T18:38:00.000Z",
            "message": "\nwhats this week look like?  I had to fire my manila developer.\n"
        },
        {
            "from": "Brian",
            "time": "2010-09-13T18:38:00.000Z",
            "message": "Brian\nI should have time around 2 today, and more time the rest of the week.  I work at the helpdesk so I can talk but I have to occassionaly answer calls and help people, should we start with a phone meeting and then talk over instant message and email?\n"
        },
        {
            "from": "Paul",
            "time": "2010-09-14T15:30:00.000Z",
            "message": "\nI got super busy yesterday... What does your afternoon look like today.  I have a 1 hour call at 12 and at 3.  Maybe we can fit something in between?\n"
        },
        {
            "from": "Brian",
            "time": "2010-09-14T15:30:00.000Z",
            "message": "Brian\nSounds good to me.  12 to 3 works.\n"
        },
        {
            "from": "Paul",
            "time": "2010-09-14T20:19:00.000Z",
            "message": "\nIm still on crazy calls now... alittle after 3:00 work for you?  Whats a good number?\n"
        },
        {
            "from": "Brian",
            "time": "2010-09-14T20:19:00.000Z",
            "message": "Brian\nUnderstandable.  After 3 should be fine also.  928-315-1123\n"
        },
        {
            "from": "Brian",
            "time": "2010-09-14T22:37:00.000Z",
            "message": "Brian\nHey,\nJust so you have this somewhere you can look it up:\n\nvoice: 928-315-1123\ncell: 614-425-6054\ngtalk: bjcullinan@gmail.com\naim: bjcullinan\nmsn: bjcullinan@live.com\n"
        },
        {
            "from": "Brian",
            "time": "2010-09-14T22:37:00.000Z",
            "message": "Brian\nAlso, if you are interested in taking a look at my project, it can be found at: http://media.bjcullinan.com/.  It's constantly in the works, but that is the latest revision.  Username: admin password: tmppass for viewing the administration section.\nSelect Files : Brian's Media Website\nmedia.bjcullinan.com\n"
        },
        {
            "from": "Brian",
            "time": "2010-09-27T00:26:00.000Z",
            "message": "Brian\nPaul,\nI haven't seen an e-mail from you, I take it you have been busy.  I hope you can find time to get me some code this week and I can begin auditing and helping you implement a security model like OWASP.  Let me know.\n-Brian\n"
        },
        {
            "from": "Brian",
            "time": "2010-11-15T07:15:00.000Z",
            "message": "Brian\nHey,\n\nHaven't heard from you in a while, I take it you have been busy.  The end of the semester is coming up in a month and there will be some grace period before I can find a full time job.  I am wondering if you would like to work together.  As I mentioned before, I like the Javascript technology you have been working with.  I think I could contribute a lot to you team and fully implement a security model.  I would be happy to forward you my resume, what e-mail address do you prefer?  Let me know what's going on.\n\n-Brian\n"
        },
        {
            "from": "Paul",
            "time": "2010-11-19T18:10:00.000Z",
            "message": "\nHey Man... sorry, been busy as hell.  We are in the open enrollment portion of call center world right now and OPSTEL has taken a bit of a shift to satisfy a partner need.  Do you think NAU Helpdesk might be interested in a dashboard/reporting/OI solution?  \n\nI am definitely interested in your help, especially once we land a deal!  Probably looking at possible contracting opportunity, then lead into employment depending on how quick we get rolling.\n\nThree Areas I think you can help:\n- Javascript json profile layout saved to database on update or change\n- Password Security -> Might be going a hosted solution and will need a robust security level\n- PHP to crop an animating GIF from http://radar.weather.gov/ridge/Conus/Loop/\n\nSend me your resume, I'll share it with my partner.\n\nThanks Brian\n"
        },
        {
            "from": "Brian",
            "time": "2010-11-19T19:29:00.000Z",
            "message": "Brian\nHere at engineering we use OTRS and Nagios for our call center needs.  I'd like to see some documents of features and I can recommend your software if it looks like something we would use.\n\nMy resume can be found here:\nhttps://bjcullinan.com/Share/Documents/Applications/Brian%20Cullinan.pdf\n\nI look forward to hearing from you.\n"
        },
        {
            "from": "Paul",
            "time": "2010-11-22T22:36:00.000Z",
            "message": "\nDocumentation is on our website.  http://www.OpsTelServices.com.  We are still adding more content.  If you think the Contact Center could beenfit from the solution, let me know. We can setup a demo.\n\nPaul\n"
        },
        {
            "from": "Brian",
            "time": "2010-12-03T23:24:00.000Z",
            "message": "Brian\nSounds good.  Please give me a call after the meeting Monday and fill me in.  I actually just worked through an interesting problem last night, I added SSL authentication to my media server project and the browser wasn't obeying the \"secure\" flag set on the cookie which prevents it from transporting cookies over non-SSL connections.  My site is now completely compliant with rules A3 and A9 defined by OWASP http://www.owasp.org/index.php/Top_10_2010-Main.\n\nI would be happy yo write you an authentication system or at least a template of code for you to use in your projects.\nTop 10 2010-Main - OWASP\nAttackers can potentially use many different paths through your application to do harm to your business or organization. Each of these paths represents a risk that may, or may not, be serious enough to warrant attention. Sometimes, these paths are trivial to find and exploit and sometimes they are e\nowasp.org\n"
        },
        {
            "from": "Paul",
            "time": "2010-12-03T23:24:00.000Z",
            "message": "\nSounds good.  I just sent you a Google Docs share.  Where I am going to post development tasks.\n"
        },
        {
            "from": "Paul",
            "time": "2011-11-11T01:00:00.000Z",
            "message": "\nDude... do you know of any good PHP Encryption or Encoders to protect the source?\n\n"
        },
        {
            "from": "Brian",
            "time": "2011-11-12T09:14:00.000Z",
            "message": "Brian\nYou're looking for a PHP obfuscator such as http://www.zend.com/en/products/guard/.  Most languages have obfuscators, but consider, rather than encrypting your code, include the source code in your business model.  A developer may want to contribute to the code, but a regular client cannot re-sell the code for profit that doesn't also benefit you.  You should find a boutique that can write you a custom EULA, this goes for about $1500, but is well worth it.  PHP is open, inherently.  There are solutions that don't include \"encryption\".  http://stackoverflow.com/questions/336057/best-solution-to-protect-php-code-without-encryption\nPHP Encode Your Application to Protect Your Code with Zend Guard - Zend.com\nDownload Zend Guard, the most widely accepted PHP encryption product on the market that encodes your PHP code and protects your PHP applications from unlicensed use and reverse engineering.\nzend.com\n"
        }
    ]
}