{
    "thread": "https://www.facebook.com/messages/t/ryan.raub",
    "participants": [
        {
            "name": "Ryan Raub",
            "description": "Software Engineer at RetailMeNot",
            "url": "Former Sr. Systems Programmer at Arizona State University"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2011-09-10T22:45:00.000Z",
            "message": "Brian\nHey, what have you been up to since you moved back?\n"
        },
        {
            "from": "Ryan",
            "time": "2011-09-10T22:45:00.000Z",
            "message": "\nbusy with this and that, u?\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-10T22:45:00.000Z",
            "message": "Brian\nyeah same.\nDo you still brew?\n"
        },
        {
            "from": "Ryan",
            "time": "2011-09-10T22:45:00.000Z",
            "message": "\nyeah, actually im looking at beer recipes now\nhows Phoenix treating you?\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-10T22:45:00.000Z",
            "message": "Brian\nI would love to learn how to do that.\nPretty good, I have a nice two bed / two bath place in Scottsdale.  I love my job.  I get to do pretty much whatever I want.  I work with really smart and healthy people.\nWhere are you working?\n"
        },
        {
            "from": "Ryan",
            "time": "2011-09-10T22:45:00.000Z",
            "message": "\nnice!\ni'm working at ASU, and its going rather well also\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-10T22:45:00.000Z",
            "message": "Brian\nAwesome!\nWe should meet up sometime for a drink or w/e.\n"
        },
        {
            "from": "Ryan",
            "time": "2011-09-10T22:45:00.000Z",
            "message": "\nyeah, and i can show you the beer brewing stuff\nits all at Steve's house\n"
        },
        {
            "from": "Brian",
            "time": "2011-09-10T22:45:00.000Z",
            "message": "Brian\nYeah, I need to make it over there sometime.\n"
        },
        {
            "from": "Ryan",
            "time": "2011-09-10T22:45:00.000Z",
            "message": "\ntotally\nalright I gotta run, i'll ttyl dude\n"
        },
        {
            "from": "Brian",
            "time": "2014-04-22T05:26:00.000Z",
            "message": "Brian\nAfter working in the field for a few years, do you feel like you could have made that arcade box in a weekend?  I remember how we idolized Murphy.  My company StudySauce is about to finish a semester with a Capstone team at ASU and it reminded me of all the work we did in school.\n"
        },
        {
            "from": "Ryan",
            "time": "2014-04-22T15:48:00.000Z",
            "message": "\nAre you working with undergraduates at ASU? It is amazing what years of experience equates to.\n"
        },
        {
            "from": "Brian",
            "time": "2014-04-22T21:10:00.000Z",
            "message": "Brian\nYes.  It's awesome.  I have a couple of projects on the side I am working on.  I am attaching a green house to the side of my house that I want to automate with solenoid valves, raspberry pis, and quad-copters.  It will grow enough spring flowers for the whole neighborhood hopefully.\n"
        },
        {
            "from": "Brian",
            "time": "2014-04-22T21:10:00.000Z",
            "message": "Brian\nI just hooks a pool filter up to a fish tank.  I meant to ask you how your fish tank survived, are you still using it?  I've become quite the blissfully ignorant enthusiast.  7 days and the water is still crystal clear, it might be overkill.\n"
        },
        {
            "from": "Brian",
            "time": "2014-04-22T21:10:00.000Z",
            "message": "Brian\nI have designed a hot tub that I want to build from the mold up, it will be like an above ground jacuzzi that has been sunk 4 feet.  The water will come right up to the rim and sand.  It's amazing what you can save by ordering materials online.\n"
        },
        {
            "from": "Ryan",
            "time": "2014-04-22T21:10:00.000Z",
            "message": "\nSounds like a fun project! I kinda quit the aquarium hobby, got too pricy and maintenance was teadious.  I still have a bunch of fish tank pumps and filters that I've been looking to get rid of.\n"
        },
        {
            "from": "Brian",
            "time": "2014-04-22T21:10:00.000Z",
            "message": "Brian\nYeah, I bet.  The filters you get from retail stores are crap.  The sand at the bottom is the worst.  It holds too much water and therefore algae.  I added little glass marbles offset from the bottom with some mesh wire.  Then I routed a siphon underneath the glass beads to a big sand filter.  It cycles the entire tanks water like 4 times every day. Do you have any glass you want to sell me?\n"
        },
        {
            "from": "Ryan",
            "time": "2014-04-22T21:10:00.000Z",
            "message": "\nI have a 15 gal I think that I was using for a Refugim (below the main tank) that has some plexiglass sections in it. I also have some aquarium sealant which is good for building water tight joints. You can have any of it if you want it.\n"
        },
        {
            "from": "Brian",
            "time": "2014-04-22T21:40:00.000Z",
            "message": "Brian\nI basically tried to make a huge version of this: https://www.kickstarter.com/projects/930441187/noclean-aquariumstm-self-cleaning-aquarium-for-bet\n"
        },
        {
            "from": "Brian",
            "time": "2014-04-22T21:40:00.000Z",
            "message": "Brian\nhttps://www.facebook.com/photo.php?fbid=10100676540010468&set=a.581359923168.2142189.27705471&type=1&theater\n"
        },
        {
            "from": "Ryan",
            "time": "2014-04-27T06:07:00.000Z",
            "message": "\nNice, however nothing is ever that maintenance free.. Still a good system. Here's that tank I was telling you about\n\n"
        },
        {
            "from": "Brian",
            "time": "2014-04-29T20:43:00.000Z",
            "message": "Brian\nWoah cool, it looks like you literally built your own sand filter.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-02T15:30:00.000Z",
            "message": "Brian\nI completely lost my mind last week. You always stood our as someone I admire because you seem to have all your crap figured out. I appreciate you.\n*stood out\n"
        },
        {
            "from": "Ryan",
            "time": "2016-10-02T15:30:00.000Z",
            "message": "\nIt's been a while since we've hung out, we should probably organize a dinner sometime to catch up. Thanks for the kind words, it's nice to have friends nearby.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-02T15:30:00.000Z",
            "message": "Brian\nI agree. Thank you for checking in.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-09T05:26:00.000Z",
            "message": "Brian\nI am sending you this because I have a high regard for your intelligence. I need to speak with you an Matthew Shanker at the same time. I have a test procedure. Pretend you are my DevOps. I will pretend to ask you the most absurd question I can think of to appeal to the most important thing I know about you. I need your trust. If Jesus appeared to you today, is there too much noise on the internet for him to be heard? Do you understand where I am going with this? Communication is key. \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T14:53:00.000Z",
            "message": "Brian\nHmm, too complicated.  How to DevOps think about Sales and Marketing?  Studying one discipline at a time isn't enough.\n"
        },
        {
            "from": "Ryan",
            "time": "2016-10-12T23:57:00.000Z",
            "message": "\nYeah sorry I wasn't sure quite what you were asking. I'm not the most knowledgeable about marketing, but I think there is quite a bit of room for automation there.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T23:57:00.000Z",
            "message": "Brian\nI agree!  But what about the noise?\nThere is so much hate on FB, what can we do to fix it?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T23:57:00.000Z",
            "message": "Brian\nWhen I get the job at PNNL I will change my status to Supreme Being at Earth.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-17T18:29:00.000Z",
            "message": "Brian\nI am sorry for that time I tried to charge you money for a video card, computers are useless to me now.\n"
        },
        {
            "from": "Ryan",
            "time": "2016-10-17T20:35:00.000Z",
            "message": "\nI don't recall a video card exchange.. could you be thinking of someone else\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-17T20:35:00.000Z",
            "message": "Brian\nNope, it was you.\nI had a spare.\nMaybe it was Steve.  90% sure it was you though.\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-11T23:07:00.000Z",
            "message": "Brian\nI need to know more about big data.  Recommendations?\n\n"
        }
    ]
}