{
    "thread": "https://www.facebook.com/messages/t/ryan.raub",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "Brian",
            "message": "Brian\nThere is so much hate on FB, what can we do to fix it?\n",
            "time": "2016-10-13T00:19:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nWhen I get the job at PNNL I will change my status to Supreme Being at Earth.\n",
            "time": "2016-10-13T00:19:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nI am sorry for that time I tried to charge you money for a video card, computers are useless to me now.\n",
            "time": "2016-10-17T18:29:00.000Z"
        },
        {
            "from": "Ryan",
            "message": "\nI don't recall a video card exchange.. could you be thinking of someone else\n",
            "time": "2016-10-17T20:35:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nNope, it was you.\nI had a spare.\nMaybe it was Steve.  90% sure it was you though.\n",
            "time": "2016-10-17T20:35:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nI need to know more about big data.  Recommendations?\n",
            "time": "2016-11-11T23:07:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nSo, I'm sure your busy thinking about the new baby.  That is awesome!  Iga and I are on the fence but at least talking about it.  I wanted to ask you since I don't know a lot of people working in the same industry.  Leah messaged me about a year ago and then blocked me right after, but she said she \"Left the software industry\" and I couldn't understand why?  What am I missing?  Other people save up their big payouts and go on vacations.  Is women in tech really as bad as the media says?  Does technology move so quickly that by the time it's fun it is already obsolete?  Am I too vested in the business outcome and completely missing out on a life passing me by?  A year ago when I got laid off, I wanted to quit and find something else to do, like growing flowers.  Where are you at with this?\n",
            "time": "2017-10-03T18:10:00.000Z"
        },
        {
            "from": "Ryan",
            "message": "\nSexism is still rather rampant in this industry, I’ve seen it first hand and heard too many stories.\n",
            "time": "2017-10-03T19:23:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nLame.  I've heard stories, but never witnessed it.\n",
            "time": "2017-10-03T19:23:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nlol? https://twitter.com/megamindbrian/status/917879392935731200\nBrian on Twitter\n“@lambdatips Here's a tip for you. Fix your stuff!”\ntwitter.com\n",
            "time": "2017-10-11T00:14:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nI send Jeff Bezos an email every single day asking for CEO advice.\n",
            "time": "2017-10-11T17:55:00.000Z"
        },
        {
            "from": "Ryan",
            "message": "\nHas he ever replied?\n",
            "time": "2017-10-12T02:32:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nI know it has been forwarded to support.  Not personally yet.  I asked him to admit that he doesn't know everything.  World's first denial of Bezos attack.  \n",
            "time": "2017-10-12T15:46:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nQ: Why did Billy go out with a prune?\nA: Because he couldn't find a date!\n",
            "time": "2017-11-13T00:40:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nQ: Why was everyone so tired on April 1st?\nA: They had just finished a March of 31 days.\n\n",
            "time": "2017-11-14T23:01:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nI'm thankful for you!!\n",
            "time": "2017-11-23T18:28:00.000Z"
        }
    ]
}