{
    "thread": "https://www.facebook.com/messages/t/scott.johnson.31149359",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "Brian",
            "message": "Brian\nI don't.  I am actually minus a computer right now because the hardware I do have is so out of date.  I have a tuner that you could have, but you would still need a separate video card.  Probably is, this box won't be able to support any cable channels like ESPN or HBO.  You would still need to buy a box from the cable company.  There are some great set-top boxes out there already such as Boxee.  But we will see some big changes in the coming months because TV stations have actually started to encrypt channels.  So you have to subscribe, your box authenticates (who know when support for that will catch up to the market), then your box can decrypt the channel.\n",
            "time": "2012-10-19T20:39:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nI overcome this by settling for never watching \"Live\" television and I download all of my TV shows off of News Groups alt.binaries.*\n",
            "time": "2012-10-19T20:39:00.000Z"
        },
        {
            "from": "Scott",
            "message": "\nWell I figured it out.  Didnt actually need a video card.  The one I had has a DVI out which should work just fine.  Ended up buying a new tuner that can get over the air HDTV.  Just waiting for my newegg box to be delivered.\n",
            "time": "2012-10-21T16:45:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nDo you want to get together and some see our petting zoo?\n",
            "time": "2015-06-15T16:15:00.000Z"
        },
        {
            "from": "Scott",
            "message": "\nHuh? You have a petting zoo?\n",
            "time": "2015-06-15T16:15:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\n2 dogs a big and 3 fish and soon another dog and a snake\n*a bird\n",
            "time": "2015-06-15T16:15:00.000Z"
        },
        {
            "from": "Scott",
            "message": "\nNo chickens.?\n",
            "time": "2015-06-15T16:15:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nnot yet.  they are illegal unless you get written consent from all your neighbors within 80 feet. https://www.animallaw.info/local/az-phoenix-chapter-8-animals#s7\nAZ - Phoenix - Chapter 8 - ANIMALS. | Animal Legal & Historical Center\nPrimary Citation: Chapter 8 Jurisdiction Level: Arizona Last Checked: May, 2012 Summary: The following comprises Phoenix, Arizona's animal-related ordinances. Topics include the keeping of reptiles or wild animals, vicious animal provisions, and sections addressing animal cruelty. An entire artic…\nanimallaw.info\nOur neighbors have them and the black flies are awful all over.\n",
            "time": "2015-06-15T16:15:00.000Z"
        },
        {
            "from": "Scott",
            "message": "\nWe love ours. We have 5\n",
            "time": "2015-06-15T16:15:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nyeah Iga's mom raises like 30 so we get the benefit of the eggs without any of the work.  It's amazing.\n",
            "time": "2015-06-15T16:15:00.000Z"
        },
        {
            "from": "Scott",
            "message": "\nThat's the best way to go. 30 is alot. But now with the bird flu..\n",
            "time": "2015-06-15T18:13:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nQ: What did one elevator say to the other elevator?\nA: I think I'm coming down with something!\n",
            "time": "2017-11-14T23:21:00.000Z"
        },
        {
            "from": "Scott",
            "message": "\nOk...?\n",
            "time": "2017-11-14T23:21:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nHow often would you like a joke?\n",
            "time": "2017-11-14T23:21:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nI'm thankful for you!!\n",
            "time": "2017-11-23T17:46:00.000Z"
        },
        {
            "from": "Scott",
            "message": "\nI am thankful for cds too\n\n",
            "time": "2017-11-23T02:09:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nLiving the dream? Mm\n",
            "time": "2017-11-23T02:09:00.000Z"
        }
    ]
}