{
    "thread": "https://www.facebook.com/messages/t/stein.wahl?filter=unread",
    "participants": [
        {
            "name": "Stein Wahl\n(Cid)",
            "description": "Prisoner at Weyland-Yutani Corporation \"Building Better Worlds\"",
            "url": "Xenomorph at LV-426"
        }
    ],
    "messages": [
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\nindeed ... may i ask you why you want to  friend me ?"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Brian",
            "message": "Brian\nI'm divergent too."
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\nexplain to me  what that means  i have seen the movies   so i get it\nbut i would like to see your p o v\nPoint Of View"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Brian",
            "message": "Brian\nYeah, I just relate the movies back to brainstorming: \nhttps://www.cleverism.com/idea-generation-divergent-vs-convergent-thinking/"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\nahh yes well i do belive that some  of us are  different\nas in one who doesnt think as the mere mortals"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Brian",
            "message": "Brian\nBut specifically related to the post on beatings, I don't tend to fall in line easily or trust easily.  I think that is the cause."
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\nfor you and i    \"I am mortal and i know it \"\nmere mortals are those who think there is some specail place when they recycle\nif they would read more  than one  book  written by some cave dwelling pedophile\nand that   particular reference applies to all theism\nif you want to brains trom  well lest figure out a way to  teach a man to fish  so to sepak\nspeak  not sepack\neg see with thier own eyes the flaw in thier logic as opposed to forcing our clear and untainted pov\nim sure you must understand  where i am coming from\never sen pac rim ?\nthen you can \"catch my drift \""
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Brian",
            "message": "Brian\nI thought that movie was good, looking forward to the second."
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\nagreed\nbut the old school term of  do you catch my drift\nis where they got the idea\ncatch my drift is  two minds as one      of the same thought  process\nhere is an example\nif we had a mutual friend we both cared about as they were a good person\nand then we find out they were horrribly wronged\none or the other could say  well  we should go pursuade somone not to do that again  to our  freind ....   catch my drift"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Brian",
            "message": "Brian\nhttp://www.word-detective.com/2010/03/drift-catch-my/\nWhich friend?"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\ndoesnt matter\nany freind   lets jsut say that happened\nthe phrase catch my drift is   tow of a like mind\ntwo\nmeaning instead of saying  this dude raped our friend  lets go fuck hism up  to teach him a lesson"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Brian",
            "message": "Brian\nvengeance is the only justice, batman taught me that."
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\nvenegnce  is best served both cold  and without knowlage of source\nall they can have  is the suspicion\none must not be tired to  it\ntied\nthe  idea is to instill a sence of fear   and intimidation\njsutice  but without direct involvment\nwell   semi direct\nbut as far as the rest of the world is aware\nmake the vengence appear as karma\nhehe  remeber loosers  scum  evil eople arent very bright"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Brian",
            "message": "Brian\ninteresting \"make the vengence appear as karma\"\nI'm saving that."
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\nno  you keep that to yourself\ni mean it\nor no more words of wisdom  for you\nthat is for YOU  and for YOU alone\nyou can thik it  but you may not speak it"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Brian",
            "message": "Brian\nSure. I keep a journal.\nMy wife will love that."
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\nya well you msut  use an encrypted journal then"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Brian",
            "message": "Brian\nGoogle calendar?"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\nno\ntemp  word file then send to a storage device"
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Brian",
            "message": "Brian\nI think you are a genius."
        },
        {
            "time": "2017-12-06T01:54:00.000Z",
            "from": "Stein",
            "message": "Stein\nthat is isolated from all other\nthen delete all other  copies on your machine every day\nin word its easy\nor even a pdf form to make it more of a pain in the ass   for others to open\nbut always to a removeable media storage device\nthis is vital for personal thoughts and securities\nif you wish to keep them in case you need to review them\nthey must be as secure as that   withn your own mnd\ndo you understand\ni want your next response to condense all i said  with application to you  in short form\nif you dont get it right i will correct you  but  i always give a person a shot to do it on thier own"
        }
    ]
}