{
    "thread": "https://www.facebook.com/messages/t/stephen.baier",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "Stephen",
            "message": "\nWe are at that point were we used to go really fast and now we have a lot of spaghetti.\nOur object model is spaghetti\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nI specifically went there to learn corporate America. I had an offer for more money to work for mindspree.com a tutoring startup. I kind of wish I took that instead.\nMindSpree\n“MindSpree and my tutor Sarah helped me ace the SAT and get into the Barrett Honors College at Arizona State University. Now I’m a business major, and I still use MindSpree to find tutors for some of my more difficult classes. I’m even thinking about becoming a MindSpree tutor myself so I can help s...\nmindspree.com\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Stephen",
            "message": "\nWe are hiring if you like Denver.\nData sciences, platform engineer, internal tools\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nGoogle is a lot of spaghetti? They always did seem like the types to tack on an API at the end, must be why they are constantly shutting down projects and starting new ones.\nI really like the sound of DevOps but it is hard to explain to people what it is for. Just some new buzz word.\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Stephen",
            "message": "\nNo, my new place is spaghetti\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nOh sure. It happens.\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Stephen",
            "message": "\nIt's not terrible, I have seen worse; but its hard to evolve.\nThe main problem relies in reporting.\nI can change the system to add a new feature in a few hours or days, depending on the scope; but figuring out the downstream reporting impacts for that is hugely time consuming.\nI spent a two weeks figuring out what revenue was and how we derived it.\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nYeah that is tough. Looks highly advertising based?\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Stephen",
            "message": "\nSimilar business model as Google, revenue is advertising, customer benefit is cash back (whereas Google provides free services).\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nOne of our fellow hackers works for Snap Inc. and loves it. Good to catch up, I have to go to sleep and go deal with these meetings at 5:30 am. Cheers!\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Stephen",
            "message": "\nCheers\n",
            "time": "2018-01-13T05:57:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nQ: What's the difference between a TV and a newspaper?\nA: Ever tried swatting a fly with a TV?\n\n",
            "time": "2017-11-14T05:41:00.000Z"
        }
    ]
}