{
    "thread": "https://www.facebook.com/messages/t/steve.arcas",
    "participants": [
        {
            "name": "Steve Arcas",
            "description": "From Torrance, California",
            "url": "Followed by 49 people"
        }
    ],
    "messages": [
        {
            "from": "Steve",
            "time": "2008-11-15T07:37:00.000Z",
            "message": "\ndude i'm excited you're finally coming to my house! \n\nI don't have my schedule yet but I have worked every sunday at Sears since I got the job... We close at 6pm and I get home about 6:30ish. Just telling you cause I told you to call me when you get back into town so if I don't answer before 6 its because I'm at work.\n\nSee you then,\n~Steve\n"
        },
        {
            "from": "Steve",
            "time": "2008-12-02T14:19:00.000Z",
            "message": "\nHey I'm just kinda curious what this means... \"Brian is in a relationship with a girl that is not in a relationship with him.\" Hopefully has nothing to do with Crystal or Elyse...\n\nSee you Thursday if you're drinking my tequila..\n"
        },
        {
            "from": "Brian",
            "time": "2008-12-02T17:39:00.000Z",
            "message": "Brian\nHey,\nDon't worry man, Elyse is fully committed to seeing your relationship through.  Crystal met another guy at Ithaca, and she has been on this search for God.  She wants me to wait for her to decide if our relationship is right.  I have tried to be supportive and loving, but I can't be with someone that isn't attracted to me anymore, so we decided to just put things on hold until winter break.  As you can see my relationship status is also Single.  See you Thursday!\n"
        },
        {
            "from": "Steve",
            "time": "2008-12-02T19:40:00.000Z",
            "message": "\nShit man, that sucks. I don't have any work this week, only school stuff, so let me know if you want to hang out before thursday and have man talk or whatever, if you want to talk or whatever. \n\nTruly sorry man, ttyl\n"
        },
        {
            "from": "Brian",
            "time": "2008-12-04T20:55:00.000Z",
            "message": "Brian\nHow did it got last night!?  Here is the address to my blog: http://www.bjcullinan.com See you tonight!\nBrian J Cullinan’s Project Blog\nThis week I collected an article from a valued friend, and respectable employer. Assistant Vice President of EBSCO Industries, Roger Rohweder, explains his experience with hiring employees and how one can appeal to the employer and acquire the job they are looking for.\nbjcullinan.com\n"
        },
        {
            "from": "Steve",
            "time": "2008-12-04T23:25:00.000Z",
            "message": "\nLast night went well, this morning even better, even though I missed both my morning classes and didn't finish my paper \n\nNice blog, i'll keep up on it.\n"
        },
        {
            "from": "Brian",
            "time": "2008-12-04T23:25:00.000Z",
            "message": "Brian\nHot...\n"
        },
        {
            "from": "Brian",
            "time": "2009-01-07T23:37:00.000Z",
            "message": "Brian\nHey,\nThe keys are at http://www.bjcullinan.com/Share/Software/Media/Rippers/SlySoft/\nLet me know how it works.\nwww.bjcullinan.com\nbjcullinan.com\n"
        },
        {
            "from": "Steve",
            "time": "2009-01-07T23:37:00.000Z",
            "message": "\ncool thanks man i'll try it out. I'm going to try to update my sata / bios / chipset drivers and see if that helps. later\n"
        },
        {
            "from": "Steve",
            "time": "2009-02-19T04:05:00.000Z",
            "message": "\nYo. Its been a while since we really talked, I've been wondering how things are going... Yesterday my grandma died and I've been dealing with that lately, she got cancer so my family saw this coming a while ago but it still sucks. So anyway this weekend Elyse and I are going to Phoenix cause she has to work anyway and I'm going to be with my family; so we'll unfortunately both be missing the costume party. But after that we should get together, maybe just you and me and we can talk about stuff if you are up for talking or whatever. \n\nHave a fun party this Friday, let me know\n~Steve\n"
        },
        {
            "from": "Brian",
            "time": "2009-02-20T17:27:00.000Z",
            "message": "Brian\nHey man, we should definitely hang out.  Give me a call sometime!\n"
        },
        {
            "from": "Steve",
            "time": "2009-10-06T19:15:00.000Z",
            "message": "\nYo, we are planning on making our army costumes at Ryan's place sometime this weekend... \n\nWe are still figuring out some of the details but I believe we have most of the concept and just need to attempt building at this point.\n\nYou should come and make a green army guy costume!\n\n"
        },
        {
            "from": "Brian",
            "time": "2009-10-27T06:01:00.000Z",
            "message": "Brian\nBrownies?  Also, find two people to go with me and I will pick them up.  This is because if I am bringing stuff, I should be a little behind the vans since you guys will probably get a little more thorough inspection.  Call me tomorrow?\n"
        },
        {
            "from": "Steve",
            "time": "2009-10-27T06:01:00.000Z",
            "message": "\ni call you tomorrow\n"
        },
        {
            "from": "Brian",
            "time": "2010-01-12T20:44:00.000Z",
            "message": "Brian\nHmm, I'd only be gaining 1 PCI slot.  It would be able to support the drives I have now, but still no room for expansion...  How much would you want for it?\n"
        },
        {
            "from": "Steve",
            "time": "2010-01-28T21:02:00.000Z",
            "message": "\nyo I still got your motherboard, why don't you come over friday night or we can meet this weekend and you can see my new place and I'll give you the mobo...\n\ngimme a call tomorrow or write me back\n\nlater\n"
        },
        {
            "from": "Steve",
            "time": "2011-12-28T22:01:00.000Z",
            "message": "\nHeh was going to post this under your current pic on your wall but wasn't sure she'd like it... \nDamn, what a hottie!\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-29T01:08:00.000Z",
            "message": "Brian\nOh, Jen?  Yeah, I like her a lot, but I don't know how she feels about me.\n"
        },
        {
            "from": "Brian",
            "time": "2011-12-29T01:08:00.000Z",
            "message": "Brian\nI have a 1-hitter for Jared.  It's ceramic too.\nIt's been so long since I have smoked or drank.\nMellow Mushroom for pizza and beer tomorrow night?  Say 7:30?\n"
        },
        {
            "from": "Steve",
            "time": "2011-12-29T03:52:00.000Z",
            "message": "\nPerhaps.. It depends on when elyse arrives; i have to pick her up from the airport tomorrow night and she hasn't gotten back to me yet. I'll let u know\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-02T14:31:00.000Z",
            "message": "Brian\nI completely lost my mind last week from too much internet. What have you been up to? Any awesome music festivals in your near future?\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-02T17:23:00.000Z",
            "message": "\nHey man! Actually your timing is a little off, we just finished our music festival season last weekend, things are winding down across the country. However, we will probably have a crazy awesome party for Halloween and it'd be great if you could come out! Otherwise, there is this event on Nov 23 called \"FK A Genre\" that I'm likely attending. Cheers!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-02T17:23:00.000Z",
            "message": "Brian\nThank you. I would love to cookout and party. Work kept me tied up in a cave for 6 years\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-02T17:23:00.000Z",
            "message": "\nHaha wow well let me know! If you don't hear from me then hit me up and I'll respond as fast as I can!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-10T02:48:00.000Z",
            "message": "Brian\nIs this information pertinent to you? https://en.wikipedia.org/wiki/Upekkha\nUpekkha - Wikipedia, the free encyclopedia\nUpekkhā (in Pali: upekkhā ऊपेक्खा; Sanskrit: upekṣā उपेक्षा), is the Buddhist concept of equanimity. As one of the Brahma Vihara (meditative states), it is a pure mental state cultivated on the Buddhist path to nirvāna.\nen.wikipedia.org\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:19:00.000Z",
            "message": "\nYea so it took me a while to respond because I was out of town and had not heard of this term - I wanted to take my time looking it up. Sounds great! Yes I would say I'm striving to be more equitable \nI don't know much about Buddhism (this term Upekkha included, I had never heard of it before), but everytime I read more or someone sends me info about a concept, Buddhism sounds more and more appealing...\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T21:19:00.000Z",
            "message": "Brian\nOne time you told me in Central Union that you were buddhist.\nI have a friend that is buddhist and he's really special.\nAnywho, I've thought of something amusing I wanted to tell you.  Can a troll be positive?  Or is it always negative?\nI'm trolling people with compliments.\nYou are an awesome dude.\n\nBut with less jaundice.\nI applied for Pacific Northwest National laboratory.  That's the only job I can really get excited about.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "Brian\nI applied for Pacific Northwest National laboratory.  That's the only job I can really get excited about.\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "\nYea so from what I've been seeing, it looks like you're seeking something which I know a little about - perhaps you could gain by reading some philosophy. But anyways trolling, by definition, is negative. But of course language is fluid and changing all the time. I would claim it is more accurate to say you are \"actively and perhaps aggressively complimenting and attempting to provoke conversation through social media\", to which I am unsure if there is a word to describe this action, but \"trolling\" seems off. Philosophy strives to find the most accurate word for the occasion, so this is what I am doing \n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "\nFor the record, your strategy/method to invite conversation is probably not going to find the most success, just because people are very choosy about how things appear. Whateves, I don't mind though!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "Brian\nInsightful.  I've always had high regard for your intellect.  This thing you said about \"trolling\" not being the right word because I know certain people that we both know who enjoy throwing that word at me.  I wonder if I will be able to convince them otherwise.  What could possibly be going on?\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "\nThanks man, its definitely good to hear from you, I've changed a lot! I don't think of myself as buddhist since I'm so ignorant about it but I've always admired. Good luck to you working at PNN, I'll have to research that and see what it's all about!\nTo answer your above question:\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "\nwell, idk if you can change people's minds, that's a separate issue. But you can change the medium... Person to person conversation is always better than text (like this conversation) since there is more context and therefore more information flow (e.g. non-visual feedback, hand motions, etc). Also you've been off the map for a bit and while that doesn't bother me, it can be strange for others to acclimate, so they may need some time to get used to you again.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "Brian\nI've been searching for answers.  I am fading in and out of existence.\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "\nhmm ok.. like you are depressed? Or merely looking for a change?\nI'd be willing to bet your physical body is pretty stable\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "Brian\nAlways looking for change, hence the conversation.\nInteresting, so my existence in your mind extends into the physical world.  This is all new to me.\nHow can you tell you aren't talking to an AI?\nhttp://www.theverge.com/a/luka-artificial-intelligence-memorial-roman-mazurenko-bot\nWhen her best friend died, she used artificial intelligence to keep talking to him\nWhen the engineers had at last finished their work, Eugenia Kuyda opened a console on her laptop and began to type. “Roman,” she wrote. “This is your digital monument.” It had been three months since Roman Mazurenko, Kuyda’s closest friend, had died. Kuyda had spent...\ntheverge.com\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "\nHeh well I don't need to make that assumption! It doesn't matter if you're AI or not, I'm just concerned for your well being \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "Brian\nAwww, that is very kind.  I appreciate that.  I am thinking to move to Flagstaff or Portland, we should have a party before next year.  Hmm, or maybe during the transition of this year to the next.\nI am actually fine, I am just ahead of my time.\nSee, I've started journaling and tracking my to-do list using Google calendar.\n\nThat red spot is you\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "\nHahaha that's hilarious! Glad you penciled me in!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "Brian\nCrystal said she did this for a while.  Validation!\nlol\nI'll know if it works in a month.\nI realized something.  I need friends like you.\nReason is, if friends and kindness helps me be successful, I can prove every opportunity that led me to a path of success was not a coincidence.  I've been tracking coincidences so at some future point I can realize the impact.\nJust trying to start a conversation.  I recorded that part you said about trolling.  That seems important to me.\nMaybe I will start with a compliment instead of end with a compliment.\nlol, tell me if you hear about my compliment and it makes you laugh.\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "\nYa, friends are important (Reference: Aristotle)! Cool well I'm about to head out so don't take any silence from my part personally, my work requires me to be present and absence in blocks. But I will reply when I can \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "Brian\nHow is Elyse?\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "\nHaha ok Brian, try both and I'll let you know!\nYa she's good, we've been dating other people for a year now. But her and I are on really good terms, we talk all the time and work together too\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "Brian\nEveryone is on there way out, I won't take it personally \n"
        },
        {
            "from": "Steve",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "\n\n\nTenor GIF Keyboard\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-11T21:29:00.000Z",
            "message": "Brian\nlol\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T21:08:00.000Z",
            "message": "Brian\nhttps://www.generosity.com/emergencies-fundraising/send-brian-and-iga-to-tahiti-for-great-success--2/x/15204496\nSend Brian and Iga to Tahiti for great success!\nSupport 'Send Brian and Iga to Tahiti for great success!' by donating or sharing today!\ngenerosity.com\nWhat do you think?\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-13T19:51:00.000Z",
            "message": "\nHaha well well! Let me think about this!\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-14T16:34:00.000Z",
            "message": "\nI've thought about this a lot. I'm pretty sure you won't get funded. This may come off as insulting to other people, so be careful who you ask. Also, imo, this is a costly strategy which will likely not yield lasting results, while other much less costly strategies will be much better. Examples upon request. Cheers!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-14T17:11:00.000Z",
            "message": "Brian\nI would love some examples!  and don't say saving up money.  Any way to use the internet as a lottery?\nAlso, Leah Shankar made me immune to insults, so no worries there.  I am working on other gofundme pages.  Which part of it is insulting?\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-14T17:11:00.000Z",
            "message": "\nAh, I meant: presenting this campaign may appear insulting to those you present it to; I didn't mean \"caution, the following words may be insulting to you.\" \nStrategies: \nGo on a 15 min walk or run in the morning when you wake up, before looking at any electronics. \nExercise daily. Can be as easy/cheap as putting on a 15 min YouTube fitness channel or as expensive as joining a gym or yoga studio or something- doesn't matter as long as you do the work. \nMeditate.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-14T17:11:00.000Z",
            "message": "Brian\nI see.  So the problem here is Americans don't deserve paid vacation.  Here is my thinking, if my friends fund me today ~$10 I will gain attention from more and more distant friends through some sort of ranking algorithm, and after the vacation I will get a new job and pay everyone back because I will be making more money.  It is hard to explain tithing to people in terms other than money, is there such thing as emotional tithing?  You give someone an emotional connection and you get more than money in return?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-14T17:11:00.000Z",
            "message": "Brian\nYou are extremely thoughtful btw, thank you for helping me understand this.  Now I can modify myself. \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-17T18:30:00.000Z",
            "message": "Brian\nI am sorry for that time I tried to get you to donate to my vacation fund.  No one gets PTO and I thought it would be fun but others see it as discourteous.\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-18T19:57:00.000Z",
            "message": "\nHeh, I don't know where you went but um, ok? \"So the problem here is Americans don't deserve paid vacation.\" I have no idea how you jumped to that conclusion, but suit yourself. Alright man heh I'm not sure I get your sense of humor but yes as I mentioned I'm not surprised others saw it as discourteous. Anyways... we (my company) are having an awesome halloween party on Friday Oct 28th at night, you should totally come and with any guests you want! Here is the location:\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-18T19:57:00.000Z",
            "message": "\nhttps://goo.gl/maps/LNsraqoV2162\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-18T19:57:00.000Z",
            "message": "Brian\nI appreciate you going out on a limb.  I've been told I'm passive aggressive by multiple people today so I am not sure this is a good point in my life to rekindle old friendships.  I'd rather talk to friends personally than see them waste time fighting about politics, but to each's own I suppose.  Maybe sometime in the future.  Amazing how big this city is and what a small world it is.  Be well brother.  You are a kind soul.  \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-18T19:57:00.000Z",
            "message": "Brian\nHave you read Flatland?  I want to send you a copy.  This book changed my life.\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-18T19:57:00.000Z",
            "message": "\nYes read that book a while ago \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-18T19:57:00.000Z",
            "message": "Brian\nOh good!\n"
        },
        {
            "from": "Steve",
            "time": "2016-10-18T19:57:00.000Z",
            "message": "\nCool well do what you need to \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-18T19:57:00.000Z",
            "message": "Brian\nI don't believe it is fiction.\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-06T22:28:00.000Z",
            "message": "Brian\nGot rejected by San Francisco companies and simultaneously won a contract to rebuild a meditation site.  So I basically am copying their entire software stack and used smart people to train me how to use it.\nHow was your party?\n"
        },
        {
            "from": "Steve",
            "time": "2016-11-07T00:08:00.000Z",
            "message": "\nok well sounds neat! Party was epic, I posted some pictures which definitely do not capture the awesomeness\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-07T00:08:00.000Z",
            "message": "Brian\nWill you help me test it?\n"
        },
        {
            "from": "Steve",
            "time": "2016-11-07T00:08:00.000Z",
            "message": "\npotentially, that depends on the time requirements and so forth, but you may make your request and I'll go from there \n"
        },
        {
            "from": "Brian",
            "time": "2016-11-07T00:08:00.000Z",
            "message": "Brian\nI'll send you an invite when the content is ready.  Eta, 2 weeks.\n\n"
        }
    ]
}