{
    "thread": "https://www.facebook.com/messages/t/teresa.p.yates",
    "participants": [
        {
            "name": "Teresa Panther Yates\n(Terry Grimwood)",
            "description": "",
            "url": "https://www.facebook.com/teresa.p.yates"
        }
    ],
    "messages": [
        {
            "from": "Teresa",
            "time": "2015-01-20T15:01:00.000Z",
            "message": "\nHope you and Iga are better! I am well. Don still has a touch of the flu.\n"
        },
        {
            "from": "Brian",
            "time": "2015-01-26T05:53:00.000Z",
            "message": "Brian\nYeah, mostly, my nose is still a little runny.\n"
        },
        {
            "from": "Teresa",
            "time": "2015-01-26T05:53:00.000Z",
            "message": "\nJanuary sucks. Get better soon. How is Iga?\n"
        },
        {
            "from": "Brian",
            "time": "2015-01-26T05:53:00.000Z",
            "message": "Brian\nShe is good.  She is painting again with a new color wheel that comes with 50 different paints.  I didn't know so many colors existed with all different names.\nhttps://www.youtube.com/watch?v=uMK0prafzw0\n\nDIE ANTWOORD - UGLY BOY\nDONKER MAG out now on iTunes: http://bzz.is/donkermag_it + Amazon: http://bzz.is/donkermag_amz. Website: http://dieantwoord.com Facebook: https://www.faceboo...\nyoutube.com\n\n"
        },
        {
            "from": "Teresa",
            "time": "2015-01-26T05:53:00.000Z",
            "message": "\nAwesome. I didn't know she painted. There are actually colors we cannot even see. What is this? Music?\nWill check it out tomorrow. Thanks. Going to bed. Hope we can all get together soon. Get better.\n"
        },
        {
            "from": "Brian",
            "time": "2015-01-26T05:53:00.000Z",
            "message": "Brian\nYes, music.\nThanks, talk to you soon.\n"
        },
        {
            "from": "Teresa",
            "time": "2015-01-26T05:53:00.000Z",
            "message": "\nNite.\n"
        },
        {
            "from": "Brian",
            "time": "2015-01-26T05:53:00.000Z",
            "message": "Brian\nGoodnight\n"
        },
        {
            "from": "Teresa",
            "time": "2015-02-11T19:59:00.000Z",
            "message": "\nHi Brian, what does Iga want for her birthday? I know she paints. Does she want anything for that? Take care & see you at the party. Teresa\n"
        },
        {
            "from": "Brian",
            "time": "2015-02-12T23:16:00.000Z",
            "message": "Brian\nNot sure what Iga wants.  Probably just for you guys to come hang out tomorrow.  I am really bad at birthday gifts.\n"
        },
        {
            "from": "Teresa",
            "time": "2015-02-12T23:16:00.000Z",
            "message": "\nLove to hang out with you both. I got her a necklace. Well, I bought two & now have to decide which one to give her & which one to keep lol. See you soon. Teresa\n"
        },
        {
            "from": "Brian",
            "time": "2015-02-12T23:16:00.000Z",
            "message": "Brian\nCan you send me a picture?\n"
        },
        {
            "from": "Teresa",
            "time": "2015-02-13T04:14:00.000Z",
            "message": "\nJust saw this sorry. Texted it to you. No matter what I do the choker comes out looking purplish but is shiny silver & gold.\n"
        },
        {
            "from": "Teresa",
            "time": "2015-02-18T18:06:00.000Z",
            "message": "\nHi Brian, our house is now live and active if want to send this to Gabrie or anyone else you might know that is interested. You two will just have to come visit us in CO when we move. Here it is http://www.flexmls.com/cgi-bin/mainmenu.cgi?cmd=url+other/run_public_link.html&public_link_tech_id=1533wfa10hk1&s=12&cid=1\nflexmls\nflexmls.com\n"
        },
        {
            "from": "Brian",
            "time": "2015-02-19T00:10:00.000Z",
            "message": "Brian\nCool, I'll forward it to him.\n"
        },
        {
            "from": "Teresa",
            "time": "2015-02-19T00:10:00.000Z",
            "message": "\nK thank you. We are going out of town this weekend & there will be an open house Sat & Sun 10-6 but if he wants a special showing he can call our agent Karen Santaella  at 602-363-4933. Say hi to Iga. Take care. Hope to see you both soon. Teresa\n"
        },
        {
            "from": "Brian",
            "time": "2015-05-29T03:58:00.000Z",
            "message": "Brian\nI thought of something, does your genetics testing show what diseases people are prone to?  Even based on region some regions are more prone to certain diseases right?\n"
        },
        {
            "from": "Teresa",
            "time": "2015-05-29T03:58:00.000Z",
            "message": "\nAnswer to your first question- No. The FDA clamped down on 23/Me doing this because you do not have a doctor to consult. It is true though that some regions are more prone to certain diseases though.\n"
        },
        {
            "from": "Teresa",
            "time": "2015-05-29T14:12:00.000Z",
            "message": "\nHey Brian, we just discovered that you can get lightning speed internet here! You can only get it a few places in the world. Lots of techie jobs - just don't know if the right one for you.\n"
        },
        {
            "from": "Teresa",
            "time": "2015-05-29T14:12:00.000Z",
            "message": "\nGoodbye Verizon! Hello ultra high speed fiber optic Internet!http://www.usatoday.com/story/news/nation/2014/11/19/longmont-internet-service/19294335/\n"
        },
        {
            "from": "Brian",
            "time": "2015-05-31T04:44:00.000Z",
            "message": "Brian\nsweet\n"
        },
        {
            "from": "Teresa",
            "time": "2015-05-31T15:48:00.000Z",
            "message": "\nYes! And anyone with a public library card here can do research in university databases at home. You have more places to research like that than I did as an adjunct professor at PVCC! That is not available in Phoenix, or most places, so I bought Don the very expensive scientific  magazine Nature for his birthday with online access when I quit teaching. Here, anyone can access that with their library card info & countless others!\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "\nHi Brian! How are you & Iga? Come see us some time! Think talking politics is off the table though. Please don't post anti- Hillary stuff on my page again. I am a big Hillary fan. This is a picture I made when we went to go see her in Denver. I consider my wall like my living room. I don't post Hillary stuff on your FB wall. Do not want to block you. Thanks, Teresa\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "\nGuess if you write back I proved you exist lol!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "Brian\nSure, we would love to come visit you in your real life living room!  I think Facebook has a lot of noise and posting arguments or hate speech about people is adding to it.  I appreciate you and your kindness \n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "\nI will be so glad when the damn election is over. I think we can both agree with that! \n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "Brian\nI just wish someone as smart as you wouldn't be so set in their ways!  No one trusts either candidate.  They both suck.\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "\nWould love to see you both. We have a complete basement apartment - added a kitchen with stove. We rent it though so you would have to get up with Don about when you could as far as dates.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "Brian\nBut I would never block you\nBecause I respect your brain.\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "\nI disagree. But I respect you as well.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "Brian\nWe will know more after November.  I lost my job and might be getting a job at Pacific Northwest National Laboratory.  I am so excited!\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "\nDisagree about both of the candidates being awful. Is your job in Phoenix?\nBut don't want to argue about it with you.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "Brian\nArguing is the only way we can gain a deeper understanding of what is important to us.  What differs between you and I is age.  I appreciate that difference and respect you more for it.  You are a role model and a my stars.  Hows the hubby?  He is a genius.  I love his book.\nJob will be outside portland\nin Richland\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T18:36:00.000Z",
            "message": "\nOkay, fine. She isn't perfect. But to compare them as equally bad is a false equivalency. She isn't my BFF. I don't need a candidate to be. But she isn't a xenophobic, sexist maniac that our counterintelligence says is a danger to our national security. And the most important thing is the Supreme Court as there will be 2-3 appointments made by the next President which will either put us on a path of progressive politics or regressive ones for the next 40 years. Also, global warming. Trump thinks it is a hoax made up by the Chinese. She has an extensive plan for that & said she would ask advice of all Democrats & progressives on issues- Bernie, Obama, etc. Trump says he knows more than the generals & has a very good brain- not really. People said they thought Gore was boring & voted for Nader. We got Bush . All the allegations against her are conspiracy theories that the GOP dreamed up to attack the Clintons & destroy the Democratic Party. Read the whistleblower book, Killing the Messenger, by David Brock who was a Republican in on it at the time & changed to a Democratic activist. Also, Don was in an actual board room of Bauer when people were plotting crap about her. All the pharmaceutical & health insurance companies were pissed because they were so popular & she tried to get us universal healthcare. They spent billions along with the GOP & Koch brothers to plant fake scandals & the idea that she is a liar ( not according to facts- Politifact - as honest as  Bernie. We lived through the Clinton years. Everyone had a job & we were at peace. I am in FL on vacation. My daughter is having a baby girl any day, Isabel. Oregon is much better than Phoenix I hear. Much more liberal & lots of young people but never been there. Not so hot. Thank you for your kind words & give my love to Iga. When do you go to Oregon?\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "Brian\nwow.  I'll have to read.\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "Brian\nvery insightful!\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "\nJust hold your nose & think of the Supreme Court!!!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "Brian\nCourts are a waste of time.  If everyone already knew right from wrong, they wouldn't have a purpose at all.\nAgree disagree?\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "\nNo, you don't get it. They could reverse things like gay marriage, block or repeal any kind of healthcare, affordable college,  voting rights, Roe vs. Wade. And that is exactly what Trump & Pence Ave said they would do & they are appointed for life. Like it or not, they are the law of the land. Pence is a crazy RW radical Christian. Trump has hinted that he doesn't want to do all that stuff. Pence could be another Cheney.\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "\nRead this article: https://www.thenation.com/article/the-supreme-court-is-the-most-important-issue-in-the-2016-election/\nThe Supreme Court Is the Most Important Issue in the 2016 Election\nHealthcare, gay marriage, voting rights, affirmative action, reproductive rights, labor rights, immigration, climate change. These are some of the crucial issues that have come before the Supreme Court in recent years or will be heard this year.\nthenation.com\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "Brian\nRight I agree completely.  I am just thinking if they ended up NOT reversing gay marriage, then that isn't a good basis for a decision.  Let's say hypothetically Trump gets elected and everything continues as normal.  Then the decision to vote for Hillary doesn't matter because everything is normal.  You can't base a political decision on a hypothetical scenario.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "Brian\nOh that is new information I'll read it.\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "\nI am not doing that. I like Hillary, but if you do not think Supreme Court. Think global warming.\nOkay, must run. Bye!\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "Brian\nIs global warming in that article?\nOk, let's talk again privately soon.\n"
        },
        {
            "from": "Teresa",
            "time": "2016-10-15T19:10:00.000Z",
            "message": "\nNo. Trump came out and said he thinks it is a hoax. Plan: Do nothing. She has a plan. https://www.hillaryclinton.com/issues/climate/ Okay. Bye!\nHillary on climate change\nTaking on the threat of climate change and making America the world’s clean energy superpower.\nhillaryclinton.com\n"
        },
        {
            "from": "Teresa",
            "time": "2016-11-12T18:32:00.000Z",
            "message": "\nHappy birthday!!!!\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-12T18:32:00.000Z",
            "message": "Brian\nThank you!\n"
        },
        {
            "from": "Teresa",
            "time": "2016-11-12T18:32:00.000Z",
            "message": "\nWe have the same birthday!!! LOL\n"
        },
        {
            "from": "Brian",
            "time": "2016-11-12T18:32:00.000Z",
            "message": "Brian\nHappy birthday!\n"
        },
        {
            "from": "Teresa",
            "time": "2016-11-12T18:32:00.000Z",
            "message": "\nThank you!\n\n"
        }
    ]
}