{
    "thread": "https://www.facebook.com/messages/archived/t/travis.addair",
    "participants": [
        {
            "name": "Travis Addair",
            "description": "Senior Software Engineer at Uber",
            "url": "Former Senior Software Engineer, AI at Super Evil Megacorp"
        }
    ],
    "messages": [
        {
            "from": "Travis",
            "time": "2008-04-18T04:50:00.000Z",
            "message": "\nHey!\n\nAre you hosting another one of your friday-night get-togethers tomorrow?  If so, would you mind if Rory, Jordan, and I stopped by?\n\n-Travis\n"
        },
        {
            "from": "Brian",
            "time": "2008-04-18T04:50:00.000Z",
            "message": "Brian\nYeah totally!  Come on by! we are wearing PJs and baking cookies too!  Next week will have a different theme.\n"
        },
        {
            "from": "Travis",
            "time": "2008-04-18T07:00:00.000Z",
            "message": "\nAwesome, thanks.  Any specific time you want us to drop in?\n"
        },
        {
            "from": "Brian",
            "time": "2008-04-18T07:00:00.000Z",
            "message": "Brian\nMy parties consistently start at 7:30, but people show up before to help or I am usually hanging out with someone before hand.\nAlso BSG is on at 9:30 here so be sure to come by before then if you want to watch the show on my amazing system.\n"
        },
        {
            "from": "Travis",
            "time": "2008-04-18T07:00:00.000Z",
            "message": "\nExcellent, see you there!\n"
        },
        {
            "from": "Travis",
            "time": "2008-04-20T06:46:00.000Z",
            "message": "\nHey man, sorry about what happened last night.  I should have remembered that VODKA + TEQUILA = POOR CHOICE.  Anyhow, do you like red wine?  If you don't mind me stopping by again next week, I'll bring you a good cab as a token of my apologies.\n"
        },
        {
            "from": "Brian",
            "time": "2008-04-21T04:54:00.000Z",
            "message": "Brian\nLOL, no problem man.  I hope you feel better.  Eat lots of protein to make up for the food loss.  Check the group for next weeks theme!  I think we will take it easy next week.\n"
        },
        {
            "from": "Brian",
            "time": "2016-10-12T01:01:00.000Z",
            "message": "Brian\nHELLO!\nCan you do me a favor and send Joe Flieger a compliment?  It's a part of a game.\n\n"
        }
    ]
}