{
    "thread": "https://www.facebook.com/messages/t/wellsfargo",
    "participants": [
        {}
    ],
    "messages": [
        {
            "from": "Brian",
            "message": "Brian\nWorst company ever. I was fined for using their crappy website and accidentally overpaid my mortgage. I had 2 $50 fees because their payment scheduler has bugs.\n",
            "time": "2017-11-06T20:23:00.000Z"
        },
        {
            "from": "Wells Fargo",
            "message": "\nLet me look into what happened, Brian. Please provide your full name, phone number, and property address. For your privacy, do not include account numbers in your message. Thanks. ~Liz\n",
            "time": "2017-11-06T20:23:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nThere is nothing you can do.  I've already written their legal department and they used their own arbitration process to determine the charges are valid (duh why would they disagree with themselves from earlier?)   All you can know is that you work for an evil company that doesn't deserve to suck out your energy.  They've lied, cheated, and stolen from millions, and created fake accounts to defraud investors.\n",
            "time": "2017-11-07T13:13:00.000Z"
        },
        {
            "from": "Wells Fargo",
            "message": "\nI’m sorry to see you feel this way, Brian. If you change your mind and would like me to review your concerns, please don’t hesitate to let me know. Thanks. ~Liz\n",
            "time": "2017-11-07T13:13:00.000Z"
        },
        {
            "from": "Brian",
            "message": "Brian\nLiving the dream? Mm\n",
            "time": "2017-11-24T02:00:00.000Z"
        },
        {
            "from": "Wells Fargo",
            "message": "\nWhat's going on, Brian? I'd like to better understand your concern and do my best to help. Please tell me more details about your situation without sharing any account numbers. Thank you. ~Ludwicke\n\n",
            "time": "2017-11-24T03:44:00.000Z"
        }
    ]
}