{
    "thread": "https://www.facebook.com/messages/archived/t/whitney.olson.14",
    "participants": [
        {
            "name": "Whitney Olson",
            "description": "Works at Music Studio Instructor/VYS String Orchestra Director",
            "url": "Lives in Tucson, Arizona"
        }
    ],
    "messages": [
        {
            "from": "Brian",
            "time": "2005-10-04T21:24:00.000Z",
            "message": "Brian\nAre you in band for Music Education?  If you are, sorry i don't know you, if not then you will be and should be because its a ton of fun.\n"
        },
        {
            "from": "Whitney",
            "time": "2005-10-05T20:57:00.000Z",
            "message": "\num, i'm in orchestra...i play violin...what do you play in band?\n"
        },
        {
            "from": "Brian",
            "time": "2005-10-05T23:20:00.000Z",
            "message": "Brian\nYeah I just realized it said that in your orchestra after I sent you the message.  I play trumpet in the marching band.  I am not a music major or a minor, I just do it because I think devoting 12 hours a week to band for one credit is fun...  Not.  What are you majoring in?\n"
        },
        {
            "from": "Whitney",
            "time": "2005-10-06T19:55:00.000Z",
            "message": "\nMy major is Music Education, I still haven't decided if I want to go for the Psych minor or not, my major is already keeping me crazy, hehe.  Plus I have some catching up to do if I want to start teaching students, since the violin pedagogy program is best to start at freshman, but I'm starting it my sophomore year.  But I like staying busy, it keeps you from getting bored.  So why'd you choose Computer Science?\n"
        },
        {
            "from": "Brian",
            "time": "2005-10-07T02:20:00.000Z",
            "message": "Brian\nI chose computer science because i have beed writing computer applications for about 8 years now.  I have multiple websites and am constantly trying to sell my skills. Some people now depend on me to fix their computers on a regular basis.  i have built numorous people entire computers with the assistance of my step father. It has always been something i am good at, so i stuck with it until now and plan to continue the expand my knowledge here in college.  I would love to someday be able to work for a game company, such as Electronic Arts, or id Software.  You should stop by sometime and see our set up in out room Sechrist 115.  We used to have a pretty impressive surround sound until Eric (my roommate) blew it up. What level eduacation do you want to teach? How long have you been playing violin? We should hang out sometime, let me know.\n"
        },
        {
            "from": "Whitney",
            "time": "2005-10-07T21:31:00.000Z",
            "message": "\nHmm, maybe you can help me with my Spyware problem then, haha.  Well that's cool.  I'm not sure what level I want to teach...right now I'm thinking I'll start in elementary and work up to high school.  Or own a private studio....I dunno.  I've got time to think about it.  I've been playing violin since 4th grade, and piano since 3rd grade (but haven't kept up with it since I came to nau).  Well, sorry to cut this one short, but I just realized what time it was and I need to get to class.  ttyl\n"
        },
        {
            "from": "Brian",
            "time": "2005-10-08T02:05:00.000Z",
            "message": "Brian\nYeah, i can fix spyware.  Its annoying and take a while, but i'd love to hang out sometime.  I am not so up to par right now, our flag football scrimmage got pretty intense and i collided with another player.  I am definitaly going to have some battle scars to show off.  I don't have much free time this weekend with band and all, but maybe after we could meet at java and i could come back and take a look at that compuer problem. I am going to lay down again, talk to you soon!\n"
        },
        {
            "from": "Whitney",
            "time": "2005-10-09T20:41:00.000Z",
            "message": "\nWell, I have a shitload of homework to do tonight, but maybe sometime later this week we can meet up.  Have fun at the cardinals game, haha.\n\n"
        },
        {
            "from": "Brian",
            "time": "2005-10-10T02:28:00.000Z",
            "message": "Brian\nI just got back from phoenix.  Wow, one hell of a day this was.  There is nothing like trying to keep drunk fans from passing through the line.  Nothing like performing infront of thousands of screaming fans, i love the rush.  Well sorry you have so much homework, that kind of sucks.  I am glad to be back, i think i will just chill and listen to music.  I hope to talk to you soon!\n"
        },
        {
            "from": "Brian",
            "time": "2005-10-10T04:10:00.000Z",
            "message": "Brian\nI just got back from phoenix.  Wow, one hell of a day this was.  There is nothing like trying to keep drunk fans from passing through the line.  Nothing like performing infront of thousands of screaming fans, i love the rush.  Well sorry you have so much homework, that kind of sucks.  I am glad to be back, i think i will just chill and listen to music.  I hope to talk to you soon!\n"
        }
    ]
}